サーバホスト に 接続 し ます
キュー が いっぱい なら true を 、 そう で なけれ ば false を 返し ます
サンプルサイズ を n バイト に 設定 し ます
name に 関連 づけ られ た 表現 形式 を 表現 形式 レジストリ から 削除 し ます
内部 の データ 構造 を 初期化 し ます
quota root の リソース を limits に 設定 し ます
比較 を 行う 1つ 目 の シーケンス を 設定 し ます
ペン を 上げ ます – 動い て も 線 は 引か れ ませ ん
ファイル の 現在 の ポインタ 位置 を 返し ます
引数 が 正規 (normal ) の ゼロ で ない 有限 数値 で 調整 さ れ た 指数 が emin 以上 なら ば true を 返し ます
test 内 の 実行 例 ( doctest オブジェクト ) を 実行 し 、 その 結果 を 出力 用 の 関数 out を 使っ て 表示 し ます
コマンド 行 line が 解釈 実行 さ れる 直前 、 しかし 入力 プロンプト が 作られ 表示 さ れ た 後 に 実行 さ れる フックメソッド
これ は 何 も し ない エンコーダ です
ハッシュオブジェクト を 文字列 arg で 更新 し ます
文字列 str 内 の バックスラッシュ を バックスラッシュ 2つ に 置換 し た 新しい 文字 列 を 返し ます
sax xmlreader オブジェクト を 作成 し て 返し ます
拡張 ヘッダ 設定
改行 また は eof まで 読み込み 、 一つ の unicode を 返し ます
1つ の コマンドライン 引数 が どう 解析 さ れる か を 定義 し ます
fifo が 空 の とき ( のみ ) に true を 返し ます
format _list (extract _stack (f , limit )) の 省略 表現
現在 の デバッグフラグ を 返し ます
ファイル 記述子 fd の 端末 属性 を 含む リスト を 返し ます
新しい 有限 セマフォ ( bounded semaphore ) オブジェクト を 返す ファクトリ 関数 です
圧縮 形式 を 返し ます （ ' none ' だけ が サポート さ れ て いる 形式 です ）
1つ の 変数 name を 返し ます
ユーザ 定義 の 属性 や メソッド を 持た ない 、 新しい オブジェクト を 返し ます
ファイル から 引数 を 読み込む 場合 (argumentparser コンストラクタ の fromfile _prefix _chars キーワード 引数 を 参照 )、 1行 に つき 1つ の 引数 を 読み込み ます
ディザ 処理 を 行わ ず に 、 8 ビットグレースケール 画像 を 4ビットグレースケール 画像 へ 変換 し ます
指定 さ れ た key を 削除 し ます
引数 に 負 の 符号 がつい て いれ ば true を 、 そう で なけれ ば false を 返し ます
自動増加 モード を 開始 し ます : interval ミリ 秒 ごと に progressbar .step を 繰り返し 呼び出す タイマーイベント を 設定 し ます
この メソッド は フォームフィールド name に関連付け られ た 値 を 常 に リスト に して 返し ます
ブロック が 入れ子 の クラス また は 関数 の とき true を 返し ます
ファイル の 中 の オーディオフレーム 数 を 返し ます
この メソッド は 、 stop _here が true を 返し た とき に 、 dispatch _return から 呼び出さ れ ます
サーバ から ファイル filename を 削除 し ます
指定 し た フレーム と 、 その 内側 の 全 フレーム の フレームレコード を 返し ます
elementname の オプション の リスト を 返し ます
追加 の スタイル を 設定 し ます
1 0 進数 文字 のみ で 構成 さ れる 場合 、 true を 返し ます
n バイト を 読み込ん で 返し ます
x を deque の 左側 につけ 加え ます
この 条件 変数 を 待っ て いる スレッド が あれ ば 、 その スレッド を 起こし ます
起き た ばかり の 例外 を 表示 し ます
現在 の グループ に 関連 付け られ た 従属 グループ id の リスト を groups に 設定 し ます
名前 空間 を 伴う 新 た な 要素 ノード を 生成 し て 返し ます
バッファ の 空き に 入れる こと の できる サンプル の 数 を 返し ます
親 プロセス の id を 返し ます
認証 が 必要 な smtp サーバ に ログイン し ます
サンプリングレート （ 1 秒 あたり の オーディオフレーム 数 ） を 返し ます
文字列 を ファイル に 書き込み ます
pattern の string へ の マッチ の うち 、 重複 し ない 全 て の マッチ を 文字列 の リスト として 返し ます
1 6 進数 表記 の 文字列 hexstr の 表す バイナリデータ を 返し ます
ch を プッシュ し て 、 getch を 次に 呼び出し た とき に 返さ れる よう に し ます
新しい スレッド が 作られる 際 に 使わ れる スレッド の スタックサイズ を 返し ます
path に 最後 に アクセス し た 時刻 を 、 エポック ( time モジュール を 参照 下 さい ) から の 経過 時間 を 示す 秒数 で 返し ます
各 iterable の 要素 を まとめる イテレータ を 作成 し ます
ディレクトリツリー 全体 を 削除 し ます
開か れ て いる レジストリキー の サブキー を 列挙 し 、 文字列 で 返し ます
turtlescreen の 更新 を 実行 し ます
rfc 2 3 4 2 で 定義 さ れる imap 名前 空間 を 返し ます
3 2 ビットチェックサム で ある crc - 3 2 を data に対し て 計算 し ます
obj が cls の インスタンス で ある こと （ そう で ない こと ） を テスト し ます
マッチ の 、 1 から パターン 内 に ある 全 グループ 数 まで のすべて の サブグループ を 含む タプル を 返し ます
テストケース test が 成功 し た 場合 に 呼び出さ れ ます
a -law 形式 の データ を リニア ( linear ) 形式 に 変換 し ます
登録 さ れ た 結果 を 削除 し ます
ファイル 類似 の オブジェクト を 返し ます
指定 し た 文字 列 から すべ て の doctest 実行 例 を 抽出 し 、 example オブジェクト から なる リスト に して 返し ます
x の y 乗 を 返し ます
pack _into 関数 と 同じ 、 コンパイル さ れ た フォーマット を 利用 する メソッド です
共有 threading .boundedsemaphore オブジェクト を 作成 し て 、 その プロキシ を 返し ます
field の 値 を 可能 なら 文字 列 として 返し ます
現在 の エラー ・ ハンドラ を セット し ます
ファイル に 文字列 data を 書き込み ます
デバッガー が この 関数 呼び出し で 止まる べき で あれ ば 、 user _call メソッド ( サブクラス で オーバーライド さ れる ) を 呼び出し ます
oldmailbox という 名前 の メールボックス を newmailbox に 名称 変更 し ます
現在 録音 の ソース に 使わ れ て いる コントロール を 示す ビットマスク を 返し ます
例外 urlerror を 送出 し ます
a の b ビット 左 シフト を 返し ます
目次 を sys .stdout に 表示 し ます
ブラウザ の 種類 name の コントローラーオブジェクト を 返し ます
predicate が false となる 要素 だけ を 返す イテレータ を 作成 し ます
self と other が 同じ 指数 を 持っ て いる か 、 あるい は 双方 とも nan で ある 場合 に 真 を 返し ます
unpack _float と 同様 に 、 倍精 度 の 浮動 小数 点数 を アンパック し ます
圧縮 処理 を 終え 、 内部 バッファ に 残さ れ て いる データ を 返し ます
現在 の 端末 属性 を 、 稼動 中 の プログラム が curses を 使う際 の モード で ある “ プログラム ” モード として 保存 し ます
item の 1 つ 下 の 兄弟 の 識別子 を 、 item が 親 にとって 一番下 の 子供 だっ た 場合 ‘ ’ を 返し ます
与え られ た bytes を ssl 擬似 乱数 生成 器 に 混ぜ ます
データ 中 の 全 サンプル の 平均 値 を 返し ます
s ( str また は unicode インスタンス で json 文書 を 含む もの ) の python 表現 を 返し ます
ひとつ の 要素 型 で 宣言 さ れる 属性 ごと に 呼び出さ れ ます
与え た 文字 に 対応 する 制御 文字 を 返し ます ( 0x 1f と ビット 単位 で 論理 積 を 取り ます )
path の 標準 化 さ れ た 絶対 パス を 返し ます
この 関数 は シーケンス として 表現 さ れ た 解析 木 を 受け取り 、 可能 なら ば 内部 表現 を 作り ます
response オブジェクト から 得 られ た cookie オブジェクト から なる シーケンス を 返し ます
文字 列定 数 で 与え られ た xml 断片 を 構文 解析 し 、 エレメント id から エレメント へ の マッピング を 与える 辞書 も 同時 に 返し ます
backslashreplace エラー 処理 の 実装 です ( エンコード のみ ): エンコード でき なかっ た 文字 は バックスラッシュ つき の エスケープシーケンス に 置き 換え られ ます
アレイ の 要素 の 順番 を 逆に し ます
file オブジェクト から 読み込ん だ xml データ を 解析 し ます
list 命令 を 送信 し ます
現在 の ウィンドウ に 書き込ま れ た 全て の 内容 に対し “ バックグラウンド ” に 設定 さ れ た 属性 attr を 除去 し ます
3 要素 の タプル ( iso 年 、 iso 週番 号 、 iso 曜日 ) を 返し ます
現在 の プログラム の 使用 法 メッセージ ( self .usage ) を file ( デフォルト : stdout ) に 表示 し ます
オブジェクト が データデスクリプタ の 場合 に 真 を 返し ます
pack _string と 同じく 、 可変 長 の 不透明 データ 文字列 を パック し ます
type で 与え られる mime 型 に 基づい て ファイル の 拡張子 を 推定 し ます
4 ビットグレースケール 画像 を 8ビットグレースケール 画像 へ 変換 し ます
フレーム 数 を 設定 し ます
マーケティング 目的 で 使わ れる 一般 的 な 別名 に 変換 し て ( system , release , version ) を 返し ます
コード の 次 の 行 で ストップ し ます
data を ssl チャンネル を 使っ て 暗号 化 し た 上 で 接続 の 相手 側 へ 送り ます
デバイス に 関連 づけ られ た ファイルディスクリプタ を 返し ます
プロファイラ を 停止 し ます
line 内 の 符号 化 さ れ た ヘッダ 行 が 復号 化 さ れ た もの を 返し ます
キー へ の 弱参 照 を 生成 する iterator を 返し ます
rfc 2 8 2 2 に 記さ れ た 規則 に も とづい て 日付 を 解析 し ます
ファイル input の 内容 を エンコード し て 、 quoted -printable 形式 に エンコード さ れ た データ を ファイル output に 書き出し ます
ファイル 記述子 fd が 開い て い て 、 tty ( の よう な ) 装置 に 接続 さ れ て いる 場合 、 1 を 返し ます
演算 対象 から attr を 取得 する 呼び出し 可能 な オブジェクト を 返し ます
x の 仮数 と 指数 を ( m , e ) の ペア として 返し ます
メンバー を アーカイブ から カレントワーキングディレクトリ に 展開 し ます
sub 関数 と 同様 で 、 コンパイル し た パターン を 使い ます
イベントループ 内部 で 最初 に 呼ば れ て 、 モードレスダイアログイベント を 処理 し ます
この メソッド は 入出 力 の ボリューム 値 など の 情報 を 引き出し て 、 オーディオステータス の オブジェクト 形式 で 返し ます
wakeup fd を fd に 設定 し ます
未処理 の 入力 データ を 全 て 処理 し 、 最終 的 に 圧縮 さ れ なかっ た 残り の 出力 文字 列 を 返し ます
width の 長さ を もつ 中央 寄せ さ れ た 文字列 を 返し ます
rfc 2 9 6 5 の 定義 よる 、 始原 トランザクション の リクエストホスト を 返し ます
windows のみ : システム の lasterror 変数 の 、 スレッドローカル な プライベートコピー を 返し ます
結果 を 受け取っ た とき に 返し ます
指定 さ れ た 、 リフレクション が 無効 に さ れ た キー の リフレクション を 再び 有効 に し ます
sys .path に 含ま れる 、 全 て の . py ファイル を バイトコンパイル し ます
パス 名 path を ( head , tail ) の ペア に 分割 し ます
doctest の テスト を unittest .testsuite に 変換 し ます
この ロガー の 子 で ある ロガー を 、 接頭 辞 によっ て 決定 し 、 返し ます
uri は 単一 の uri でも 複数 の uri から なる シーケンス で もかまい ませ ん
(header , value ) の タプル から なる リスト を 返し ます
平文 パスワード を 使っ て クライアント を 照合 し ます
mbox メールボックス の メッセージ の 開始 を 示す “ from ” 行 を 表わす 文字 列 を 返し ます
play と 似 て い ます が 、 指定 し た 絶対 的 な 時刻 から 再生 を 開始 し て 、 指定 し た トラック で 終了 し ます
システムコール setsid を 呼び出し ます
cmd を 子プロセス として 実行 し ます
整数 で 表し た レベル lvl の メッセージ を この ロガー で 記録 し ます
プロセス を 終了 さ せ た シグナル 番号 を 返し ます
set が other と 共通 の 要素 を 持た ない とき 、 true を 返し ます
newline モード から 離れ ます
unicode 文字 unichr に 割り 当て られ た 、 双方 向 カテゴリ を 返し ます
フォーム を 表示 し ます
ファイル 記述子 fd に 文字列 str を 書き込み ます
x の 底 1 0 の 対数 を 返し ます
自動ガベージコレクション を 有効 に し ます
この メソッド は 終了 タグ tag を 処理 する ため に 呼び出さ れ ます
python 文字列 data の 内容 を オーディオデバイス に 書き込み 、 書き込ま れ た バイト 数 を 返し ます
エコー なし で ユーザー に パスワード を 入力 さ せる プロンプト
サーバ に対し て http 要求 を 送り出し た 後 に 呼び出さ れ なけれ ばり ませ ん
これ は 、 マルチパートメッセージ の 最後 の パート を 指定 する のに 使う こと が でき 、 マルチパートメッセージ を 書く とき は いつ でも 使う べき です
python を 終了 し ます
binhex 形式 の ファイル input を デコード し ます
与え られ た グループ id に対する グループデータベースエントリ を 返し ます
文字列 s を ヘッダ 用 に エンコード し ます
ほとんど の 場合 、 parse _args が 返す オブジェクト の 属性 は コマンドライン 引数 の 内容 と 引数 の アクション によっ て のみ 決定 さ れ ます
time が ゼロ で ない 値 の 場合 、 この 関数 は time 秒後頃 に sigalrm を プロセス に 送る よう に 要求 し ます
その メッセージオブジェクト 構造 の content -type を インデント つき で 表示 し ます
オブジェクト を 削除 し ます
ドライバ に 出力 の 一時 停止 ( pause ) が 起き そう で ある こと を 伝え 、 ドライバ が 一時 停止 を より 賢く 扱える よう に し ます
value を format _spec で 制御 さ れる “ フォーマット 化 ” 表現 に 変換 し ます
object を (デコーダ の 現在 の 状態 を 考慮 に 入れ て ) デコード し 、 得 られ た デコード さ れ た オブジェクト を 返し ます
既存 の ノード と 新た な ノード を 置き 換え ます
python インタープリタ を 現在 実行 中 の マシン の ホスト 名 を 示す 文字 列 を 取得 し ます
オブジェクト が メンバーデスクリプタ の 場合 に 真 を 返し ます
共有 threading .lock オブジェクト を 作成 し て 、 その プロキシ を 返し ます
デバッグレベル ( 印字 さ れる デバッグ 出力 の 量 ) を 設定 し ます
content -transfer -encoding メッセージヘッダ で 指定 さ れ た 符号 化方 式 を 返し ます
terminfo 機能 名 capname に対応 する 機能 値 を ブール 値 で 返し ます
オプション で 無い 最初 の 引数 を 見つけ て も パース を 止め ない よう に 設定 し ます
ドキュメント の 開始 通知 を 受け取り ます
line 内 の ヘッダ 行 が mime 符号 化 さ れ た もの を 返し ます
メッセージ id に対する 複数 形 を 検索 し ます
set に 含ま れ て 、 かつ 、 全 て の other に 含まれ ない 要素 を 持つ 、 新しい set を 返し ます
オーバライド 可能 な 、 未知 の タイプ の url を 開く ため の インタフェース です
辞書 の 要素 ( ( key , value ) の 対 ) の 新しい ビュー を 返し ます
指定 し た フォルダ の 直下 に ある サブフォルダ の リスト を 返し ます
join _thread が ブロッキング する の を 防ぎ ます
親 オブジェクト として 、 director を 追加 し ます
この 関数 は 、 sys .excepthook を 設定 する こと で 、 インタプリタ の 標準 の 例外 処理 を cgitb モジュール に 肩代 わり させる よう に し ます
端末 を 初期化 し ます
x の 絶対 値 を 返し ます
msiviewgetcolumninfo の 呼び出し を 通し て ビュー の カラム を 説明 する レコード を 返し ます
base を 底と する x の 対数 を 返し ます
first と second が 等しく ない こと を テスト し ます
code が テーブル b . 1 ( 一般 に は 何 に も 対応 付け られ て い ない : commonly mapped to nothing ) かどう か 判定 し ます
other の 全て の 要素 が 、 set に 含ま れる か 確認 し ます
データ 接続 中 に 転送 を 初期化 し ます
ctypes 型 の アライメント の 必要 条件 を 返し ます
コマンドライン 引数 リスト の 作成 を 補助 する ため の ダイアログ を 表示 し ます
パラメタ で 渡さ れ た target および data の 入っ た 処理 命令 ノード を 生成 し て 返し ます
内部 的 な 辞書 の 中 で レベル lvl を テキスト levelname に関連付け ます
robots .txt ファイル を 参照 する ため の url を 設定 し ます
x は aedesc タイプ の オブジェクト で なけれ ばいけ ませ ん
infile を outfile に コピー し ます
指定 さ れ た item が ツリー の 中 に あれ ば true を 返し ます
test を 実行 する 直前 に 呼び出さ れ ます
一度 に メモリ 上 に 置く こと が でき ない よう な データストリーム を 圧縮 する ため の 圧縮 オブジェクト を 返し ます
x を [ -]d .ddde [+ -] ddd の 形 に フォーマット し ます
この 木 の 根 エレメント を 返し ます
appleevent ハンドラ を インストール し ます
listdir と 同じ です
浮動 小数 点数 を 正確 に 小数 に 変換 する クラスメソッド です
指定 さ れ た ポート で ソケットサーバ を 開始 し 、 新 た な 設定 を 待ち受け ます
sql 文 を 実行 し ます
x が 無限 なら ば true を 返し ます
ブラウザ が javascript を サポート し て いる 場合 、 http ヘッダ を 送信 し た 場合 と 同様 に 動作 する 埋め込み 可能 な javascript snippet を 返し ます
x y の 位置 に ある 画面 構成 要素 の 名前 を 返し ます
name に 関連 づけ られ た 表現 形式 を 返し ます
この 記号 表 に 含まれる ローカル 変数 が 最適 化 できる なら ば true を 返し ます
現在 選択 さ れ て いる メールボックス を 閉じ ます
全て の other の 要素 を 追加 し 、 set を 更新 し ます
false を 返し ます
ファイル を seek します
ソケット の オプション を 設定 し ます (unix の マニュアルページ setsockopt ( 2 ) を 参照 )
この メソッド は ウィンドウ の 内容 を 文字 列 として 返し ます ; ウィンドウ 内 の 空白 が 含め られる かどう か は stripspaces メンバ 変数 で 決め られ ます
url 用 に 安全 な アルファベット 集合 を もちい て 文字 列 s を エンコード ( 符号化 ) します
予測 的 グレゴリオ 暦 に おける 日付 序数 を 返し ます
ファイル の ポインタ を オーディオストリーム の 先頭 に 戻し ます
ブラウザ が javascript を サポート し て いる 場合 、 http ヘッダ を 送信 し た 場合 と 同様 に 動作 する 埋め込み 可能 な javascript snippet を 返し ます
help 命令 を 送信 し ます
ascii 制御 文字 ( 0 から 3 1 まで の 値 ) かどう か を 調べ ます
decimal ( 1 0 ) つまり decimal クラス が その 全 て の 算術 を 実行 する 基数 を 返し ます
a で インデクス が b の 要素 を 返し ます
圧縮 オブジェクト の コピー を 返し ます
エレメント の アトリビュート を ( 名前 , 値 ) ペア の シーケンス として 返し ます
メッセージ の 可視 ヘッダ を visible の ヘッダ と 同じ に セット し ます
dialect を name と 関連 付け ます
“from ” 行 を from _ に セット し ます
none あるい は 明示 的 に 許可 さ れ て いる ドメイン を ( タプル として ) 返し ます
開い て いる ファイル に 関連 し た システム 設定 情報 ( system configuration information ) を 返し ます
ツリービュー の 水平 方向 の 位置 を 問い合わ せ たり 、 変更 し たり し ます
この メソッド は start _tag か do _tag のどちらか の メソッド が 定義 さ れ て いる 開始 タグ を 処理 する ため に 呼び出さ れ ます
チャネル が 受信 し た 不定長 の データ を data に 指定 し て 呼び出さ れ ます
xml -rpc サーバ で 実装 さ れ て いる メソッド の 名前 を 指定 し 、 利用 可能 な シグネチャ の 配列 を 取得 し ます
name という 名前 の 新しい 空 モジュールオブジェクト を 返し ます
与え られ た セクション が 存在 し て いれ ば 、 オプション を 指定 さ れ た 値 に 設定 し ます
mailbox に おける 自分 の acl を 返し ます
first が second と 比べ て 、 メソッド 名 に 対応 し て > , >= , < もしく は < = で ある こと を テスト し ます
ssl 擬似 乱数 生成 器 が 十分 な ランダム 性 (randomness ) を 受け取っ て いる 時 に 真 を 、 それ 以外 の 場合 は 偽 を 返し ます
少なく とも blankline 空行 分 の 間隔 か 、 空行 その もの で 段落 を 分割 し ます
x の 実数 部 また は 虚数 部 が 正ま た は 負 の 無限 大 で あれ ば true を 返し ます
文字列 str を 逆クォート し た 新しい 文字 列 を 返し ます
unicode 文字 unichr に 付い て いる 名前 を 、 文字列 で 返し ます
section の option を 整数 として 評価 する 関数 です
str の 逆 クオート さ れ た 新 た な 文字列 を 返し ます
現在 すぐ に 読み出せる データ を 読み出し ます
flags で 指定 さ れ た フラグ を 下ろ し ます が 他 の フラグ は 変え ませ ん
code が テーブル c . 1 . 1 ( ascii スペース 文字 ) かどう か 判定 し ます
絶対 的 な タイムコード で ある ( minutes , seconds , frames ) の 3つ 組 の 表現 を 、 相当 する cd の フレームナンバー に 変換 し ます
expr が 真 （偽 ） で ある こと を テスト し ます
ブロック の 完了 時 に thing を close する コンテキストマネージャ を 返し ます
全て の グローバル の site -packages ( site -python が 含まれる 場合 も ある ) ディレクトリ を 含む リスト を 返し ます
code が テーブル a . 1 ( unicode 3 . 2 における 未割り 当て コード 点 : unassigned code point ) かどう か 判定 し ます
xml -rpc リクエスト また は レスポンス を ( params , methodname ) の 形式 を とる python オブジェクト に し ます
ログファイル を 閉じ 、 プロファイラ を 終了 し ます
x が 入力 の 終わり を 示す マーカー なら ば 、 真 を 返し ます
現在 の プロセス に対し て ルートディレクトリ を path に 変更 し ます
同じ年 、月 、 日 の date オブジェクト を 返し ます
要素 elem が set に 含ま れ て いれ ば 、 取り除き ます
フォーム に クロックオブジェクト を 加え ます
フレーム 数 を n に 設定 し ます
date _time を imap 4 の internaldate 表現 形式 に 変換 し ます
デバッガ の 制御 も と で ( 文字 列 として 与え られる ) expression を 評価 し ます
この inputsource の 文字 エンコーディング を 取得 し ます
first と second が 等しい こと を テスト し ます
encode に 似 て い ます が 、 文字列 を 入力 として 受け 取り 、 エンコード さ れ た 文字列 を 返し ます
警告 を 発する か 、 無視 する か 、 あるい は 例外 を 送出 し ます
ファイル の モード が 通常 ファイル の 場合 に ゼロ で ない 値 を 返し ます
filename が 正しい マジックナンバ を もつ zip ファイル の とき に true を 返し 、 そう で ない 場合 false を 返し ます
メッセージヘッダ と howmuch で 指定 し た 行数 の メッセージ を 、 which で 指定 し た メッセージ 分取り出し ます
path で 指定 さ れ た ファイル に 最終 アクセス 時刻 および 最終 修正 時刻 を 設定 し ます
再帰 的 に ディレクトリ や ファイル 名 を 変更 する 関数 です
sigfpe を 生成 する よう に 切り 替え 、 適切 な シグナルハンドラ を 設定 し ます
x が 有限 なら ば true を 返し ます
この 関数 は 、 デバッグ さ れ て いる フレーム の トレース 関数 として インストール さ れ ます
文字列 を 指定 し た 文字 幅 の フィールド 中 で それぞれ 左寄 せ 、 右寄 せ 、 中央 寄せ し ます
文字列 データ を フォーマッタオブジェクト に 送ら ず に バッファ に 保存 する 操作 を 開始 し ます
x が ゼロ で あれ ば true を 返し ます
executable で 指定 し た ファイル （ 省略 時 は python インタープリタ ） が リンク し て いる libc バージョン の 取得 を 試み ます
クッキー を ファイル に 保存 し ます
obj ( ctypes 型 の インスタンス で なけれ ば なら ない ) への 軽量 ポインタ を 返し ます
現在 の エレメント を 根と する ツリー の イテレータ ( iterator ) を 作り ます
この メソッド は 全て の 出力 中 の プロセス が 終了 する まで 待っ て 、 それから 制御 が 戻り ます
今 まで 集め られ た ヘッダ すべて が 書か れ ( そして 忘れ られ )る よう に し ます
この generator インスタンス の 独立 し た クローン を 生成 し 返し ます
オーバーライド し て プラットフォーム 固有 の ファイル 転送 を 実装 し ます
すべて の クッキー を 破棄 し 、 保存 さ れ て いる ファイル から 読み込み 直し ます
根底 の 生 ストリーム を バッファ から 分離 し て 返し ます
この メソッド は 録音 側 で バッファリング さ れる サンプル 数 を 返し ます
decode に 似 て い ます が 、 文字列 を 入力 として 受け 取り 、 デコード さ れ た 文字列 を 返し ます
traceback から limit まで の スタックトレース 項目 を 出力 し ます
この 演算 は compare とほとんど 同じ です が 、 全て の nan が シグナル を 送る ところ が 異 なり ます
固定 し た オブジェクト の 固定 を 解除 し ます
引数 に 渡し た データ 中 の ゼロ 交差 回数 を 返し ます
pickle さ れ た 文字列 を ソケット に 送信 し ます
メモリバッファ を 解放 し ます
指定 し た 文字 列 から すべ て の doctest 実行 例 を 抽出 し 、 doctest オブジェクト 内 に 集め ます
filename に 含ま れる すべ て の ブレークポイント を 削除 し ます
多角形 の 頂点 の 記録 を 開始 し ます
wave によっ て 開か れ て い た 場合 は ストリーム を 閉じ 、 この オブジェクト の インスタンス を 使用 でき なく し ます
引数 が 正ま た は 負 の 無限 大 なら ば true を 、 そう で なけれ ば false を 返し ます
rfc 2 8 2 2 の 規則 に 従っ て いる 日付 を 解析 しよ う と 試み ます
emit の 処理 中 に 発生 し た エラー を 処理 し ます
与え られ た 秒数 の 間実行 を 停止 し ます
waitpid に 似 て い ます が 、 子 プロセス id 、 終了 ステータスインジケータ 、 リソース 使用 情報 の 3 要 素 から なる タプル を 返し ます
base 6 4 をつかっ て 、 文字列 を エンコード ( 符号化 ) します
x が 発信 nan で あれ ば true を 返し ます
オブジェクト の 長さ ( 要素 の 数 ) を 返し ます
モジュール 名 module _name を sys .modules から 取り除き 、 モジュール の バイトコンパイル 済み ファイル を 全 て 削除 し ます
予測 的 グレゴリオ 暦 に おける 日付 序数 を 返し ます
プログレスバー の 現在 値 curval を value に 設定 し ます
control -c ハンドラ を インストール し ます
現在 の ファイル 位置 を 整数 （long 整数 に なる かも しれ ませ ん ） で 返し ます
acl を mailbox に 設定 し ます
並列 な map 組み込み 関数 と 同じ です ( iterable な 引数 を 1つ だけ サポート し ます )
data を 一括し て 解凍 し ます
記号 表 から 名前 name を 見つけ 出し て symbol インスタンス として 返し ます
極座標 r , phi を 持つ 複素 数 x を 返し ます
value が none 以外 の 場合 、 value を sys .stdout に 出力 し て _ _ builtin __ ._ に 保存 し ます
辞書 から ロギング 環境 設定 を 取得 し ます
アプリケーション が 起動 し て い てる か 確認 し 、 起動 し て い なけれ ば 起動 しよ う とし ます
機能名 featurename に 値 value を セット し ます
object の 参照 数 を 返し ます
tcl は ファクトリ 関数 で 、 tk クラス で 生成 する オブジェクト と よく 似 た オブジェクト を 生成 し ます
style の 指定 さ れ た option の 値 を 返し ます
ウィンドウ の 左上 角 から の 相対 で 表し た 現在 の カーソル 位置 を タプル ( y , x ) で 返し ます
指定 さ れ た モジュール が import さた 場合 、 その モジュール に 設定 し た _ _ file __ の 値 を 返し ます
パス 名 として 渡さ れ た application の ため の スタブパッケージ を 作成 し ます
ファイル の 読み 書き 位置 を 移動 し ます
共有 ライブラリ が エクスポート し て いる 外部 関数 を 返し ます
(linux 2 . 5 . 4 4 以降 で のみ サポート ) エッジポーリング ( edge polling ) オブジェクト を 返し ます
ディレクトリ の 場合 に true を 返し ます
ascii アルファベット 文字 か どう か を 調べ ます ; isupper (c ) or islower (c ) と 等価 です
nnn は 3 桁 の 1 0 進数 から なる http エラーコード で なく て は なり ませ ん
オブジェクト を うまく 印字 可能 な 形 に 表現 し た もの を 含む 文字 列 を 返し ます
暗号 に関する 用途 に 適し た n バイト から なる ランダム な 文字列 を 返し ます
文字列 の エンコード さ れ た バージョン を 返し ます
オブジェクト が メソッドデスクリプタ で あり 、 ismethod , isclass , isfunction , isbuiltin でない 場合 に 真 を 返し ます
比 が 元 の 浮動 小数 点数 とちょう ど 同じ で 分母 が 正 で ある 、 一対 の 整数 を 返し ます
文字 列定 数 で 与え られ た xml 断片 を 構文 解析 し ます
生成 する html ドキュメント の 本文 を セット し ます
レベル debug の メッセージ を ルートロガー で 記録 し ます
xml - rpc リクエスト に 応じる 関数 を 登録 し ます
チャンク の 最後 まで 飛び ます
pathname ( パス の 指定 を 含ん だ 文字 列 で なけれ ばいけ ませ ん
obj が gc に 管理 さ れ て い たら true を 返し 、 それ 以外 の 場合 は false を 返し ます
filename という 名前 で 、 ファイルシステム ・ ノード ( ファイル 、 デバイス 特殊 ファイル 、 また は 、 名前 つき パイプ ) を 作り ます
もし key が 辞書 に あれ ば 、 key に対する 値 を 返し ます
object が 抽象 規定 型 ( abc ) で ある とき に 真 を 返し ます
モジュールオブジェクト module を 再 ロード し て 、 それ を 再解 析 し 再 初 期化 し ます
指定 し た section の option 値 を ブール 値 に 型強 制 する 便宜 メソッド です
根底 の 生 ストリーム の read メソッド を 高々 1 回呼 び 出し 、 最大 で n バイト 読み込み 、 返し ます
番号付け の 間隔 を 詰める 必要 に 応じ て メールボックス 中 の メッセージ の 名前 を 付け 替え ます
文字列 また は 数値 を 長整 数値 に 変換 し ます
現在 の スレッド の ‘ スレッドid ’ を 返し ます
プリフィックス と uri の 名前 空間 の 関連 付け を 開始 し ます
unicode 文字 unichr に 割り 当て られ て いる 二 進数 を 、 整数 で 返し ます
node に ある node ._ fields の それぞれ の フィールド を ( フィールド 名 , 値 ) の タプル として yield します
フォントスタイル を 設定 し ます
漸増 的 エンコーダ を 使っ て 、 iterable から 供給 さ れる 入力 を 反復 的 に エンコード し ます
readline 初期化 ファイル の 行 を 一行 解釈 し て 実行 し ます
open が 制限 さ れ た 環境 で 呼ば れる とき 、 呼ばれる メソッド です
' 2 . 2 . 0 ' や ' nt ' のよう な 、 システム の リリース 情報 を 返し ます
二つ の 比較 対象 が 等しく なけれ ば 、 一つめ の 対象 に 最も 近く 二つめ の 対象 へ 近付 く 方向 の 数 を 返し ます
ペン の 色 (pencolor ) を 設定 する かまた は 返し ます
文字列 s を メッセージ 本体用 に エンコード し ます
この メソッド は source オブジェクト の バッファ を 共有 する ctypes の インスタンス を 返し ます
配列 を 作成 し て 、 その プロキシ を 返し ます
共有 threading .event オブジェクト を 作成 し て 、 その プロキシ を 返し ます
open と 同義
左 マージン の インデント 数 を 一つ 増や し 、 論理 タグ margin を 新た な インデント に 関連 付け ます
この ブレークポイント に関する すべ て の 情報 を 表示 し ます
子 ノード と 子 オブジェクト を 、 これら が 出 て き た 順 で 、 平ら な リスト 形式 に して 返し ます
setattr の 親戚 と なる 関数 です
これ は 、 with 文 の body で sys .stdout として stringio .stringio オブジェクト を 利用 する コンテキストマネージャー です
新しい セット 型 オブジェクト を 返し ます
ソケット に 指定 さ れ た タイムアウト 値 を 取得 し ます
再帰 的 に 、 carbon .ae .aedesc イベント を python オブジェクト へ アンパック し ます
バージョン 2 . 0 で 撤廃 : 組み込み 関数 int を 使っ て く ださい
コネクション 間 で やり とり さ れる メッセージ 出力 の レベル を セット し ます
再帰 レベル を デクリメント し て ロック を 解放 し ます
バージョン 2 . 7 で 撤廃 : 代わり に elementtree .iter メソッド を 利用 し て くだ さい
ファイル の モード が キャラクタ 型 の 特殊 デバイスファイル の 場合 に ゼロ で ない 値 を 返し ます
cd -rom から 次 に デジタルオーディオデータ を 読み込む 開始 位置 の ポインタ を 設定 し ます
ローカル 時間 の utc から の オフセット を 、 utc から 東向き を 正と し た 分 で 返し ます
ファイル 記述子 fd に対応 する ファイル を 、 サイズ が 最大 で length バイト に なる よう に 切り 詰め ます
obj が 真 の 場合 true を 返し 、 そう で ない 場合 false を 返し ます
code は 、 python の 式 を 含む 文字 列 か 、 あるい は コンパイル さ れ た コードオブジェクト の どちらか で なけれ ば なり ませ ん
接続 し て 最初 に サーバ から 送 られ て くる ウェルカムメッセージ を 返し ます
sha オブジェクト の コピー (“ クローン ”) を 返し ます
fd ( open が 返す 開か れ た ファイル 記述子 ) で 与え られる 端末 に 関連 付け られ た プロセスグループ を pg に 設定 し ます
指定 さ れ た namespaceuri および qname で 与え られ た 属性 の 値 を 文字列 で 設定 し ます
解析 さ れ て い ない ( ndata ) エンティティ 宣言 を 処理 する ため に 呼び出さ れ ます
与え られ た オブジェクト から 作 られ た “ メモリビュー ” オブジェクト を 返し ます
startup _hook 関数 を 設定 また は 除去 し ます
unichr as string . ユニコード 文字 unichr に 割り 当て られ た east asian width を 文字列 で 返し ます
現在 の コンポーネント に glob パターン で 指定 さ れ た ファイル の リスト を 追加 し ます
エンティティ 宣言 ごと に 呼び出さ れ ます
一時ファイル を 生成 する 際 に 使わ れる ファイル 名 の 先頭 部分 を 返し ます
cd -rom デバイス を 開き ます
getstatusoutput に 似 て い ます が 、 終了 ステータス は 無視 さ れ 、 コマンド の 出力 のみ を 返し ます
この ファクトリ 関数 は 新しい ctypes ポインタ 型 を 作成 し て 返し ます
共有 メモリ から 割り 当て られ た ctypes 配列 を 返し ます
可変長 の 文字列 s を パック し ます
コマンド を 指定 さ れ た 引数 で 実行 し 、 その コマンド が 完了 する の を 待っ て 、 returncode 属性 を 返し ます
アレイ から インデクス が i の 要素 を 取り除い て 返し ます
デバッガー が この 例外 発生 で 止まる べき で あれ ば 、 user _call メソッド ( サブクラス で オーバーライド さ れる ) を 呼び出し ます
サーバ へ の 接続 が 確立 し たら 、 最初 に この メソッド を 呼び出さ なく て は なり ませ ん
x を [ -] ddd .ddd の 形 に フォーマット し ます
ファイル の リソースフォーク を 開き ます
nframes が 正しい か 確認 し て 、 ファイル が wave によっ て 開か れ て い た 場合 は 閉じ ます
split 関数 と 同様 で 、 コンパイル し た パターン を 使い ます
この ハンドラ の フォーマッタ を form に 設定 し ます
すべて の テストモジュール を 指定 さ れ た 開始 ディレクトリ から 検索 し て 返し ます
x を a に ソート さ れ た 順序 で 挿入 し ます
str を 与え られ た パラメタ を 使っ て 文字列 に インスタンス 化 し ます
cd -rom ドライブ に マウント さ れ た オーディオ cd から 、 指定 し た フレーム 数 を 読み込み ます
ascii 小文字 か どう か を 調べ ます
カーソル を db ファイル の 次 の 要素 に 設定 し 、 その 要素 を 返し ます
fifo が 空 で なけれ ば 、 ( true , first ) を 返し 、 ポップ さ れ た アイテム を 削除 し ます
メソッド readda の パラメータ num _frames として 最適 の 値 を 返し ます
前 の バージョン と の 互換 性 の ため に 用意 さ れ て い ます
現在 の プロセス に グループ id を セット し ます
インストールスキーム に 基づい た 全て の インストールパス を 格納 し た 辞書 を 返し ます
x の 双曲 線正 弦 を 返し ます
encoding に 指定 し た codec を 検索 し 、 エンコーダ 関数 を 返し ます
現在 の ファイル 位置 から 最大 で num バイト 分 の 文字列 を 返し ます
last 命令 を 送信 し ます
指定 さ れ た section を 設定 から 削除 し ます
現在読 み 込み 中 の ファイル 名 を 返し ます
smtp サーバ に helo コマンド で 身元 を 示し ます
サーバ 上 の ディレクトリ dirname を 削除 し ます
タートル の 描い た もの を スクリーン から 消し ます
文字列 を lc _numeric で 設定 さ れ た 慣行 に 従っ て 浮動 小数 点 に 変換 し ます
与え られ た 行全 体 を 無視 し 、 単 に 読み飛ば す とき に 真 を 返し ます
a の b ビット 右 シフト を 返し ます
オブジェクト を 表示 し ます
この 関数 は run に 似 て い ます が 、 command 文字列 に対する グローバル 辞書 と ローカル 辞書 の 引数 が 追加 さ れ て い ます
主要 な オーディオパラメタ 、 サンプル 形式 、 チャネル 数 、 サンプルレート を 一つ の メソッド 呼び出し で 設定 し ます
イメージファイル の 幅 w 、 高 さ h 、 1 ピクセル あたり の バイト 数 b を 引数 として 扱い ます
rgb から hls に 変換 し ます
msisummaryinfogetpropertycount を通し て サマリープロパティ の 個数 を 返し ます
文字 データ を 処理 する とき に 呼び だ さ れ ます
変更 を 加え ず に writer に 渡さ なけれ ば なら ない データ を 提供 し ます
url の タイプ — いわゆる スキーム ( scheme ) — を 返し ます
指定 さ れ た tagname の オプション を 問い合わ せ たり 、 変更 し たり し ます
この ビジター は ノード の 全て の 子 について visit を 呼び出し ます
クッキー が サーバ から 受け 入れ られる べき かど う か を 表わす boolean 値 を 返し ます
ascii 大文字 か どう か を 調べ ます
文字列 を lc _numeric で 設定 さ れ た 慣行 に 従っ て 整数 に 変換 し ます
path が 絶対 パス なら 、 true を 返し ます
適切 な dom 実装 を 返し ます name は 、 よく 知ら れ た dom 実装 の モジュール 名 か 、 none に なり ます
データベース db を 開き 、 データベースオブジェクト を 返し ます
現在 の python インストール が ソース から ビルド さ れ た 場合 に true を 返し ます
新しい 条件 変数 ( condition variable ) オブジェクト を 返す ファクトリ 関数 です
キャラクタデバイス 、 ブロックデバイス あるい は fifo のい ずれ か の 場合 に true を 返し ます
assertraises と 同等 です が 、 例外 の 文字 列表 現 が 正規 表現 オブジェクト に マッチ する こと も テスト し ます
可能 な 限り 最 も セキュア な 方法 で 、 一時 ディレクトリ を 作成 し ます
os .listdir によって 得 た path の ディレクトリ 一覧 を 返し ます
古い メールボックス の 購読 を 解除 ( unsubscribe ) します
アレイ 中 で x が 出現 する インデクス の うち 最小 の 値 i を 返し ます
実際 に は パッケージ 内 で oldname という 名前 に なっ て いる モジュール を newname という 名前 で 指定 できる よう に し ます
“protected ” の _ charset 変数 を 返し ます
その メッセージ の content -type を 返し ます
この 関数 は タプル の リスト を 返し ます
document クラス 内 に おける 同名 の メソッド と 同じ です
path の フラグ を flags に 変更 する
y 座標 が y の 位置 に ある 要素 の 識別子 を 返し ます
与え られ た セクション が 存在 し て かつ オプション が 与え られ て いれ ば true を 返し 、 そう で なけれ ば false を 返し ます
与え られ た 実行 例 が 期待 と は 違う 例外 を 送出 し た こと を 報告 し ます
a を b に する ため の 方法 を 記述 する 5つ の タプル を 返し ます
この メソッド は リクエスト を 解釈 し 、 適切 な do _* メソッド に 転送 し ます
現在 設定 さ れ て いる 呼び出し 可能 ( callable ) アプリケーション を 返し ます
端末 の 出力 速度 を ビット ／ 秒 で 返し ます
メニュー の 最後 に セパレータ を 追加 し ます
x の 正弦 を 返し ます
'icmp ' のよう な インターネットプロトコル 名 を 、 socket の 第 三 引数 として 指定 する 事 が できる 定数 に 変換 し ます
与え られ た 順番 に url ハンドラ を 連鎖 さ せる openerdirector の インスタンス を 返し ます
デコレート し た テスト を 無条 件 で スキップ し ます
os ディストリビューション 名 の 取得 を 試み ます
カーソル を db ファイル の 最後 の 要素 に 設定 し 、 その 要素 を 返し ます
プロセス と 通信 し ます : end -of -file に 到達 する まで データ を stdin に 送信 し 、 stdout および stderr から データ を 受信 し ます
pwd を 展開 する 圧縮 ファイル の デフォルトパスワード として 指定 し ます
fullname に対する pep 3 0 2 “ loader ” オブジェクト を 検索 し ます
新しい プリミティブロック ( primitive lock ) オブジェクト を 返す ファクトリ 関数 です
terminfo 機能 名 capname に対応 する 機能 値 を 数値 で 返し ます
iterator ( イテレータ ) オブジェクト を 返し ます
新規 に 生成 さ れ た ソケットオブジェクト の 、 デフォルト の タイムアウト 値 を 浮動 小数 点形 式 の 秒数 で 返し ます
もっとも 最近 開か れ た 開始 タグ の テキスト を 返し ます
コンテナ 内 の 次 の 要素 を 返し ます
object を フォーマット 化 し て 出力 できる （” readable ”） か 、 あるい は eval を 使っ て 値 を 再構 成 できる か を 返し ます
システムコール setpgid を 呼び出し て 、 pid の id を もつ プロセス の プロセスグループ id を pgrp に 設定 し ます
深刻度 が lvl の メッセージ が 、 この ロガー で 処理 さ れる こと に なっ て いる かど う か を 示し ます
ソーステキスト の 一行 を インタプリタ へ 送り ます
音声 データ の 各 サンプル を u -law 符号 で エンコード し 、 python 文字 列 として 返し ます
インスタンス の デバッグレベル を 設定 し ます
パネル の ユーザポインタ を obj に 設定 し ます
現在 の プロセス が 動作 し て いる ウィンドウマネージャ に アクセス し ます
reg _expand _sz の よう に 、 環境 変数 プレースホルダ % name % を unicode 文字列 で 展開 し ます
トップレベル の モジュール を import します
tarfile を クローズ し ます
浮動 小数 点数 を str (float ) と 同じ よう に 書式 化 し ます が 、 ロケール に 配慮 し た 小数 点 が 使わ れ ます
タートル の 現在 の 向き を 返し ます ( 返 さ れる 値 は タートル の モード に 依存 し ます
最後 の エラー について の ステイタス の 情報 を 返し ます
カーソル を db ファイル の 最初 の 要素 に 設定 し 、 その 要素 を 返し ます
多角形 の 頂点 の 記録 を 停止 し ます
オブジェクト が フレーム の 場合 は 真 を 返し ます
domain を codeset に 結び付け て 、 gettext ファミリ の 関数 が 返す 文字 列 の エンコード 方式 を 変更 し ます
オーディオチャンネル 数 （ モノラル なら 1 、 ステレオ なら 2 ） を 返し ます
現在 の ウィンドウ に 書き込ま れ た 全て の 内容 に対し “ バックグラウンド ” に 属性 attr を 追加 し ます
http リクエスト を 処理 し ます
rfc 3 4 9 0 仕様 に 従っ て ラベル を ascii に 変換 し ます
引数 device は 整数 です
タートル の y 座標 を 返し ます
pickle を シンボル 分解 ( symbolic disassembly ) し た 内容 を ファイル 類似 オブジェクト out ( デフォルト で は sys .stdout ) に 出力 し ます
メンバー name に対する tarinfo オブジェクト を 返し ます
テストケース を 特定 する 文字 列 を 返し ます
(y , x ) に 文字列 str を 属性 attr で 描画 し ます
ソケットアドレス sockaddr から 、 ( host , port ) の タプル を 取得 し ます
条件 に 合致 する メッセージ を メールボックス から 検索 し ます
現在 実行 中 の 再生 を 停止 し ます
_ _future __ . division が 有効 な 場合 a / b を 返し ます
出力用 の 文字 セット を 返し ます
ジャンプ 先 で ある コードオブジェクト code のすべて の オフセット を 求め 、 これら の オフセット の リスト を 返し ます
メッセージ に 付い て いる ラベル の リスト から label を 削除 し ます
グループ に name という 名前 で 、 座標 x , y に 大きさ が width , height で text という ラベル の 付い た ラジオボタン を 追加 し ます
code は 、 python 式 を 含む 文字 列 で なけれ ば なり ませ ん
キュー が 空っぽ なら true を 、 そう で なけれ ば false を 返し ます
windows 用 : エラーコード code の 説明 文 を 返し ます
' # 3 on degas ' のよう な 、 システム の リリース 情報 を 返し ます
テストランナー が 実行 例 を 処理 しよ う とし て いる とき に レポート を 出力 し ます
パラメタ : distance – 数 タートル が 頭 を 向け て いる 方 と 反対 方向 へ 、 タートル を 距離 distance だけ 後退 さ せ ます
入力 し た データ の フレームレート を 変換 し ます
幾つか の 保存 先 に対し て デフォルト 値 を まとめて セット し ます
xml -rpc の イントロスペクション 関数 、 system .listmethods 、 system .methodhelp 、 system .methodsignature を 登録 し ます
バージョン 2 . 6 で 追加 . この メソッド は コールバック を 登録 し ます
path が シンボリックリンク なら 、 true を 返し ます
プログラム の セグメント ( program segment ) を メモリ 内 で ロック し ます
非名 前空間 モード で 要素 の 開始 を 通知 し ます
最後 に 読み込ま れ た 行 の 、 累積 し た 行番 号 を 返し ます
この ノートブック を 含む 最上 位 に ある ウィンドウ で の キーボード 移動 を 可能 に し ます
この メソッド は アンカー 領域 の 末尾 で 呼び出さ れ ます
パイプライン の 先頭 に 新しい アクション を 追加 し ます
text ( 文字列 ) 内 の 段落 を 一つ だけ 折り返し を 行い ます
x の 正接 を 返し ます
a % b を 返し ます
intel /dvi adpcm 形式 の データ を リニア ( linear ) 形式 に デコード し ます
新しい xmlparser オブジェクト を 作成 し 、 返し ます
指定 さ れ た 名前 を もつ フィールド の 値 を 返し ます
開か れ て いる ミキサデバイスファイル の ファイルハンドルナンバ を 返し ます
smtp セッション を 終了 し 、 コネクション を 閉じ ます
x の 双曲 線余 弦 を 返し ます
メッセージヘッダ を rfc に 沿っ た やり 方 で エンコード し ます
現在 の オブジェクト の グループ を 終了 し ます
nframes の 修正 なし に オーディオフレーム を 書き込み ます
ソケット の 接続 が 確立 し た 時 に 呼び出さ れ ます
