host と port 上 で 待機 し 、 app へ の コネクション を 受け 付ける wsgi サーバ を 作成 し ます
command args を 、 メッセージ 番号 で は なく uid で 指定 さ れ た メッセージ 群 に対し て 実行 し ます
オーディオデバイス を 明示 的 に 閉じ ます
ガウス 分布 です
この 関数 は 関数 tokenize .tokenize への コールバックパラメータ として check によって 使わ れ ます
insort _left と 似 て い ます が 、 a に 含ま れる x のうち 、 どの エントリー より も 後ろ に x を 挿入 し ます
この メソッド は 最後 に 行っ た commit 後 の 全て の 変更 を ロールバック し ます
xml エレメント を 全て の 子 エレメント を 含め て 表現 する 文字 列 を 生成 し ます
代替 オブジェクト が 設定 さ れ て いる 場合 、 lgettext を 代替 オブジェクト に 転送 し ます
パーサ が 回復 可能 な エラー を 検知 する と 呼び出さ れ ます
引数 も 含め 、 通常 の ソケット 生成 と 同じ
有効 な マップ の リスト を 返し ます
文字列 の スライス s [start , end ] に sub が 含まれる 場合 、 その 最小 の インデクス を 返し ます
文字 列定 数 で 与え られ た xml 断片 を 構文 解析 し ます
差分 を 生成 し た 元 の 二つ の シーケンス の うち 一つ を 返し ます
半遅延 モード 、 すなわち cbreak モード に 似た 、 ユーザ が 打鍵 し た 文字 が すぐ に プログラム で 利用 できる よう に なる モード で 使わ れ ます
ステレオミキサコントロール を 示す ビットマスク を 返し ます
翻訳 メッセージ として 返す 文字 列 の エンコード を 決める 、 “ protected ” の 変数 _ output _charset を 変更 し ます
タブ 補完 の ため の readline 単語 区切り 文字 を 設定 し ます
object を フォーマット 化 し て 文字 列 として 返し ます
使用 する cookiepolicy インスタンス を 指定 し ます
パラメタ : delay – 正 の 整数 描画 の 遅延 (delay ) を ミリ 秒単 位 で 設定 する かま た は その 値 を 返し ます
m 列 から なる 一年間 の カレンダー を 複数 行 の 文字 列 で 返し ます
ヒストリファイル に 必要 な 長さ を 返し ます
指定 さ れ た base 6 4 文 字列 を デコード し 、 インスタンス の データ と します
ascii 値 を 返し ます
指定 さ れ た フィルタ filt を この ロガー から 取り除き ます
モジュールオブジェクト module を アンロード し ます
python ソース code に対する トップレベル の symboltable を 返し ます
共有 メモリ から 割り 当て られ た ctypes オブジェクト を 返し ます
filename と 名づけ られ た b -tree 形式 の ファイル を 開き ます
現在 の 検出 数 を 、 ( count 0 , count 1 , count 2 ) の タプル で 返し ます
テスト の 説明 を 一行分 、 また は 説明 が ない 場合 に は none を 返し ます
mosel の 文字 列表 現 を http や javascript で 囲まず に 出力 し ます
接続 を 受け 入れ ます
finditer 関数 と 同様 で 、 コンパイル し た パターン を 使い ます
サブエレメント を この エレメント の 与え られ た 位置 に 挿入 し ます
オブジェクト input エンコード し 、( 出力 オブジェクト , 消費 し た 長さ ) の タプル を 返し ます
メモリ 上 に 一度 に 展開 でき ない よう な データストリーム を 解凍 する ため に 用い られる 解凍 オブジェクト を 返し ます
1 6 ビット の 正 の 整数 の バイトオーダ を 、 ホストバイトオーダ から ネットワークバイトオーダ に 変換 し ます
スクロールバー を 正しい 位置 に 移動 さ せ ます
この ウィンドウ の 上位 の ウィンドウ のい ずれ か で 更新 (touch ) さ れ た 各場 所 を この ウィンドウ 内 でも 更新 し ます
ウィンドウ の 指定 の 位置 の 文字 を 返し ます
expectedfailure の デコレータ で マーク さ れ た test が 失敗 し た 時 に 呼び出さ れ ます
stringio オブジェクト の close メソッド が 呼ば れる 前 ならいつ でも 、 “ file ” の 中身 全体 を 返し ます
代替 オブジェクト が 設定 さ れ て いる 場合 、 lngettext を 代替 オブジェクト に 転送 し ます
label を nameprep し た バージョン を 返し ます
オーディオファイル の 圧縮 形式 を 人 に 判読 可能 な 形 に し た もの を 返し ます
next 命令 を 送信 し ます
入力 ストリーム から 全 て の 行 を 読み込み 、 行 の リスト として 返し ます
ssl シャットダウンハンドシェイク を 実行 し ます
これ まで に 実行 し た テスト が 全 て 成功 し て いれ ば true を 、 それ 以外 なら false を 返し ます
インスタンス が none で ない データ を 持つ かど う か を 返し ます
ひと月 分の カレンダー を 複数 行 の 文字 列 で 返し ます
カラム 数 と 与え られる タブサイズ に 依存 し 、 全て の タブ 文字 を ひとつ 以上 の 空白 で 置換 し て 文字 列 の コピー を 返し ます
iterable の 要素 から なる 長さ r の 置換 (permutation ) を 次々 と 返し ます
メッセージヘッダ 向け に 書式 化 さ れ た 、 timestamp ( time .time の フォーマット で ある 必要 が あり ます ) で 与え られ た 日時 を 返し ます
file に対する マッピングエントリ を 返し ます
あらかじめ 与え て おく メソッド で 、 ユーザー と の 対話 により 呼ば れ ます
オブジェクト の 印字 可能 な 表現 を 含む 文字 列 を 返し ます
引数 の 絶対 値 を 返し ます
サンプルサイズ を 設定 し ます
newindex が 指定 さ れ て いる 場合 、 コンボボックス の 値 が ドロップダウンリスト の newindex の 位置 に ある 値 に 設定 さ れ ます
ディレクトリ path を 削除 し ます
出力 ストリーム に 特定 の http ヘッダ を 書き込み ます
引数 の パス の 環境 変数 を 展開 し て 返し ます
acquire で 獲得 し た スレッドロック を 解放 し ます
値 real + imag *j の 複素 数 型数 を 生成 する か 、 文字 列 また は 数値 を 複素 数型 に 変換 し ます
base 6 4 で エンコード さ れ た データ の ブロック を バイナリ に 変換 し 、 変換 後 の バイナリデータ を 返し ます
メッセージテキスト str 付き の モーダルダイアログ を 表示 し ます
1 6 ビット の 正 の 整数 の バイトオーダ を 、 ネットワークバイトオーダ から ホストバイトオーダ に 変換 し ます
object を 有効 な コンストラクタ で ある と 宣言 し ます
パラメタ で 渡さ れ た データ の 入っ た コメントノード を 生成 し て 返し ます
出力 ストリームオブジェクト out に 、 xml -rpc エンコーディング の boolean 値 を 出力 し ます
キー に 関数 情報 を タプル として 返し ます
wsgi .errors ストリーム として 使わ れる オブジェクト を 返し ます
condition が 偽 の 場合 に 、 デコレート し た テスト を スキップ し ます
stats クラス の この メソッド は 、 既存 の プロファイリングオブジェクト に 情報 を 追加 し ます
プロンプト に 答え て タイプ し たか の よう に 引数 を 解釈 実行 し ます
オブジェクト の ハッシュ 値 を ( 存在 すれれ ば ) 返し ます
(y , x ) に ある 文字 を 削除 し ます
この メソッド は address で 指定 さ れ た メモリ を 使っ て ctypes 型 の インスタンス を 返し ます
ファイル を 開い て 、 ファイルオブジェクト にて 説明 さ れる 、 file オブジェクト を 返し ます
ホスト 名 が ない 場合 、 また は ホスト 名 が ' localhost ' の 場合 に ファイル を ローカル で オープン し ます
現在 の エレメント に テキスト を 追加 し ます
レコード に対する イベントカテゴリ を 返し ます
この メソッド は オーディオデバイス の ステータスパラメータ を 設定 し ます
name という 名前 の 組み込み モジュール を 初期化 し 、 その モジュールオブジェクト を sys .modules に 格納 し た 上 で 返し ます
start と iterable の 要素 を 左から 右 へ 合計 し 、 総和 を 返し ます
getscrollbarvalues の 結果 から 値 を 計算 する の を 助ける 補助 的 な メソッド です
readline タブ 補完 スコープ の 先頭 の インデクス を 取得 し ます
ascii 1 0 進数 字 、 すなわち ' 0 ' から ' 9 ' まで の 文字 か どう か を 調べ ます
オブジェクト が 、 ビルトイン もしく は python で 作ら れ た クラス の 場合 に 真 を 返し ます
この 関数 は timeout 属性 が none 以外 に 設定 さ れ て 、 リクエスト が ない まま タイムアウト 秒数 が 過ぎ た とき に 呼ば れ ます
数値 を 表現 する 文字 列 の 左側 に 、 指定 の 幅 に なる まで ゼロ を 付加 し ます
文字列 を カーソル の 下 に ある 文字 の 前 に ( 一行 に 収まる だけ ) 最大 n 文字 挿入 し ます
サンプルサイズ を バイト 数 で 返し ます
非同 期 ループ 中 に 呼び出さ れ 、 read イベント の 監視 リスト に 加える か 否か を 決定 し ます
raw モード に 入り ます
指定 さ れ た 色 の 表示 テキスト に おける 属性 値 を 返し ます
メールボックス 内 の メッセージ 群 の フラグ 設定 を 変更 し ます
プログレスバー の 値 を amount だけ 増加 さ せ ます
フォーム を ディアクティベート し ます
非常 に 低機能 の telnet クライアント を エミュレート する 対話 関数 です
item の 子要素 を newchildren で 置き 換え ます
与え られ た 状態 データ が 関連 付け られ た key _mouse イベント を 入力 キュー に プッシュ し ます
もし string の 先頭 の 0 個以上 の 文字 が この 正規 表現 と マッチ すれ ば 、 対応 する matchobject インスタンス を 返し ます
(bsd で のみ サポート ) カーネルキュー ( kernel queue ) オブジェクト を 返し ます
matchobject m について 、 大きさ 2 の タプル ( m .start (group ), m .end (group )) を 返し ます
state は 予め getstate を 呼び出し て 得 て おか なく て は なり ませ ん
スクリーン を フラッシュ ( flash ) します
この 関数 は instance に 束縛 さ れ た メソッドオブジェクト か 、 あるい は instance が none の 場合 に 束縛 さ れ て い ない メソッドオブジェクト を 返し ます
obj の 符号 非反 転 ( + obj ) を 返し ます
gettext と 同じ です が 、 bind _textdomain _codeset で特に エンコード を 指定 し ない 限り 、 翻訳 結果 を 優先 システムエンコーディング ( preferred system encoding ) で 返し ます
multiprocessing が 使用 する ロガー を 返し ます
フォルダ 内 の シーケンスファイル の 完全 な パス 名 を 返し ます
すべて の メンバー を アーカイブ から カレントワーキングディレクトリ に 展開 し ます
コマンドラインオプション と パラメータ の リスト を 構文 解析 し ます
システム 変数 errno の 、 呼び出し 元 スレッド で の ctypes の プライベートコピー の 現在 値 を value に 設定 し 、 前 の 値 を 返し ます
input の 中身 を base 6 4 形式 で エンコード し た 結果 を output に 出力 し ます
ペイロード を base 6 4 形式 で エンコード し 、 content -transfer -encoding ヘッダ を base 6 4 に 変更 し ます
exec _info タプル を サーバログ に 記録 し ます
一つめ の 演算 対象 の 指数 部 に 二つめ の 値 を 加え た もの を 返し ます
a = ior (a , b ) は a | = b と 等価 です
join され た プロセス が terminate を 呼び出す まで 、 もしく は オプション で 指定 し た タイムアウト が 発生 する まで 呼び出し 側 の スレッド を ブロック し ます
この 名前 に 束縛 さ れ た 名前 空間 の リスト を 返し ます
この 関数 は 指定 さ れ た ファイル 上 の 画像 を 読み出し て 復号 化 し 、 python 文字 列 として 返し ます
ディザ 処理 を 行い 、 8 ビットグレースケール 画像 を 2ビットグレースケール 画像 へ 変換 し ます
テスト が 失敗 し た 場合 に 呼び出さ れ ます
再帰 的 な ディレクトリ 作成 関数 です
pattern に マッチ する names の リスト の 部分 集合 を 返し ます
openlog 関数 を 呼び出す こと で 以降 の syslog の 呼び出し に対する ログオプション を 設定 する こと が でき ます
set の 全て の 要素 が 、 other に 含ま れる か 確認 し ます
readline ヒストリファイル を 保存 し ます
この 関数 は data 中 の rgb また は グレイスケール の データ を 画像 ファイル file に 書き込み ます
whathdr を 使っ て 、 ファイル filename に 保存 さ れ た サウンドデータ の 形式 を 識別 し ます
この ノード を 複製 ( clone ) します
mailbox における who について の acl を 削除 ( 権限 を 削除 ) します
getargspec で 取得 し た 4つ の 値 を 読み やすく 整形 し ます
content -type ヘッダ の maintype と subtype を 設定 し ます
指定 さ れ た section から 指定 さ れ た option を 削除 し ます
フォーム を 再描 画 し ます
境界 文字 列 を 終了 マーカ 行 に し ます
あらかじめ 作成 さ れ た carbon .ae .aedesc オブジェクト 中 の パラメーター および 属性 を 保存 し ます
もし string の 先頭 で 0 個以上 の 文字 が 正規 表現 pattern と マッチ すれ ば 、 対応 する matchobject インスタンス を 返し ます
pem 形式 の ascii 文字 列 として 与え られ た 証明 書 から 、 同じ 証明 書 を der エンコード し た バイト 列 を 返し ます
背後 の windows ハンドル を 閉じ ます
新しい uuid を 、 msi が 通常 要求 する 形式 (す なわち 、 中括弧 に 入れ 、 1 6 進数 は 大文字 ) で 返し ます
fd で 指定 さ れ た ファイル の モード を mode に 変更 し ます
入力 ストリーム から 1 行 読み込み 、 デコード 済み の データ を 返し ます
listen 中 の チャネル が リモートホスト から の connect で 接続 さ れ 、 接続 が 確立 し た 時 に 呼び出さ れ ます
すべて の 属性 の 修飾 名 を 返す
ウィンドウ の ブロック また は 非 ブロック 読み込み 動作 を 設定 し ます
repr と 同じ値 を 返し ます
等差 数列 を 含む リスト を 生成 する ため の 多機 能関 数 です
指定 し た type の コールバック を 削除 し ます
この メソッド は message を 含む 使用 法 メッセージ を 標準 出力 に 表示 し て 、 終了 ステータス 2 で プログラム を 終了 し ます
文字 ch に 属性 attr を 付与 し 、 即座 に refresh を ウィンドウ に対し て 呼び出し ます
3 要素 の タプル ( iso 年 、 iso 週番 号 、 iso 曜日 ) を 返し ます
( コンストラクタ で 指定 さ れ た ) フィールド 名 の 行 を 出力 し ます
リクエスト が プロキシサーバ を 経由 する よう に 準備 し ます
which 番 の メッセージ に 削除 の ため の フラグ を 立て ます
テンプレート 文字 列 template に 、 sub メソッド が する よう な バックスラッシュ 置換 を して 得 られる 文字 列 を 返し ます
子 プロセス を fork します
ファイル source を コンパイル し 、 .pyc ファイル を 生成 し ます
obj の pickle 化 さ れ た 表現 を 、 ファイル に 書き込む 代わり に 文字列 で 返し ます
文字列 arg を 入力 として md5 オブジェクト を 更新 し ます
ファイル 記述子 fd の モード を raw モード に 変え ます
resource が 利用 でき なけれ ば 、 resourcedenied を 送出 し ます
応答 の 本体 全体 か 、 amt バイト まで 読み出し て 返し ます
urlsplit が 返す よう な 形式 の タプル 中 の エレメント を 組み合わせ て 、 文字列 の 完全 な url に し ます
メールボックス の 排他 的 アドバイザリロック を 取得 し 、 他 の プロセス が 変更 し ない よう に し ます
decimal インスタンス num の コピー を 返し ます
この 記号 表 に ある 記号 の 名前 の リスト を 返し ます
新 た な イベントオブジェクト を 返す ファクトリ 関数 です
iterable の 要素 と 同じ 要素 を もち 、 かつ 順番 も 同じ な リスト を 返し ます
フォルダ 内 の シーケンス から なる 辞書 を 返し ます
現在 の グローバルシンボルテーブル を 表す 辞書 を 返し ます
記号表 の 識別子 を 返し ます
非 常用 の メソッド で 、 全て の 入出 力 バッファ と producer fifo を 廃棄 し ます
数字 を 表す 文字 のみ で 構成 さ れる 場合 、 true を 返し ます
文字列 source 、 python モジュール 、 文 あるい は 式 を exec 文 あるい は eval 関数 で 実行 可能 な バイトコードオブジェクト に コンパイル し ます
タイマ を ストップ し て 、 その 動作 の 実行 を キャンセル し ます
x の 正弦 を 返し ます
この メソッド は iter (f ) と 同じ 結果 を 返し ます
source を コード 、 もしく は 、 ast オブジェクト に コンパイル し ます
readda など から 返さ れ た デジタルオーディオ cd の データ の 1つ ある い は それ 以上 の フレーム を パース し ます
これら の 関数 は ただ 一つ の 引数 を 取り 、 pick /select に 使う バッファ の サイズ を 設定 し ます
subn 関数 と 同様 で 、 コンパイル し た パターン を 使い ます
おそらく マルチバイト の 文字列 を 、 安全 に split できる 形式 に 変換 し ます
obj の ビット 単位 反転 を 返し ます
ウィンドウ が アクティブ 化 (activate = = 1 )、 非 アクティブ 化 (activate = = 0 ) する 際 に 呼ば れ ます
bytesource オブジェクト を 逆アセンブル し ます
与え られ た node ( これ は functiondef , classdef , module のいずれ か の ノード で なけれ ば なり ませ ん ) の ドキュメント 文字 列 を 返し ます
cmd を 子プロセス として 実行 し ます
保存先 の ファイル を ユーザ に 尋ねる ダイアログ を 表示 し て 、 ユーザ が 選択 し た ファイル を 返し ます
与え た 文字 に 対応 する 8 ビット 文字 を 返し ます ( 0x 8 0 と ビット 単位 で 論理 和 を 取り ます )
width の 長さ を もつ 左寄 せ し た 文字列 を 返し ます
yes が 1 の 場合 、 カーソル は “ カーソル 位置 ” に 移動 せ ず 現在 の 場所 に とどめ ます
元 の データ の 全 サンプル に 浮動 小数 点数 factor を 掛け た データ を 返し ます
指定 さ れ た アドレス ( 整数 で なく て は なり ませ ん ) の 外部 関数 を 返し ます
この 関数 は メモリアドレス address から 始まる 文字 列 を 返し ます
この メソッド と next メソッド を 使っ て 、 データベース の 全て の キー にわたっ て ループ 処理 を 行う こと が でき ます
文字列 data の 内容 を 解析 し 、 解析 さ れ た データ を 処理 する ため の 適切 な 関数 を 呼び出し ます
プロセス が シグナル によっ て 終了 し た ( exit ) 場合 に true を 、 それ 以外 の 場合 は false を 返し ます
formatyear で返さ れる 一年間 の カレンダー を 出力 し ます
robots .txt url を 読み出し 、 パーザ に 入力 し ます
ウィンドウ を destwin の 上 に 重ね 書き ( overlay ) します
名前 空間 の prefix を 登録 し ます
現在 の プロセス の ユーザ id を 設定 し ます
未知 の エンティティ 参照 を 処理 する ため に 呼び出さ れる メソッド です
現在 の リクエスト の cgi 変数 を environ 属性 に 追加 し ます
hmac オブジェクト の コピー ( “ クローン ”) を 返し ます
それぞれ の 桁 に 論理 演算 or を 当て はめ ます
与え られ た クッキー の パス 名 に対し て 、 そこに クッキー を 返す べき で ない 場合 に は false を 返し ます
apply メソッド の 一種 で 結果 オブジェクト を 返し ます
この メソッド は stats オブジェクト を 指定 し た 基準 に 従っ て ソート し ます
内部 フラグ の 値 を 真 に セット し ます
一様 な 項目 から なる 可変 長 の list を アンパック し て 返し ます
現在 の lc _collate 設定 に 従っ て 二つ の 文字列 を 比較 し ます
フォーム に メニューオブジェクト を 加え ます
ブロック し て いる ドメイン の シーケンス を ( タプル として ) 返し ます
ファイル の モード が fifo ( 名前 つき パイプ ) の 場合 に ゼロ で ない 値 を 返し ます
レベル info の メッセージ を ルートロガー で 記録 し ます
バージョン 2 . 0 で 撤廃 : isinstance (x , collections .callable )( ) を 使っ て く ださい
文字 列表 現 を 値 に デコード し て 返し ます
乱数 生成 器 の 現在 の 内部 状態 を 記憶 し た オブジェクト を 返し ます
特定 の キー を 生成 する か 開き 、 ハンドルオブジェクト を 返し ます
ソケット から データ を 受信 し 、 その データ を 新しい 文字 列 として 返す 代わり に buffer に 書き ます
インタープリタ が 拡張 モジュール を ロード する 時 、 dlopen で 使用 する フラグ を 設定 し ます
msiviewfetch の 呼び出し を 通し て クエリ の 結果 レコード を 返し ます
この 抽象 型 は 、 str および unicode の スーパークラス です
アレイ 中 の 位置 i の 前 に 値 x を もつ新しい 要素 を 挿入 し ます
モジュール modulename を インポート し 、 もしその モジュール が 安全 で ない と み なさ れる なら 、 importerror 例外 を 発生 し ます
プロセス が exit ( 2 ) システムコール で 終了 し た 場合 に true を 、 それ 以外 の 場合 は false を 返し ます
この 名前 に 束縛 さ れ た ただ 一つ の 名前 空間 を 返し ます
iterables の 要素 を 引数 として funtion を 呼び出す イテレータ を 作成 し ます
handler は basehandler の インスタンス で なけれ ば なり ませ ん
現在 の メッセージ 番号 を n に 設定 し ます
ポーリングオブジェクト によっ て 追跡 中 の ファイル 記述子 を 登録 解除 し ます
左上 の 角 が ( begin _y , begin _x ) で 、 高さ ／ 幅 が nlines / ncols の 新規 ウィンドウ を 返し ます
pc の スピーカ を 鳴ら し ます
サンプリングレート を 返し ます
文字列 の 先頭 部分 を 除去 し た コピー を 返し ます
最後 に 読み込ま れ た 行 が sys .stdin から 読ま れ て いれ ば true 、 そう で なけれ ば false を 返し ます
command へ の 、 また は command から の パイプ 入出 力 を 開き ます
this method is called to process an unknown end tag . 未知 の 終了 タグ を 処理 する ため に 呼び出さ れる メソッド です
match に マッチ する 最初 の サブエレメント を 探し ます
ランダム 生成 し た メッセージ を コネクション の 相手 側 へ 送信 し て 応答 を 待ち ます
現在 の プロセス に 実効 グループ id を セット し ます
src で 指定 さ れ た ファイル の 内容 を dst で 指定 さ れ た ファイル へ と コピー し ます
根底 に ある ロック を 解放 し ます
この メソッド は アンカー 領域 の 先頭 で 呼び出さ れ ます
短い 形式 の オプション 文字列 を 一つ だけ 持つ よう な オプション を 生成 する に は 次 の よう に し ます
url の コンテンツ を 取得 し 、 filename に 書き込み ます
3 2 ビット の 正 の 整数 の バイトオーダ を 、 ホストバイトオーダ から ネットワークバイトオーダ に 変換 し ます
この メソッド は 、 http 要求 メソッド method および セレクタ url を 使っ て 、 要求 を サーバ に 送り ます
引数 が 非正 規数 (subnormal ) で あれ ば true を 、 そう で なけれ ば false を 返し ます
rfind と 同じ です が 、 部分 文字 列 が 見つ から なかっ た とき に valueerror 送出 し ます
現在 の 傾斜 角 を 返し ます
ファイル の サイズ を 切り 詰め ます
digits と 似 て い ます が 、 ダイジェスト は 長さ 4 0 の 文字列 に なり 、 1 6 進 表記 数字 しか 含み ませ ん
開か れ た ファイル に 値 を 書き込み ます
mode で エンコード さ れ た ファイル を 開き 、 透過 的 に エンコード ・ デコー ド を 行う よう に ラップ し た ファイルオブジェクト を 返し ます
msirecordsetinteger を通し て field を value に セット し ます
s に 含まれる 小文字 を 大文字 に 置換 し て 返し ます
レベル critical の メッセージ を この ロガー で 記録 し ます
録音 に 使用 できる ミキサコントロール を 特定 する ビットマスク を 返し ます
元 データ の 各 サンプル に バイアス を 加え た データ を 返し ます
入力 iterable から 、 それぞれ の 要素 が 複数 回現 れる こと を 許し て 、 長さ r の 要素 の 部分 列 を 返し ます
u -law で 符号 化 さ れ て いる 音声 データ を 線形 に 符号 化 さ れ た 音声 データ に 変換 し ます
python における 単項 マイナス 演算子 に 対応 する 演算 です
この アプリケーション から の 異なる 呼び出し の 間 で 共有 さ れる 可能 性 が ある ファイル 選択 ダイアログ を 返し ます
ウィンドウ の 縁 に 境界線 を 描画 し ます
unquote と 似 て い ます が 、 加え て プラス 記号 を 空白 文字 に 置き 換え ます
この 関数 は デフォルト で gnu スタイル の スキャンモード を 使う 以外 は getopt と 同じ よう に 動作 し ます
x を 小数 点以 下 n 桁 で 丸め た 浮動 小数 点数 の 値 を 返し ます
tix アプリケーション の スキーム と フォントセット を newscheme と newfontset それぞれ へ と 再設定 し ます
この 関数 は 新しい クラスオブジェクト を 返し ます
アレイ の すべ て の 要素 を ファイルオブジェクト f に ( マシン 依存 の データ 形式 その ままで ) 書き込み ます
フォーム に インプットオブジェクト を 加え ます
漸増 的 デコーダ を 使っ て 、 iterable から 供給 さ れる 入力 を 反復 的 に デコード し ます
(resp , path ) から なる ペア を 返し ます
x の ガンマ 関数 の 絶対 値 の 自然 対数 を 返し ます
マウスカーソル を 矢印 型 に 設定 し ます
指定 さ れ た 位置 に ペイン を 挿入 し ます
セクション 境界 を ポップ し ます
新しく 選択 状態 の 要素 が items に なり ます
クラス 内 に 定義 さ れ た テスト が 実行 さ れる 前 に 呼び出さ れる クラスメソッド です
新しい イベント を スケジュール し ます
tarinfo アーカイブ の メンバー を オブジェクト の リスト として 返し ます
この 記号 表 に 対応 する ブロック の 一行 目 の 行番 号 を 返し ます
キーワード 引数 で 指定 し た メンバ の 値 を 除き 、 同じ値 を もつ time オブジェクト を 返し ます
パネルスタック の 最上 層 の パネル を 返し ます
ファイル の モード が ディレクトリ の 場合 に ゼロ で ない 値 を 返し ます
object を フォーマット 化 し て 出力 できる （” readable ”） か 、 あるい は eval を 使っ て 値 を 再構 成 できる か を 返し ます
node 中 の ツリー の フォーマット さ れ た ダンプ を 返し ます
レベル info の メッセージ を この ロガー で 記録 し ます
data の binhex 4 crc 値 を 計算 し ます
list newsgroups 命令 を 送信 し ます
object の 文字 列表 現 を 、 再帰 的 な データ 構造 から 保護 し た 形式 で 返し ます
個 の メソッド は 対応 する 開始 エレメント の ない 終了 タグ が 発見 さ れ た 時 に 呼び出さ れ ます
string を 解凍 し 、 少なく とも string の 一部 分 に 対応 する 解凍 さ れ た データ を 含む 文字 列 を 返し ます
rgb から hsv に 変換 し ます
レベル warning の メッセージ を ルートロガー で 記録 し ます
エポック から の 経過 時間 で 表現 さ れ た 時刻 を 、 utc における struct _time に 変換 し ます
tix アプリケーション ・ コンテキスト の 設定 オプション を 問い合わ せ たり 、 変更 し たり し ます
カーソル の 下 に 空行 を 1 行入 れ ます
ガベージコレクション の デバッグフラグ を 設定 し ます
与え られ た グループ 名 に対する グループデータベースエントリ を 返し ます
文字列 から なる 2つ の シーケンス を 比較 し 、 差分 （ を 表す 文字 列 から なる シーケンス ） を 生成 し ます
host 上 の port に対する ソケット を 開き ます
この 関数 は 、 現在 linux _distribution が 提供 し て いる 機能 の 古い バージョン です
キャッシュ 付き 接続 の 最大 接続 数 を m に 設定 し ます
この メソッド は obj を ctypes 型 に 適合 さ せ ます
イベント の コールバック 関数 を 設定 し ます
ファイルディスクリプタ を 整数 で 返し ます
フォーム に ライトボタンオブジェクト を 加え ます
この コントロール の eventmapping テーブル に エントリ を 作り ます
この ブレークポイント を ファイル / 行 に 関連 付け られ た リスト から 削除 し ます
ファイル file を 開き 、 flag に 従っ て 様々 な フラグ を 設定 し 、 可能 なら mode に 従っ て ファイルモード を 設定 し ます
呼び出し 可能 ( callable ) な application を リクエスト を 受け取る wsgi アプリケーション として 設定 し ます
windows 用 : 返 さ れ た 関数 プロトタイプ は stdcall 呼び出し 規約 を つかう 関数 を 作成 し ます
loadtestsfromname と 同じ です が 、 名前 を 一つ だけ 指定 する の で は なく 、 複数 の 名前 の シーケンス を 指定 する 事 が でき ます
開か れ た レジストリキー の 値 フィールド に データ を 記録 し ます
マネージャ が 使用 する プロセス を 停止 し ます
サンプリングレート を n に 設定 し ます
a = ixor (a , b ) は a ^ = b と 等価 です
スクリーン また は スクロール 領域 を 上に lines 行 スクロール し ます
yes が 1 で あれ ば 、 curses は ハードウェア の 行編 集機 能 を 利用 しよ う と 試み ます
text コントロール を 追加 し て 返し ます
argumentparser が コマンドライン から どう 実行 さ れる べきか の 短い 説明 を 格納 し た 文字列 を 返し ます
デフォルト の content -type を 設定 し ます
固定長 の 文字列 、 s を パック し ます
x の 双曲 線正 弦 を 返し ます
バイナリデータ を uuencode して 1 行 の ascii 文字列 に 変換 し ます
メールボックスオブジェクト の コンストラクタ に 渡さ れ た 、 オプション の factory 引数 を 使っ て 、 メールボックス 中 の 次 の メッセージ を 生成 し て 返し ます
ascii 余白 文字 、 すなわち 空白 、 改行 、 復帰 、 改頁 、 水平タブ 、 垂直タブ か どう か を 調べ ます
選択 状態 の 要素 から items を 取り除き ます
内部 状態 を 、 現在 の 状態 から 、 非常 に 離れ て いる で あろ う 状態 に 変更 し ます
デバイス に 関連 付け られ て いる ファイル 記述子 を 返し ます
メッセージ の content -type パラメータ を リスト として 返し ます
標準 の 真値 テスト を 使っ て 、 値 を ブール 値 に 変換 し ます
メッセージ 中 の content -type ヘッダ に ある 、 boundary パラメータ に 値 を 設定 し ます
xmlcharrefreplace エラー 処理 の 実装 です ( エンコード のみ ): エンコード でき なかっ た 文字 は 適切 な xml 文字 参照 に 置き 換え ます
パス の list の 中 の 共通 する 最長 の プレフィックス を ( パス名 の 1 文字 1 文字 を 判断 し て ) 返し ます
ソケット へ の 接続 を 待つ
便利 関数
最後 に 読み込ま れ た 行 が ファイル の 1 行目 なら true 、 そう で なけれ ば false を 返し ます
プロセス が 実行 する 処理 を 表す メソッド です
epoll オブジェクト の 制御 用 ファイル 記述子 を 閉じる
内部 的 に 使わ れ て いる ソケットオブジェクト の ファイル 記述子 です
以前 に キュー へ 追加 さ れ た タスク が 完了 し た こと を 表し ます
この メソッド は 、 特殊 な logrecord インスタンス を 生成 する ため に サブクラス で オーバライド できる ファクトリメソッド です
エレメント の key という 名前 の アトリビュート を 取得 し ます
pop 3 サーバー から 送 られる グリーティングメッセージ を 返し ます
パラメタ : angle – 数 ( 整数 また は 浮動 小数 点数 ) タートル を angle 単位 だけ 右 に 回し ます
その メッセージ の 主 content -type を 返し ます
varname と 名づけ られ た 環境 変数 の 値 を 文字列 value に 設定 し ます
現在 の ヒストリ 行数 を 返し ます ( この 値 は get _history _length で 取得 する 異 なり ます
2つ の 辞書 が 等しい か どう か を テスト し ます
wrapper 関数 を wrapped 関数 に 見える よう に アップデート し ます
y から x に 符号 を コピー し ます
forms ドキュメント に ある fl _color 、 fl _mapcolor 、 fl _getmcolor の 記述 を 参照 し て くだ さい
文字列 を コピー し 、 大文字 に 変換 し て 返し ます
メモリ 内 の ファイル ・ ポインタ の 現在 位置 に 単一文字 の 文字列 byte を 書き込み ます
この メソッド は ref を 一般 エンティティ 参照 として 、 & ref ; 形式 の エンティティ 参照 を 処理 する ため に 呼び出さ れ ます
パーザ が sgml の doctype 宣言 を 読み出し た 際 に 呼び出さ れる メソッド です
シグナル を 受け 取る まで プロセス を 一時 停止 し ます ; その後 、 適切 な ハンドラ が 呼び出さ れ ます
これ は arepr の repr メソッド です
string を 、 pattern が ある たび に 分割 し ます
flags で 指定 さ れ た フラグ を 下ろ し ます が 他 の フラグ は 変え ませ ん
imap 4 の internaldate 文字列 を 解析 し て それ に 相当 する ローカルタイム を 返し ます
ウィンドウ 全体 を 更新 ( touch ) し 、 次 の refresh 呼び出し で 完全 に 再描 画 さ れる よう に し ます
この 関数 は オーディオデバイス を 開き 、 sun オーディオデバイス の オブジェクト を 返し ます
記号 表中 の 名前 を 表す symbol インスタンス の リスト を 返し ます
認証 情報 が ある 場合 、 認証 情報 付き で 再度 リクエスト を 試み ます
echo モード から 離れ ます
ファイル src を dst へ コピー し ます
cmd を サブプロセス として 実行 し ます
パッケージ から リソース を 取得 し ます
現在 の プロセス に対し て 実際 の ユーザ id および 実効 ユーザ id を 設定 し ます
インスタンス が 強制 する 書式 化 を 使う 組み込み repr と 等価 なもの
以前 の マージン 設定 を 復元 し ます
ランダム な uuid を 生成 し ます
指定 し た producer オブジェクト を チャネル の fifo に 追加 し ます
2つ の リスト また は タプル が 等しい か どう か を テスト し ます
その メッセージ 中 の content -type ヘッダ に ある 、 charset パラメータ の 値 を 返し ます
string を 走査 し て 、 この 正規 表現 が マッチ する 場所 を 探し 、 対応 する matchobject インスタンス を 返し ます
特定 の キー を 削除 し ます
時刻 を 浮動 小数 点数 で 返し ます
その メッセージ 中 の content -type ヘッダ に ある 、 boundary パラメータ の 値 を 返し ます
set the current process ’s real , effective , and saved user ids . 利用 できる 環境 : unix バージョン 2 . 7 で 追加 .
データベース が 高速 モード で 開か れ て い た 場合 、 この メソッド は ディスク にまだ 書き込ま れ て い ない データ を 全て 書き込ま せ ます
過去 3 6 時間 以内 に アクセス さ れ なかっ た メールボックス 内 の 一時 ファイル を 削除 し ます
これら は a および b の 大小 比較 を 行い ます
新しい 辞書 型 データ を 作成 し ます
複数 行 の 文字列 first が 文字列 second と 等しい こと を テスト し ます
url で 表さ れる ネットワーク 上 の オブジェクト を 読み込み 用 に 開き ます
要求 さ れ た 色ペア 中 の 色 を 含む ( fg , bg ) から なる タプル を 返し ます
ngettext と 同じ です が 、 bind _textdomain _codeset で特に エンコード を 指定 し ない 限り 、 翻訳 結果 を 優先 システムエンコーディング ( preferred system encoding ) で 返し ます
この メソッド は 何 も しませ ん
newnews 命令 を 送信 し ます
指定 さ れ た ログ 記録 レコード を 実際 に ログ 記録 する 際 の すべ て の 処理 を 行い ます
アンドゥバッファ の エントリー 数 を 返し ます
受理 さ れ た ( 成功 し た ) リクエスト を ログ に 記録 し ます
function の クラスメソッド を 返し ます
ソケット を クローズ し ます
ウィンドウ が リサイズ さ れ た 後 に 呼ば れ ます
bitmap コントロール を 追加 し て 返し ます
背後 に ある 実装 系 が オペレーティングシステム に i /o 操作 を 要求 する ため に 用いる 、 整数 の “ ファイル 記述子 ” を 返し ます
cd -rom ドライブ の イジェクトボタン を ロック し て 、 ユーザ が cd キャディ を 排出 でき ない よう に し ます
現在 の プログラム の バージョン ( self .version ) を file ( デフォルト : stdout ) へ 表示 し ます
cmd を サブプロセス として 実行 し ます
子孫 エレメント の 中 で 与え られ た タグ を 持つ 最初 の もの の テキスト を 見つけ ます
iterable から 要素 を 取得 し 、 同時 に その コピー を 保存 する イテレータ を 作成 し ます
eof に 到達 し ない 限り 、 少なく とも 1 バイト の 転送 処理 済 み データ を 読み込み ます
infile を outfile に コピー し ます
レベル level の メッセージ を ルートロガー で 記録 し ます
これ まで update メソッド に 渡さ れ た 文字 列 の ダイジェスト 値 を 返し ます
文字列 の 先頭 と 末尾 から 文字 を 取り除い た コピー を 生成 し て 返し ます
新 た な メールボックス を 購読 ( subscribe ) します
extract _tb また は extract _stack が 返す タプル の リスト が 与え られる と 、 出力 の 準備 を 整え た 文字 列 の リスト を 返し ます
unpack _from 関数 と 同じ 、 コンパイル さ れ た フォーマット を 利用 する メソッド です
destwin の 上 に ウィンドウ の 内容 を 上書き ( overwrite ) します
地域 的 な 慣行 の データベース を 辞書 として 返し ます
data に対し 、 binhex 4 標準 に 従っ て rle 展開 を 行い ます
ライブラリ を 初期化 し ます
handle メソッド より 前 に 呼び出さ れ 、 何らか の 必要 な 初期 化処 理 を 行い ます
現在 の エレメント を 閉じ ます
オブジェクト 内 の [ start , end ] の 範囲 に 含ま れ て いる 部分 文字 列 string が 見つかっ た 場所 の 最も 小さい インデックス を 返し ます
文字列 データ 内 の ' &' , '< ', ' >' を エスケープ し ます
x が 標準 的 (canonical ) ならば true を 返し ます
返り値 は 新しい audio configuration object です ； オーディオコンフィギュレーションオブジェクト の メソッド は 下 に 書か れ て い ます
すで に 開か れ て いる ファイルオブジェクト file に 、 obj を pickle 化 し た もの を 表現 する 文字 列 を 書き込み ます
windows 用 : python と 拡張 モジュール で 使わ れる vc ランタイプライブラリ の ファイル 名 を 返し ます
フォームフィールド name に関連付け られ た 値 を つね に 一つ だけ 返す 軽量 メソッド です
固定長 の 文字列 を アンパック し て 返し ます
辞書 の キー の 新しい ビュー を 返し ます
src から dst へ パーミッション を コピー し ます
これ は 非標 準 の 便宜 メソッド で 、 一度 に 複数 の sql 文 を 実行 する こと が でき ます
同じ decimal オブジェクト x を 返し ます
ast が ' eval ' 形式 を 表し て いる 場合 に 、 この 関数 は 真 を 返し ます
データ 中 の 全 サンプル の 平均 peak -peak 振幅 を 返し ます
呼び出し元 の ソースファイル 名 と 行番 号 を 調べ ます
ロック を 解放 し ます
tls /ssl ハンドシェイク を 実施 し ます
ファインダ に file を 起動 する よう に 命令 し ます
現在 インポートロック が 維持 さ れ て いる なら ば 、 true を 返し ます
一つめ の 演算 対象 の 数字 を 二つめ の で 指定 さ れ た 量 だけ シフト し た 結果 を 返し ます
この メソッド は 、 呼ばれ た 関数 の 中 で ブレーク する 必要 が ある 可能 性 が ある 場合 に 、 dispatch _call から 呼び出さ れ ます
高々 max _denominator を 分母 に 持つ self に 最も 近い fraction を 見付け て 返し ます
全て の テスト が 実行 さ れ た 後 に 一度 だけ 実行 さ れ ます
attrname で 指定 さ れ た 属性 の attr ノード を 返し ます
y / x の 逆正 接 を ラジアン で 返し ます
データ 文字 列 を 値 に 変換 し ます
日付 を rfc 2 8 2 2 形式 の 文字 列 で 返し ます
x の 逆双 曲線 正弦 を 返し ます
キュー の 中 の 全 アイテム が 処理 さ れる 間 で ブロック し ます
unpack _string と 同様 に 、 可変 長 の 不透明 データ 文字列 を アンパック し て 返し ます
チャネル の fifo に データ を プッシュ し て 転送 し ます
stat 命令 を 送信 し ます
レコード の イベント 型 を 返し ます
現在 の ペイロード へ の 参照 を 返し ます
この 関数 は range に 非常 によく 似 て い ます が 、 リスト の 代わり に “ xrange オブジェクト ” を 返し ます
cd -rom から 次 に デジタルオーディオデータ を 読み込む 開始 位置 の ポインタ を 設定 し ます
エラー 状態 を 示す 可読 メッセージ を 返し ます
演算 対象 の 自然 対数 (底 e の 対数 ) を 返し ます
pickle 内 の 全て の opcode を 取り出す イテレータ ( iterator ) を 返し ます
x の クラス を 指し示す もの を 返し ます
メインウィンドウ の サイズ と ポジション を 設定 し ます
x の 逆双 曲線 正接 を 返し ます
エレメント の アトリビュート key に value を セット し ます
fullname に 指定 し た モジュール の ソースコード を 返し ます
最近傍 の 整数 に 値 を 丸め 、 丸め が 起こっ た 場合 に は inexact また は rounded の シグナル を 適切 に 出し ます
代替 オブジェクト が 設定 さ れ て いる 場合 、 gettext を 代替 オブジェクト に 転送 し ます
aiff -c ファイル を 作り ます
無視 できる 行 の とき 真 を 返し ます
rfc 2 2 3 1 に 従っ て 文字 列 s を デコード し ます
可変長 の 文字列 を アンパック し て 返し ます
item を 見える 状態 に し ます
読み込む ポインタ を データ の 始め に 巻き戻し ます
1 + x の 自然 対数 (つまり 底 e の 対数 ) を 返し ます
共有 オブジェクトファイル を 開い て 、 ハンドル を 返し ます
下位 互換 性 の ため に 、 new の 別名 として 提供 さ れ て い ます
object を 参照 する すべ て の 弱参 照 と プロキシオブジェクト の リスト を 返し ます
iso 8 6 0 1 形式 、 ‘ yyyy -mm -dd ’ の 日付 を 表す 文字 列 を 返し ます
リスト 中 の メッセージ を 他 の フォルダ に 移動 し ます
名前 空間 識別子 （ これ は uuid です ） と 名前 （ 文字列 です ） の sha - 1 ハッシュ から 生成 し ます
obj の 絶対 値 を 返し ます
名前 に 対応 する 文字 を 探し ます
実行 中 の 補完 の タイプ を 取得 し ます
オブジェクト が python の 関数 (lambda 式 で 生成 さ れ た もの を 含む ) で ある 場合 に 真 を 返し ます
プロセス が 停止 さ れ た ( stop ) 場合 に true を 、 それ 以外 の 場合 は false を 返し ます
ファイル path を 削除 し ます
unicode フラグ が 偽 の 場合 、 この メソッド は self .gettext を 組み込み 名前 空間 に 組み入れ 、 _ と 結び付け ます
デフォルト の ブラウザ で url を 表示 し ます
パイプ を 作成 し ます
get *( ) メソッド が 返す の と 同じ ( nchannels ,  sampwidth , framerate , nframes , comptype , compname ) の タプル を 返し ます
フォーム の 中 の 最初 の オブジェクト を 見つけ ます
外部 の xml 断片 を この エレメント の 木 に 読み込み ます
ratio の 上界 を 、 非常 に 高速 に 計算 し ます
walk メソッド は 多目 的 の ジェネレータ で 、 これ は ある メッセージオブジェクトツリー 中 の すべ て の part および subpart をわたり 歩く の に 使え ます
現在 の errorhandler を 返し ます
トレースバックオブジェクト traceback から limit まで 取り出さ れ た ” 前処 理済 み ” スタックトレース 項目 の リスト を 返し ます
テスト 結果 を 収集 せ ず に テスト を 実行 し ます
現在 の ヒストリ から 、 index 番目 の 項目 を 返し ます
メールボックス の ロック を 、 もし あれ ば 、 解放 し ます
function が 型 type の オブジェクト に対する ” リダクション ” 関数 として 使う こと を 宣言 し ます
一様 な 項目 から なる 固定 長 の リスト ( array ) を パック し ます
unicode 文字 unichr に 割り 当て られ て いる 十進数 を 、 整数 で 返し ます
データ 中 の index サンプル 目 の 値 を 返し ます
カーソル 位置 から 行末 まで を 消去 し ます
デバイス を 非 ブロックモード に し ます
section の option 変数 を 取得 し ます
check _warnings と 似 て い ます が 、 python 3 互換 性警 告 の ため の もの です
( “protocol ” は 実際 に は プロトコル 名 です ) この メソッド は basehandler で は 定義 さ れ て い ませ ん
getch の ワイド 文字 列版
callable を 呼び出し た 時 に 例外 が 発生 する こと を テスト し ます
mime type 情報 を windows の レジストリ から 読み込み ます
xml -rpc における 複数 の 要求 を 処理 する 関数 system .multicall を 登録 し ます
サーバ に 最初 に 接続 し た 際 に 送信 さ れる 応答 中 の ウェルカムメッセージ を 返し ます
アーカイブ から メンバー を オブジェクト として 抽出 し ます
接続 を 一方 的 に 閉じ ます
トップレベルフォルダ の リスト を 返し ます
translate に渡す のに 適し た 変換 テーブル を 返し ます
与え られ た uid に対応 する パスワードデータベース の エントリ を 返し ます
空白 また は 英数 字以外 の ascii 印字 可能 文字 か どう か を 調べ ます
msirecordgetfieldcount を通し て レコード の フィールド 数 を 返し ます
アレイ を unicode 文字列 に 変換 し ます
エポック から の 経過 秒数 で 表現 さ れ た 時刻 を 、 ローカル の 時刻 を 表現 する 文字 列 に 変換 し ます
read -eval -print ループ を 実行 する ため の 便利 な 関数
新しい 要素 を 作り 、 その 要素 の 識別子 を 返し ます
resource が 有効 で 利用 可能 なら ば true を 返し ます
x の y 回巡 回 し た コピー を 返し ます
msidatabaseopenview を 呼び出し て ビューオブジェクト を 返し ます
ファイル input の 内容 を デコード し て 、 デコード さ れ た バイナリデータ を ファイル output に 書き出し ます
コマンドディスパッチ が 終わっ た 直後 に 実行 さ れる フックメソッド
パラメーターエンティティ ( 外部 dtd サブセット を 含む ) の 解析 を 制御 し ます
filename という 名前 の ファイル から lineno 行目 を 取得 し ます
実行 中 の スレッド で インタープリタ の インポートロック を 取得 し ます
非同 期 ループ で 、 チャネル の ソケット の read メソッド の 呼び出し が 成功 し た 時 に 呼び出さ れ ます
kqueue オブジェクト の 制御 用 ファイル 記述子 を 閉じる
name に 一致 する 最初 の ヘッダ に おける コロン 以降 の テキスト が 入っ た 単一 の 文字列 を 返し ます
カレントプロセス の アクティブ な 子 プロセス の 全て の リスト を 返し ます
group 命令 を 送信 し ます
パック 処理 用 バッファ を リセット し て 、 空文字 に し ます
現在 の ポインタ から n 個 の オーディオフレーム の 値 を 読み込ん で 、 バイト ごと に 文字 に 変換 し て 文字列 を 返し ます
オプション 文字 列 opt _str に対する option インスタンス を 返し ます
k が morsel の キー で ある かど う か を 判定 し ます
キューサイズ を 設定 し ます
deque の 要素 を インプレース に 逆転 し 、 none を 返し ます
ソケット 自身 の アドレス を 返し ます
古い スタイル の 比較 関数 を key 関数 に 変換 し ます
この 関数 は name という 名前 の 新しい モジュールオブジェクト を 返し ます
オブジェクト を 登録 し 、 その オブジェクト の register _function で 登録 さ れ て い ない メソッド を 公開 し ます
string 全体 を 走査 し て 、 正規 表現 pattern が マッチ を 発生 する 位置 を 探し て 、 対応 する matchobject インスタンス を 返し ます
一様 な 項目 から なる リスト を アンパック 処理 し て かえ し ます
textcalendar の formatmonth メソッド を 利用 し て 、 ひと月 分の カレンダー を 複数 行 の 文字 列 で 返し ます
パス 名 の 大文字 、 小文字 を システム の 標準 に し ます
モジュロ を 計算 し 、 正負 の モジュロ の うち ゼロ に 近い値 を 返し ます
この メソッド は basehandler で は 定義 さ れ て い ませ ん
自動ガベージコレクション を 無効 に し ます
mailbox に対する annotation を 取得 し ます
返さ れ た 関数 プロトタイプ は python 呼び出し 規約 を つかう 関数 を 作成 し ます
オブジェクト が 再帰 的 な 表現 か どう か を 返し ます
