вычисляет факториал a! числа a
это интерфейс к getrusage 2 
возвращает число tidy-предупреждений встреченных в указанном документе
устанавливает цвет в объекте imagickpixel используя нормализованные значения оттенка насыщенности и яркости
возвращает внутреннюю информацию о том где было вызвано исключение
аналогична но возвращает файл разбитый построчно на массив
декодирует бинарные данные переданные в качестве параметров в udf
удаляет атрибут с пространством имен namespaceuri и локальным именем localname из элемента
устанавливает прозрачность цвета в заданном изображении image
бинарно-безопасное сравнение строк без учета регистра
получает текущий для заданного xml анализатора байтовый индекс
этот метод вызывается в результате вызова rename()
этот метод вычисляет уникальный идентификатор для объектов добавляемых в контейнер splobjectstorage
связывает php переменную с именованным или неименованным параметром подготавливаемого sql запроса
этот метод возвращает текущий внутренний итератор
функция генерирует сообщение которое направляется в системный журнал
возвращает позицию файлового указателя handle
устанавливает клиентскую кодировку и возвращает 0 при успехе -1 в случае ошибки
поворот изображения image на заданный угол angle в градусах
возвращает объект содержащий следующую строку из результата запроса
выводит информацию о переменной в удобочитаемом виде
возводит число base в степень exp
собирает статистическую информацию о файле
сортирует результат запроса ldap возвращаемый функцией ldap_search()
разбивает массив на несколько массивов размером в size элементов
переименовывает файл или директорию на ftp-сервере
возвращает static статические свойства
позволяет асинхронную обработку множества curl-дескрипторов
проверяет является ли аргумент необязательным
функция возвращает true если в массиве присутствует указанный ключ key
получает ссылку на активный в данный момент внутренний итератор
рисует прямоугольник
получение имени функции
определяет является ли файл обычным файлом
функция отправляет len байт из буфера buf через сокет socket к порту port на адресе addr
возвращает имя класса из которого был вызван статический метод
устанавливает значение статического static свойства
возвращает строку содержащую последнее сообщение об ошибке
читает до конца файла eof данные из указателя gz-файла начиная с текущей позиции и записывает результат без сжатия в стандартный вывод
позиционирует курсор на именованном атрибуте в указанном пространстве имен
эта функция сортирует ключи так чтобы сохранить связь ключа и значения при этом для сравнения элементов вызывается пользовательская функция
исполняет команду command
устанавливает таймаут ожидания активности на сокете
создает gmp число из целого числа или строки
проверяет содержит ли куча еще элементы
возвращает цвет фона изображения
проверяет считается ли переменная пустой
проверяет является ли соединение с серверами memcache устойчивым т.е
возвращает количество полей в результирующем наборе
функция возвращает массив ключами которого являются значения массива array а значениями - частота повторения значений array
создает копию обработчика
возвращает количество аргументов переданных функции
возвращает имя файла связанное с результирующим изображением
присоединяет итератор
обрезка вдоль ближайшего контура с профилем 8bim если он предоставлен
определяет возможна ли навигация по содержимому текущего элемента
декодирует строку данных из шестнадцатеричного представления
возвращает дополнительную информацию в случае ошибки последнего запроса к серверу
returns the image data of this surface or null if surface is not an image surface or if cairocontext::finish() procedural : cairo_surface_finish() has been called
создает новый объект norewinditerator
получение значения альфа-канала изображения
получает класс объявляющий отображенный метод
метод asxml задает формат данных родительских объектов в версии xml 1.0
создает новый объект класса recursivetreeiterator на основе рекурсивного объекта-итератора
функция возвращает массив имен интерфейсов реализованных в заданном классе class и его родительских классах
возвращает значение атрибута по имени и uri пространства имен или пустую строку если атрибут не существует или не расположен на узле элемента
эта функция вернет метку времени unix соответствующую номеру дня в юлианском летоисчислении заданному в jday либо false если jday лежит за пределами эпохи unix годы по григорианскому календарю между 1970 и 2037 или 2440588 < = jday < = 2465342 
возвращает количество элементов в коллекции
добавляет сервер заданий в обработчик
получает список всех заголовков http текущего запроса
возвращает имя элемента по его индексу
устанавливает максимальное время выполнения запроса
ассоциирует данные с объектом object в контейнере
этот метод копирует текущий узел и возвращает соответствующий объект dom
заменяет цвета в изображении используя таблицу соответствия
присваивает атрибут pdo объекту
перемещает файловый указатель на указанное в параметре offset количество байт
возвращает арксинус числа arg в радианах
вызывает пользовательскую функцию переданную в параметре callback
делает текущий процесс лидером сессии
уменьшает числовое значение записи на величину указанную в offset
возвращает последнее уведомление сгенерированное сервером postgresql на заданном соединении connection
этот метод вызывается при создании фильтра во время инстанцирования экземпляра класса
возвращает содержимое объекта lob
возвращает индекс текущего элемента массива
сортирует массив по ключам
возвращает ассоциативный массив с информацией о числовых и денежных форматах в текущей локали
получает текущее значение заданного параметра сервера
очищает все функции обратного вызова данной задачи которые были ранее установлены
возвращает массив содержащий аргументы функции
это низкоуровневая функция api которая позволяет сделать soap-вызов
регистрирует имя функции на сервере заданий и добавляет ссылку на эту функцию для обратного вызова
проверяет срок действия текущего элемента
возвращает массив с заголовками из ответа сервера на http-запрос
извлечение последней ошибки из libxml
извлекает информацию о текущем файле
устанавливает имя пользователя и пароль которые должны быть использованы для sasl аутентификации с серверами memcache
возвращает путь к поддиректории
отбрасывает все данные в файле после байта size
функция возвращает двухсимвольный код континента соответствующий имени хоста или ip-адресу
похожа на sqlite_open() в том что она открывает базу данных sqlite database или пытается создать ее если она не существует
получает поток отражающий переменную используемую при взаимодействии с libeio
устанавливает функцию обработчик элементов для xml анализатора parser
определяет зарегистрирована ли глобальная переменная в сессии
возвращает имя класса экземпляром которого является объект object
посылает запрос на создание параметризованного sql выражения и не ждет его завершения
добавляет в zip-архив файл по указанному пути
использует array как стек и добавляет переданные значения в конец массива array
умножает left_operand на right_operand
очищает все текущие настройки группировок и отключает группировку
возвращает подстроку строки haystack начиная с последнего вхождения needle до конца строки
возвращает противоположное относительно нуля число
возвращает ключ текущего элемента на который указывает внутренний объект-итератор iterator
возвращает текущий элемент array
закрывает частично или нет полнодуплексное соединение
этот метод перемещает simplexmliterator к следующему элементу
получает правильно сформированную xml-строку и возвращает ее как объект
производит попытку запуска обозначенной службы
похож на метод memcached::set() но операция завершится неудачей в случае если ключ key отсутствует на сервере
этот метод получает объект splfileinfo для указанного файла
задает стиль который будет использоваться функциями рисования линий такими как imageline() и imagepolygon() при задании специального цвета img_color_styled или img_color_styledbrushed
подготавливает sql запрос к базе данных к запуску посредством метода pdostatement::execute()
привязывает переменную к заданному столбцу в результирующем наборе запроса
получает определенные в расширении константы
функция возвращает имя провайдера isp указанного ip адреса
создает символическую ссылку new_path на путь path
удаляет объект object из контейнера
возвращает последнее сообщение с предупреждением
контролирует формат массивов с наборами результатов запроса должны ли результаты быть возвращены в виде обычного массива или же ассоциативного 
возвращает длину указанного поля
извлекает узел с заданным локальным именем localname и uri пространства имен namespaceuri
возвращает текущую позицию файлового указателя или другими словами текущее смещение в файловом потоке
возвращает индекс текущего узла
генерирует случайное число
возвращает информацию о средней загрузке системы число процессов в очереди системных процессов через 1 5 и 15 минут соответственно
возвращает строку содержащую json-представление value
форматирует строку переданную в виде массива fields в виде csv и записывает её заканчивая переводом строки в указанный файл handle
возвращает сжатый размер заданного дескриптора директории
создает директорию с заданным режимом доступа mode
получение имени расширения
возвращает массив соответствующий выбранной строке записи 
возвращает имя следующего по порядку элемента каталога
возвращает log 1 + number рассчитанное таким образом что результат точен даже когда значение number близко к нулю
разбивает строку string в массив с помощью регулярного выражения
возвращает название текущего модуля сессии
выполняет вход на ftp сервер
вызывается для каждого элемента чтобы проверить есть ли у него дочерние
вычисляет пересечение массивов с дополнительной проверкой индекса используя для сравнения индексов и значений callback-функцию
возвращает дробный остаток от деления делимого x и делителя y 
откладывает исполнение скрипта до заданной отметки времени указанной в параметре timestamp
задает значение настройки конфигурации include_path на время выполнения скрипта
проверяет существование и наличие значения указанной константы
определяет есть ли пробелы в содержимом текстового узла или там пусто
перемещается к заданной позиции в итераторе
функция вычисляет циклический избыточный код 32-битных полиномов crc32 для строки str
очищает конкретную часть объекта lob начиная с позиции определенной в параметре offset
закрывает изображение image полученное с помощью функции pdf_open_image()
перемещается вперед к следующей строке в файле
создает xml документ из dom представления
возвращает уникальный идентификатор этого задания
включает трассировку соединения с postgresql сервером во внешний файл
читает файл и записывает его в буфер вывода
выполняет soap-запрос поверх http
сканирует a начиная с бита start пока не найдет бит установленный в 1
подсчитывает количество элементов массива или что-то в объекте
возвращает данные приложения установленные ранее с помощью gearmanclient::setdata()
возвращает array с информацией о текущих мягких и жестких ограничениях системных ресурсов
вставляет value в начало двусвязного списка
читает данные сессии из хранилища сессий и возвращает результат
возвращает совпавшую с регулярным выражением часть строки
возвращает идентификатор сгенерированный колонкой с auto_increment последним запросом обычно insert 
возвращает версию api imagemagick как строку и число
возвращает объявленные интерфейсы
временно переопределяет значение атрибута в документах в пределах одного запроса
проверяет является ли данная переменная числом
проверяет соответствие документа переданной через строку схеме
устанавливает retval в значение указанной опции
исполняет строку переданную в параметре code как код php
подготавливает sql_text к выполнению используя соединение connection и возвращает идентификатор выражения который может быть далее использован функциями oci_bind_by_name() oci_execute() и другими
опрашивает набор дескрипторов о наличии сообщений или информации от индивидуальных передач
устанавливает буферизацию для большого объекта исходя из значения параметра on_off
извлекает текущую строку файла
возвращает внутреннюю информацию о том где было вызвано исключение
получает внутренний итератор который был передан в norewinditerator
проверяет является ли текущий элемент доступным для записи
эта функция создает экземпляр класса domprocessinginstruction
возвращает array с информацией о переданном пользователе
некоторые субд поддерживают хранимые процедуры которые возвращают более одного набора строк его еще называют результирующим набором 
возвращает текст ошибки выполнения последней функции mysql
возвращает битовое поле модификаторов доступа для метода
принимает файловый указатель handle и урезает соответствующий файл до размера size
возвращает тип php-переменной var
разбирает запросы get / post / cookie и устанавливает значения глобальных переменных
возвращает строку содержащую версию клиентской библиотеки
выполняет пользовательскую функцию определенную в параметре execute как любой другой вызов запросов eio_*
возвращает тип операционной системы ftp-сервера
возвращает последнее время изменения элемента
возвращает идентификатор изображения представляющего изображение полученное из потока image
преобразует исходный узел в domdocument применяя таблицу стилей заданную с помощью метода xsltprocessor::importstylesheet()
устанавливает значение переменной окружения apache определенной как variable
возвращает расширение файла
эта функция определяет могут ли использоваться обработчики ошибок soap в soap-сервере
создает объект gearmantask представляющий задание на обработку которое в дальнейшем будет отправлено на сервер
сбрасывает курсор освобождая все связанные ресурсы и отменяет возможность читать из него
ищет позицию первого вхождения одной строки string в другую строку string
возвращает количество памяти в байтах которое было выделено php скрипту на на данный момент
сбрасывает таймер сервера apache который по умолчанию установлен в 300 секунд
позволяет напрямую управлять размером используемого дискового пространства для файла
объектно-ориентированный стиль constructor :
перемещает итератор на начальную позицию заданную при создании объекта конструктором limititerator::__construct()
возвращает масштаб поля под номером field
используется после смены обработчика ошибок функцией set_error_handler() чтобы вернуть предыдущий обработчик который может быть как встроенной функцией так и определенной пользователем 
задает флаги настройки
функция устанавливает путь для домена
определяет загружено ли указанное расширение
эта функция удобна когда закодированная строка будет использоваться в запросе как часть url также это удобный способ для передачи переменных другим страницам
эта функция возвращает значение запрошенной опции option для указанного ftp соединения
функция добавляет дочерний узел к существующему списку потомков или создает новый список
возвращает путь к поддиректории и имя файла
получение числа обязательных аргументов в определении функции
закрепляет именованный ресурс указанный в аргументе filename за потоком
ищет в строке haystack символы из набора char_list
создает копию узла
данная функция похожа на функцию file() с той только разницей что file_get_contents() возвращает содержимое файла в строке начиная с указанного смещения offset и до maxlen байт
читает до length байт из файлового указателя handle
если ресурс сокета передан этой функции то возвращается последняя ошибка которая произошла на этом конкретном сокете
рисует эллипс с центром в заданных координатах
эта функция полезна для получения множества переменных без многократного вызова функции filter_input()
возвращает арктангенс числа arg в радианах
возвращает количество полей столбцов в результате запроса postgresql
возвращает массив с числовыми индексами содержащий данные обработанного ряда и сдвигает внутренний указатель результата вперед
сохраняет текущие настройки в указанный файл
получает размер массива
возвращает внутренние параметры конфигурации расширения iconv
удаляет директорию
извлекает последний код возврата gearman
возвращает array с информацией о пользователе используя идентификатор пользователя
возвращает эквивалент выражения exp arg - 1 рассчитанный таким образом что результат точен даже если значение arg близко к нулю тогда как exp arg - 1 будет неточно из-за вычитания двух почти равных чисел
внимание should be used instead of this function as it can cause crashes when used with mcrypt_module_close() due to multiple buffer frees
возвращает имена интерфейсов
получает значение переменной среды
разбивает строку по регулярному выражению
присваивает имя действию для трассировки oracle
возвращает квадратный корень из operand
передвигает текущую позицию к следующему элементу
изменяет отдельные пиксели в зависимости от их интенсивности по сравнению с пороговым значением
извлекает узел с заданным индексом index из объекта класса domnamednodemap
удаляет объект pdflib и освобождает все внутренние ресурсы
возвращает исключение в виде строки string 
подключается к серверу searchd выполняет указанный поисковый запрос с текущими настройками получает и возвращает набор результатов
проверяет является ли класс интерфейсом или нет
добавляет необработанные xml данные в объект класса domdocumentfragment
эта функция является антиподом htmlspecialchars()
выполняет sql запрос без подготовки и возвращает результирующий набор если есть в виде объекта pdostatement
создаёт новый экземпляр класса
этот метод проверяет имеет ли текущий элемент simplexmliterator вложенные элементы
удаляет значение по указанному индексу
возвращает индекс для заданного цвета и альфа компонента в палитре изображения
возвращает текущее значение
возвращает информацию о группе используя её id
работает аналогично методу memcached::get() но вместо одной записи получает несколько ключи которых были переданы в массиве keys
устанавливает фактический идентификатор пользователя текущего процесса
получает внутренний итератор
проверяет являются ли все символы в строке text цифровыми
устанавливает размер фрагмента обрабатываемых данных потока
удаляет параметр если он установлен
устанавливает указатель на позицию в файле на который ссылается zp
проверяет можно ли клонировать этот класс
возвращает флаги настройки
функция возвращает размер свободного пространства в байтах доступного для использования в указанном каталоге или файловой системе
освобождает память занятую результатом запроса postgresql resource
функция определит размер заданного изображения и вернет этот размер вместе с типом файла и текстовой строкой height / width которую можно будет использовать внутри тэга html img а также вернет соответствующий тип содержимого http
добавляет пустую директорию в архив
этот метод возвращает базовое имя файла каталога или ссылки без информации о пути
возвращает номер версии в виде строки клиентской c-библиотеки oracle с которой связан php
возвращает версию сервера mysql
возвращает сумму значений массива
создаёт временный файл с уникальным именем открывая его в режиме чтения и записи w+ и возвращает файловый указатель
функция возвращает интернет порт который соответствует параметру service для заданного в protocol протокола как в / etc / services
возвращает информацию о системе
добавляет низкоприоритетную задачу для параллельной работы с другими задачами
возвращает комментарий zip-архива
сбрасывает значение по смещению
возвращает короткое имя класса ту часть которая не относится к названию пространства имён
устанавливает символы разделителя и ограничителя для разбора данных csv
возвращает идентификатор сессии процесса pid
выполняет sql-запрос возвращает объект sqlite3result если запрос возвращает результат
читает атрибуты и значения из записи в результатах поиска
добавляет новый узел атрибута attr в элемент
открывает новое соединение с сервером mysql или использует уже существующее
возвращает массив ошибок последнего вызова функции mysqli которая может завершать работу успехом или неудачей
обновляет рабочую копию расположенную в path до ревизии revno
извлекает первое значение массива array и возвращает его сокращая размер array на один элемент
эта функция создает экземпляр класса domelement
регистрирует процесс apache обслуживающий текущий запрос php с тем чтобы завершить его по окончании выполнения php скрипта
выбирает записи из базы данных удовлетворяющие условиям field= > value заданным в массиве assoc_array
этот метод вызывается в результате вызова feof()
объектно-ориентированный стиль constructor :
возвращает массив псевдонимов для известного типа кодировки encoding
проверяет является ли свойство защищенным protected 
объектно-ориентированный стиль конструктор :
анализирует параметры переданные в скрипт
используется для завершения доступа к блоку разделяемой памяти
функция возвращает информацию о соответствующем имени хоста или ip адреса
ищет сообщение в текущем домене
создает новый курсор для указанного соединения и возвращает его идентификатор
возвращает soap-заголовки последнего ответа
декодирует закодированную строку string str в mime-заголовке
создает новый xml анализатор и возвращает ссылающийся на него ресурс который можно использовать в других xml функциях
возвращает индекс цвета пиксела на заданных координатах на изображении image
проверяет что функция возвращает ссылку
определяет владельца файла
установить uri содержащий xml-документ который будет разобран
сбрасывает устанавливает в 0 бит на позиции index аргумента a
получение индекса цвета имеющего значения тона белизны и затемнения наиболее близкие к заданному цвету
возвращает идентификатор группы текущего файла
возвращает все глобальные изменения сделанные в архиве
устанавливает флаги
возвращает doc-блоки комментариев класса
устанавливает одну или несколько настроек клиента
эта функция идентична оператору обратный апостроф
декодирует любые % ## кодированные последовательности в данной строке
этот метод вызывается при задании настроек потока
заменяет один или более атрибутов из указанного dn
возвращает строку отформатированную в соответствии с указанным шаблоном format
возвращает гамму изображения
возвращает строку содержащую шестнадцатеричное представление указанного безнакового аргумента number
если указаны три аргумента эта функция возвращает копию str в которой все вхождения каждого символа однобайтного из from были заменены на соответствующий символ в параметре to т.е
получает текущий номер столбца заданного xml парсера
возвращает путь к файлу исключая само имя файла и замыкающий слеш
делит a на b и возвращает целочисленный результат
читает строку из файлового указателя
установить соединение с сервером ldap определённым параметрами hostname и port
если при последнем json кодировании / декодировании возникла ошибка то возвращает её код
удаляет файл filename
вычисляет квадратный корень числа с остатком
функция возвращает массив содержащий все значения массива array1 которые содержатся во всех аргументах
удаляет директорию directory
возвращает код исключения
устанавливает указатель на позицию файла на начало потока этого файла
создает директорию directory на ftp сервере
эта функция создает новый экземпляр класса domdocumentfragment
выбор индивидуального ограничения для каждого пикселя в зависимости от диапазона значений интенсивности вокруг этого пикселя
возвращает строку с описанием последней ошибки подключения
получение номера строки начала описания функции
возвращает число ошибок в конфигурации заданного объекта tidy
устанавливает часть префикса которая используется для построения графа
используется для удаления блока разделяемой памяти
разрывает привязку к ldap-директории
этот метод вызывается в результате вызова opendir()
читает файл распаковывает его и записывает в стандартный вывод
возвращает значение указанного цвета канала как дробное число между 0 и 1
извлекает содержимое элемента
возвращает число вхождений подстроки needle в строку haystack
получает список имен классов как они определены в расширении
сравнивает ключи array1 с ключами array2 и возвращает разницу
это может использоваться для остановки ранее запущенного вами скрипта и ожидать ответ с сокета
рисует текст string вертикально на заданных координатах
перемещает итератор на следующий объект object в контейнере
удаляет указанный дескриптор ch из указанного набора дескрипторов mh
добавляет строку message в указанный mailbox
добавляет адаптивный фильтр размытия к изображению
возвращает код оригинальной операционной системы в которой был создан элемент архива
возвращает количество элементов в массиве array или количество публичных свойств объекта object 
создает новый объект класса recursivedirectoryiterator() используя заданный путь path
определяет поддерживает ли поток блокировку с использованием flock()
переходит в родительскую директорию
задает время в секундах в течение которого скрипт должен завершить работу
возвращает строку с номером версии работающего в данный момент ядра zend engine
читает exif -заголовки jpeg и tiff файлов
данный метод похож на datetime::setdate() но работает с datetimeimmutable
возвращает абсолютный путь рабочей директории выполняемого скрипта
собирает статистическую информацию об открытом файле по файловому указателю handle
возвращает имя файла без расширения текущего элемента directoryiterator
посылает один запрос посылка нескольких запросов не поддерживается активной базе данных сервера на который ссылается переданный дескриптор link_identifier
возвращает гиперболический арккосинус arg т.е
эта функция является псевдонимом: soapfault::soapfault()
задает возвращаемое значение для текущей работы
работает аналогично методу memcached::cas() за исключением того что произвольный server_key может быть использован для определения сервера и установки key на конкретный сервер
загружает удалённый файл с ftp-сервера и сохраняет его локально
эта функция идентична функции strftime() за исключением того что возвращает время по гринвичу gmt 
данный метод похож на datetime::add() но работает с datetimeimmutable
задает обработчик который вызывается при выходе за пределы объявления пространства имен
