возвращает ascii-строку содержащую шестнадцатеричное представление аргумента str
преобразует gmp число в строку в системе счисления base
возвращает число соответствующее методу компрессии использовавшемуся при создании текущего элемента архива
проверяет все ли символы в переданной строке text являются знаками пунктуации
эта функция подобна sprintf() но она принимает не переменное число аргументов а массив
добавяет файл в zip-архив используя его содержимое
возвращает индекс текущего элемента массива
возвращает список всех серверов которые находятся в пуле
перемещает курсор на родительский элемент текущего атрибута
создает многоугольник в изображении image
эта функция похожа на hebrev() с тем отличием что что она преобразует символы перевода строки \n в < br > \n
вычисляет квадратный корень числа a
возвращает идентификатор группы файла в виде числа
делит left_operand на right_operand
читает содержимое текущего узла включая сам узел
выводит стек вызовов функций php в массив
позволяет отключить стандартные ошибки libxml и включить пользовательскую обработку ошибок
возвращает индекс текущего положения итератора
возвращает десятичный логарифм arg
возвращает статистику файловой системы в result аргумент callback
устанавливает файл содержащий персональный список слов
возвращает код ошибки последней функции работы с mysql
возвращает идентификатор изображения представляющего изображение полученное из файла с заданным именем
возвращает хэшированную строку полученную с помощью стандартного алгоритма unix основанного на des или другого алгоритма имеющегося в системе
ищет в haystack значение needle
возвращает текущую позицию начиная с 0 внутреннего объекта-итератора iterator
устанавливает название атрибута используемого для расчета количества уникальных значений при группировке
получает имя файла из определенной пользователем функции
возвращает значение шрифта объекта
возвращает строковое представление объекта
преобразует строку из одной кириллической кодировки в другую
очищает все ресурсы связанные с объектом imagick
получение информации о расширении в состав которого входит функция
получает версию mnogosearch api
вызывается когда обход дерева спускается на один уровень вниз
устанавливает ssl соединение с ftp-сервером заданным аргументом host
добавляет в конец объекта lob данные из другого объекта lob
создает объект класса gearmanjob представляющий работу для обработчика
возвращает текущий тип компрессии изображения
создает временный большой объект и записывает в него данные data
переименовывает элемент заданный по имени
возвращает требуемую подстроку
закачивает данные из дескриптора файла в удалённый файл на ftp-сервере
возвращает параметр если он раньше установлен с помощью xsltprocessor::setparameter()
данная функция сжимает строку используя формат данных deflate
функция аналогична функции mysql_field_name()
проверяет является ли итератор допустимым
эта функция возвращает строку str с удаленными из начала и конца строки пробелами
отключает сборщик циклических ссылок путем установки значения zend.enable_gc в 0
возвращает целое число представляющее собой версию протокола mysql используемого для соединения переданного в link
получает значение атрибута в пространстве имен namespaceuri с локальным именем localname текущего элемента
по индексу index устанавливает значение newval
этот метод вызывается в процессе выполнения rewinddir()
создает объект класса filteriterator который состоит из итератора переданного в параметре iterator и фильтров применяемых к нему
создает итератор из чего-либо что является обходимым traversable 
вычисляет побитовое исключающее или xor двух gmp чисел
функция похожа на sscanf() но берёт данные для обработки из файла ассоциируемого с handle и интерпретирует их согласно формату format который описан в документации функции sprintf()
вернет уровень вложенности механизма буферизации вывода
создание нового изображения на основе gd2 или url
задает функцию обработчик внешних сущностей для xml анализатора parser
очищает буфер ошибок libxml
устанавливает новый срок хранения для записи с указанным ключом
возвращает имя файла конкретного изображения в последовательности
возвращает объявленные по умолчанию свойства указанного класса
функция возвращает название организации которая владеет указанным ip адресом
функция проверяет существует ли атрибут property в указанном классе
функция возвращает версию сервера к которому создано соединение переданое в параметре link как integer
выполняет проверку синтаксиса производит верификацию файла указанного в filename проверяя ошибки в коде
устанавливает соединение с сервером cyrus imap
перемещает указатель на следующую запись в массиве
заменяет часть строки string начинающуюся с символа с порядковым номером start и необязательной длиной length строкой replacement и возвращает результат
сортирует массив по значениям
создает большой объект и возвращает его oid
экспортирует отображение
принудительная запись всех буферизованных данных в файл
возвращает значение именованного атрибута или null если атрибут не существует или не находится в узле элемента
задает серию объектов для использования на нижестоящих соединениях
устанавливает режим error_reporting
метод xpath ищет узлы simplexml с дочерними элементами совпадающими с xpath path
возвращает ключ metaphone для строки str
возвращает гиперболический косинус arg определяемый как exp arg + exp -arg / 2
возвращает уникальный идентификатор этого задания
перемещает внутренний указатель array к его первому элементу и возвращает значение первого элемента массива
возвращает идентификатор изображения представляющего изображение полученное из файла с заданным именем
адаптивное изменение размера изображения с данными триангуляции
создает новый объект класса domcomment
используется для изменения информации сохранённой в id3 теге
проверяет имеет ли текущий элемент допустимое значение
устанавливает имя файла или uri для схемы relaxng которые используются при проверке
проверяет знак числа
назначает обработчику идентификатор
получает объект класса splfileinfo для пути текущего файла
получает имя файла без информации о пути к нему
находит элемент по его имени
удаляет значение по заданному индексу
эта функция создает новый объект класса domattr
устанавливает необходимо ли прерывать работу скрипта при отключении клиента
преобразует дату юлианского календаря заданную в jd в дату указанного календаря calendar
генерирует yaml-представление из данных data и отправляет в filename
функция используется для разбиения строки на фрагменты например для приведения результата функции base64_encode() в соответствие с требованиями rfc 2045
определяет является ли изображение image полноцветным
проверяет можно ли создать экземпляр класса
возвращает комментарий элемента используя его индекс
этот метод возвращает simplexmliterator к первому элементу
аналогично только gzgetss() также удаляет все теги html и php из возвращаемой строки
проверяет был ли достигнут конец файла eof 
устанавливает значение указанного канала текущего объекта при условии того что новое значение находится между 0 и 1
функция возвращает состояние текущей сессии
возвращает код ошибки для последнего вызова функции которая могла завершиться удачно или неудачно
возвращает позицию первого вхождения строки needle в строке haystack
возвращает гиперболический тангенс arg определяемый как sinh arg / cosh arg 
получает первый атрибут в данной записи
определяет существует или нет данное смещение ключ 
проверяет создан ли экземпляр класса memcache
возвращает имя функции обрабатывающей данные то есть функции которая будет вызвана для выполнения работы
функция предназначена для использования в качестве callback-функции для ob_start() чтобы облегчить отправку gz-кодированных данных web-браузерам поддерживающим сжатие web-страниц
эта функция осуществляет частичный запрос на указанный uri
эта функция идентична функции ereg() за исключением того что игнорирует регистр при сравнении алфавитных символов
этот метод вызывается в результате вызова closedir()
возвращает массив всех определённых функций
функция производит проверку синтаксиса выбранного файла
возвращает число ошибок tidy встретившихся при рассмотрении документа
устанавливает на searchd количество повторных попыток и задержку между ними
возвращает информацию о состоянии файла в result аргументе callback
создает новый объект класса infiniteiterator на основе объекта-итератора iterator
эта функция возвращает значение расширенного атрибута файла
возвращает конструктор отраженного класса
загружает локальный файл на ftp-сервер
переносит строку по указанному количеству символов
извлекает и возвращает последнее значение параметра array уменьшая размер array на один элемент
подключает другой парсер для bbcode_container
преобразует правильно сформированный xml-документ в указанном файле в объект
возвращает ассоциативный массив соответствующий полученному ряду и сдвигает вперед внутренний указатель результата
перемещает итератор к следующему элементу
возвращает строку input повторенную multiplier раз
данная функция строит запрос по url адресу репозитория и получает список файлов и директорий опционально для конкретной ревизии
читает и возвращает length байт данных с текущей позиции объекта lob
освобождает память выделенную для ispell-данных
устанавливает опции для парсера
вычисляет символ лежандра чисел a и p
создает прямоугольник закрашенный цветом color в заданном изображении image
открывает поток к процессу выполняемую при помощи форка команды заданной в параметре command
форматирует число number как денежную величину
рисует прямоугольник с заданными координатами углов
функция искусственно увеличивает нагрузку добавляя delay секунд к времени исполнения
закрывает базу данных согласно полученному идентификатору
откатывает изменения в базе данных сделанные в рамках текущей транзакции которая была создана методом pdo::begintransaction()
возвращает исходный код php в файл filename исключая комментарии и пробелы
проверяет соединение с базой данных и переподключается если оно нарушено
подписывает переданный в параметре plaintext текст ключом который был прежде установлен с помощью gnupg_addsignkey и возвращает подписанный текст или подпись в зависимости от того что было установлено в gnupg_setsignmode
сравнивает value1 с value2
возвращает список разделенных запятыми конфигурационных файлов проанализированных после php.ini
открывает соединение с базой данных postgresql определенное строкой connection_string
пытается установить время доступа и модификации файла с именем filename в значение time
определяет является ли текущий элемент directoryiterator символической ссылкой
создает специальный fifo файл который существует в файловой системе и выступает в качестве двунаправленной связи для процессов
позволяет использовать режим сопряжения цветов для truecolor-изображений при рисовании
проверяет документ на действительность основываясь на заданной схеме
получает имя расширения
функция открывает для программы соединение к системному журналу
сохраняет значение value на memcache сервере под указанным ключом key
получить дескриптор файла определенный по имени элемента
получает значение по умолчанию аргумента определенной пользователем функции или метода
создает новый объект коллекции
возвращает строку с sqlstate кодом последней ошибки
создает html документ из dom представления
возвращает день недели
проверяет содержит ли массив array еще записи
сливает элементы одного или большего количества массивов таким образом что значения одного массива присоединяются к концу предыдущего
данный метод похож на datetime::__set_state() но работает с datetimeimmutable
возвращает строку содержащую код sqlstate ошибки вызванной в результате выполнения последней операции над запросом которая может завершаться успешно или неуспешно
отправляет данные серверу заданий и всем слушающим клиентам 
проверяет задан ли в классе указанный метод или нет
получает значение атрибута запроса
возвращает цвет объекта imagickpixel в виде строки
эта функция является псевдонимом: finfo_buffer()
закрывает сгенерированный pdf-файл и освобождает все относящиеся к документу ресурсы
этот метод вызывается в результате вызова mkdir()
проверяет соответствует ли позиция указателя в gz-файле позиции eof end-of-file конец файла 
этот метод проверяет содержит ли данный узел атрибуты
функция вернет временную зону и код региона соответствующей страны
позволяет вам реализовать ваш собственный фильтр на любом зарегистрированном потоке используемом со всеми другими функциями файловой системы такими как fopen() fread() и т
возвращает описание операционной системы на которой запущен php
удаляет файл заданный аргументом path с ftp-сервера
пытается создать директорию заданную в pathname
возвращает информацию о состоянии файла в result аргументе callback
получает знаменатель дроби который используется для определения процента выполненной работы
делает скриншот
этот метод вызывается в результате вызова unlink()
проверяет является ли данная переменная булевой
возвращает информацию о сервере который может быть выбран с помощью специального параметра server_key который используется в memcached::*bykey() функциях
проверяет является ли данная переменная объектом
посылает запрос mysql query без автоматической обработки и буферизации её результата в отличие от функции mysql_query()
проверяет является ли метод абстрактным
возвращает сообщение о любой ошибке связанной с ресурсом result
получает имена всех файлов которые были включены в скрипт функциями include include_once require или require_once
ищет в строке subject все совпадения с шаблоном pattern и помещает результат в массив matches в порядке определяемом комбинацией флагов flags
получает количество записей строк в указанной базе данных
позволяет вам реализовать ваши собственные обработчики протоколов и потоков для использования со всеми другими функциями файловой системы такими как fopen() fread() и т
пытается удалить директорию с именем dirname
получение имени пространства имен в котором определен класс
ассоциирует uri пространства имен namespaceuri и префикс prefix с объектом domxpath
сортирует записи в массиве по значениям используя алгоритм натуральной сортировки
возвращает строковое сообщение об ошибке объясняя ошибку сгенерированную последней командой ldap для данного идентификатора соединения link_identifier
возвращает строку содержащую имя базового типа значений колонки результата запроса result с номером field_number
этот метод получает имя xml-тега текущего элемента
копирующий конструктор
разбирает iptc данные на отдельные тэги
возвращает числитель дроби которая используется для вычисления процента выполненной работы
проверяет что для потока данных подходит выбранная кодировка
функция может быть использована для сортировки сразу нескольких массивов или одного многомерного массива в соответствии с одной или несколькими размерностями
возвращает идентификатор владельца текущего элемента directoryiterator в числовом формате
создает array используя значения массива keys в качестве ключей и значения массива values в качестве соответствующих значений
эта функция возвращает копию импортируемого узла и присоединяет ее к текущему документу
экранирует спецсимволы в строке item для использования в запросе sqlite
функция возвращает массив содержащий элементы array1 после их обработки callback -функцией
создает новый объект pdflib с настройками по умолчанию
проверяет существует ли файл на который ссылается объект splfileinfo и является ли он обычным файлом
инициализирует все переменные используемые в syslog функциях
задает имя модуля для трассировки oracle
функция закрывает ресурс сокета указанный параметром socket
возвращает размер используемой памяти указанного ресурса в мегабайтах
вычисляет пересечение массивов используя для сравнения значений callback-функцию
возвращает массив содержащий все записи из результата запроса
возвращает позицию и длину совпавшего с регулярным выражением участка заранее определенной многобайтной строки
отсоединяет итератор
сериализует хранилище
сообщает о достижении внутренним указателем конца объекта lob
удаляет атрибут с именем name из элемента
возвращает идентификатор соединения который используется большинством функций данного модуля
переводит итератор на начало очереди
закрывает открытый gz-файл по его указателю
определяет занято соединение в данный момент или нет
сжимает поле mime -заголовка и представляет его строкой вида: subject: =?iso-8859-1?q?pr=fcfung_f=fcr?= entwerfen von einer mime kopfzeile в примере выше subject является именем поля а часть строки начиная с =?iso-8859-1?... - его значение
устанавливает функцию обратного вызова для принятия пакетов данных для задачи
разделяет узел на два вторая часть начинается с позиции offset полученные узлы становятся братьями
этот метод выполняет те же действия как если бы вы сохранили и затем загрузили документ приводит документ к нормальной форме
возвращает время когда содержимое файла было изменено
функция является интерфейсом к системному вызову gettimeofday 2 
функция проверяет права пользователя на доступ к файлу
вычисляет побитовое или двух gmp чисел
этот метод вызывается для задания метаданных потока
добавляет строку переданную в параметре value в начало существующей записи
ищет позицию первого вхождения подстроки needle в строку haystack
откладывает исполнение программы на заданные в параметрах seconds и nanoseconds число секунд и наносекунд соответственно
возвращает число уникальных цветов в изображении
получив строку содержащую путь к файлу или каталогу данная функция возвратит родительский каталог данного пути
получение абсолютной величины числа
объявляет атрибут name ключевым
получает значение текущего элемента
отправляет процессу process созданному при помощи функции proc_open() сигнал говорящий о том что он должен завершиться
отправляет произвольную команду command ftp-серверу
накладывает случайный шум на изображение
преобразует текущую дату и время в целое число в соответствии со строкой форматирования format
эта функция добавляет пару имя / значение к механизму перезаписи url
возвращает юлианский день для заданной метки времени unix timestamp количество секунд с 1.1.1970 либо для текущего времени если аргумент timestamp не задан
возвращает понятное сообщение об ошибке для последней операции curl
проверяет является ли значение свойством по умолчанию
рисует символ c вертикально на заданных координатах изображения image
возвращает информацию об уровне загрузки cpu
возвращает гиперболический арксинус arg т.е
открывает словарь cracklib указанный в параметре dictionary для использования в функции crack_check()
задает список кодировок encoding_list для механизмов автоматического определения кодировок в строках
возвращает метод сжатия дескриптора директории заданного в zip_entry
сериализует массив
возвращает дескриптор работы присвоенный сервером
возвращает тип сжатия объекта
за исключением направления рисования эта функция ведет себя так же как pdf_arc()
записывает содержимое string в данный gz-файл
возвращает десятичный эквивалент шестнадцатеричного числа содержащегося в аргументе hex_string
yaf_dispatcher will render automatically after dispatches a incoming request you can prevent the rendering by calling this method with flag true замечание : you can simply return false in a action to prevent the auto-rendering of that action
задает обработчик по умолчанию для случаев когда исключение выброшено вне блока try / catch
устанавливает в 1 бит с индексом index в числе a
функция возвращает имя протокола по номеру указанному в параметре number как в / etc / protocols
удаляет большой объект с идентификатором oid
возвращает объем занимаемого дискового пространства для текущего элемента directoryiterator
присваивает переменной var тип type
создаёт копию объекта gearmanclient
данный метод возвращает значение memcached параметра указанного в option
разбивает строку str на подстроки токены используя в качестве разделителей символы из token
читает указанный файловый указатель с текущей позиции до eof конца файла и записывает результат в буфер вывода
восстанавливает исходное значение настройки конфигурации
возвращает значение static статического свойства класса
изменяет права доступа к файлу / директории
определяет доступен ли текущий элемент directoryiterator для чтения
получает целевой путь по ссылке файловой системы
использует схему w3c xsd для проверки документов в процессе работы
возвращает объявленные классы
вычисляет расхождение в массивах с дополнительной проверкой индексов используя для сравнения значений и индексов callback-функцию
создаёт анонимную функцию из переданных параметров и возвращает её уникальное имя
пытается изменить группу которой принадлежит символическая ссылка filename на указанную в group
закрывает ввод который в настоящий момент анализирует объект xmlreader
эта функция проверяет содержит ли данный узел потомков
извлекает узел с заданным индексом index из объекта класса domnodelist
преобразует строку чисел string str в заданном блоке в символ
показывает клиентская библиотека скомпилирована как потокобезопасная или нет
передвигает внутренний указатель массива на одну позицию назад
получает значение свойства
функция разбирает html содержащийся в строке source
распаковывает переданную строку содержащую сжатые bzip2 данные
высвободит всю память занимаемую результатом на который ссылается переданный дескриптор result
проверяет наличие атрибута с именем указанным в параметре name текущего элемента
читает данные из файла с текущей позиции до конца файла и помещает их в буфер выходного потока
проверяет может ли значение переменной быть вызвано в качестве функции
устанавливает идентификатор клиента используемый различными компонентами базы данных для идентификации различных пользователей тонких клиентов которые авторизуются в базе данных как один пользователь
возвращает информацию о path в виде ассоциативного массива или строки в зависимости от options
сообщает является ли namespaceuri пространством имен по умолчанию
складывает left_operand с right_operand
сбрасывает поток каталога переданный в параметре dir_handle таким образом чтобы тот указывал на начало каталога
перемещает итератор к следующей позиции
открывает дескриптор каталога для последующего использования с функциями closedir() readdir() и rewinddir()
проверяет является ли значение данной переменной равным null
этот метод импортирует таблицу стилей в xsltprocessor для трансформации
получает статус соединения в битах
посылает уведомление всем присоединенным наблюдателям
записывает данные из параметра data в текущую позицию внутреннего указателя объекта
disable view engine used in some app that user will output by theirself замечание : you can simply return false in a action to prevent the auto-rendering of that action
эта функция создает новый объект класса domcdatasection
возвращает размер данных которые выдал обработчик
возвращает имя родительского класса для объекта или класса
отправляет на выполнение асинхронный запрос
возвращает эффективной идентификатор группы текущего процесса
устанавливает некоторые произвольные данные приложения которые впоследствии могут быть извлечены gearmanclient::data()
функция возвращает название региона соответствующей страны и кода региона
возвращает значение размера точки объекта
проверяет все ли символы в переданной строке text являются печатными
удаляет имя из файловой системы
возвращает строковое представление контейнера
добавляет новое значение в конец массива
устанавливает функцию которая будет вызвана при php выводе
получает дескриптор задания для выполняющейся задачи
переход к следующему файлу
удаляет перечисленные переменные
фиксирует транзакцию возвращая соединение с базой данных в режим автоматической фиксации до тех пор пока следующий вызов pdo::begintransaction() не начнет новую транзакцию
вычисляет степень похожести двух строк по алгоритму описанному в programming classics: implementing the worlds best algorithms by oliver isbn 0-131-00413-1 
функция преобразует ipv4 адрес интернет сети из стандартного формата строка с точками
псевдо-объектно-ориентированный механизм для чтения каталога
перемещает внутренний указатель результата запроса с которым связан переданный дескриптор к ряду с указанным номером
перемещает указатель на первый элемент в массиве
получает информацию о последней произошедшей ошибке
возвращает последнюю ошибку связанную с указателем на ресурс req
проверяет все ли символы в переданной строке text являются буквенными
возвращает внешний итератор
добавляет атрибут к simplexml-элементу
загружает вектор кодировки из файла и подменяет им текущий вектор шрифта
данная функция позволяет переопределить одно сообщение с использованием множественного числа в текущем домене
эта функция реализует алгоритм сравнения упорядочивающий алфавитно-цифровые строки подобно тому как это сделал бы человек
регистрирует функцию session_write_close() в качестве функции завершения сессии
добавляет текстовый комментарий на изображение
выбирает для работы указанную базу данных на сервере на который ссылается переданный дескриптор соединения
устанавливает опорной точку для рассчета географической удаленности geodistance и включает эту возможность
рисует первый символ аргумента c на изображении с идентификатором image на координатах x y координаты отсчитываются с левого верхнего угла цветом color
работает аналогично memcached::getdelayed() за исключением того что произвольный server_key может быть использован для определения сервера и установки значения с ключом key на конкретный сервер
возвращает внутреннюю информацию о том где было вызвано исключение
выбирает значение столбца с именем index_or_name если это строка или его порядковый номер index_or_name если это целое число из текущей записи результата запроса result
возвращает позицию указателя поля используемую при последнем вызове mysqli_fetch_field()
возвращает ширину и высоту в виде ассоциативного массива
проверяет реализует ли класс указанный интерфейс или нет
определяет есть ли еще записи в результате запроса
возвращает строку после распаковки из gz-файла её длина ограничивается length - 1 байтами
возвращает строку str в которой первый символ переведен в верхний регистр если этот символ является буквой
создает новый tidy -объект
проверяет соответствие строки string которую вернул метод regexiterator::current() или regexiterator::key() если установлен флаг regexiterator::use_key регулярному выражению
возвращает указатель на результат содержащий список баз данных доступных на указанном сервере
возвращает значение атрибута с именем name для текущего узла
присоединяет splobserver чтобы он мог получать уведомления об обновлениях
эта функция пытается возвратить строку str из которой удалены все null-байты html и php теги
делает метод доступным
эта функция возвращает массив c доступными в настоящее время классами spl
разбивает строку string на массив по регулярному выражению
устанавливает значения одной или нескольких настроек
работает аналогично memcached::add() за исключением того что произвольный server_key может быть использован для определения сервера и установки значения с ключом key на конкретный сервер
возвращает абсолютное значение number
устанавливает кодировку по умолчанию для текущего соединения
возвращает содержимое элемента по его имени
возвращает массив содержащий все записи одной колонки результата запроса
возвращает итератор для текущего элемента
удаляет запись с ключом key с сервера
выполняет запрос curl
проверяет были ли и куда отправлены заголовки
получает ini-настройки расширения
подключается к searchd и отправляет запрос на генерацию фрагментов указанных документов и возвращает результаты
декодирует поле mime -заголовка
изменяет корневой каталог текущего процесса на переданный в качестве параметра directory и меняет текущий каталог на / 
удаляет одну или несколько настроек обработчика
возвращает время последнего изменения текущего элемента directoryiterator в формате отметки времени unix
возвращает комментарий элемента используя его имя
вычисляет инверсию остатка от деления числа b на число a
возвращает время изменения индексного дескриптора inode файла
возвращает цвет рамки изображения
эта функция является псевдонимом: soapserver::soapserver()
получает сведения об исключении
возвращает максимальное количество элементов в коллекции
может быть выполнена в произвольном цикле вызванном eio_poll()
возвращает значение глобальной цветовой палитры
может быть использована для реализации особых циклов обработки запросов
функция создаёт файл jpeg из изображения image
используется для получения всей информации хранящейся в id3-теге данного файла
возвращает массив содержащий все поддерживаемые кодировки
получает список всех зарегистрированных функций __autoload()
совпадение с регулярным выражением для многобайтовой строки
эта функция определяет будут ли объединённые слова рассматриваться как правильные сложные слова
вызывается когда следующий элемент становится доступен
создает псевдоним alias для пользовательского класса original
удаляет записи переданные в массиве keys с сервера
ищет позицию последнего вхождения подстроки needle в строку haystack
отсекает num элементов с конца коллекции
возвращает строку описывающую соединение которое обозначено в параметре link включая имя хоста сервера 
команда экранирует любые символы в строке которые могут быть использованы для обмана шелл-команд при выполнении произвольных команд
открывает новый словарь и возвращает ссылку на словарь для использования в других функциях pspell
функция идентична функции preg_replace() за исключением того что возвращает только те значения возможно преобразованные в которых найдено совпадение
этот метод проверяет является ли текущий элемент допустимым после вызова simplexmliterator::rewind() или simplexmliterator::next()
отсекает изображение вдоль обозначенного контура с профилем 8bim если он предоставлен
эта функция является псевдонимом: finfo_set_flags()
возвращает размер элемента архива в распакованном состоянии
разбирает строку содержащую временной интервал в обычном удобочитаемом виде и создает на его основе объект класса dateinterval
получает флаги поведения arrayobject
проверяет является ли val не числом nan например как результат выполнения функции acos 1.01 
создает большой объект в базе данных используя локальный файл в качестве источника данных
этот метод вызывается в результате вызова функции fstat()
возвращает высоту заданного изображения image
метод переводит итератор на начало кучи
функция задает значение директивы error_reporting во время выполнения
открывает zip-архив для чтения
устанавливает внутренний указатель в начало объекта lob
возвращает имя терминала связанного с подключением postgresql connection на который выводится отладочная информация
возвращает текущий ключ
запускает на выполнение с низким приоритетом задачу в фоновом режиме возвращая дескриптор задания который может быть использован для запроса состояния выполняющейся задачи
функция экранирует спецсимволы в строке запроса для базы данных
непосредственно записывает данные на сервер
возвращает массив соответствующий обработанному ряду результата запроса и сдвигает внутренний указатель данных вперед
возвращает число завершенных но необработанных процессов
проверяет является ли данная переменная ресурсом
ищет в haystack значение needle
создает объект класса domdocument заданного типа с элементом document
возвращает строку str буквенные символы в которой приведены к верхнему регистру
- это регистронезависимый аналог natsort()
проверяет содержит ли контейнер заданный объект object
работает аналогично memcached::getmulti() за исключением того что произвольный server_key может быть использован для определения сервера и установки значения с ключом key на конкретный сервер
определяет является ли файловый дескриптор fd ссылкой на валидный терминал
получает версию расширения
добавляет дочерний элемент к узлу и возвращает потомка simplexmlelement
добавляет смайлы для разбора парсером
функция преобразует заданный интернет адрес в формат с точками н-р.: aaa.bbb.ccc.ddd
проверяет все ли символы в переданной строке text являются пробельными
возвращает состояние переданного в качестве аргумента соединения connection
возвращает данные одного столбца следующей строки результирующей таблицы
возвращает цвет в виде массива описанный в объекте imagickpixel
несмотря на то что функция может обрабатывать даты вплоть до 1-го года 3761 до н.э.) практически преобразование для таких ранних дат не имеет смысла
возвращает ширину изображения
освобождает память выделенную для результатов
читает из переданного bzip2 файлового указателя
получает дочерние элементы текущего элемента итератора
используется для определения oid соответствующего вставленной в таблицу строке
эта функция декодирует data предположительно закодированные в utf-8 в iso-8859-1
возвращает итератор к первому элементу
метод похож на memcached::set() но операция добавления завершится неудачей если ключ key уже существует на сервере
запускает выполнение ранее подготовленного параметризованного запроса и ждет результат
проверяет все ли символы в переданной строке text являются буквами в верхнем регистре
преобразует исходный узел в строку применяя таблицы стилей которые установлены с помощью метода xsltprocessor::importstylesheet()
функция нестабильная и совершенно бесполезна для 99% пользователей
этот метод вызывается в результате вызова readdir()
возвращает список всех http заголовков ответа apache
добавляет дескриптор ch к набору дескрипторов mh
этот метод производит анимацию изображения на локальном или удалённом x сервере
преобразует набор символов строки str из кодировки in_charset в out_charset
данный метод похож на datetime::settimezone() но работает с datetimeimmutable
этот метод вызывается в результате вызова fclose()
преобразует png файл в wbmp
устанавливает режим ранжирования
эта функция разбирает url и возвращает ассоциативный массив содержащий все компоненты url которые в нём присутствуют
данный метод похож на datetime::setisodate() но работает с datetimeimmutable
удаляет count символов начиная с позиции offset
возвращает максимальный объем памяти в байтах который был выделен php скрипту
метод класса emptyiterator
проверяет существование индекса index в массиве
возвращает параметр аутентификации по ключу key
посылает запрос cyrus imap серверу
возвращает таймаут операций ввода / вывода в миллисекундах
возвращает одно из полей отчета об ошибках связанного с ресурсом result
возвращает число затронутых строк в последнем insert update или delete запросе связанным с link_identifier
получение массива произошедших ошибок
обходит каждое значение массива array передавая его в callback -функцию
создает постоянное подключение к серверу
возвращает размер заданного файла в байтах
переключает состояние бита интерлейсинга
перемещает итератор к предыдущему узлу
определяет является ли файл исполняемым
задает предпочитаемый синтаксис для извлекаемой записи
функция идентична последовательным успешным вызовам функций fopen() fwrite() и fclose()
функция ищет все пути совпадающие с шаблоном pattern согласно правилам используемым в функции glob() библиотеки libc которые похожи на правила используемые большинством распространённых оболочек
эта функция закрывает resource возвращаемый функцией bbcode_create()
диапазон возможных дат для юлианского календаря: с 4713 года до н.э
возвращает массив array все ключи которого преобразованы в нижний или верхний регистр
извлекает область изображения
создает и возвращает новую анонимную функцию с тем же телом функции и связанными переменными но с другим связанным объектом или новой областью видимости класса
вычисляет md5-хэш строки str используя алгоритм md5 rsa data security inc
вычисляет величины g s и t в выражении a*s + b*t = g = gcd( a b где gcd - наибольший общий делитель
возвращает индекс текущего узла
используется для вызова пользовательских ошибок можно использовать в связке с встроенным обработчиком ошибок а также с пользовательским обработчиком заданным функцией set_error_handler()
возвращает номер начальной строки
рисует текст string на заданных координатах
метод устарел начиная с pecl / gearman 1.0.0
эта функция представляет из себя базовую реализацию метода __autoload()
открывает файл gzip .gz для чтения или записи
осуществляет проверку и установку значения записи новое значение будет сохранено только если другие клиенты не обновили его со времени последнего обращения этим клиентом
возвращает имя заданного дескриптора директории
возвращает количество дней между 21 марта и пасхой в заданном году
возвращает текущий элемент
возвращает список имен таблиц базы данных mysql
проверяет имеет ли внутренний объект-итератор дочерние объекты
преобразует строку в массив
преобразует дату французского республиканского календаря в количество дней в юлианском летоисчислении
удаляет из текущего контейнера все объекты которых нет в другом контейнере
функция возвращает общий размер в байтах указанного раздела диска или каталога
проверяет загружен ли файл php.ini и возвращает его адрес
проверяет корректность даты по переданным аргументам
функция возвращает подробную информацию обо всех типах базы geoip в виде многомерного массива
получение детальной информации о элементе по его индексу
копирует содержание или часть содержания объекта lob в другой объект lob
возвращает строковое представление объекта класса reflectionclass
возвращает тип указанного файла
подсчитывает количество элементов в итераторе
возвращает идентификатор родительского процесса по отношению к текущему процессу
вызывается во время закрытия обертки потока непосредственно перед вызовом метода streamwrapper::stream_flush()
получает ключ текущего элемента с префиксом и суффиксом
получает содержимое буфера без его очистки
обрезает строку string str по ширине width
сериализует объект в значение которое в свою очередь может быть сериализовано функцией json_encode()
закрывает соединение с сервером cyrus imap
устанавливает данные содержащие схему relaxng используемую при проверке
представление в виде строки
возвращает информацию о ссылке
подсчитывает сколько раз подстрока needle встречается в строке haystack
устанавливает флаги которые будут использоваться splfileobject
функция возвращает интернет службу соответствующую заданному в параметре port порту для определенного протокола protocol как в / etc / services
устанавливает режим совпадения при полнотекстовом поиске
возвращает текущее состояние транзакции на сервере
задает атрибут объекта pdostatement
перемещает внутренний указатель большого объекта
функция убирает флаг o_nonblock с сокета указанного в параметре socket
возвращает строку с сообщением о последней обнаруженной ошибке
возвращает длину гипотенузы прямоугольного треугольника с длинами сторон x и y или расстояние точки x y до начала координат эквивалентно sqrt(x*x + y*y)
функция задает критерий сортировки и включает сортировку по z39.50
сортирует записи в массиве по ключам используя функцию сортировки определенную пользователем
тестирует реализацию специфичной возможности feature объекта domimplementation
применяет заданный фильтр filtertype к изображению image
проверяет взломостойкость переданного пароля по специальному словарю
используется для отправки http заголовка
сбрасывает определенные ограничения поиска
устанавливает смещение в файле на который ссылается handle
возвращает массив типов описанных в wsdl для веб-службы
возвращает число записей сохраненных в результате предыдущей операции поиска
проверяет является ли текущий узел php-кодом
создает действие которое может быть применено к различным объектам или событиям
функция работает идентично функции getimagesize() с той разницей что getimagesizefromstring() принимает данные изображения в виде строки в качестве первого аргумента вместо имени файла
работает аналогично функции imagecolorallocate() но еще добавляет к цвету параметр alpha отвечающий за прозрачность
добавляет фильтр размытия к изображению
задает режим работы
изменяет смещение файлового указателя связанного с потоком ресурсом сокета или файловым описателем fd на значение offset
этот метод подсчитывает количество дочерних элементов у текущего элемента
возвращает версию клиентских библиотек svn
возвращает переменную окружения сервера apache указанную параметром variable
возвращает идентификатор текущего потока
используется для удаления id3-тега
проверяет является ли класс окончательным final 
переводит файловый указатель в начало файла
устанавливает таймаут для операций ввода / вывода
запускает на выполнение задачу с низким приоритетом и возвращает строку содержащую результат
эта функция создает экземпляр класса domentityreference
функция позволяет вам остановить передачу поступающих исходящих или всех данных по умолчанию через сокет socket
считывает встроенный эскиз из tiff или jpeg изображения
проверяет определен ли указанный интерфейс
проверяет что аргумент передан по ссылке
устанавливает предельное количество запросов в группе
данный метод похож на datetime::getlasterrors() но работает с datetimeimmutable
распаковывает строку
собирает статистику на файл или символическую ссылку с именем filename
объявляет атрибут с заданным локальным именем localname и пространством имен namespaceuri идентифицирующим элемент атрибутом
возвращает объект класса reflectionextension для расширения определенного в классе
проверяет является ли класс абстрактным
вывод gd-изображения в filename
возвращает квадратный корень из arg
возвращает переменную типа string содержащую путь до текущего управляющего терминала данного процесса
устанавливает файл для записи профилирующей информации во время обработки таблиц стилей
возвращает путь к файлу
добавляет значение value как последний элемент массива
этот метод получает класс arrayiterator который используется для хранения итераторов добавленных с помощью метода appenditerator::append()
возвращает ключ текущего элемента
ждет от сервера задание а затем вызывает соответствующую callback-функцию для его обработки
функция устанавливает кодировку в которой будут возвращаться сообщения из domain такими функциями как gettext()
сжимает переданную строку и возвращает ее в виде закодированных данных bzip2
возвращает атрибуты элемента архива зависящие от операционной системы
устанавливает параметры для указанного контекста
функция принимает один два или четыре аргумента не три :
возвращает таблицу преобразований используемую функциями htmlspecialchars() и htmlentities()
устанавливает параметр для указанного сеанса curl
устанавливает буферизацию для операций записи на заданном потоке stream в число buffer байт
проверяет является ли тип переменной целочисленным
возвращает имя по идентификатору жанра
эта функция может оказаться полезной при выполнении запросов на этапе разработки и тестирования
перемещает все присоединенные итераторы к своим следующим элементам
определяет заголовки которые буду отправлены с soap-запросами
получает объявляющий класс
проверяет является ли файл исполняемым
возвращает определённые в классе константы
получает имя свойства
(ре-)инициализирует eio
функция возвращает array наоборот то есть ключи массива array становятся значениями а значения массива array становятся ключами
возвращает версию клиента в виде целого числа
задает cookie которое будет передано клиенту вместе с другими http заголовками
возвращает размер файла в байтах
эта функция идентична htmlspecialchars() за исключением того что htmlentities() преобразует все символы в соответствющие html-сущности для тех символов для которых html сущности существуют 
получение цветов соответствующих заданному индексу
возвращает список адресов ipv4 в которые разрешается доменное имя узла hostname
вызывает отображенный метод
работает аналогично memcached::setmulti() за исключением того что произвольный server_key может быть использован для определения сервера и установки значения с ключом key на конкретный сервер
возвращает косинус параметра arg
конструктор создает объект soapclient в wsdl или не-wsdl режиме
преобразование изображения с помощью аффинной матрицы
создает и заполняет массив значением параметра value используя значения массива keys в качестве ключей
возвращает строковое сообщение об ошибке объясняющее код ошибки errno
декодирует несколько полей заголовка mime за один раз
получает время последней модификации запущенного скрипта
создает новый файловый объект
экранирует символы которые воспринимаются как специальные операторы парсером запроса
возвращает текущее значение настройки magic_quotes_gpc
проверяет является ли значение переданное в поле field из текущего ряда statement равным null
возвращает массив строк полученных разбиением строки string с использованием delimiter в качестве разделителя
возвращает ассоциативный массив с кодом и строкой ошибки произошедшей с переданным файловым указателем
задает обработчик по умолчанию для xml анализатора parser
проверяет все ли символы в переданной строке text являются буквенно-цифровыми
производит relaxng проверку документа основываясь на заданной rng схеме
возвращает пространства имен используемые в документе
рассчитывает количество дней с начала юлианской эпохи до даты в заданном календаре calendar
определяет максимальную допустимую глубину вложенности элементов
открывает большой объект базы данных и возвращает его ресурс
установка / получение кодировки символов http вывода
форсирует запись всех буферизированных bzip2 данных в файл на который ссылается указатель bz
проверяет является ли функция устаревшей
удаление конкретной записи из директории ldap
закрывает словарь указанный в параметре dictionary
добавляет значение value с приоритетом priority в очередь
изменяет права доступа к файлу дескриптор которого указан в fd
записывает массив fields в файл в виде строки csv
создаёт объект object класса reflectionextension
сбрасывает буфер вывода возвращая его содержимое в виде строки и отключает буферизацию вывода
устанавливает допустимый диапазон id документов
вычисляет остаток от деления числа n на d
создает новый объект класса domelement
функция позволяет переопределить текущий домен domain для одного сообщения
проверяет принадлежит ли объект object к данному классу или содержит данный класс в числе своих предков
выдает параметры рамки обрамляющей текст написанный шрифтом postscript type1
останавливает трассировку запущенную функцией pg_trace()
подготавливает sql-запрос для выполнения и возвращает объект sqlite3stmt
значение errno в случае возвращаемого значения gearman_errno
возвращает reflected отражённые свойства
проверяет является ли текущий элемент directoryiterator допустимым файлом
эта функция является полным аналогом функции fsockopen() с той лишь разницей что соединение не закрывается после завершения работы скрипта
возвращает атрибут в пространстве имен namespaceuri с локальным именем localname для текущего элемента в виде узла
возвращает время захода солнца для определенных дня заданного аргументом timestamp и местоположения
нет действия
отключение / включение возможности загружать внешние сущности
возвращает статус обработки задания
возвращает данные ассоциированные с объектом на который указывает итератор
закрывает дескриптор zip-архива
резервирует или использует существующий блок разделяемой памяти
производит смену регистра символов в строке string в соответствии с режимом mode
возвращает идентификатор текущего процесса
возвращает трассировку стека исключения в виде строки
добавляет новый фильтр по диапазону значений для поля типа float к имеющемуся списку фильтров
используйте чтобы узнать количество столбцов в результирующем наборе который представляет объект pdostatement
возвращает свойства класса по умолчанию включая наследованные свойства 
получает текущее состояние выполнения задания запущенного в фоновом режиме
перемотка на первый элемент первого внутреннего итератора
получает число столбцов в запросе заданном в statement
возвращает трассировку стека исключения
устанавливает позицию внутреннего указателя объекта lob
освобождение памяти выделенной для сессии агента
переименование / перемещение записи определённой dn
проверяет поддерживается ли заданное свойство feature в определенной версии version
получение строкового представления ошибки xml анализатора в соответствии с переданным кодом ошибки code
возвращает номер ошибки произошедшей в последней posix функции завершившейся неудачей
похожа на функцию file_get_contents() за исключением того что stream_get_contents() работает с уже открытым ресурсом потока и возвращает оставшуюся часть содержимого в строку размером до maxlength байт и начиная с указанного смещения offset
распаковывает сжатую строку
вызывает отображенную функцию
определяет можно ли для текущего элемента создать итератор методом recursiveiterator::getchildren()
декодирует строку из формата uuencode в обычный вид
перемещает указатель к полю с указанным смещением
получает номер строки завершения описания функции
делает свойство доступным
отменяет выполнение асинхронного запроса отправленного функциями pg_send_query() pg_send_query_params() или pg_send_execute()
данная функция идентична функции fgets() с той только разницей что fgetss() осуществляет отбрасывание любых html и php-тегов из прочитанной строки
добавляет указанный сервер в пул
возвращает формат imagick объекта
устанавливает весовые коэффициенты индексов и включает суммирование соответствующих весов для различных индексов
этот метод позволяет зарегистрировать свой собственный расширенный dom класс чтобы впоследствии использовать его в php dom расширении
возвращает префикс пространства имен узла из uri пространства имен
удаляет функцию из spl очереди реализаций метода __autoload
эта функция создает новый экземпляр класса domcomment
возвращает имя файла текущего элемента directoryiterator
создает специальный или обычный файл
возвращает величину размера спектра для объекта imagick
отсортирует массив используя для сравнения его ключей функцию предоставленную пользователем
складывает два числа
закрывает поток связанный с каталогом и переданный в качестве параметра dir_handle
возвращает информацию о последней операции
возвращает число строк затронутых последним insert update replace или delete запросом
возвращает целочисленный идентификатор базового типа oid значений колонки результата запроса result с номером field_number
вычитает число b из числа a и возвращает результат
включает и выключает внутреннюю отладку
определяет известно ли серверу задач об этом задании
упаковывает заданные аргументы в бинарную строку согласно формату в параметре format
выключает режим автоматической фиксации транзакции
возвращает контекст ранее установленный с помощью gearmanclient::setcontext()
функция похожа на функцию pclose() за исключением того что она работает только с процессами открытыми при помощи функции proc_open()
вычисляет наибольший общий делитель чисел a и b
кодирует строку с помощью алгоритма uuencode
получает функцию в которой аргумент объявлен
освобождает память внутренне выделенную для хранения результата
отправляет указанные данные data через сокет socket
возвращает округлённое значение val с указанной точностью precision количество цифр после запятой 
возвращает название колонки с указанным индексом
возвращает строку с информацией о версии сервера oracle и доступных опциях
возвращает дочерние элементы внутреннего итератора в виде объекта recursivefilteriterator
умножает число a на b и возвращает результат
возвращает позицию первого вхождения подстроки needle в строке haystack
работает аналогично memcached::prepend() за исключением того что произвольный server_key может быть использован для определения сервера и установки значения с ключом key на конкретный сервер
создание нового изображения на основе gd файла или url
этот метод возвращает объект simplexmliterator содержащий вложенные элементы текущего элемента simplexmliterator
устанавливает значение заданной настройки конфигурации
проверяет является ли val допустимым конечным числом на данной платформе
в поведении аналогичен carp::cluck в perl
преобразует заданные коды символов в строке string str из кодов в числовые html-ссылки
получить записи хранящиеся в результате
сравнивает две php-стандартизованные строки с номерами версий
вывод или сохранение в формате xbm изображения image
сохраняет данные из параметра data в объект lob
устанавливает или изменяет настройки парсера
выводит или сохраняет png изображение image
возвращает всю строку haystack начиная с первого вхождения needle включительно
проверяет является ли метод конструктором
добавляет список серверов задач которые могут использоваться для выполнения задачи
устанавливает эффективный идентификатор группы для текущего процесса
возвращает текущий статус сервера
задает количество чисел после десятичной точки по умолчанию для bc math функций которые не могут явно получить это число в виде аргумента
возвращает подстроку строки haystack начиная с первого вхождения needle и включая его и до конца строки haystack
возвращает итератор обратно на первый элемент
у каждого массива имеется внутренний указатель на его текущий элемент который инициализирован первым элементом добавленным в массив
получение объявляющего класса
функция заменяет дочерний узел oldnode новым узлом
возвращает значение элемента с индексом index начиная с нуля 
добавляет запрос в группу запросов
добавляет строку data в конец символьных данных узла
возвращает количество строк в результате запроса postgresql
возвращает строку в которой последовательность знаков процента % и следующие за ним два шестнадцатеричных числа заменены буквенными символами
позиционирует курсор на атрибуте с заданным именем
возвращает тангенс параметра arg
возвращает массив содержащий статистику всех доступных memcache серверов
освобождает connection
осуществляет попытку смены группы файла filename на группу group
проверяет является ли файл доступным для чтения
разбирает xml документ
возвращает либо информацию о состоянии буфера вывода верхнего уровня либо если full_status установлен в true массив уровней всех активных буферов
используйте этот метод для проверки того является ли файл на который ссылается объект splfileinfo ссылкой
возвращает массив имен методов класса
записывает строку отформатированную в соответствии с параметром format в поток handle
проверяет и преобразовывает значения из assoc_array в приемлемые для sql сервера
в отличие от strlen() iconv_strlen() учитывает кодировку строки
этот метод вызывается в результате вызова fflush()
возвращает параметры cookie сессии
определяет доступен ли текущий элемент directoryiterator для записи
переводит указатель на начало директории
удаляет элемент файл или каталог - прим.пер.) в архиве используя его индекс
распаковывает данные из бинарной строки в массив согласно заданному в format формату
возвращает последовательность элементов массива array определённую параметрами offset и length
заполняет массив num элементами со значением value начиная с ключа start_index
записывает строку созданную с использованием строки формата format в поток дескриптор которого передается в параметре handle
задает имя класса объекты которого будут создаваться при вызове методов splfileinfo::getfileinfo() и splfileinfo::getpathinfo()
закрывает текущую сессию
экземпляр runkit_sandbox_parent созданный внутри окружения runkit_sandbox предоставляет набор контролируемых средств для доступа к внешнему окружению из песочницы
функция возвращает id который можно использовать для вывода логотипа php используя встроенное изображение
при работе в неблокирующем режиме ввода / вывода заставляет обработчика ожидать задания от какого-либо сервера заданий gearman
получает строку для помещения после текущего элемента
отправляет изменения в файлах локальной рабочей копии перечисленные в массиве targets в репозиторий с сообщением log
создает новый объект класса parentiterator на основе объекта-итератора
возвращает абсолютный путь через аргумент result функции callback
получает результат выполнения key() зарегистрированных итераторов
работает так же как imagick::thresholdimage() но изменяются только пиксели ниже порогового значения в то время как остальные пиксели остаются неизменными
запрашивает статус searchd и возвращает массив в формате пар ключ-значение
этот метод вызывается в результате вызова rmdir()
определяет была ли установлена переменная значением отличным от null
удаляет length элементов расположенных на расстоянии offset из массива input и заменяет их элементами массива replacement если он передан в качестве параметра
читает распаковывая до length байт из gz-файла по указателю на него
рисует точку пиксел на заданных координатах
возвращает массив содержащий все элементы array1 имеющие ключи содержащиеся во всех последующих параметрах.
фиксирует удаление из базы данных окончательно удаляет записи которые были помечены на удаление с помощью dbase_delete_record()
эта функция подобна strcmp() за исключением того что можно указать максимальное количество символов в обоих строках которые будут участвовать в сравнении
очищает истекшие сессии
сбрасывает подключение
эта функция создает новый объект класса domattr
сопоставляет переменную php столбцу результата запроса полученного с помощью oci_fetch()
устанавливает php umask в значение mask & 0777 и возвращает старую umask
возвращает массив содержащий следующую строку результата запроса
является противоположностью функции htmlentities()
эта функция может вызываться для присоединения бакета в цепочку бакетов
устанавливает количество рядов которые будут выбраны в буфер клиентскими библиотеками oracle сразу после удачного вызова oci_execute() и для каждого последующего внутреннего запроса данных к базе
посылает команду allo ftp-серверу для резервирования места под загружаемый файл
возвращает объект domnodelist со всеми элементами с заданным локальным именем и uri пространства имен
задает значение именованной или неименованной псевдопеременной в подготовленном sql запросе
добавляет высокоприоритетную задачу для параллельной работы с другими задачами
возвращает string содержащую абсолютный путь до текущего терминального устройства которое открыто и связано с файловым дескриптором fd
добавляет низкоприоритетную фоновую задачу для параллельной работы с другими задачами
эта функция сортирует массив в обратном порядке от большего к меньшему 
синхронизирует данные между фронтендом postgresql обычно процессом веб-сервера и сервером postgresql после завершения копирования данных совершенных с помощью функции pg_put_line()
получает строку string mime набора символов для заданной кодировки
вычисляет base возводится в степень exp остаток от целочисленного деления на mod
возвращает текущую позицию указателя в буферизованном результирующем наборе result
закрывает fdf-документ
получение количества аргументов в определении функции как обязательных так и опциональных
создаёт новый ресурс сокета типа af_inet слушающий на всех локальных интерфейсах указанный порт в ожидании новых соединений
переинициализирует генератор случайных чисел параметром seed или случайным числом если seed не указан
возвращает содержимое элемента по его индексу
будет срабатывать при усечении потока функцией ftruncate()
sets the miter limit.возвращает true в случае успешного завершения или false в случае возникновения ошибки
возвращает реальный размер заданного дескриптора директории
удаляет элемент файл или каталог - прим.пер.) в архиве используя его имя
возвращает длину участка от начала строки subject содержащий только символы из mask
возвращает время последней модификации удалённого файла
вставляет записи из массива assoc_array в таблицу table_name
вычисляет побитовое и двух gmp чисел
выполнение запросов останавливается если время выполнения превышает nseconds секунд
функция экранирует unescaped_string таким образом после чего её можно безопасно использовать в mysql_query()
закрывает указанный идентификатор соединения с сервером и освобождает resource
освобождает соединение с сервером давая возможность запускать другие sql запросы
создаёт новый объект splfileinfo для указанного имени файла
возвращает массив содержащий значения array1 содержащиеся во всех последующих параметрах
add a section of a cubic bézier curve described by the three given control points to the current path
функция обратного вызова ob_start() для восстановление буфера
читает содержимое текущего узла как строку
применяет пользовательскую функцию callback к каждому элементу массива input
возвращает массив содержащий значения array1 имеющие ключи содержащиеся во всех последующих параметрах
возвращает атрибуты записи
создает заготовку sql выражения на сервере для последующего запуска функциями pg_execute() или pg_send_execute()
этот метод распаковывает все символические ссылки разрешает относительные пути и возвращает абсолютный путь к файлу
проверяет является ли класс встроенным в расширение или в ядро а не пользовательским
возвращает минимальную версию программы rar т.е
проверяет что функция определена в пространстве имен
добавляет запрос с текущими настройками к очереди запросов
десериализует хранилище из строкового представления полученного с помощью spldoublylinkedlist::serialize()
выводит информацию о подготовленном запросе в выходной поток
создает массив
возвращает количество строк измененных запросом insert update или delete
заменяет текущий массив array на другой массив array или объект object 
возвращает строку содержащую восьмеричное представление указанного аргумента number
аналогичен методу memcached::setoption() но принимает массив параметров
получает текущий ключ
переименовывает элемент по его индексу
выбирает дочерние элементы внутреннего итератора подходящие под условия фильтра
вычисляет md5-хэш файла имя которого задано аргументом filename используя алгоритм md5 rsa data security inc
метод вызывается после выполнения recursiveiteratoriterator::getchildren() а результат его работы аналогичен вызову recursiveiteratoriterator::rewind()
возвращает строку из одного символа код которого задан аргументом ascii
возвращает количество секунд прошедших с начала эпохи unix the unix epoch 1 января 1970 00:00:00 gmt до текущего времени
возвращает размер сжатого элемента архива
определяет был ли достигнут конец файла
эта функция устанавливает расширенный атрибут файла
сравнивает array1 c array2 и возвращает разницу
сжимает данные с указанным кодированием
функция записывает в сокет socket данные из указанного буфера buffer
посылает на сервер задач и всем слушающим клиентам статус текущей работы
возвращает размер данных которые должен переработать обработчик заданий в байтах
читает большой объект и посылает данные напрямую в броузер после отправки всех необходимых заголовков
возвращает глобальное значение гравитации объекта imagick
увеличивает числовое значение записи на величину указанную в параметре offset
возвращает код любой bzip2 ошибки произошедшей с переданным указателем на файл
функция возвращает метку времени unix соответствующую дате и времени заданным аргументами
возвращает доменное имя узла по адресу ip_address
останавливает обозначенную службу
проверяет являются ли все символы в строке text шестнадцатеричными цифрами
генерирует url-кодированную строку запроса из предоставленного ассоциативного или индексного массива
создает новое соединение с сервером oracle и выполняет вход
задает функцию которая будет вызываться когда обработчик задания пошлет исключение
включает или выключает пассивный режим
сбрасывает курсор файлового указателя handle на начало файлового потока
загружает php расширение заданное аргументом library
распаковывает любые raw / gzip / zlib закодированные данные
возвращает десятичный эквивалент двоичного числа binary_string
этот метод включает возможность использовать php функции в xpath выражениях
адаптивное изменение резкости изображения с большей интенсивностью на краях изображения и с меньшей ближе к середине
возвращает определение таблицы table_name в виде массива
возвращает идентификатор группы текущего процесса
эта функция возвращает ключ текущего элемента массива
получает документируемый комментарий из описания функции
отменяет запрос определенный в req
функция возвращает дескриптор соединения в случае успеха и ноль в случае ошибки
извлекает строку из файла и разбирает ее в соответствии с форматом csv
добавляет setting в среду сервера
добавляет переданные в качестве аргументов элементы в начало массива array
используется для установки функции которая будет вызвана когда задача будет выполнена
при передаче строки с путем к файлу или каталогу данная функция вернет последний компонент имени из данного пути
возвращает атрибут с именем name текущего элемента в виде узла
устанавливает комментарий к элементу по его индексу
возвращает список загруженных модулей сервера apache
проверяет может ли метод иметь потомков final 
для обеспечения большей производительности при использовании функций stat() lstat() или любой другой функции перечисленных в приведенном ниже списке php кеширует результаты их выполнения
запускает выполнение задачи в фоновом режиме возвращая дескриптор задания который может быть использован для запроса состояния выполняющейся задачи
определяет к какому типу принадлежит текущей элемент directoryiterator
добавляет фоновую задачу для параллельной работы с другими задачами
экспортирует все методы из заданного класса
получает следующий результат последнего запроса
возвращает гиперболический арктангенс arg т.е
создает объект gearmanworker представляющий обработчик который подключается к серверу задач и выполняет полученное от сервера задание
конвертирует строку из формата utf-8 в формат utf-16
возвращает строку содержащую версию библиотеки клиента mysql
запускает на выполнение с высоким приоритетом задачу в фоновом режиме возвращая дескриптор задания который может быть в дальнейшем использован для запроса состояния выполняющейся задачи
эта функция обязательно вернет идентификатор цвета для выбранного цвета либо ближайшую возможную его альтернативу
возвращает расстояние хэмминга для чисел a и b
postgresql поддерживает автоматическое преобразование наборов символов между сервером и клиентом для некоторых кодировок
эта функция сортирует массив таким образом что сохраняются отношения между ключами и значениями
задает функцию которая будет вызываться когда обработчик заданий пришлет предупреждение
создает новый объект класса domxpath
возвращает число строк в результате запроса
retrieve assigned varaiable замечание : parameter can be empty since 2.1.11
определяет является ли текущий элемент массивом array или объектом object 
открывает новый zip-архив для чтения записи или изменения
этот метод может быть использован для определения того является ли файл каталогом
возвращает все заголовки для текущего http-запроса
создает новый объект класса reflectionmethod
закрывает файл указанный в fd
получает список требуемых и конфликтующих зависимостей
этот метод вызывается в следующих случаях: при вызове функции flock() при вызове file_put_contents() когда flags содержит lock_ex при вызове stream_set_blocking() и при закрытии потока lock_un 
отправляет указанную команду site ftp-серверу
отменяет группу запросов указатель на которую определен в grp
получает имена модификаторов
если для определенного дескриптора была установлена опция curlopt_returntransfer то эта функция вернет содержимое этого curl дескриптора в виде строки
эта функция подобна strcasecmp() за исключением того что можно указать максимальное количество символов в обоих строках которые будут участвовать в сравнении
функция возвращает коды страны и региона соответствующих имени хоста или ip адресу
возвращает значение переменной var в виде числа с плавающей точкой float 
функция возвращает версию базы geoip соответствующую определению в бинарном файле
возвращает имя класса итератора массива который используемый arrayobject::getiterator()
перемещает итератор к следующему элементу
возвращает идентификатор цвета в соответствии с заданными rgb компонентами
функция похожа на include за исключением того что весь код вне функций и объявлений классов игнорируется
посылает параметризованный запрос на сервер и ждет результат
устанавливает данные содержащие xml для разбора
возвращает данные поля field текущей строки возвращаемой функцией oci_fetch()
отправляет сигнал sig процессу с идентификатором pid
возвращает код ошибки последнего вызова функции mysqli завершившейся успехом или провалом
функция отправляет len байт в сокет socket из буфера buf
представление в виде строки
собирает статистическую информацию о файле filename
эта функция возвращает текущую версию расширения в виде строки
вернет порядковый номер поля с именем field_name в результате запроса result
перемещает итератор к следующему узлу
создает регулярное выражение для регистронезависимого сравнения
получает текущее качество сжатия изображения
используется для запроса информации о состоянии с сервера gearman который будет вызывать указанный обратный вызов статуса устанавливаются с помощью gearmanclient::setstatuscallback() 
производит заливку начиная с заданных координат верхний левый угол имеет координаты 0 0 цветом color в изображении image
присваивает коллекции значение другой ранее созданной коллекции
начинает потоковое или датаграммное соединение с удалённым сокетом указанным параметром remote_socket
получает имя xml элемента
эта функция возвращает уникальный идентификатор текущего потока выполнения
вычитает число right_operand из left_operand
возвращает строковые данные хранимые в участке разделяемой памяти
перемещает курсора к следующему атрибуту если курсор спозиционирован на атрибуте или перемещает позицию на первый атрибут если спозиционирован на элементе
возвращает массив содержащий версии клиента протокола клиент-серверного взаимодействия и сервера
десериализует конвертирует в значение php - прим.пер.) сериализованный объект arrayobject
этот метод определяет был ли php сконфигурирован с библиотекой exslt
заменяет данную запись в базе данных на заданные значения
обнаружить dn записи в результате
функция похожа на функцию printf() но используется не для вывода а для ввода данных
возвращает ассоциативный массив с именами и значениями всех предопределенных констант
возвращает короткое имя id3v2 кадра
список всех используемых обработчиков вывода
добавляет filtername в список фильтров прикреплённых к stream
добавляет к процессу pid идентификатор группы pgid
получает содержимое кэша реального пути
создает экземпляр gearmanclient представляющий клиента который соединяется с сервером заданий и передаёт задачи для выполнения
возвращает логическое значение boolean которое является признаком того что разбираемый документ является синтаксически правильным
данный метод похож на datetime::sub() но работает с datetimeimmutable
данная функция выполняет разбор строки в формате csv и возвращает массив с полученными из строки полями
закрывает большой объект
масштабирует систему координат
устанавливает режим подписывания
этот метод вызывается в результате вызова функции fseek() для определения текущей позиции
получает остаток от деления left_operand на modulus
возвращает список текущих процессов на сервере mysql
функция возвращает имя файла соответствующей базы geoip
проверяет совпадает ли переданный параметр string с указанным шаблоном подстановок оболочки pattern
привязывает имя указанное в параметре address к сокету описанному в параметре socket
возвращает итератор в начало
устанавливает смещение offset для получаемого от сервера набора результатов и количество записей limit которое необходимо получить с данным смещением
получает значение из предоставленного смещения
переводит итератор на первый элемент контейнера
проверяет документ на действительность основываясь на его dtd
проверяет ожидает ли аргумент массив в качестве значения
возвращает локальное или удалённое название указанного сокетного соединения
возвращает e в степени arg
устанавливает флаги регулярного выражения
сравнивает value1 с value2
получает уникальный идентификатор с префиксом основанный на текущем времени в микросекундах
возвращает точность поля field
выполняет безопасную с точки зрения многобайтных кодировок операцию strrpos() основываясь на количестве символов
callback-функция типа callable используемая параметром контекста notification вызываемая во время события
возвращает индекс текущего узла
ищет позицию первого вхождения подстроки needle в строку haystack
получает сообщение агента об ошибке
преобразует строку закодированную в internal_encoding в строку закодированную в output_encoding
представление в виде строки
данная функция устанавливает домен в котором будет производиться поиск при вызове функции gettext() обычно называется именем приложения
определяет является ли текущий элемент directoryiterator директорией
создает дубликат дескриптора файла
принимает закодированную в json строку и преобразует ее в переменную php
возвращает заданный лимит ресурсов
возвращает запись которая ранее была сохранена под ключом key
функция устанавливает опцию указанную в параметре optname на уровне протокола level в значение указанное параметром optval для сокета socket
возвращает объем памяти в байтах занимаемый значением поля результата запроса postgresql result
разделяет dn возвращенный функцией ldap_get_dn() и разбивает его на составные части
устанавливает значение по заданному индексу index в newval
первый прототип работает при связке с libmcrypt 2.2.x второй - при связке с libmcrypt 2.4.x или выше
возвращает модифицированную строку в которой перед каждым символом из следующего списка:
замещает значения массива array1 значениями с такими же ключами из других переданных массивов
принимает массив array и возвращает новый массив содержащем элементы исходного массива в обратном порядке
возвращает число доступных предупреждений найденных в рассмотренном документе
возвращает определенную константу
получает текущий элемент массива
находит последнюю позицию подстроки needle в строке haystack
обрезает объект lob
устанавливает курсор на атрибуте основываясь на его позиции
делит число n на d используя быстрый алгоритм деления без остатка
создает базу данных dbase с заданными свойствами
устанавливает настройки локали
проверяет есть ли в списке определённых функций как встроенных так и пользовательских функция function_name
эта функция устанавливает соответствие индекса в палитре заданному цвету
проверяет является ли метод общедоступным public 
работает аналогично memcached::deletemulti() за исключением того что произвольный server_key может быть использован для определения сервера и установки значения с ключом keys на конкретный сервер
возвращает информацию о таблице с переданным именем
функция возвращает массив имен всех скомпилированных и загруженных в php интерпретаторе модулей
вызывает отображенный метод и передает ему аргументы в виде массива
эта функция возвращает все имеющиеся в настоящее время драйверы pdo которые можно использовать в dsn -параметре pdo::__construct()
возвращает имя таблицы из result
рисует эллипс с центром в заданных координатах изображения image
данный метод похож на datetime::settimestamp() но работает с datetimeimmutable
эта функция сортирует элементы массива таким образом что сохраняются отношения между ключами и значениями
возвращает высоту в пикселах символа заданного шрифта
получить строку с восстановленным html
показывает существует ли атрибут в пространстве имен namespaceuri с именем localname в составе элемента
эта функция может задавать расширения файлов в которых callback-функция __autoload() будет искать описания классов и интерфейсов
данная функция сжимает строку используя формат данных zlib
проверяет является ли метод защищенным protected 
возвращает код ошибки последней операции curl
составляет полное имя файла из параметра filename используя пути включения в соответствии с теми же правилами что и функции fopen() / include
возвращает информацию о группе используя её имя
проверяет отключена ли функция с помощью директивы disable_functions
возвращает номер порта соответствующего заданному соединению postgresql connection
выставляет итератор массива в начало
уничтожает сессию
эта функция возвращает уникальный идентификатор для заданного объекта
переводит символы из кодировки iso-8859 в t61
этот метод является регистронезависимой версией arrayobject::natsort
проверяет определён ли класс в пространстве имён
удаляет предварительно установленный функцией header() http заголовок
получает флаги настройки объекта splfileobject в виде целого числа типа integer
функция получает стандартное имя хоста для локального компьютера
записывает строку в переданный bzip2 файловый поток
экспортирует ключ fingerprint
возвращает набор прав для текущего элемента directoryiterator
этот метод устанавливает значение параметра для memcached переданного в option
возвращает строковое представление объекта reflection method
получает позицию аргумента в списке аргументов
возвращает объект свойства которого соответствуют именам полей выборки
возвращает путь и имя файла текущего файла
форматирует дату / время с учетом текущих настроек локали
выбирает все строки из результата запроса в двумерный массив
записывает данные сессии в хранилище сессий
эта функция конфигурирует ccl-парсер запросов для сервера с определениями точек доступа ccl-квалификаторов и их отображения в rpn
возвращает размер указанного файла
возвращает информацию о правах доступа на файл
используется для получения размера блока разделяемой памяти в байтах
возвращает последнее сообщение об ошибке после вызова mysqli_connect()
устанавливает условия выборки содержит конкретные атрибуты для выборки и выражения для расчета и последующей выборки
возвращает идентификатор изображения представляющего изображение полученное из файла с заданным именем
копирующий конструктор
привязывает обратные вызовы для cyrus imap соединения
эта функция возвращает строку или массив в котором все вхождения search в subject заменены на replace
эта функция выводит список разработчиков php модулей и т.п
работает аналогично методу memcached::append() за исключением того что произвольный server_key может быть использован для определения сервера и установки key на конкретный сервер
закрывает открытый или созданный архив и сохраняет изменения
добавляет сервера указанные в массиве servers в общий пул
возвращает предупреждения и ошибки возникшие при разборе указанного документа
возвращает длину строки количество символов значения поля при выводе результата result
возвращает текущую позицию отступ от начала внутреннего указателя большого объекта
освобождает все ресурсы занимаемые курсором или sql-выражением которое было возвращено функцией oci_parse() или получено от сервера oracle
эта функция реализует алгоритм сортировки при котором порядок буквенно-цифровых строк будет привычным для человека
посылает команду site exec command на ftp-сервер
создаёт потоковый или датаграммный сокет на указанном local_socket
этот метод реализует алгоритм сортировки при котором порядок цифробуквенных строк будет привычным для человека сохраняя при этом связь ключ / значение
эта функция сортирует массив таким образом что его индексы сохраняют отношения с элементами с которыми ранее были ассоциированы с помощью callback-функции предоставленной пользователем
сериализует arrayobject преобразует в пригодное для хранения представление - прим
экранирует спецсимволы в строке с данными типа bytea
считывает начальные байты изображения и проверяет их сигнатуру
возвращает значение гравитации изображения
данный метод похож на datetime::settime() но работает с datetimeimmutable
возвращает true если файл filename был загружен при помощи http post
резервирует ресурсы необходимые для хранения дескриптора объекта или lob-локатора
возвращает расширение файла для заданной imagetype_xxx константы
функция закрывает файл на который указывает дескриптор handle
возвращает синус параметра arg
возвращает список групп для текущего процесса
возвращает строку содержащую наименование месяца
функция возвращает тип интернет соединения соответствующего имени хоста или ip адреса
устанавливает флаги которые влияют на поведение arrayobject
принимает строку str и возвращает практически уникальную 32-битную хэш-сумму этой строки
эту функцию можно использовать для ручного поиска описания класса или интерфейса используя все зарегистрированные реализации метода __autoload
объединяет элементы массива с помощью строки glue
расшифровывает переданный текст ключами установленными ранее с помощью gnupg_adddecryptkey
возвращает настройки из строки ini в виде ассоциативного массива
инициализирует новый сеанс curl и возвращает дескриптор который используется с функциями curl_setopt() curl_exec() и curl_close()
создаёт новый экземпляр класса
обычно все результаты работы в песочнице использование функций echo или print будут выведены в родительском окружении
перемещает позицию курсора на первый атрибут
включает или выключает неявный сброс
эта функция возвращает распакованную версию входных данных
проверяет является ли итератор действительным
возвращает id последней вставленной строки либо последнее значение которое выдал объект последовательности
эта функция возвращает многомерный массив содержащий список всех определенных переменных будь то переменные окружения серверные переменные или переменные определенные пользователем в той области видимости в которой была вызвана get_defined_vars()
выполняет подготовленное выражение statement созданное с помощью функции oci_parse()
работает аналогично memcached::get() за исключением того что произвольный server_key может быть использован для определения сервера и установки значения с ключом key на конкретный сервер
функция принимает строку str и добавляет обратный слеш перед каждым служебным символом
возвращает время последнего изменения i-узла текущего элемента directoryiterator
получает время последнего обращения к файлу
перемещает указатель на следующий элемент directoryiterator
изменяет значение указанной параметром type внутренней переменной на charset
проходит по циклу запроса ничего при этом не делая
вычисляет расхождение массивов с дополнительной проверкой индексов используя для сравнения значений callback-функцию
проверяет установлен ли заданный бит в 1
добавляет новый фильтр по типу поля integer к имеющемуся списку фильтров
посылает сообщение о провале обработки причем причина этого провала известна в отличие от провала в результате возникновения исключительной ситуации 
получение короткого имени функции без указания пространства имен 
работа функции идентична splfileobject::fgets() за исключением того что splfileobject::fgetss() пытается очистить строку от html и php тэгов
возвращает копию массива
проверяет текущий узел на соответствие asp
возвращает значение переменной mysql character_set
функция разбирает html документ из файла filename
работает аналогично memcached::set() за исключением того что произвольный server_key может быть использован для определения сервера и установки значения с ключом key на конкретный сервер
получение аргументов в виде массива объектов reflectionparameter
возвращает данные переданные для обработки
получение содержимого кэша
эта функция возвращает массив с именами трэйтов которые использует заданный класс class
вызывает пользовательскую функцию callback с параметрами из массива param_arr
загружает xml документ из строки
подключается к searchd выполняет набор из всех запросов добавленных с помощью sphinxclient::addquery получает и возвращает набор результатов
загружает шрифт postscript type 1 из файла filename
функция возвращает тип данного ресурса
создает экземпляр imagick для отдельного изображения или группы изображений
добавляет тег в существующий набор тегов tag_set bbcode_container используя tag_rules
определяет является ли текущий элемент directoryiterator обычным файлом
переходит к следующему элементу
начинает соединение с адресом address используя ресурс сокета socket который должен быть действующим ресурсом сокета созданным при помощи функции socket_create()
эта функция рассчитывает и возвращает рамку границы freetype текста
создаёт новый объект класса reflectionclass
освобождает память занятую изображением image
если указан необязательный параметр base log() возвращает log base от arg иначе log() возвращает натуральный логарифм числа arg
изменяет текущий каталог php на указанный в качестве параметра directory
возвращает имя хоста с которым установлено заданное postgresql соединение connection
добавляет запись в ldap директорию
возвращает строку описывающую результирующий код выполнения последнего memcached метода
вызывается когда начинается навигация по элементам после первого вызова метода recursivetreeiterator::rewind() 
эта функция удаляет содержимое выходного буфера
экспортирует данные как из рабочей копии так и из репозитория в чистую директорию
этот метод находит всех дочерних элементов узла
рисует дугу окружности против часовой стрелки
вычисляет пересечение массивов с дополнительной проверкой индексов используя для сравнения значений callback-функцию
возвращает указанный аргумент из списка аргументов пользовательской функции
функция является полным аналогом функции setcookie() исключая то что значение cookie не будет автоматически преобразовано при отправке браузеру
устанавливает флаги управляющие поведением
помечает указанные записи для удаления из базы данных
проверяет является ли функция определенной пользователем то есть это не внутренняя функция
определяет cookie которые будут отправлены с soap-запросами
возвращает ассоциативный массив содержащий следующую строку из результата выполнения запроса
получает значение ключа / encoding
данная функция вставляет новый узел перед опорным узлом
устанавливает произвольную строку для предоставления контекста приложения которая может быть позже получена с помощью gearmanclient::context()
возвращает номер ошибки когда какой-либо метод вернул значение gearman_errno
переводит число дней в юлианском летоисчислении в строку содержащую григорианскую дату в формате месяц / день / год
удаляет из таблицы записи соответствующие ключам и значениям массива assoc_array
возвращает строку str буквенные символы в которой приведены к нижнему регистру
поведение этой функции во многом напоминает preg_replace() за исключением того что вместо параметра replacement необходимо указывать callback -функцию
эта функция возвращает новый объект класса domnodelist содержащий элементы с заданным локальным именем
эта функция идентична функции mktime() за исключением того что аргументы формируют время по гринвичу gmt 
пытается уничтожить базу данных на сервере на который ссылается переданный дескриптор соединения
возвращает версию версии id3-тега(тегов в mp3-файле
эта функция производит разбор строки to_parse в соответствии с правилами в bbcode_container возвращаемом функцией bbcode_create()
создает горизонтальное зеркало изображения отражая пиксели вокруг центральной оси y
возвращает xml полученный в последнем soap-ответе
конвертирует символы в переменных vars из кодировки from_encoding в кодировку to_encoding
возвращает число соответствующее действительному id группы текущего процесса
возвращает видимые нестатические свойства указанного объекта object в соответствии с областью видимости
возвращает статистику файловой системы в result аргумент callback
создает итератор recursivefilteriterator на основе recursiveiterator
эта функция сортирует элементы массива используя для сравнения значений callback-функцию предоставленную пользователем
выполняет экспорт расширения и возвращает его в виде строки string
отсоединяет наблюдателя от субъекта чтобы больше не уведомлять его об обновлениях
возвращает метку времени unix соответствующую полуночи на пасху в заданном году
получает максимальную длину строки установленную с помощью splfileobject::setmaxlinelen()
загружает файл remote_file с ftp-сервера и записывает его в переданный файловый дескриптор
производит преобразование han-kaku - zen-kaku для аргумента string str
удаляет файл директорию или символическую ссылку path из рабочей копии
ищет в dns записи mx соответствующие hostname
возобновляет работу обозначенной приостановленной службы
возвращает текущий объект
эта функция возвращает массив с именами базовых классов заданного класса class
возвращает значение атрибута на основании позиции или пустую строку если атрибут не существует или не расположен на узле элемента
переводит итератор на первый элемент верхнего уровня элементов внутреннего итератора
возвращает название пространства имён
функция добавляет по одной кавычке вокруг строки и добавляет кавычки / экранирует любые существующие единичные кавычки позволяя вам передать строку непосредственно шелл-функции и рассматривать её как один безопасный аргумент
удаляет выбранную область с реструктуризацией изображения
получить номер строки где исключение было создано
возвращает полную историю изменений конкретного элемента репозитория расположенного по url repos_url или историю правок в конкретном диапазоне если указан параметр start_revision
возвращает дату релиза imagemagick в виде строки
копирует функцию
возвращает итератор для текущего элемента
изменяет дату и время последней модификации и доступа к файлу
создает новый объект класса domentityreference
задает callback-функцию которая будет обрабатывать данные задания
возвращает информацию о структуре полей столбцов базы данных согласно заданному идентификатору
устанавливает новое значение по указанному индексу
используется для доступа к отдельным элементам различных категорий текущей локали
переход к следующему узлу
закрывает заданный дескриптор директории
загружает xml документ из файла
этот метод вызывается в результате запуска функции fwrite()
возвращает ключ текущего элемента directoryiterator
удаляет из текущего контейнера объекты которые есть в другом контейнере
принимает входной array и возвращает новый массив без повторяющихся значений
возвращает массив функций веб-служб описанных в wsdl
создает прямоугольную аннотацию на текущей странице
заменяет значения массива array1 на соответствующие по ключам значения из всех следующих массивов
отправляет запрос на каждый сервер и получает массив всех ключей хранящихся на нем в данный момент
устанавливает размер массива в значение size
читает строку из файла
проверяет наличие указанного файла или каталога
посылает исключение возникшее во время выполнения работы
добавляет все пары объект-данные из другого контейнера в текущий
возвращает уникальный идентификатор объекта работы присвоенный клиентом
пытается изменить владельца символической ссылки filename на указанного в user пользователя
возвращает количество рядов затронутых последним insert update replace или delete запросом связанным с дескриптором link_identifier
получает объем памяти используемой при кэшировании реального пути
возвращает строку содержащую версию сервера mysql к которому также подключено расширение mysqli
выполняет поиск соответствий регулярному выражению в многобайтной строке
создает обычный или специальный что чаще файл
закрывает набор curl дескрипторов
ømq devices can do intermediation of addresses services queues or any other abstraction you care to define above the message and socket layers. -- zguide
если параметры не были отправлены то http_response_code получит текущий код статуса
получение возможного типа изображения
определяет является ли имя файла директорией
возвращает имя таблицы которой принадлежит заданное поле
извлекает все полученные записи последнего запроса
получает uri пространства имен узла по префиксу prefix
добавляет одну или несколько опций к уже установленным
данная функция позволяет переопределить текущий домен для одного сообщения
функция производит проверку синтаксиса выбранного кода на наличие ошибок
добавляет объект object в контейнер и дополнительно может ассоциировать этот объект с какими-то данными
рисует линию соединяющую две точки
регистрирует функцию в spl очереди метода __autoload
определяет допустимо ли текущее значение итератора то есть возможна ли работа с этим объектом
извлечение всего архива или его части в указанное место назначения
после того как сокет socket был создан при помощи функции socket_create() привязан к имени при помощи функции socket_bind() и ему было указано слушать соединения при помощи функции socket_listen() эта функция будет принимать входящие соединения на этом сокете
возвращает путь к текущему элементу directoryiterator
возвращает массив состоящий из элементов входящего массива input которые соответствуют заданному шаблону pattern
получает длину строки string
возвращает идентификатор жанра
возвращает объект-итератор iterator скрытый внутри объекта
возвращает новый объект imagick с текущей последовательностью изображений
связывает весовые коэффициенты полей с их названиями
возвращает строку str в которой первый символ каждого слова переведен в верхний регистр если этот символ является буквой
возвращает сообщение исключения
вычисляет остаток от деления нацело числа n на d
устанавливает ftp-соединение с указанным сервером host
устанавливает права доступа к указанному удалённому файлу в значение mode
закрывает переданный указатель на файл bzip2
возвращает строку экранированную обратными слешами перед символами указанными в параметре charlist
задает функцию обратного вызова которая будет принимать и обрабатывать информацию о состоянии задания передаваемую обработчиком заданий
добавление не версионированного пути path в репозиторий по адресу url
возвращает текущую пару ключ / значение из массива и смещает его указатель
эта функция отключает обработчик url и удаляет все значения установленные функцией output_add_rewrite_var() или механизмом сессий если session.use_trans_sid был установлен для session_start() 
получает строку для помещения перед текущим элементом
возвращает массив с данными разбора строки date либо false в случае ошибки
аналогична но предоставляет намного больше контроля над исполнением программы
пытается определить возможности браузера пользователя производя поиск информации о браузере в файле browscap.ini
задает текущее активное значение настройки magic_quotes_runtime
проверяет является ли метод деструктором
возвращает объект содержащий информацию о колонке
возвращает копирайт api imagemagick в виде строки
разбирает строку str которая должна иметь формат строки запроса url и присваивает значения переменным в текущем контексте
устанавливает режим сортировки результатов
возвращает один символ после распаковки из gz-файла по его указателю
функция возвращает трехсимвольный код страны соответствующий имени хоста или ip-адресу
эта функция идентична функции date() за исключением того что возвращает время по гринвичу gmt 
возвращает идентификатор изображения представляющего изображение полученное из файла с заданным именем
возвращает последнюю найденную ошибку
создает новый объект класса recursiveiteratoriterator на основе объекта recursiveiterator
получает числовой код ошибки агента
возвращает ссылку на текущий объект imagick с указателем на изображение в правильной последовательности
возвращает время последнего доступа к текущему элементу directoryiterator
создаёт два соединённых и неразличимых сокета и сохраняет их в массиве fd
возвращает время рассвета для определенных дня заданного аргументом timestamp и местоположения
устанавливает значение настройки xml анализатора
читает данные из открытого ранее дескриптора директории
возвращает список методов в виде массива
возвращает информацию о версии curl
отправляет ftp-серверу команду list и возвращает результат в виде массива
определяет является ли текущий элемент directoryiterator
пытается клонировать исключение что приводит к фатальной ошибке
делает снимок окна или его клиентской части используя windows обработчик свойство hwnd com объекта 
обнуляет все выставленные на данный момент фильтры
создает объект класса reflectionfunction
освобождает память которая была выделена для postscript type 1 шрифта
в html некоторые символы имеют особый смысл и должны быть представлены в виде html сущностей чтобы сохранить их значение
удаляет value из начала очереди
эта функция возвращает значение атрибута соединения с базой данных
записывает содержимое строки string в файл
посылает сообщение электронной почты
проверяет является ли функция внутренней то есть не определенной пользователем
проверяет существует ли метод класса в указанном объекте object
возвращает текущий вызов стека в виде массива
возвращает целое значение переменной var используя указанное основание системы исчисления base для преобразования по умолчанию основание равно 10 
находит первое вхождение подстроки needle в строке haystack и возвращает часть haystack
функция устанавливает флаг o_nonblock на сокете указанном в параметре socket
добавляет сервер задач к списку серверов которые могут использоваться для выполнения задачи
нет действия
переводит файловый указатель на заданную строку
возвращает строку string в которой перед каждым переводом строки \r\n \n\r \n и \r вставлен < br / > или < br > 
возвращает строку созданную с использованием строки формата format
отправляет электронную почту
создает группу запросов
выполняет над строкой str преобразование rot13 и возвращает полученную строку
ищет следующее простое число
функция возвращает символьное имя для значения php-лексемы token
проверяет является ли число точным квадратом т.е
добавляет файл папку или символическую ссылку path в рабочую копию
изменяет права доступа к файлу / директории
синхронизирует текущее состояние файла с физическим устройством
открывает базу данных dbase с заданным режимом доступа
данная функция возвращает время последней записи блоков файла иначе говоря изменения содержания файла
переключает вывод в текстовом или бинарном режиме
сравнивает value1 с value2
возвращает последний код возврата для этого задания
изменяет пароль пользователя указанного в username
задает имя класса которое будет использовать метод splfileinfo::openfile()
моментально обновляет указанные значения атрибутов в указанных документах
возвращает размер поля field
увеличивает числовое значение записи на величину указанную в параметре offset
переход к следующему элементу
эта функция берет узел node класса simplexml и превращает его в узел domelement
преобразует исходный узел в uri применяя таблицу стилей которая установлена с помощью метода xsltprocessor::importstylesheet()
устанавливает значение атрибута с пространстве имен namespaceuri и локальным именем name
объектно-ориентированный стиль constructor 
генерирует пригодное для хранения представление переменной
проверяет существование соседних узлов
разрывает ассоциацию переменной с цветом которая ранее была создана функциями imagecolorallocate() или imagecolorallocatealpha()
удаляет экранирующие обратные слеши
возвращает код ошибки последнего вызова mysqli_connect()
проверяет существует ли смещение
этот метод является статическим вариантом closure::bindto()
создает новый pdf-файл с использованием предоставленного имени файла
перемещает указатель directoryiterator на определённую позицию
эта функция включает буферизацию вывода
создает постоянное соединение с сервером oracle и выполняет аутентификацию
посылает на сервер задач и всем слушающим клиентам статус текущей работы
функция возвращает массив аналогичный по структуре возвращаемой соответствующей функцией c
посылает данные всем серверам задач и смотрит какие из серверов ответят
устанавливает кодировку для входных / выходных документов
возвращает mime-тип содержимого файла используя для определения информацию из файла magic.mime
перемещает внутренний указатель объекта iterator на следующий элемент или на первый элемент если текущий элемент был последним
функция выполняет сетевое блокирующее действие до завершения запроса подготовленного функциями yaz_connect() yaz_search() yaz_present() yaz_scan() and yaz_itemorder()
проверяет подключен ли клиент
выполняет заданный xpath запрос expression
возвращает строку содержащую число number представленное в системе счисления tobase
запускает подготовленный запрос
возвращает заданное смещение ключ 
установка флага альфа сопряжения для использования эффектов наложения изображений встроенной libgd библиотеки
обратите внимание что эта функция учитывает регистр символов и в отличие от strcmp() не безопасна для обработки данных в двоичной форме
форматирует интервал
проверяет есть ли у текущего элемента внутреннего итератора дочерние элементы
получает список модификаторов
восстанавливает встроенную обёртку ранее разрегистрированную при помощи stream_wrapper_unregister()
блокирует выполнение скрипта пока какое-либо из curl_multi соединений не станет активным
получает информацию о версии и возможностях установленной gd библиотеки
объявляет атрибут определяемый узлом attr идентифицирующим элемент атрибутом
получает значение настройки xml анализатора
возвращает ключ soundex для строки str
извлекает значение настройки конфигурации php option
записывает содержимое файла filename в текущую позицию объекта lob
связывает с ldap директорией с указанным rdn и паролем
завершает сеанс curl и освобождает все ресурсы
читает все значения атрибута в записи результата
вызывается по завершении навигации когда метод recursivetreeiterator::valid() впервые вернет false 
сравнивает строку main_str начиная с позиции offset со строкой str
возвращает размер длину изображения в байтах
эта функция создает экземпляр класса domtext
возвращает идентификатор изображения представляющего из себя пустое изображение заданного размера
эта функция удаляет содержимое самого верхнего буфера вывода и отключает эту буферизацию
освобождает ресурсы связанные с дескриптором lob изначально выделенные функцией oci_new_descriptor()
проверяет достигнут ли конец файла
возвращает список классов модуля
возвращает горизонтальный и вертикальный фактор выборки
сравнивает left_operand с right_operand и возвращает целочисленный результат
возвращает флаги связанные с указанным полем
сортирует массив по ключам сохраняя отношения между ключами и значениями
возвращает текущее значение таймаута то есть время в течение которого обработчик ожидает запрос от сервера заданий
получить имя файла где исключение было создано
задает изменяет значение свойства
возвращает идентификатор изображения представляющего изображение полученное из файла с заданным именем
выбирает большой объект из базы данных и сохраняет его данные локально в файловой системе
возвращает xml переданный в последнем soap-запросе
проверяет является ли класс подклассом указанного класса или реализует ли указанный интерфейс
функция позволяет переопределить текущий домен domain для одного сообщения во множественном числе
задает / возвращает текущую кодировку для многобайтового регулярного выражения string
функция сливает элементы двух или более массивов таким образом что значения одного массива присоединяются в конец другого
возвращает строку string в которой все буквенные символы переведены в верхний регистр
эта функция возвращает строку или массив в котором все вхождения search в subject заменены на replace без учета регистра символов 
выполняет поиск совпадений в строке subject с шаблоном pattern и заменяет их на replacement
возвращает количество публичных свойств arrayobject
сортирует массив по ключам в обратном порядке сохраняя отношения между ключами и значениями
определяет является ли данная переменная массивом
добавляет окружность
эта функция проверяет поддерживает ли файловая система содержащая файл расширенные атрибуты
рекурсивно показывает различия двух файлов path1 и path2
создает новый recursivecachingiterator который состоит из переданного итератора iterator 
выводит gd2 изображение в заданный файл filename
получает содержимое текущего буфера и затем удаляет текущий буфер
проверяет задана ли в классе указанная константа или нет
compares one or more image channels of an image to a reconstructed image and returns the specified distortion metrics этот метод доступен если imagick был скомпилирован с версией imagemagick 6.4.4 или старше
создаёт новый экземпляр класса без вызова конструктора
возвращает строку с ошибкой bzip2 произошедшей с переданным указателем на файл
удаляет один или более атрибутов из указанного dn
возвращает внутреннюю информацию о том где было вызвано исключение
работает аналогично memcached::delete() за исключением того что произвольный server_key может быть использован для определения сервера и установки значения с ключом key на конкретный сервер
прекращает выполнение скрипта
в случае успеха возвращает значение настройки конфигурации
создает новый объект sphinxclient
выбирает базу данных и выполняет запрос к ней
возвращает внутренний итератор для текущего элемента
версия для сообщений во множественном числе
подобно это не функция а языковая конструкция
импортирует переменные из массива в текущую таблицу символов
эта функция проверяет являются ли два узла одним и тем же узлом
получает код ошибки xml-парсера
возвращает режим работы
возвращает ширину заданного изображения image
эта функция устарела
создает вертикальное зеркало изображения отражая пиксели вокруг центральной оси x
возвращает содержимое одного поля из набора результата mysql
перемещает указатель на заданную позицию position
создает xml документ из dom представления
проверяет содержит ли ячейка результата запроса значение sql null
принимает соединение на сокете предварительно созданном с помощью функции stream_socket_server()
кодирование строки осуществляется согласно rfc 3986
возвращает строку с обратным слешом перед символами которые нужно экранировать
импортирует php-массив array в новый объект класса splfixedarray
выполняет рендеринг объекта imagickdraw на текущем изображении
функция возвращает имена всех функций определенных в модуле с именем module_name
этот метод вставляет xinclude блоки в объекте класса domdocument
эта функция возвращает количество видео-кадров из swfvideostream
сравнивает два числа
отправляет сообщение об ошибке в лог web-сервера или в пользовательский файл
данный метод выводит изображение на x сервер
сообщает если узел соответствует jste
возвращает содержимое по url repos_url файла в репозитории по состоянию на ревизию номер revision_no необязательный параметр 
возвращает информацию о протоколе mysql
сравнивает два объекта lob / file
возвращает размер массива
отправляет параметризованный запрос на выполнение и не ждет его завершения
закрывает непостоянное соединение с базой данных mysql на которое указывает переданный дескриптор
эта функция разбирает xml строку и помещает данные в 2 массива
проверяет содержит ли объект object в своем дереве предков класс class_name
проверка является ли функция замыканием
отправляет результаты работы клиенту и обновляет статус объекта на завершенный
эта функция удаляет расширенный атрибут файла
возвращает экземпляр reflectionproperty для свойства класса
создает закрашенный многоугольник в заданном изображении image
добавляет одну или несколько настроек к заданным ранее
добавляет данные в базу данных
возвращает массив содержащий информацию о версии каждого доступного memcache сервера
отправляет данные серверу заданий и всем слушающим клиентам 
эта функция является аналогом domdocument::getelementsbytagname но ищет элемент по его id
создание нового domdocument объекта
регистрирует функцию callback которая выполнится после завершения работы скрипта или при вызове функции exit()
останавливает работу компилятора
устанавливает обработчик символьных данных для заданного xml анализатора parser
функция возвращает двухсимвольный код страны соответствующий имени хоста или ip-адресу
сообщает есть ли у заданного узла потомки
определяет является ли текущий элемент directoryiterator исполняемым
возвращает массив элементы которого представляют длины каждого поля текущей строки результирующего набора
возвращает количество единиц в двоичной записи числа
возвращает индекс цвета в палитре изображения ближайшего к заданному rgb значению
возвращает число соответствующее действительному id пользователю текущего процесса
возвращает текст последнего брошенного исключения или причины неудачи при вызове функции
создает новый объект datetimeimmutable с измененной временной меткой
эта функция сортирует массив
посылает исключение возникшее во время выполнения работы
создает пустой объект класса domdocumenttype
возвращает шестнадцатеричное строковое представление crc элемента архива
получает рабочую копию с ревизией revision из репозитория repos и размещает в targetpath
получает список определенных в расширении функций
получает номер текущей строки
накладывает искривляющую матрицу на изображение используя заданный коэффициент и смещение
выбирает следующую строку из результата запроса во внутренний буфер доступный с помощью oci_result() или через переменные заранее определенные с помощью oci_define_by_name()
проверяет является ли текущий узел обычным текстом без какой-либо разметки 
выбирает одно или несколько случайных значений из массива
урезает файл дескриптор которого указан в параметре fd точно до length байт
подсчитывает количество вхождений каждого из символов с asii-кодами в диапазоне 0..255 в строке string и возвращает эту информацию в различных форматах
вставляет записи в таблицу из массива rows
проверяет является ли объект экземпляром класса
извлекает следующую строку и возвращает ее в виде объекта
находит первое вхождение подстроки needle в haystack и возвращает часть haystack
посылает сообщение о провале обработки причем причина этого провала известна в отличие от провала в результате возникновения исключительной ситуации 
копирует дескриптор curl сохраняя его настройки
возвращает критичность исключения
устанавливает комментарий к элементу заданному по имени
отменяет все локальные изменения файлов расположенных в рабочей копии
класс splfileobject не имеет наследников поэтому метод всегда возвращает false
эта функция является псевдонимом: soapheader::soapheader()
функция специфична для сервера apache и является эквивалентом конструкции < !--#include virtual...-- > используемой в mod_include
освобождает память занятую xml анализатором parser
получает имя аргумента
создает точную копию объекта imagick
функция нестабильна и совершенно бесполезна для 99% пользователей
сообщает включена ли буферизация для большого объекта lob 
вставляет строку data в позицию offset
получение детальной информации о элементе по его имени
эта функция не должна вызываться
проверяет все ли символы в переданной строке text являются буквами в нижнем регистре
возвращает ассоциативный массив содержащий записи из строки результата запроса
сортирует записи в массиве по значениям используя функцию сортировки определенную пользователем
возвращает строку str первый символ которой был преобразован в нижний регистр если этот символ является буквой
задает значения параметров string и pattern для функций регулярных выражений
похож на метод memcached::set() но вместо одной пары ключ / значение работает с несколькими записями переданными в items в виде массива
отменяет все измения у позиции с заданным индексом
задает функцию обработчик неразобранных объявлений сущностей для xml анализатора parser
выполняет переданное xpath выражение expression и возвращает типизированный результат если это возможно
декодирует строку data закодированную при помощи base64
проверяет доступно ли значение по умолчанию аргумента
устанавливает соединение с сокетом ресурса hostname
возвращает строку string перевернутую задом наперед
устанавливает флаг сохранять всю информацию альфа компонента в противовес одноцветной прозрачности и сохраняет png изображение
освобождает ресурсы занимаемые объектом коллекции
устанавливает значение атрибута с именем name
проверяет является ли метод статическим
извлекает список зарегистрированных потоков доступных на запущенной системе
функция использует тест миллера-рабина для определения является ли число простым
задает обработчик инструкций препроцессора pi для xml анализатора
устанавливает имя класса итератора массива возвращаемое arrayobject::getiterator()
устанавливает блокирующий или неблокирующий режим на потоке stream
возвращает имя текущего рабочего каталога
возвращает массив содержащий все возможные значения жанра которые может содержать id3-тег
добавляет новый узел атрибута attr в элемент
получает inode текущего скрипта
возвращает размер объекта lob
эта функция кодирует строку data кодировкой utf-8 и возвращает закодированный вариант
устанавливает ширину и высоту для потокового видео
функция получает массивы потоков и ждёт изменения их статуса
функция похожа на функцию exec() в том что она выполняет команду command
возвращает объект со свойствами соответствующими колонкам в обработанном ряду и сдвигает внутренний указатель результата вперед
разрешенный диапазон дат для григорианского календаря с 4714 года до н.э
задает настройки итератора
перемещает указатель на одну позицию вперед
экспортирует reflectionmethod
возвращает имя элемента массива вместе с путем 
получает текущее значение
создаёт пару связанных неразличимых потоковых сокетов
возвращает арккосинус числа arg в радианах
добавляет value в конец очереди
открывает файл по заданному пути path в режиме доступа mode
закрывает базу данных идентификатор соединения с которой передан через аргумент dbhandle
определяет уровень доступа группы для пользователя указанного в параметрах
возвращает имя файла текущего элемента directoryiterator
функция закрывает дескриптор используемый для записи в системный журнал
устанавливает начальное число генератора случайных чисел в seed или случайное число если seed не указан
получает список разрешений для файла
возвращает гиперболический синус arg определяемый как exp arg - exp -arg / 2
этот метод вызывается всякий раз когда данные читаются из присоединенного потока или записываются в него такими функциями как fread() или fwrite() 
проверяет все ли символы в переданной строке text являются управляющими символами
получает путь xpath по которому расположен узел
извлекает ключевые слова из query используя настройки tokenizer лексера для указанного index опционально с частотной статистикой по ключевым словам
устанавливает эффективный идентификатор пользователя
переключает указанный dn в более удобную для пользователя форму снимая изоляцию с имен типов
возвращает количество полей в результате запроса
возвращает количество рядов результата запроса
представление в виде строки
возвращает интерфейсы
сортирует записи в массиве по значениям используя алгоритм натуральной сортировки с учетом регистра
определяет объем текста сообщений возвращаемых функциями pg_last_error() и pg_result_error()
эта функция устанавливает параметры соединения с ftp сервером
возвращает число соответствующее эффективному идентификатору пользователя текущего процесса
получает документируемый комментарий
возвращает номер версии базы данных временных зон
получает ключ текущего элемента
возвращает высоту изображения
похожа на c-версию этой функции в том что она выполняет указанную команду command и выводит её результат
переводит итератор на следующий узел
создаёт символическую ссылку на существующий файл target с именем link
создает новый объект класса domprocessinginstruction
возвращает номер последней строки определения пользовательского класса
возвращает имя базы данных соответствующей ресурсу postgresql connection
получает группу файла
рисует дугу окружности с заданными координатами центра
выводит arg
проверяет является ли класс пользовательским а не встроенным
определяет будет ли pspell_save_wordlist() сохранять замещающие пары вместе со списком слов
определяет количество директорий и файлов совпадающих с glob-выражением
выводит или сохраняет в формате wbmp заданное изображение image
функция разбирает переданную строку source в языковые лексемы php используя лексический сканер zend engine
возвращает текущий элемент с префиксом и суффиксом
проверяет является ли текущий элемент итератора допустимым для данного фильтра
эта функция сортирует массив в обратном порядке таким образом что сохраняются отношения между ключами и значениями
возвращает значение ячейки таблицы результата запроса
считывает length байт из файла с описателем fd начиная с байта offset
эта функция возвращает объект класса domnodelist - список всех элементов-потомков текущего узла с указанным именем тэга name в порядке в котором они встречаются при обходе дерева
возвращает количество кортежей сущностей / записей / рядов затронутых запросом insert update и delete queries
читает все значения атрибута в записи результата
возвращает сжатую версию входных данных data аналогично выводу программы gzip
возвращает тип указанного файла
возвращает величину глубины объекта imagick в виде строки
добавляет фильтр filtername к списку фильтров прикреплённых к потоку stream
класс splfileobject не имеет потомков поэтому этот метод возвращает null
эта функция возвращает строку str с удаленными из конца строки пробелами
экранирует специальные символы в unescaped_string принимая во внимание кодировку соединения таким образом что результат можно безопасно использовать в sql-запросе в функции mysql_query()
возвращает номер последнего брошенного исключения или причины неудачи при вызове функции
прикрепляет переменную variable к метке bv_name
задает замещающий символ на случай когда кодировка входных данных задана неверно или код символа не существует в кодировке выходных данных
возвращает название базы данных из вызова к mysql_list_dbs()
скачивает удалённый файл с ftp-сервера и сохраняет его в локальный файл
указывает выполняется сейчас задание или нет
помещает value в конец двусвязного списка
создает жесткую ссылку new_path на файл указанный в path
устанавливает буфер чтения
производит заливку области ограниченной цветом border
является callback-функцией функции ob_start()
возвращает inode текущего элемента directoryiterator
задает функцию обратного вызова для обработки ситуации когда задание выполнить не удалось
возвращает список ошибок возникших при выполнении последней операции над запросом которая может завершаться успешно или неуспешно
получает число присоединенных итераторов
вызывается чтобы начать навигацию после первого вызова recursiveiteratoriterator::rewind() 
рисование углем
эта функция возвращает список имён расширенных атрибутов файла
возвращает информацию о состоянии файла в result аргументе callback
регистрирует имя функции на сервере заданий и дополнительно задает таймаут
обрабатывает результат поиска ldap
поиск в контексте пространства имен для данного префикса
конструктор класса reflectionparameter
создание нового изображения на основе части gd2 файла или url
возвращает ассоциативный массив array содержащий информацию о дате представленной меткой времени timestamp или текущим системным временем если timestamp не был передан
возвращает формат конкретного изображения в последовательности
закрывает дескриптор объекта lob или file
получает записи из базы данных как из индексированного массива
шифрует и подписывает переданный в параметре plaintext текст ключами которые были установлены gnupg_addsignkey и gnupg_addencryptkey ранее и возвращает зашифрованный и подписанный текст
описывает тип используемого соединения указанного переданным дескриптором соединения включая имя хоста
преобразует символы строки string str в кодировку to_encoding
запрашивает у memcache несколько записей ключи которых переданы в массиве keys
во время выполнения задания отправляет предупреждение
эта функция является псевдонимом: soapvar::soapvar()
получает поддерево корнем которого является текущий элемент
удаляет экранирующие символы
выполняет одиночное задание и возвращает строковое представление результата
создает arrayiterator типа object
окружает изображение рамкой с цветом установленным в объекте imagickpixel
выводит стек вызовов функций
функция определяет mime-тип для константы imagetype
проверяет является ли свойство общедоступным public 
производит подсчет объектов в контейнере
функция пытается получить временную зону по умолчанию по порядку следующими способами: чтение настройки временной зоны с помощью функции date_default_timezone_set() если применимо только до версии php 5.4.0: чтение переменной окружения tz если она не пуста чтение значения ini настройки date.timezone если задана только до версии php 5.4.0: опрос операционной системы если поддерживается и разрешено ос 
пытается создать базу данных на сервере с которым ассоциирован переданный дескриптор соединения
подсчитывает количество слов входящих в строку string
проверяет содержит ли узлы двусвязный список
возвращает объявленное пространство имен в документе
работает аналогично memcached::replace() за исключением того что произвольный server_key может быть использован для определения сервера и установки значения с ключом key на конкретный сервер
вызывает функцию и передает ей аргументы в виде массива
проверяет является ли свойство частным private 
сравнивает array1 с одним или несколькими другими массивами и возвращает значения из array1 которые отсутствуют во всех других массивах
получает класс из контроля типа для параметра в виде объекта reflectionclass
устанавливает внутренний указатель array на последний элемент и возвращает его значение
удаляет объект object из контейнера
возвращает расширение файла
возвращает подстроку строки string начинающейся с start символа по счету и длиной length символов
создает объемное изображение
получает текущий элемент представляющий собой структуру данных
возвращает информацию о существующем потоке stream
проверяет работает ли соединение с сервером
возвращает число столбцов затронутых последним запросом для соединения указанного в link
функция возвращает список заголовков передаваемых браузеру / клиенту
убирает экранирование спецсимволов в значениях типа postgresql bytea
посылает данные на все сервера и определяет какие из них выведут эти данные в выходной поток
функция возвращает строку с информацией о последнем выполненном запросе к базе данных
устанавливает постоянное соединение с сервером mysql
эта функция создает новый узел-элемент с соответствующим пространством имен
этот метод выполняется при использовании метода count() объекта countable
устанавливает значение тайм-аута на потоке stream равное сумме параметров seconds и microseconds
возвращает идентификатор группы текущего процесса
получает ресурс результата асинхронного запроса запущенного функциями pg_send_query() pg_send_query_params() или pg_send_execute()
эта функция полезна для получения множества переменных без многократного вызова функции filter_var()
удаляет объект imagick и освобождает все ресурсы связанные с ним
возвращает информацию о параметрах и опциях из потока или контекста
возвращает домашний url библиотеки imagemagick
эта функция возвращает строку input дополненную слева справа или с обоих сторон до заданной длины
фиксирует транзакцию соединения connection
конвертирует строку из формата utf-16 в формат utf-8
загружает локальный файл на ftp-сервер
считывает следующую запись в zip-архиве
возвращает идентификатор изображения представляющего изображение полученное из файла с заданным именем
итеративно применяет callback-функцию callback к элементам массива array и таким образом сводит массив к единственному значению
возвращает имя поля field из результата запроса
расшифровывает и проверяет подпись переданного текста и возвращает информацию о подписи
записывает данные в большой объект начиная с текущей позиции внутреннего указателя
возвращает индекс для заданного цвета в палитре изображения
переводит число дней в юлианском летоисчислении в дату по французскому республиканскому календарю
получает часть строки str определенную параметрами offset и length
возвращает длину строки string
позволяет вам отключить уже определённую обёртку потока
экспортирует отображение функцию
вызывается по завершении навигации когда метод recursiveiteratoriterator::valid() впервые вернет false 
отменяет все измения у позиции с заданным именем
эта функция рассчитывает и возвращает параметры рамки вокруг truetype текста в пикселах
возвращает последний возвращённый код gearman
получает в качестве параметра errno код ошибки сокета возвращаемый функцией socket_last_error() и возвращает соответствующий текст с разъяснением
задет информацию о клиенте для трассировки oracle
функция делит n на d
возвращает сообщение об ошибке последнего вызова функции mysqli который может успешно выполниться или провалиться
получает уведомления сгенерированные командой sql notify
возвращает битовую маску модификаторов для данного метода
устанавливает комментарий к zip-архиву
создает массив содержащий диапазон элементов
возвращает ассоциативный массив с подробной информацией о заданной дате
установка / получение текущего языка
проверяет есть ли у текущего элемента потомки
эта функция возвращает количество дней в месяце month года year для заданного календаря calendar
меняет текущую директорию на заданную аргументом
возвращает размер связанный с объектом imagick в виде массива с ключами columns столбцы и rows строки 
изменяет существующие записи в каталоге ldap
создаёт жесткую ссылку
функция возвращает полное название страны соответствующий имени хоста или ip-адресу
читает множественные записи из заданного результата и затем читает атрибуты и множественные значения
функция возвращает копию массива array дополненного до размера size элементами со значением value
наносит текст text поверх изображения используя truetype шрифт
возвращает качество сжатия объекта
функция возвращает текущую метку времени unix с микросекундами
считывает символ из переданного указателя на файл
эта функция идентична функции ereg_replace() за исключением того что игнорирует регистр при сравнении алфавитных символов
возвращает читабельное описание ошибки с кодом error_code полученного из функции sqlite_last_error()
возвращает true если файл существует и доступен для чтения
устанавливает xml-rpc тип base64 или datetime для значения строки php
задает максимальную глубину вложенности элементов
вызывается во время десериализации объекта
проверяет корректность подытераторов
возвращает строку string в которой все буквенные символы переведены в нижний регистр
заключает строку в кавычки если требуется и экранирует специальные символы внутри строки подходящим для драйвера способом
проверяет является ли данная переменная строкой
создает новый xml анализатор с поддержкой пространств имен и возвращает ссылающийся на него ресурс который можно использовать в других xml функциях
эта функция преобразует число gmp в обычное целое число php integer 
удаляет пробелы или другие символы из начала строки
возвращает количество меток параметров в подготовленном запросе
возвращает новый объект класса gearmantask
добавляет новое изображение к объекту imagick из текущего положения исходного объекта
вставляет value в кучу
вызывает функцию для каждого элемента в итераторе
возвращает нормализованный hsl-цвет описанный объектом imagickpixel каждое из трех значений является дробным числом между 0.0 и 1.0
проверяет является ли данная переменная числом с плавающей точкой
получает строку из указанного дескриптора
создает новый объект итератора файловой системы на основе аргумента path
возвращает ширину символа шрифта
получает номер текущей строки для заданного xml-парсера
снимает регистрацию всех ранее зарегистрированных функций на всех серверах заданий
возвращает составной оператор связанный с изображением
эта функция возвращает названия и значения атрибутов установленные в xml теге
возвращает родительский узел текущего узла
восстанавливает данные контейнера из строки и добавляет их в текущий контейнер
экспортирует отражённый модуль
ведёт себя подобно current() но с одним отличием
создает splfileobject object файла
запускает sql запрос на выполнение и возвращает количество строк задействованых в ходе его выполнения
устанавливает соединение с базой данных postgresql
возвращает индекс цвета в палитре изображения ближайшего к заданному rgb значению а также alpha уровню
сохраняет содержимое объекта lob в файл
