определяет кодировку символов в строке string str
выводит отрывок phpinfo() касающийся заданного расширения
используется после смены обработчика исключений функцией set_exception_handler() чтобы вернуть предыдущий обработчик который может быть как встроенной функцией так и определенной пользователем 
возвращает нумерованный массив содержащий следующую строку из результата запроса
раскрывает все символические ссылки переходы типа / . / / .. / и лишние символы / в пути path возвращая канонизированный абсолютный путь к файлу
получает идентификатор php процесса
ищет записи dns типа type соответствующие host
выводит или возвращает версию с подсветкой синтаксиса кода содержащегося в файле filename используя цвета определенные во встроенной подсветке синтаксиса php
если в качестве единственного аргумента передан массив max() вернет значение наибольшее значение из этого массива
поворачивает систему координат
добавляет переданную в value строку к существующей записи
сравнивает значение value атрибута attribute со значением того же атрибута в записи ldap директории
устанавливает атрибут группировки функцию и режим группировки и включает группировку
добавляет один или несколько серверов задач в обработчик
проверяет допустимо ли значение null для аргумента
загружает данные из файлового дескриптора в удалённый файл на ftp сервере
применяет гамма коррекцию к изображению image согласно заданным входным и выходным настройкам
установка / получение внутренней кодировки скрипта
получает информацию о флагах
задает функцию которая будет вызываться когда обработчику задания необходимо передать промежуточные результаты клиенту до завершения всей обработки
данная функция осуществляет сброс буферизованных данных в файл на который указывает handle
устанавливает смещение внутреннего указателя на строку результата запроса
включает сборщик циклических ссылок устанавливая zend.enable_gc в 1
блокирует или разблокирует файл тем же портируемым способом что и flock()
возвращает имя поля результата запроса result с порядковым номером field_number
функция определяет доступна ли соответствующая база geoip и может ли быть открыта на диске
открывает filename и разбирает его строка за строкой в поисках тегов < meta > 
извлекает узел с заданным значением тэга nodename
проверяет является ли данная переменная скалярным значением
возвращает десятичный эквивалент восьмеричного числа указанного в аргументе octal_string
возвращает подробную информацию о последнем запросе
возвращает информацию о заданном календаре calendar
добавляет задачу для параллельной работы с другими задачами
конвертирует строку из формата utf-32 в формат utf-16
возвращает типы поддерживаемых текущей сборкой php изображений
задает пользовательскую функцию error_handler как обработчик ошибок в скрипте
возвращает размер смещения связанный с объектом imagick
записывает до length байт из str в файл начиная с позиции offset байт от начала файла
этот метод вызывается когда любой splsubject к которому присоединен наблюдатель вызывает splsubject::notify()
возвращает объект imagickpixeliterator для секции изображения
возвращает дескриптор работы для этого задания
проверяет является ли класс итерируемым iterateable или нет
построчно выводит автора и редакцию для файла из репозитория
снимает регистрацию имени функции на всех серверах заданий
устанавливает таймаут в секундах на соединение к searchd
синхронизирует текущее состояние файла с физическим устройством
вызов этого метода устарел
возвращает количество цветов в палитре изображения
возвращает текущий элемент directoryiterator
эта функция выбирает все элементы-потомки с заданным именем localname и пространством имен namespaceuri
переводит число дней в юлианском летоисчислении в строку содержащую дату по юлианскому календарю в формате месяц / день / год
возвращает псевдослучайное значение в диапазоне( 0 1 
возвращает имя функции с которой ассоциировано задание
ассоциирует данные с текущим объектом контейнера на который указывает итератор
заменяет записи в таблице удовлетворяющие условиям condition данными data
эта функция является оберткой для table_get и table_set
возвращает индексный дескриптор файла
возвращает массив длин для каждого поля содержащегося в последнем ряду результата полученном из mysql
определяет имеет ли элемент дочерние элементы
экспортирует reflection
возводит left_operand в степень right_operand
применяет relaxng проверку документа на соответствие заданному rng источнику
извлекает следующую строку из результирующего набора объекта pdostatement
запускает на выполнение одиночную высокоприоритетную задачу и возвращает строку содержащую результат
возвращает количество предупреждений из последнего запроса
выполняет безопасную с точки зрения многобайтных кодировок операцию strripos() основываясь на количестве символов
делает цвета палитровой версии изображения более соответствующими truecolor версии
получает данные которые обработчик вернул по завершении работы
возвращает сообщение о последней ошибке на заданном соединении connection
загружает ini-файл указанный в аргументе filename и возвращает его настройки в виде ассоциативного массива
возвращает длину участка в начале строки str1 который не содержит ни одного символа из строки str2
возвращает последний выданный сервером код возврата
возвращает строку с номером версии текущего php-анализатора или расширения
задает изображение которое будет использоваться функциями для рисования линий такими как imageline() и imagepolygon() при использовании цветов img_color_brushed или img_color_styledbrushed
устанавливает фактический идентификатор группы текущего процесса
возвращает base возведенное в степень exp
удаляет значение по указанному индексу
работает аналогично memcached::touch() за исключением того что произвольный server_key может быть использован для определения сервера и установки значения с ключом key на конкретный сервер
устанавливает url затрагивающий последующие soap-запросы
делает курсивным заданный шрифт
возвращает индекс текущего внутреннего итератора
возвращает одну из констант memcached::res_* являющуюся результирующим кодом выполнения последнего memcached метода
открывает bzip2 .bz2 файл для чтения и записи
кодирует data алгоритмом base64
читает len байт большого объекта и возвращает их в виде строки
устанавливает несколько параметров для сеанса curl
обрабатывает каждый дескриптор в стеке
объединяет набор изображений в одно большое изображение
этот метод вызывается в результате вызова любой из stat() функций таких как: chmod() только в безопасном режиме copy() fileperms() fileinode() filesize() fileowner() filegroup() fileatime() filemtime() filectime() filetype() is_writable() is_readable() is_executable() is_file() is_dir() is_link() file_exists() lstat() stat() splfileinfo::getperms() splfileinfo::getinode() splfileinfo::getsize() splfileinfo::getowner() splfileinfo::getgroup() splfileinfo::getatime() splfileinfo::getmtime() splfileinfo::getctime() splfileinfo::gettype() splfileinfo::iswritable() splfileinfo::isreadable() splfileinfo::isexecutable() splfileinfo::isfile() splfileinfo::isdir() splfileinfo::islink() recursivedirectoryiterator::haschildren()
возвращает имя файла в котором объявлен класс
закрывает файловый указатель на канал открытый при помощи popen()
продолжает отправку или получение файла в асинхронном режиме
создает новый объект класса limititerator на основе заданного объекта iterator начального смещения offset максимального числа итераций count
получает прототип метода
копирует палитру цветов из изображения source в изображение destination
задает значение толщины линий для рисования отрезков прямоугольников многоугольников эллипсов и т.п
кодирует строку string str по схеме кодирования mime-заголовка
выводит строковое представление внутреннего значения zend
принимает данные из удалённого сокета размером до length байт
данная функция откатывает все незафиксированные изменения соединения oracle connection и завершает транзакцию
добавляет элемент в конец коллекции
этот метод вызывается в результате вызова функций fread() и fgets()
создает префикс / пространство имен контекста для следующего xpath запроса
экспортирует reflected отражённый класс
проверяет является ли узел комментарием
возвращает массив со всеми элементами массива array
создает новый объект класса domattr
закрывает обычное непостоянное соединение с базой данных postgresql соответствующее ресурсу connection
проверяет существует ли объект object в контейнере
возвращает длинное имя id3v2 кадра
эта функция сбрасывает конфигурацию tidy в стандартные значения
переводит число дней в юлианском летоисчислении в дату по иудейскому календарю
смешивает цвет заливки с каждым пикселем изображения
устанавливает указатель на первый элемент directoryiterator
создает массив содержащий переменные и их значения
растягивает или сжимает шрифт font_index если значение extend меньше текущего
эта функция полезна для проверки на наличие ошибки при вызове soap но тогда когда не используются исключения
эта функция отправит содержимое буфера вывода если имеется 
возвращает способ кодирования используемый для сжатия вывода
возвращает идентификатор для первой записи в результате
открывает директорию входящую в zip-архив для чтения
сравнивает array1 с array2 и возвращает разницу
изменяет приоритет текущего процесса на значение указанное в параметре increment
возвращает название таблицы которой принадлежит указанное поле
получает текущий элемент на который ссылается внутренний указатель iterator
проверяет является ли текущий узел частью html-документа
включает вывод отладочной информации если on_off установлен в true и выключает если в false
устанавливает значения для данного смещения
эта функция проверяет был ли объявлен указанный класс или нет
проверяет есть ли в очереди еще элементы
возвращает в начало все присоединенные итераторы
эта функция не должна вызываться
позволяет осуществить простую модель чтения / записи которая может быть использована практически на любой платформе включая большинство вариантов unix и даже windows 
ищет последнее вхождение строки needle в строке haystack и возвращает часть строки haystack
отменяет все изменения сделанные в архиве
записывает строковые данные в участок разделяемой памяти
возвращает стандартизированный код ошибки возвращенный последней командой ldap
функция возвращает id генерируемый запросом к таблице которая содержит колонку с атрибутом auto_increment
отменяет привязку функции обработчика для команды load data infile local которую ранее задали функцией mysqli_set_local_infile_handler()
делает копию до maxlength байт данных от текущей позиции или от позиции offset если указана потока source в поток dest
эта функция проверяет является ли файл filename загруженным на сервер переданным по протоколу http post 
проверяет активна ли в данный момент транзакция в драйвере
сравнивает priority1 с priority2
читает строку из файла и разбирает ее в соответствии с заданным форматом format
копирует данные из одного файла в другой
clone-метод предотвращает клонирование объекта
перемещает указатель на начальную позицию
этот метод позволяет использовать php функции как функции xslt в xsl таблицах стилей
возвращает итератор для элементов-потомков текущего элемента
создает gif файл из изображения image
если в качестве аргументов передан только один - массив чисел min() возвращает наименьшее из них
сортирует массив по ключам сохраняя отношения между ключами и значениями
устанавливает значение для одного или нескольких параметров чтобы использовать в дальнейшем в преобразованиях xsltprocessor
явным образом запускает механизм поиска циклических ссылок
возвращает строку закодированную в формат quoted-printable в соответствии с разделом 6.7 rfc2045
вызывается когда дочерние элементы одного уровня закончились
удаляет пустые текстовые узлы и объединяет соседние текстовые узлы в один узел и со всеми их дочерними узлами
создает директорию в рабочей копии или в репозитории
присваивает значение элементу коллекции с индексом index
запускает предварительно подготовленный sql запрос и передает ему параметры; не ожидает возвращаемого результата
функция преобразует значение number из радианов в градусы
проверяет является ли поток или url локальным или нет
создает новый объект класса reflectionobject
эта функция очищает код ошибки на указанном сокете или последнюю глобальную ошибку сокета если сокет не указан
этот метод вызывается когда фильтр завершает работу обычно вместе с закрытием потока и выполняется после вызова метода flush
этот метод вызывается после iterator::rewind() и iterator::next() чтобы проверить корректна ли текущая позиция
получить текущие флаги
эта функция закрывает ресурс который был открыт функцией finfo_open()
возвращает array содержащий имена файлов и каталогов расположенных по пути переданном в параметре directory
во время выполнения работы отправляет предупреждение
возвращает дополнение до единицы числа a
возвращает имя расширения определенного в классе
получает количество полей колонок в указанной базе данных
копирует файл source в файл с именем dest
добавляет высокоприоритетную фоновую задачу для параллельной работы с другими задачами
вызывает callback-функцию и передает ей в качестве аргументов текущее значение текущий ключ и внутренний указатель
возвращает данные ассоциированные с объектом object
возвращает текущую позицию внутреннего указателя объекта lob
читает содержимое текущего узла включая дочерние узлы и разметку
заполняет кэш страницы данными из файла
возвращает имя функции с которой ассоциировано задание
возвращает номер строки в которой определен узел
задает обработчик события входа в пространство имен
метод устарел начиная с pecl / gearman 1.0.0
читает содержимое файла и помещает его в массив
sqlite может быть скомпилирована либо в режиме совместимости iso-8859-1 либо utf-8
конвертирует 8-битную строку в quoted-printable строку в соответствии с rfc2045 раздел 6.7 
расстояние левенштейна - это минимальное количество вставок замен и удалений символов необходимое для преобразования str1 в str2
возвращает экземпляр reflectionmethod для метода класса
откладывает выполнение программы на указанное число микросекунд
возвращает идентификатор владельца файла
удаляет все сервера memcache из пула делая его снова пустым
возвращает строку содержащую версию текущего расширения stomp
импортирует переменные get / post / cookie в глобальную область видимости
эта функция является псевдонимом: snmp_set_oid_output_format()
закрывает соединение определяемое параметром id
проверяет является ли метод частным private 
закрывает все открытые соединения с серверами memcache
получает значения флагов настроек объекта в том виде как они были заданы методами filesystemiterator::__construct() или filesystemiterator::setflags()
задает обработчик объявления обозначений для xml анализатора parser
возвращает строку ошибки для последней встретившейся ошибки
вычисляет символ якоби для чисел a и p
ищет последнее вхождение строки needle в строке haystack и возвращает часть строки haystack
преобразует текст на иврите из логической кодировки в визуальную
преобразует полноцветное изображение в палитровое
возвращает итератор для текущего элемента
проверяет массив на наличие элементов
возвращает id процесса текущего подключения который можно завершить функцией mysqli_kill()
сравнивает ключи array1 с ключами array2 и возвращает разницу
копирует данные из таблицы в массив
устанавливает функцию которая будет вызвана когда задача получена и поставлена в очередь сервером задач gearman
вызывается когда закончились элементы находящиеся на одном уровне родства
возвращает предыдущее исключение переданное третьим параметром в exception::__construct() 
возвращает текущее состояние ресурса результата запроса либо тэг завершения сервером работы с с этим ресурсом
возвращают статус сообщения об ошибке системный и / или zip-статус
удаляет узел атрибута oldnode из элемента
устанавливает имя хоста и tcp-порт демона searchd
копирует часть src_im в dst_im начиная с координат x y src_x src_y с шириной src_w и высотой src_h
проверяет присоединен итератор или нет
получает номер индексного узла для объекта файловой системы
возвращает soap-заголовки последнего запроса
эта функция сортирует значения так чтобы сохранить связь ключа и значения при этом для сравнения элементов вызывается пользовательская функция
эта функция является псевдонимом: finfo_file()
возвращает строку с сообщением об ошибке для последнего вызова функции которая могла ее вызвать
эта функция возвращает id который нужен для отображения логотипа zend используя встроенное изображение
получает символы разделителя и ограничителя используемые для разбора данных csv
эта функция реализует алгоритм сравнения упорядочивающий алфавитно-цифровые строки подобно тому как это сделал бы человек такой алгоритм называется natural ordering
получает pid сервера базы данных
осуществляет попытку изменения режима доступа указанного файла на режим переданный в параметре mode
возвращает путь к директории где php по умолчанию хранит временные файлы
функция получает len байт данных в буфер buf из сокета socket
производит выборку dns записей соответствующих свойствам хоста hostname
возвращает число строк затронутых в процессе выполнения запроса
делает то же самое что и функция c readlink
функция возвращает числовые и строковые ключи содержащиеся в массиве array
используйте метод быстрого возведения числа left_operand в степень right_operand и получения остатка от деления на modulus
создаёт новый итератор из экземпляра arrayobject
устанавливает временную зону по умолчанию для всех функций даты / времени в скрипте
получает результат выполнения current() зарегистрированных итераторов
устанавливает параметр аутентификации в значение value по ключу key
ищет в заданном тексте subject совпадения с шаблоном pattern
возвращает количество документов в базе данных
возвращает код ошибки выполнения последнего регулярного выражения pcre
проверяет подпись переданного в параметре signed_text текста и возвращает информацию о подписи
возвращает количество строк которые были затронуты в ходе выполнения последнего запроса delete insert или update запущенного соответствующим объектом pdostatement
проверяет задано ли в классе указанное свойство или нет
экспортирует arrayobject в массив
добавляет новый фильтр по диапазону значений для поля типа integer к имеющемуся списку фильтров
initialize the weights using widrow + nguyen’s algorithm
для набора задач ранее добавленных с помощью gearmanclient::addtask() gearmanclient::addtaskhigh() gearmanclient::addtasklow() gearmanclient::addtaskbackground() gearmanclient::addtaskhighbackground() или gearmanclient::addtasklowbackground() этот вызов начинает выполнение в параллельном режиме
рекурсивно очищает рабочую копию директории workingdir завершает любые незаконченные операции и снимает блокировки из рабочей копии
выводит либо сохраняет wbmp версию заданного изображения image
создаёт файл с уникальным именем в определённой директории с правами 0600
проверяет имеет ли текущий элемент допустимое значение
функция преобразует number из градусов в радианы
задействует механизмы сглаживания при рисовании линий и замкнутых многоугольников
эта функция проверяет является ли атрибут id описанным в dtd
добавляет один или более атрибутов к указанному dn
получает текущий узел двусвязного списка
вызывается при открытии обертки потока непосредственно перед вызовом метода streamwrapper::stream_open()
возвращает true если у текущего элемента есть дочерние и false если нет
возвращает ascii-код первого символа строки string
возвращает идентификатор изображения представляющий черное изображение заданного размера
возвращает флаги регулярного выражения
выводит большое количество информации о текущем состоянии php
возвращает произведение значений массива
установка контекста потока для следующей загрузки или записи документа посредством libxml
осуществляет попытку изменения владельца файла с именем filename на владельца чье имя передано в параметре user в виде числа или строки 
загружает определенный пользователем шрифт и возвращает его идентификатор
эта функция берет узел документа dom и превращает его в узел simplexml
сканирует a начиная с бита start пока не найдет бит установленный в 0
этот метод существует только чтобы запретить создание новых объектов класса closure
возвращает true если файл filename существует и доступен для записи
взаимодействует с libeio до тех пор пока все запросы не будут выполнены
изменяет владельца файла дескриптор которого указан в fd
возвращает строку содержащую параметры соединения postgresql connection
возвращает тип sqlt oracle поля field
возвращает svn статус файлов и директорий рабочей копии подвергнувшихся модификации добавлению удалению и прочим изменениям
возвращает все зарегистрированные настройки конфигурации
предотвращает возврат внутреннего итератора в начало
создает новый итератор директории на основе glob-выражения
загружает конфигурационный файл tidy с указанной кодировкой encoding
возвращает позицию в файле по его указателю т.е
удаляет смещение
эта функция обязательно вернет идентификатор цвета для выбранного цвета либо ближайшую возможную его альтернативу
загружает ispell-данные
усредняет набор изображений
возвращает версию подключенной библиотеки sqlite
выбирает одну строку из результата запроса result
возвращает имя класса
получение статических переменных
определяет именованную константу при запуске
эта функция конвертирует читаемый ipv4 или ipv6 адрес если php был собран с поддержкой ipv6 в адрес соответствующий 32-битной или 128-битной бинарной структуре
освобождает дескриптор созданный с помощью oci_new_descriptor()
задает изображение которое будет использовано в качестве элемента мозаичной заливки такими функциями как imagefill() и imagefilledpolygon() при использовании специального цвета img_color_tiled
создает html документ из dom представления
удаляет потоковый фильтр ранее добавленный к потоку при помощи функции stream_filter_prepend() или stream_filter_append()
кодирует бинарные данные data таким образом что они могут быть возвращены в качестве результата запроса так как библиотека libsqlite небезопасна для обработки бинарных данных 
осуществляет перемещение или переименование файла
задание значений различных установок проверки утверждений assert() или получение текущих значений
возвращает имя типа поля
позиционирует курсор на следующем узле пропуская все поддеревья
устанавливает максимальную длину строки для чтения
возвращает текущее состояние сборщика циклических ссылок
создает экземпляр класса domimplementation
скачивает удалённый файл с ftp-сервера
возвращает posix системное сообщение об ошибке связанное с полученным в параметре errno номером
эта функция отправит содержимое буфера вывода если оно имеется и отключит эту буферизацию вывода
выводит значения массива отформатированные в соответствии с аргументом format описанном в документации функции sprintf()
устанавливает файл содержащий замещающие пары
получает значение ключа / f
функция очищает системный буфер вывода php при этом всё содержимое буфера отправляется в браузер пользователя с некоторыми исключениями независимо от используемого backend-а у php cgi web-сервер и т.д.)
читает символ из файла
функция обновляет указанную опцию option новым значением value
аннулирует все существующие записи в кеше незамедлительно по умолчанию или по истечении периода времени указанного в delay
возвращает выражение соответствующее одному из типов параметра statement oci8
проверяет является ли свойство статическим
создает новый объект представляющий временный файл
ищет позицию последнего вхождения подстроки needle в строку haystack
возвращает логин пользователя являющегося владельцем данного процесса
уменьшает числовое значение записи на величину заданную в offset
возвращает дочерние объекты итератора хранящегося внутри parentiterator
этот метод вызывается в результате вызова функции fseek()
вызывается когда следующий элемент становится доступным
возвращает значение по индексу index
удаляет одну или несколько клиентских опций
закрывает ранее открытое постоянное соединение
выводит изображение или последовательность изображений на x сервер
перемещает итератор на следующий элемент массива
заменяет count символов начиная с позиции offset на строку data
вернет размер в байтах содержимого в буфере вывода
этот метод вернет имя указанного файла
проверяет все ли символы в переданной строке text являются видимыми при печати
копирует элементы итератора в массив
возвращает версию apache
эта функция позволяет использовать parser внутри объекта object
указывает было ли определенное свойство установлено
присваивает значение указанному смещению ключу 
эта функция перемешивает элементы массива в случайном порядке
получает значение ключа / status
возвращает обычный php-массив со значениями фиксированного массива
возвращает структуру данных текущего узла
получает запись из базы данных dbase в виде ассоциативного массива вместе с именами соответствующих полей 
эта функция возвращает 8-битную бинарную строку соответствующую указанной строке в кодировке quoted-printable в соответствии с разделом 6.7 rfc2045 а не разделом 4.5.2 rfc2821 т.е
возвращает true если val является бесконечностью положительной или отрицательной например как результат вычисления log 0 или любые другие значения слишком большие чтобы уместиться в float на данной платформе
этот метод вызывается в результате вызова stream_select()
возвращает цветовую палитру изображения
возвращает ширину строки string str
данная функция похожа на функцию fgets() с той разницей что она производит анализ строки на наличие записей в формате csv и возвращает найденные поля в качестве массива
экспортирует отображение
возвращает строку содержащую двоичное представление указанного аргумента number
читает содержимое директории посредством системных вызовов opendir readdir и closedir и либо возвращает имена файлов либо передает массив в качестве аргумента result в функцию callback
возвращает время последнего изменения индексного дескриптора файла
при запуске с помощью диспетчера служб процессу службы необходимо сверяться с ним для мониторинга службы и связи с ней
получает настройки обработчика заданные ранее
представление в виде строки
пытается переименовать oldname в newname перенося файл между директориями если необходимо
связывает php массив var_array с указателем oracle name на массив oracle pl / sql
эта функция удаляет дочерний узел из списка потомков
возвращает текстовое сообщение о последней проверке взломостойкости пароля
отправляет результаты обработки клиенту и обновляет статус работы на завершенный
возвращает число рядов в результирующей выборке
корректно выполняет substr() для многобайтовых кодировок учитывая количество символов
урезает файл дескриптор которого указан в параметре fd точно до length байт
устанавливает значение указанной опции в newval
вырезает подстроку из строки также как mb_substr() но оперирует байтами вместо символов
функция читает данные из ресурса сокета socket созданного при помощи функций socket_create() или socket_accept()
передает на postgresql сервер строку с завершающим нулем
перемещает курсор к следующему узлу в документе
эта функция является псевдонимом: soapparam::soapparam()
добавляет итератор
устанавливает позицию вывода текста на страницу
функция возвращает номер протокола по имени указанном в параметре name как в / etc / protocols
получает данные о процессе открытом при помощи функции proc_open()
возвращает статистику клиента для каждого процесса
создаёт и возвращает контекст потока с опциями указанными в массиве options
этот метод возвращает текущий элемент как объект класса simplexmliterator или null
конвертирует jpeg-файл в wbmp
вычисляет расхождение массивов используя для сравнения данных callback-функцию
возвращает адрес ipv4 по имени узла hostname
включает двоичные iptc данные в jpeg изображение
определяет является ли файл символической ссылкой
