この 関数 は 、 パレット 上 で 指定 し た インデックス index を 指定 し た 色 color に 設定 し ます
プリペアドステートメント を リセット し 、 実行 前 の 状態 に 戻し ます
バイナリ 文字 列 から 画像 を 読み込み ます
は 、 接続 さ れ て おり 区別 でき ない 2 つの ソケット を 作成 し 、 それ を fd に 保存 し ます
指定 さ れ た classes のすべて を 実装 、 拡張 また は 使用 し て 、 指定 さ れ た 名前 の クラス を 新規 作成 し ます
オブジェクト の グローバル 色空間 の 値 を 設定 し ます
文字列 haystack の 中 で 、 needle が 最初 に 現れる 位置 を 探し ます
アイテム が 存在 する かど う か を 調べ ます
キー keydata を インポート し 、 インポート 処理 に ついて の 情報 を 配列 で 返し ます
variant を 、 vt _date あるい は それ に 似た型 から unix タイムスタンプ に 変換 し ます
include _path 設定 オプション の 値 を 、 この スクリプト 内 で だけ 変更 し ます
メソッド を 使用 し て 画像 の サムネイル を 作成 する 方法 を 指定 する 際 に 便利 です
接続 で 使用 する データベース 名 を 取得 あるい は 設定 し ます
は 、 指定 し た postgresql connection リソース で 、 サーバー 側 の デバッグ 出力 が 送 られる tty 名 を 返し ます
dom 実装 が 、 指定 し た 機能 feature を 実装 し て いる かど う か を 調べ ます
オープン し て いる ファイルハンドル から 画像 を 読み込み ます
column _number で 指定 し た カラム の 型 を 返し ます
コンパイル さ れ た データ の 終了 を 示す 文字 \ x 0 0 を 書き込み ます
指定 し た 親 から 、 オブジェクト を 削除 し ます
実行 する sql 文 を 準備 し 、 sqlite 3stmt オブジェクト を 返し ます
画像 を 指定 し た 解像 度 に リサンプリング し ます
string を 、 正規 表現 によっ て 配列 に 分割 し ます
value を 優先 順位 priority で キュー に 挿入 し ます
コマンド と パラメータ を 分割 し て サーバー に 送信 し ます
この 館数 は 、 現在 の ノード の インデックス を 返し ます
クエリ が 返す レコード の 数 を 返し ます
は 、 ウェブベース の phar で 使用 し ます
グレースケール 画像 に 三次 元効 果 を 施し た もの を 返し ます
ユリウス 積算 日 を ユダヤ 暦 に 変換 し ます
は サーバー から の 直近 の メッセージ を 返し ます
ファイル の 統計 情報 を 集め ます
配列 から シンボルテーブル に 変数 を インポート し ます
作成 し た イベントリソース を 解放 し ます
アーカイブ の 全体 あるい は 指定 し た ファイル を 、 指定 し た 場所 に 展開 し ます
ドキュメント で 使用 し て いる 名前 空間 を 返し ます
直近 の クエリ について の 詳細 な 情報 を 返し ます
format によっ て 作成 さ れ た 文字列 を handle で 指定 し た ストリーム に 書き込み ます
modulus で 割っ た 余り を 求める こと を 考慮 し て 、 left _operand の right _operand 乗 を 高速 に 計算 し ます
その 位置 を もと にし て 属性 の 値 を 返し ます
この テキストノード が 空白 のみ を 含む （ あるい は 空 で ある ） かどう か を 示し ます
指定 し た ドキュメント の fdf バージョン 、 あるい は パラメータ を 指定 し なかっ た 場合 は ツールキット api の バージョン を 返し ます
は 、 php .ini を パース し た 後 で 、 設定 ファイル の リスト を カンマ 区切り で 返し ます
ラージオブジェクト の 内部 ポインタ を セット し ます
切り取る サイズ と 画像 の ジオメトリ を 設定 する 便利 な メソッド です
関数 は 、 level が 指す プロトコルレベル で ソケット socket の オプション optname に 値 optval を 設定 し ます
現在 バインド さ れ て いる すべ て の パラメータ を クリア し ます
ファイル の 中身 が 変更 さ れ た 時刻 を 返し ます
引数 str に対し て rot 1 3 変換 を 施し 、 その 結果 の 文字列 を 返し ます
結果 セット の 次行 から 単 一 カラム を 返し ます
imagick オブジェクト の グローバル gravity プロパティ を 取得 し ます
d を 法として n を 計算 し ます
データベース の 指定 さ れ た 位置 から 読み込ん だ データ を 返し ます
画像 の 高さ を 返し ます
現在 の パス の 角 の 形式 を 取得 し ます
画像 の シーン を 取得 し ます
ページ の 表示 を 、 ウィンドウ に あわせる よう 設定 し ます
ファイル が 存在 し 、 読み込み 可能 で ある かど う か を 調べ ます
この メソッド は 、 大文 字小 文字 を 区別 し ない arrayobject :: natsort です
配列 を 受け 取る パラメータ で ある かど う か を 調べ ます
この 関数 は 、 引数 で 渡し た フォーム を 実行 し ます
ファイル の パーミッション を 取得 し ます
予期 せ ぬ エラー が 発生 し た 場合 に 例外 を スロー する かど う か を 切り 替え ます
この ノード が マークアップ さ れ て い ない テキスト で ある かど う か を 調べ ます
現在 の 画像 上 の imagickdraw オブジェクト を レンダリング し ます
デフォルト の スケール を 設定 し ます
は 、 callback の result 引数 で ファイル の 状態 を 返し ます
ドキュメント を 、 指定 し た ファイル に 保存 し ます
画像 ピクセルストリーム の sha - 2 5 6 メッセージダイジェスト を 生成 し ます
デフォルト の イベントループ が 新しい イベント を ポーリング し た 回数 を 返し ます
サービス の 稼動 状況 を 問い合わせ 、 情報 を 配列 で 返し ます
data で 渡し た データ を yaml 形式 に して 返し ます
スペシャルファイル あるい は 通常 の ファイル を 作成 し ます
指定 し た 角度 だけ 画像 を 回転 さ せ ます
任意 の command を ftp サーバー に 送信 し ます
パラメータ value で 指定 し た 値 で 配列 を 埋め ます
この メソッド は 、 fclose に対応 し て コール さ れ ます
linejoin パラメータ を 設定 し 、 パス を 描画 する 際 の 角 の 形状 を 指定 し ます
画像 を 元 の サイズ の 2 倍 に 比例 拡大 し ます
画像 の 型 を 取得 し ます
パラメータ が null を 許可 する かど う か を 調べ ます
は 、 path で 指定 し た ファイル を 切り 詰め て 、 ちょうど length バイト に し ます
マルチバイト 文字 列 の 中 で 正規 表現 に 一致 し た 部分 の 位置 と 長さ を 配列 で 返し ます
この 関数 は 、 アクセスポイント ccl 限定 辞 が 定義 する サーバー に関し て ccl クエリパーサ と rpn へ の マッピング を 設定 し ます
メソッド を 実行 し ます
ldap ディレクトリ 内 の エントリ を 修正 し ます
distinct コマンド は 、 指定 し た キー に 対応 する 区別 できる 値 の 一覧 を 返し ます
関数 は 、 auto _increment 属性 を 持つ カラム が ある テーブル 上 で の クエリ により 生成 さ れ た id を 返し ます
指定 し た 1 個 の ファイル の 監視 を 指示 し ます
データベース へ の 接続 を オープン し ます
ノード の デフォルトドメイン を 返し ます
この 関数 は 、 dom ドキュメント の ノード を 引数 とし 、 simplexml ノード を 作成 し ます
ポリシー 名 を 含む 配列 を 取得 し ます
指定 し た 名前 の プロパティ を 画像 に 設定 し ます
イメージファイル を オープン し ます
は 、 path へ の シンボリックリンク new _path を 作り ます
現在 の 塗り つぶし 色 を 0 から 1 まで の グレー 値 に 設定 し ます
関数 は 、 socket から len バイト の データ を 受信 し て buf に 格納 し ます
この 関数 は 、 与え られ た クラス class の 親 クラス 名 を 配列 で 返し ます
クラス の バイトコード を 読み込み 、 ユーザー 関数 を コール し ます
現在 の リクエスト に おける すべ て の http リクエストヘッダ を 取得 し ます
は ユーザー が 定義 し た ビットマップ を 読み込み 、 その id を 返し ます
この 関数 は 文字列 str の 最後 から 空白 文字 を 取り除き 、 取り除か れ た 文字列 を 返し ます
画像 に 畳み込み 配列 を 適用 し ます
オフセット が 存在 する かど う か を 調べ ます
は 、 php token 値 の シンボル 名 を 返し ます
は 、 insert update delete クエリ により 変更 さ れ た タプル インスタンス / レコード / 行 の 数 を 返し ます
指定 し た チャネル の 尖度 と 歪度 を 取得 し ます
配列 を 、 要素 数 が size の 配列 に 分割 し ます
テキスト の アノテーション で 使う フォント の ポイント 数 を 返し ます
現在 の エントリ の イテレータ を 返し ます
関数 は 、 ホスト 名 あるい は ip アドレス に 対応 する 完全 な 国名 を 返し ます
によっ て 開始 し た テンプレート を 終了 し ます
キー の fingerprint を エクスポート し ます
画像 を 指定 し た ファイル 名 で 書き出し ます
エントリ の 最終 更新 時刻 を 取得 し ます
この 関数 を 定義 すれ ば 、 クラス の オートローディング を 有効 に でき ます
この メソッド が コール さ れる の は 、 フィルタクラス の オブジェクト の インスタンス を 生成 する とき です
は 、 その 名前 を ファイルシステム から 削除 し ます
固定 サイズ の サムネイル を 作成 し ます
登録 さ れ て いる イテレータインスタンス の current の 結果 を 取得 し ます
クラス の メソッド の 配列 を 取得 し ます
指定 し た relation から 前 の タプル の データ を 読み込み 、 tuple に 連想 配列 として 返し ます
この メソッド は 、 直接 コール する こと を 想定 し た もの で は あり ませ ん
この メソッド により 、 独自 に 拡張 し た dom クラス を 登録 する こと が でき ます
指定 し た 名前 の グループ に関する 情報 を 取得 し ます
現在 の php の 状態 に関する 、 多く の 情報 を 出力 し ます
整数 属性 を 、 現在 の radius リクエスト に アタッチ し ます
dom 表現 から html ドキュメント を 作成 し ます
は 、 id 3 タグ に 格納 さ れ て いる すべて の ジャンル を 配列 で 返し ます
この メソッド は 、 エントリ を 新しい 値 で 更新 し ます
ドキュメント の 一時 ストリーム を 巻き戻し ます
この 関数 は 、 variant の コピー を 作成 し て 、 それ を 指定 し た type に 強制 的 に 変換 し ます
テキスト の 印字 用 に 使用 する 現在 位置 を 取得 し ます
トランザクション を 閉じ ず に ロールバック し ます
は 、 大文 字小 文字 を 区別 し ない バージョン の natsort です
は データベース を 選択 し 、 そこで クエリー を 実行 し ます
この メソッド が コール さ れる の は 、 fflush への 対応 を する 場合 や ストリーム を 閉じる 場合 です
は fbsql _field _name 関数 と 同じ です が 、 返 さ れる 内容 が フィールド の 型 と なり ます
レスポンス の http ステータス を 返し ます
は 、 certificate signing request csr を 受け取り 、 それ を outfilename という 名前 の ファイル に ascii テキスト として 保存 し ます
クエリ 結果 に おい て フィールド の 型 を 取得 し ます
現在 の パス に対し て 、 3 つの 制御 点 を 指定 し て 3 次 ベジエ 曲線 を 追加 し ます
文字列 str の 、 start と length で 指定 さ れ た 一部 を 返し ます
この メソッド を 使っ て 、 固定 サイズ の コレクション や 特別 な オプション を 要する その 他 の コレクション を 作成 し ます
は 現在 の サーバー の 状態 を 返し ます
ファイル の 現在 の 行 を 取得 し ます
指定 し た ソケット の リモート 側 に 問い合わせ 、 その型 に 応じ て ホスト / ポート 、 あるい は unix ファイルシステム の パス を 返し ます
は 、 arg の サイン を 返し ます
内部 で の 結果 保持 用 に 割り 当て られ て い た メモリ を 開放 し ます
個人 の 単語 リストファイル を 設定 し ます
すべて の マップエントリ を 返し ます
は 、 yaz _errno で返さ れ た 直近 の エラー 番号 に 対応 する 英語 の メッセージ を 返し ます
は システムログ へ の 書き こみ に 使用 さ れ て いる デスクプリタ を 閉じ ます
filtername で 指定 さ れ た フィルタ を 、 stream に 付加 さ れ て いる フィルタ の リスト に 加え ます
evcheck ウォッチャーオブジェクト を 作り ます
value を json 形式 に し た 文字列 を 返し ます
は 、 文字列 haystack の 中 で の 副文 字列 needle の 出現 回数 を 返し ます
拡張 モジュール の バージョン を 取得 し ます
奇偶 規則 を 使用 し て 現在 の パス を 塗り つぶし ます
name という 名前 の 属性 を 要素 から 削除 し ます
正規 表現 フラグ を 設定 し ます
指定 し た 型 の エントリ の キャッシュ を 破棄 し ます
指定 さ れ た フィールドオフセット に 移動 し ます
result _id に 関連 する クエリ を 実行 し た 後 の sqlca .sqlerrd 0 から sqlca .sqlerrd 5 に関する 擬似 レコード を 返し ます
指定 し た ドキュメント 属性 の 文字 列値 を 取得 し ます
コレクション 間 で オブジェクト を 移動 し ます
は 、 pid の 優先 度 を 設定 し ます
inotify イベント を inotify インスタンス から 読み込み ます
プロセス pid の セッション id を 返し ます
指定 し た 色ペア の 前景 色 と 背景 色 を 取得 し ます
コンパイラ の 実行 を 中止 し ます
により 作成 さ れ た 結果 id から 全 て の 行 を 出力 し ます
二つ の 座標 を 指定 し て 、 現在 の 描画 色 と 線幅 そし て 塗り つぶし 設定 を 使っ た 矩形 を 描き ます
この 関数 は 、 __ autoload 用 の 代替 関数 で ある spl _autoload が 使用 する ファイル 拡張子 を 変更 し たり 調べ たり し ます
ディレクトリ を 先頭 に 巻き戻し ます
現在 の directoryiterator アイテム の inode 番号 を 取得 し ます
画像 を シャープ に し ます
これ は 、 id が 作ら れ た とき に time を 実行 し た 結果 と 同じ もの を 返し ます
指定 さ れ た 変数 を シリアライズ し た もの を 含む 構造 体 を 用い て wddx パケット を 作成 し ます
クエリ 結果 の フィールド について の 情報 を 取得 する ため に 使用 さ れ ます
gmagickpixel オブジェクト を 作り ます
フォーム の 結果 を 表示 する pdf ドキュメント として 、 もと の フォーム と は 別 の もの を 指定 し ます
クラス の 名前 を 取得 し ます
指定 し た data を base 6 4 で エンコード し ます
関数 は 、 国 コード と 地域 コード の 組み合わせ に 対応 する 地域 名 を 返し ます
指定 し た フィールドオフセット を 探し ます
この 関数 は 、 soap コール が 失敗 し た かどう か を 調べ たい が 、 例外 を 使用 し たく ない 場合 に 有用 です
取得 し た 行 に 対応 する 連想 配列 を 返し 、 内部 の データポインタ を 前 に 進め ます
scm に 、 実行 中 の サービス の 現在 の 状態 を 通知 し ます
string の アルファベット 部分 を すべ て 大文字 に して 返し ます ｡
format に 基づき 文字 列 フォーマット さ れ た 文字列 を 出力 し ます フォーマット は sprintf の ドキュメント に 既述 さ れ て い ます 
必須 の 依存 性 、 衝突 する 依存 性 の 両方 を 取得 し ます
path に ある ファイル あるい は ディレクトリ 、 シンボリックリンク を 作業 コピー から 削除 し ます
直近 で 失敗 し た sqlite リクエスト について の 英文 テキスト の 説明 を 返し ます
mask user group で 指定 し た 許可 属性 に 変更 し ます
は 、 ascii 変換 さ れ た pem エンコード さ れ た key を outfilename の ファイル に 保存 し ます
icc 、 iptc あるい は 汎用 の プロファイル を 画像 に 追加 あるい は 削除 し ます
現在 の 要素 の キー を 返し ます
バイナリ 文字 列 から 画像 を 読み込み ます
関数 は 、 対応 する geoip データベース の ファイル 名 を 返し ます
画像 を 指定 し た 解像 度 に リサンプリング し ます
この ブローカー で 発生 し た 直近 の エラー を 返し ます
は 、 既存 の キャッシュ 内 の すべ て の アイテム を 即時 デフォルト あるい は 指定 し た delay の 後 に 無効 化 し ます
stream で 指定 さ れ た ファイルポインタ に buffer で 表さ れ た バイト 数分 だけ 出力 バッファ を 設定 し ます
は 、 ファイル 名 を 変更 し たり 別 の 場所 に 移動 し たり し ます
関数 は 任意 の 画像 ファイル の 大きさ を 決定 し 、 ファイル の 型 と 高さ / 幅 を 表す 文字 列 を 返し ます
内部 イテレータ の フィルタリング し た 子 を 取得 し ます
コレクション の 子 、 あるい は 文書 の 属性 を 取得 し ます
この 関数 は 、 miller -rabin の 確率 的 テスト を 使用 し て 、 その 数 が 素数 か どう か を 調べ ます
コントローラ の モジュール 名 を 取得 し ます
現在 の ノード を 取得 し ます
現在 の 画像 シーケンス を 、 replace で 指定 し た オブジェクト の 画像 で 置き 換え ます
ノード の 文字 データ の 最後 に 文字列 data を 追加 し ます
現在 の プロセス の 実際 の ユーザー id を 返し ます
画像 の ヒストグラム を imagickpixel オブジェクト の 配列 で 返し ます
現在 の php スクリプト に 割り 当て られ た メモリ の 量 を バイト 単位 で 返し ます
は 、 取得 し た 行 （ レコード ） を 配列 で 返し ます
x 方向 および y 方向 の 解像 度 を 取得 し ます
エンコーダ の 型 を 取得 し ます
は 機能 的 に memcached :: deletemulti と 同等 です
指定 し た ドキュメント について 発生 し た tidy エラー の 数 を 返し ます
と ev :: resume が 、 それぞれ ループ の 一時 停止 と 再開 に 対応 し ます
文字列 の 最初 から 空白 もしく は その 他 の 文字 を 取り除き ます
指定 し た dn で ひとつ あるい は 複数 の 属性 の 置換 を 行い ます
クオータレベル の 設定 、 メールボックス 毎 の 使用 状況 を 取得 し ます
テキスト の アノテーション で 使う フォント の ウェイト を 返し ます
一段下 がる とき に コール さ れ ます
これ は 、 カーソル の 反復 処理 が 始まる 前 で も 後 でも コール する こと が でき ます
指定 し た パラメータ により 取得 し た メッセージ 番号 を ソート し ます
描画 に 使う 不透 明度 を 返し ます
データベース から blob データ を 読み込み ます
待機 中 の fam イベント を 調べ ます
この 関数 は 、 属性 が 定義 済み の id かどう か を 調べ ます
バックスラッシュ を 取り除い た 文字列 を 返し ます
クラスメソッド に関する reflectionmethod を 取得 し ます
結果内 の 最初 の エントリ の エントリ id を 返し ます
与え られ た 連想 配列 もしく は 添字 配列 から url エンコード さ れ た クエリ 文字 列 を 生成 し ます
local _socket で 指定 さ れ た 接続 ポイント に 、 ストリーム また は データグラムソケット による 接続 を 作成 し ます
arg の アークタンジェント を ラジアン で 返し ます
radius リクエスト に は 、 リクエスト の 種類 を 指定 する コード および 追加 情報 を 指定 する ゼロ 個以 上 の 属性 が 含ま れ ます
現在 の キー を 返し ます
は 、 プリペアドステートメント を 作成 し ます
エラー の 数 を 取得 し 、 また オプション で エラーメッセージ も 取得 し ます
サーバー 上 の 、 特定 の カーソル を 削除 し たく なる こと が あり ます
は 、 指定 し た data の 署名 を 作り ます
mnogosearch api バージョン 番号 を 取得 し ます
email を 送信 し ます
関数 socket _write は 、 buffer の 内容 を ソケット socket に 書き込み ます
通常 の ssl ピア 証明 書 および ホスト の チェック を 有効 に し ます デフォルト は 有効 です 
関数 で 定義 さ れ て いる パラメータ の 数 を 、 必須 と 任意 の 両方 を 含め て 取得 し ます
frontbase サーバー へ の 持続 的 な 接続 を 確立 し ます
この 関数 は 、 ファイル の 拡張 属性 の 値 を 設定 し ます
ファイルポインタ handle により オープン さ れ た ファイル の 統計 情報 を 取得 し ます
id 3 v 2 . x フレーム 内 の 画像 フレーム に 添付 さ れ た 説明 を 返し ます
は エラー severity レベル の 最小値 を 設定 し ます
関連付け られ て いる プロパティ の うち 、 パターン に マッチ する もの を すべ て 返し ます
座標系 を x 方向 および y 方向 に それぞれ alpha 度 、 beta 度歪 ませ ます
クエリ 結果 から 列 データ を 順 に 返し ます
直近 の db ++ 操作 から の エラーコード を 返し ます
画像 の 圧縮 を 設定 し ます
文字列 を 汚染 さ せ ます
画像 の 各 チャネル の 統計 情報 を 返し ます
文書 に対する 現行 の boost 値 を 取得 し ます
直近 の 転送 に関する 情報 を 取得 し ます
現在 の 画像 シーケンス を 使用 し た 新しい imagick オブジェクト を 返し ます
指定 し た パラメータ で プリペアドステートメント を 実行 する リクエスト を 送信 し 、 その 結果 を 待ち ませ ん
は 、 現在 の リソース に おける ソフトリミット および ハードリミット を 配列 で 返し ます
リモート の ssh サーバー と の 接続 を 確立 し ます
現在 の 要素 の 後 に 置く 文字 列 を 取得 し ます
ローカル また は リモートサーバー の データベース を 停止 し ます
は 、 result リソース に関する エラーメッセージ の 特定 の フィールド を 返し ます
zend .enable _gc を 0 に 設定 し て 、 循環 参照 コレクタ を 無効 に し ます
この 日付 の 文字 列表 現 を 返し ます
名前 を 使用 し て 、 エントリ の コメント を 設定 し ます
ワーカー が シャットダウン し た かどう か を 調べ ます
指定 し た ディレクトリ を 作成 し ます
現在 の 線幅 を 設定 し ます
id 3 タグ の コメント を 返し ます
は 、 指定 し た リンク id が 指す サーバー から データベース 全体 を 破棄 削除 します
database について 説明 する 結果 ポインタ を 返し ます
arrayobject を 配列 に エクスポート し ます
 / status キー の 値 を 取得 し ます
ファイル の グループ を 取得 し ます
後 で pdf _setfont で 使用 する フォント を 検索 し 、 準備 し ます
新しい v 8js オブジェクト を 作成 し ます
は 、 サーバー に 同名 の キー が 存在 し ない 場合 に 限り 、 key という キー で 値 var を 格納 し ます
link で 表さ れる 接続 で 使用 し て いる mysql プロトコル の バージョン を 整数 値 で 返し ます
指定 し た 接続 リソース について の autocommit の 状態 を 設定 あるい は 取得 し ます
指定 し た 範囲 の 全て の テーブルリスト を 得 ます
postgresql は 、 ある 種 の 文字 セット について は サーバー と クライアント の 間 の 自動 文字 コード 変換 を サポート し て い ます
function パラメータ で 指定 し た ユーザー 定義 の 関数 あるい は メソッド を 、 それに 続く 引数 を 指定 し て コール し ます
は 、 id3v 2 フレーム の 長い 名前 を 返し ます
指定 し た バッファ つき イベント を 無効 に し ます
関数 の クローン を 作成 し ます
ディスク 上 の pdf ドキュメント あるい は 仮想 pdf ドキュメント を オープン し 、 あと で 使える よう に 準備 し ます
asxml メソッド は 、 親 オブジェクト の データ を xml version 1 . 0 形式 に フォーマット し ます
指定 し た object について 、 その スコープ 内 で アクセス 可能 な 非 static プロパティ を 取得 し ます
この 関数 は 、 使用 する アルゴリズム および モード の モジュール を オープン します
は 、 パラメータ errno に socket _last _error の 返す ソケットエラーコード を 受け取り 、 対応 する 内容 を 文字列 で 返し ます
zip _entry により 指定 さ れ た ディレクトリエントリ の 圧縮 方法 を 返し ます
与え られ た 文字 列 text のすべて の 文字 が 句読 点 で ある かど う か を 調べ ます
は 入力 文字 列 の まわり に 引用 符 を 付け 必要 で あれ ば 、 入力 文字列 に ある シングルクオート を エスケープ し ます
ひとつ あるい は 複数 の チャネル の 内容 を 再構 築 し た 画像 と 比較 し 、 指定 し た 歪み 係数 を 返し ます
指定 し た object の クラス 名 を 取得 し ます
は 、 haystack の 中 で 最初 に needle が 現れる 場所 を 探し 、 haystack の 部分 文字 列 を 返し ます
は memcache :: connect とほぼ 同じ です が 、 確立 する 接続 が 持続 的 なもの で ある という 点 が 違い ます
は 、 str を 引数 とし 、 正規 表現 構文 の 特殊 文字 の 前 に バックスラッシュ を 挿入 し ます
スレッド 化 さ れ た メッセージ の ツリー を 取得 し ます
プロパティ の 値 を 設定 変更 します
この 関数 は 、 ソート 条件 を 設定 し て z 3 9 . 5 0 sort を 有効 に し ます
指定 し た curl セッション を 実行 し ます
イテレータ 内 の 指定 し た 位置 に 移動 し ます
画面 全体 の スクリーンショット を 取得 し ます
3 つの 制御 点 を 使用 し て 現在 の 点 から ベジエ 曲線 を 描画 し ます
は パッシブモード を オン また は オフ に し ます
例外 を ジェネレータ に スロー し て 、 ジェネレータ を 続行 し ます
ストアドプロシージャ また は リモートストアドプロシージャ へ パラメータ を バインド し ます
データ を 指定 し て 、 チェックボックスツリー の アイテム を 探し ます
指定 し た 位置 の 属性 に カーソル を 移動 し ます
既存 の paradox データベースファイル を オープン し ます
現在 位置 を 新しい 座標 に 指定 し ます
この 関数 は 、 domattr クラス の 新しい インスタンス を 作成 し ます
ftp サーバー 上 に 、 指定 し た directory を 作成 し ます
ストリームラッパー を 閉じる とき に 、 streamwrapper :: stream _flush の 直前 に 呼び出さ れ ます
指定 し た インデックス の 値 を 削除 し ます
平面度 を 設定 し ます
現在 の directoryiterator の アイテム の ベース 名 を 取得 し ます
開い て いる すべ て の 接続 と 、 それぞれ の サーバー の 情報 を 配列 で 返し ます
各 リクエスト の 終了 時 に php がすべて の リソース を 開放 する ので 、 この 関数 を コール する 必要 は あり ませ ん
protected プロパティ で ある かど う か を 調べ ます
画像 の 極値 を 取得 し ます
現在 の セッション を 閉じ ます
ncurses インターフェイス を 初期化 し ます
ファイル から 1 行取り出し ます
メソッド で 与え られ た スタイルシート を 適用 し 、 ソースノード を 文字列 に 変換 し ます
この メソッド は 、 チェックボックスツリー の 選択 さ れ て いる アイテム を 返し ます
この 関数 は 、 現在 の ノード の インデックス を 返し ます
それ 以降 の soap リクエスト で 使用 する エンドポイント url を 設定 し ます
result で 指定 し た id に関連付け られ た 全 メモリ を 開放 し ます
エントリ に対する すべ て の 変更 を 取り消し ます
env 変数 を 取得 し ます
a から b を 引い た 結果 を 返し ます
与え られ た 変数 が 配列 か どう か を 検査 し ます
クエリ から 、 結果 セット の 次 の 行 を 含む 数値 添字 配列 を 返し ます
渡さ れ た オブジェクト が マップ 内 で 参照 さ れ て いる かど う か を 調べ ます
さまざまな readline の 内部 変数 の 取得 あるい は 設定 を 行い ます
現在 の スペリングセッション の 、 直近 の エラー を 返し ます
この メソッド は 、 feof に対応 し て コール さ れ ます
データベース を 指定 し ない 場合 は 、 現在 の データベース を 使い ます
新しい フォーム を 作成 し ます
セッション を 破棄 し ます
は 、 指定 し た key が データベース に 存在 する かど う か を 確認 し ます
属性 の 値 を 取得 し ます
left _operand から right _operand を 引き ます
xml パーサ parser の デフォルト の ハンドラ 関数 を 設定 し ます
は 共有 メモリブロック の 大きさ を 得る ため に 使用 さ れ ます
は 、 infilename という 名前 の ファイル の 内容 について パラメータ signcert および privkey で 指定 し た 証明 書 と 公開鍵 を 用い て サイン を します
指定 し た 文字列 を エスケープ し 、 sql ステートメント で 安全 に 使用 できる よう に し ます
直近 の 警告 メッセージ を 返し ます
ucd ライブラリ に 保持 さ れ た quick _print の 現在 の 値 を 返し ます
新しい オブジェクト を 挿入 し ます
は 、 結果 セット に おける 行 の 数 を 返し ます
指定 さ れ た odbc 結果 id におい て 指定 番号 で 参照 さ れる フィールド の sql 型 を 取得 し ます
ドキュメント を 開い た とき に 、 どの ページ を 表示 する か を 定義 し ます
この 関数 は 、 チェックボックスリソース の さまざまな フラグ を 設定 し ます
この 関数 は 、 現在 の 配列 キー を 返し ます
クラス で 定義 さ れ て いる 定数 を 取得 し ます
dbase データベース から 、 レコード を 連想 配列 として 取得 し ます
関数 ip 2long は 、 インターネット 標準 形式 ドット 表記 の 文字列 表現 から 、 長整 数 表現 の ipv 4 インターネットネットアドレス を 生成 し ます
指定 し た キー の 変数 が ユーザーキャッシュ に 存在 する かど う か を 調べ ます
は 相当 する pdostatement オブジェクト によっ て 実行 さ れ た 直近 の delete insert update 文 によっ て 作用 し た 行数 を 返し ます
index で 指定 し た 添字 が 存在 する かど う か を 返し ます
この 関数 は 、 新しい アイテム を チェックボックスツリー に 追加 し ます
は 、 すべて の memcache サーバー の 状態 を 含む 配列 を 返し ます
この 関数 は 、 キー が 押さ れる まで 結果 を 返し ませ ん
リモートデータベース に 接続 し ます
オブジェクト 内 の 名前 と 値 の ペア の パラメータ を 全て 返し ます
置換 候補 を 保持 する ファイル を 設定 し ます
left _operand に right _operand を 掛け ます
指定 し た options に 基づい て principal を 変更 し ます
画像 の 色度 が 白い点 を 設定 し ます
指定 し た jpeg 画像 を 読み込み ます
php .ini ファイル が 読み込ま れ て いる かど う か を 調べ 、 その パス を 取得 し ます
この メソッド は 、 ラッパー が 初期化 さ れ た たとえ ば fopen や file _get _contents 直後 に コール さ れ ます
mysql _connection と memcache _connection を 関連 づけ ます
反復 処理 が 可能 で ある かど う か を 調べ ます
文字列 str におい て 指定 し た 文字 領域 に ある 数値 エンティティ を 変換 し 、 変換後 の 文字列 を 返し ます
str の 中 で 指定 し た 文字 コード を 文字 コード から html 数値 エンティティ に 変換 し ます
名前 を もと に し て 、 アーカイブ 内 の エントリ を 削除 し ます
は 、 指定 し た 文字 列 value を 既存 の アイテム の 前 に 付加 し ます
blur にじみ フィルタ を 画像 に 追加 し ます
この 関数 は 、 主 に データベース で 修正 さ れ た レコード の 数 を 得る 際 に 有用 です
画像 の 型 を 返し ます
リクエストトークン 、 secret そして 追加 の レスポンスパラメータ を サービスプロバイダ から 取得 し ます
この スレッド が 開始 し た かどう か を 調べ ます
現在 の メールボックス に関する 情報 を 調べ ます
新しい recursivetreeiterator を 、 指定 し た 再帰 イテレータ から 作成 し ます
画像 ピクセルストリーム の sha - 2 5 6 メッセージダイジェスト を 生成 し ます
と似 て い ます が 、 datetimeimmutable で 動作 し ます
関数 dio _fcntl は 、 ファイル 記述子 fd におい て cmd で 指定 さ れ た 処理 を 行い ます
画像 の 解像 度 を 設定 し ます
指定 し た バッファ つき イベント を 有効 に し ます
は 、 指定 し た オプション option の 値 を 新しい 値 value に 更新 し ます
フォント の 名前 を 取得 し ます
xpath メソッド は 、 xpath path に マッチ する simplexml ノード を 検索 し ます
は 、 この 拡張 モジュール により サポート さ れる 全て の ハンドラ の 一覧 を 返し ます
val を 、 指定 し た precision 小数 点以 下 の 桁数 に 丸め た 値 を 返し ます
指定 し た 名前 の 画像 プロファイル を 削除 し て 返し ます
画像 の 周り を 枠線 で 囲み ます
mpeg ファイル の チャンネル 数 を 返し ます
指定 し た リンク id 上 の 、 現在 アクティブ な データベース を 設定 し ます
指定 し た 画像 の 仮想 ピクセルメソッド を 返し ます
ユーザー から の 入力 を 一行 読み込み ます
サーバー 上 で 一定 の 時間 何 も しない 状態 が 続け ば 、 デフォルト で は カーソル は & quot ; 死 に ます &quot ;
エラー の 原因 の 数 を 返し ます
取得 さ れ た 行 に 対応 する 配列 を 返し 、 内部 の データポインタ を 前 に 進め ます
を 使用 し て 、 結果 セット の 現在 の 行 から 指定 し た カラム の 値 を 取得 し ます
ある 数 の 符号 を 反転 し た もの を 返し ます
直近 の sqlstate を 文字列 で 返し ます
「 ファイル 選択 」 フィールド fieldname によっ て アップロード さ れ た ファイル を 展開 し 、 それ を savepath に 保存 し ます
この メソッド は 、 solrdocument インスタンス に フィールド を 追加 し ます
親 ディレクトリ に 移動 し ます
hostname で 指定 し た インターネットホスト を 検索 し て 得 られ た ipv 4 アドレス の リスト を 返し ます
イテレータ を 、 ストレージ 内 の 次 の オブジェクト に 移動 し ます
読み込み 操作 を サポート する ファイルハンドラ を 返し ます
directory 内 の ファイル および ディレクトリ を 配列 で 返し ます
library で 指定 さ れ た php 拡張 モジュール を 読み込み ます
指定 し た データベース の すべ て の コレクション の リスト を 取得 し 、 その 名前 を 文字 列 の 配列 で 返し ます
原罪 の 画像 の gravity プロパティ を 設定 し ます
辞書 リソース を 開放 し ます
は 、 key に対応 する 既存 項目 の 値 を 置換 する ため に 使用 し ます
画像 の 周り に 三次元 の 枠線 を 追加 し ます
インデックス を 使用 し て 、 エントリ の コメント を 設定 し ます
双方向 リンクリスト にまだ ノード が ある かど う か を 調べ ます
全て の 種類 の 注記 の 境界 の 破線 形式 を 設定 し ます
フォント を 検索 し 、 後 に 使用 する ため に 準備 し ます
ファイル の 拡張子 を 取得 し ます
サービスプロセス に 送信 さ れ た 、 直近 の 制御 コード を 返し ます
文書内 の フィールド を 全て 含む 配列 を 返し ます
リクエスト に 固有 の ssl チェック を 調整 し ます
は 、 結果 セット に おける フィールド 数 を 返し ます
データ を 一時 ストリーム から 読み込み ます
リンク に関する 情報 を 取得 し ます
left を right で 割り 、 その 結果 を 返し ます
textflow の 現在 の 状態 を 問い合わ せ ます
現在 の グラフィックスモード を 取得 し ます
画像 ブロック を 、 その プロパティ に 基づい た さまざまな データ で 塗り つぶし ます
シンボリックリンク filename の 所有 者 を user に 変更 しよ う と 試み ます
画像 セクション の imagickpixeliterator を 取得 し ます
val が & # 0 3 9 ; 非数 値 not a number & # 0 3 9 ; で ある かど う か を 調べ ます
right を left から 引き ます
スクリプト が 実行 可能 な 秒数 を 設定 し ます
指定 し た blob オブジェクト を 二重化 し ます
soapserver オブジェクト で 定義 さ れ て いる 関数 の 一覧 を 返し ます
ファイルポインタ handle を 引数 とし 、 ファイル を 指定 し た 長さ 、 サイズ に 丸め ます
は 、 ファイル の コア 内 の 情報 を ストレージデバイス に 同期 さ せ ます
画像 の ヒストグラム を imagickpixel オブジェクト の 配列 で 返し ます
全て の apache レスポンスヘッダ を 配列 として 取得 し ます
メールボックス の リスト を 読み込み ます
オブジェクト の ポイントサイズプロパティ を 設定 し ます
文字列 string を 、 指定 し た 座標 で 垂直 に 描画 し ます
双方向 リンクリスト の 現在 の ノード を 取得 し ます
データベース 上 で 検索 を 実行 する ため の クエリオブジェクト を 取得 し ます
old _file と new _file の 差分 を 含む unified diff を 作成 し 、 ファイル dest に 保存 し ます
は 、 直近 の 検索 に関する ヒット 数 を 返し ます
epoch から 現在 時刻 まで の 秒数 を 返し ます
yaf _config _simple から php の 配列 を 返し ます
スタイルシート 処理 時 の プロファイル 情報 を 出力 する ファイル を 設定 し ます
トランザクション を 開始 し ます
3d ビュー を 作成 し ます
文書 の 配列 表現 を 返し ます
以前 に 読み込ま れ て いる 画像 を ページ に 配置 し ます
あと で ifx _do で 使用 する ため の query を 準備 し ます
直近 の エラー 番号 を 整数 値 で 返し ます
solr サーバー から の 生 の レスポンスヘッダ を 返し ます
この 正規 表現 の 文字 列表 現 を 返し ます
class に parent を 拡張 さ せ ます
は データベース を 同期 し ます
大文字 小文字 を 区別 せ ず 、 文字 列内 で 最後 に あらわ れる 場所 の 書記 素単 位 の 位置 を 見つけ ます
domnodelist オブジェクト から 、 index で 指定 し た ノード を 取得 し ます
現在 の プロセス を 所有 する ユーザー の ログイン 名 を 返し ます
サブパス と ファイル 名 を 取得 し ます
この メソッド は 、 現在 の simplexmliterator 要素 が 子要素 を 持つ かど う か を 調べ ます
デフォルト の 外部 エンティティローダー を 変更 し ます
この 関数 は 、 php から 既存 の 関数 を バイトコード として 読み込み 、 開か れ て いる ファイルハンドル に 書き込み ます
定義 さ れ て いる 定数 を 取得 し ます
読み込み の セカンダリ へ の 分散 について の 情報 は 、 この マニュアル の 問い合わせ の 節 を 参照く ださい
データベースサーバー の 統計 情報 を 返し ます
imagick イテレータ を 最初 の 画像 に 設定 し ます
イテレータ を 、 position で 指定 し た オフセット に 移動 し ます
この メソッド は 、 既存 の ハッシュ を ディスク に 保存 し ます
直近 の snmp リクエスト の エラー 文字 列 を 返し ます
与え られ た 文字 列 text のすべて の 文字 が 制御 文字 で ある かど う か を 調べ ます
imagick オブジェクト の サイズ を 設定 し ます
は 、 リクエスト を リクエストグループ に 追加 し ます
相対 ファイルパス と それ に 対応 する 絶対 ファイルパス と の 対応 を 記録 し た キャッシュ について の 情報 を 取得 し ます
gd 2 ファイル また は url の 指定 し た 部分 から 新規 イメージ を 生成 し ます
三次ベジエ 曲線 を 描画 する 際 の 閾値 を 設定 し ます
サービス を 停止 し ます
後続 の 接続 で 使用 する 、 オブジェクト の データベース ・ エディション を 設定 し ます
指定 し た 拡張 モジュール に関する & quot ; phpinfo & quot ; の 情報 を 表示 し ます
ispell データ 用 に 確保 さ れ た メモリ を 解放 し ます
インストール さ れ た ハンドラ を 削除 し 、 端末 の 設定 を もと に 戻し ます
この 関数 は 、 simplexml クラス の ノード node を 受け取り 、 それ を domelement ノード に 変換 し ます
文字列 haystack の 中 で の 部分 文字 列 needle の 出現 回数 を 数え ます
実行 時 に 、 名前 を 指定 し て 定数 を 定義 し ます
で 設定 し た load data infile local ハンドラ を 削除 し ます
子 プロセス が 終了 し た 原因 が 、 シグナル が 捕捉 さ れ なかっ た こと で ある かど う か を 調べ ます
は 、 frontbase サーバー へ の 接続 を 確立 し ます
新しい filteriterator を 作成 し ます
function の 名前 を rename に 変更 し ます
イテレータ を 追加 し ます
で 開始 し た トレース を 停止 し ます
画像 の 幅 を 取得 し ます
この コンストラクタ は 、 wsdl モード もしく は 非 wsdl モード で soapclient オブジェクト を 生成 し ます
データベース 内 の テーブル および 関連 する メタデータ を 含む 結果 セット を 返し ます
名前 空間 uri および 型名 を 指定 し て sdo _dataobject を 作成 し ます
ひとつ あるい は 複数 の 属性 を 、 指定 し た dn から 削除 し ます
セッション の データ を セッションストレージ から 読み込み 、 その 結果 を php の 内部 処理 用 に 返し ます
外部 イテレータ を 返し ます
この 関数 は ingres _fetch _array に 似 て い ます が 、 配列 の 代わり に オブジェクト が 返さ れる という 違い が 一つ あり ます
は 、 与え られ た bzip 2 ファイルポインタ から 読み込み ます
は 、 ひとつ の 違い を 除い て current と 同じ です
は 、 指定 し た postgresql connection リソース の オプション を 保持 する 文字 列 を 返し ます
画像 リスト から 画像 を 削除 し ます
これ は 、 solrinputdocument :: clear の エイリアス です
現在 の 接続 の 文字 セット で unescaped _string の 特殊 文字 を エスケープ し 、 mysql _query で 安全 に 利用 できる 形式 に 変換 し ます
テキスト の 位置 を 次 の 行 の 行頭 に 移動 し ます
query から キーワード を 抽出 し ます
何 もし ませ ん
blur にじみ フィルタ を 画像 に 追加 し ます
imagick オブジェクト の サイズ と オフセット を 設定 し ます
3 つの ファイル を ひとつ に 統合 し 、 結果 を ファイル dest に 保存 し ます
bzip 圧縮 さ れ た ファイル を 読み込み 、 バイトコード から クラス を 生成 し ます
この ノード が php で ある かど う か を 調べ ます
画像 の 色空間 を 設定 し ます
画像 の クリップマスク を 含む imagick オブジェクト を 返し ます
パス の 描画 用 に 使用 する 現在 位置 を 取得 し ます
は 、 ある 文字 列 から の 部分 文字 列 の 抽出 を mb _substr と 同じ 方法 で 行い ます
この 関数 は 、 gettext が コール さ れ た 際 に 検索 を 行う ドメイン を 設定 し ます
指定 し た パラメータ で プリペアドステートメント を 作成 する リクエスト を 送信 し 、 その 結果 を 待ち ませ ん
ファイル や ディレクトリ の オーナー を 変更 し ます
imagick オブジェクト の フォーマット を 返し ます
sql 文 によっ て 削除 、 挿入 あるい は 更新 さ れ た 行 の 数 を 返し ます
数字 の エージェントエラーコード を 受信 し ます
クエリ に マッチ する すべ て の レコード を 削除 し ます
error _code で 指定 し た エラーコード について の 説明 テキスト を 取得 し ます
対象 に マッチ する ピクセル と その 近傍 の 色 を 変更 し ます
現在 の ドキュメント の 任意 の ページ に 移動 先 を 作成 し ます
は 、 ファイルディスクリプタ fd で 指定 し た ファイル や ディレクトリ の オーナー を 変更 し ます
mysql の character _set 変数 の 値 を 取得 し ます
アノテーション が 初期 状態 で 開い て いる かど う か を 定義 し ます
ベンダー 固有 の 整数 属性 を 、 現在 の radius リクエスト に アタッチ し ます
自動的 に リダイレクト を たどり まず
は 、 mssql _fetch _row の 拡張 版 です
フィールド field の 、 oracle における 生 の & quot ;sqlt &quot ; データ 型 を 返し ます
evchild ウォッチャーオブジェクト を 作り ます
id 3v 1 タグ を 表す オブジェクト を 返し ます
ローカル な 数値 および 通貨 フォーマット 情報 を 有する 連想 配列 を 返し ます
domnamednodemap オブジェクト から 、 index で 指定 し た ノード を 取得 し ます
bevent の 優先 度 を 設定 し ます
変数 が 空 で ある かど う か を 検査 し ます
phar アーカイブ 内 の ファイル を 、 その アーカイブ 内 で 別 の 新しい ファイル として コピー し ます
新しい ドキュメント の インスタンス を 生成 し ます
読み込み の セカンダリ へ の 分散 について の 情報 は 、 この マニュアル の 問い合わせ の 節 を 参照く ださい
画像 の シーン を 取得 し ます
field _number に対応 する フィールド の 幅 を 返し ます
は 、 db ++ クライアントライブラリ に 組み込ま れ た aql インタプリタ を 使用 し て ローカル raw aql クエリ を 実行 し ます
指定 し た エンコーディング encoding で tidy 設定 ファイル を ロード し ます
ストアドプロシージャ の パラメータ を 含む 結果 セット を 返し ます
この 関数 は 、 phar アーカイブ 内 で の ファイル の 大きさ を 返し ます
kerberos データベース に対する すべ て の 変更 を 取り消し 、 kerberos 管理 サーバー と の 接続 は オープン し た まま に し ます
クエリ の ヒント 文字 列 を 取得 し ます
ワーカー が 実行 終了 を 待っ て いる オブジェクト の 数 を 返し ます
は 、 php が 稼動 し て いる オペレーティング システム に関する 説明 を 返し ます
イメージ の パレット で 指定 し た 色 + アルファ 値 の インデックス を 返し ます
サーバー 設定 について の 情報 を 返し ます
読み込ま れ た フォント について の 詳細 情報 を 問い合わ せ ます
取得 さ れ た 行 を 表す プロパティ を 有する オブジェクト を 返し 、 内部 の データポインタ を 前 に 進め ます
curl ハンドル の セット を 閉じ ます
すで に 接続 し て いる ssh 2 サーバー から 、 公開鍵 サブシステム を 要求 し ます
fdf ドキュメント の 文字 エンコーディング を 設定 し ます
引数 number を 8 進数 表現 し た 文字列 を 返し ます
関数 が 名前 空間 内 で 定義 さ れ て いる かど う か を 調べ ます
imagick quantum depth を 文字列 で 返し ます
pdostatement オブジェクト に 関連 付け られ た 結果 セット から 1 行 取得 し ます
は 現在 の セッション から name という 名前 の グローバル 変数 の 登録 を 削除 し ます
と似 て い ます が 、 datetimeimmutable で 動作 し ます
は 、 ファイルディスクリプタ を 複製 し ます
arrayobject の 振る 舞い の フラグ を 取得 し ます
ディレクトリ から 、 glob pattern に マッチ する ファイル を 追加 し ます
画像 に 関連 付け られ て いる 合成 演算子 を 返し ます
は mssql _connect とほとんど 同じく 動作 し ます が 、 違う点 が 2 つあり ます
が指す データベース の 直近 の エラー について の 文字 列表 現 を 返し ます
は 、 msql _fetch _array に 似 て い ます が 、 配列 の 代わり に オブジェクト を 返す ところ だけ が 異なっ て い ます
疑似 乱数 の バイト 文字 列 を 生成 し ます
使用 さ れ て いる 接続 の 型 を 返し ます
ストレージ 内 の オブジェクト の 数 を 数え ます
読み込み バッファ を 設定 し ます
tar / zip アーカイブ 内 の すべ て の ファイル を ディスク に 展開 し ます
は 、 指定 さ れ た エントリ を データベース から 削除 し ます
新しい テーブル 、 あるい は 既存 の テーブル に セル を 追加 し ます
alias という 名前 の エイリアス を 、 ユーザー 定義 の クラス original に対し て 作成 し ます
は 、 指定 し た postgresql connection リソース が 接続 し て いる ホスト の 名前 を 返し ます
現在 の 要素 の 前 に 置く 文字 列 を 取得 し ます
は 、 ファイル の 最終 アクセス 時刻 と 変更 時刻 を 変更 し ます
コンテンツ を レスポンス に 設定 し ます
指定 し た variable _key を 有する 変数 を 共有 メモリ から 削除 し 、 占有 する メモリ を 解放 し ます
その レベル の 再帰 処理 が 終了 し た とき に コール さ れ ます
csv フィールド を 処理 する のに 使わ れる 区切り と 囲み 文字 を 取得 し ます
コンシューマハンドラコールバック として 登録 し た 関数 を コール し ます
この クラス が クローン 可能 か どう か を 返し ます
開い て いる ファイルハンドル から データ を 読み込み 、 バイトコード から クラス を 生成 し ます
は 、 プリンシパル の 名前 を 含む 配列 を 返し ます
文字 オブジェクト を 作成 し ます
gif 形式 の 画像 を 、 シーケンス 内 の ひとつ 前 の 画像 と 比較 し ます
直近 の ldap コマンド により 返さ れ た 、 標準 化 さ れ た エラー 番号 を 返し ます
は 、 文字列 ini の 設定 を 連想 配列 で 返し ます
sqlite 3 データベース を オープン し ます
snmp セッションオブジェクト を 閉じ ます
は 、 取得 する レコード の 構文 を 指定 し ます
画像 パレット 中 の 特定 の 色 の インデックス を 返し ます
文字列 に 変換 し ます
画像内 の スペックルノイズ を 軽減 し ます
現在 の directoryiterator アイテム の inode 修正 時刻 を 取得 し ます
画像 の 大きさ を 取得 し ます
str の 最初 の 文字 が アルファベット で あれ ば 、 それ を 小文字 に し ます
現在 の セッション を 閉じ ます
imagick イテレータ を 最後 の 画像 に 設定 し ます
ファイルシステム の リンク 先 を 取得 し ます
イテレータ の 位置 を 、 画像 リスト 内 の index で 指定 し た 位置 に 設定 し ます
指定 し た 引数 で プログラム を 実行 し ます
magic _quotes _runtime の 現在 アクティブ な 設定 を セット し ます
すべて の 登録 済み 設定 オプション を 返し ます
関数 socket _send は 、 buf から ソケット socket に len バイト の データ を 送信 し ます
直近 の soap レスポンス で 受信 し た xml を 返し ます
スレッド の 状態 を チェック
ランダム な ノイズ を 画像 に 追加 し ます
filename を 削除 し ます
この クラス が 名前 空間 内 で 定義 さ れ て いる かど う か を 調べ ます
指定 し た 接続 リソース 上 で 実行 中 の トランザクション を ロールバック し 、 新しい トランザクション を 開始 し ます
名前 と 国 を 指定 し て 、 似 た 名前 を 取得 し ます
現在 の 内部 イテレータ を 返し ます
2 つの variant の ビット 値 が 等しい か どう か を 調べ ます
a および p の & raquo ;& nbsp ; ヤコビ 記号 を 計算 し ます
は 、 その 時点 で サーバー 上 に key という キー の データ が 存在 する 場合 に 、 格納 さ れ て いる データ を 返し ます
この 関数 は 、 ccl パーサ を 起動 し ます
新しい domxpath オブジェクト を 作成 し ます
まだ 保存 さ れ て い ない 場合 に のみ 、 変数 を データ 領域 に キャッシュ し ます
lzf 拡張 モジュール が 圧縮 時 に 使用 し た 最適 化 指定 を 取得 し ます
odbc 結果 に おける フィールド カラム の 数 を 取得 し ます
は 、 指定 し た 結果 id が 指す ms sql 結果 に関する 内部 行 ポインタ を 指定 し た 行番 号 に 移動 し ます
振る 舞い の フラグ を 設定 し ます
リクエスト を ルーティング し ます
現在 の 要素 が 有効 か どう か を チェック し ます
種々 の assert 制御 オプション を 設定 し たり 、 単 に 現在 の 設定 を 調べ たり し ます
新しい セッション を 作成 する か 、 あるい は 既存 の セッション を 再度 初 期化 し ます
現在 の プロセス の 有効 な ユーザー id を 返し ます
json エンコード さ れ た 文字列 を 受け取り 、 それ を php の 変数 に 変換 し ます
クラス の デフォルトプロパティ 継承 し た プロパティ を 含む を 取得 し ます
現在 実行 中 の zend engine の バージョン を 含む 文字 列 を 返し ます
指定 し た フィールド の javascript アクション を 設定 し ます
指定 し た 色定 義 から 赤 、 緑 、 青 の 各 コンポーネント を 取得 し ます
新しい tokyotyrant オブジェクト を 作成 し 、 オプション で データベース に 接続 する
は 、 結果 id result に関する すべ て の メモリ を 開放 し ます
指定 し た 画像 リソース image の 高さ を 返し ます
は 、 memcache サーバー へ の 接続 が 持続 的 接続 か どう か を 調べ ます
この メソッド は php が & raquo ;& nbsp ;exslt library と 共に ビルド さ れ た かどう か を 判定 し ます
登録 さ れ て いる イテレータインスタンス の key の 結果 を 取得 し ます
指定 し た メールボックス の acl を 取得 し ます
座標系 を 回転 し ます
現在 の セッション を 終了 し 、 セッションデータ を 書き込み ます
新しい 属性 ノード attr を 要素 に 追加 し ます
指定 し た dn を より ユーザー に わかり やすい 形式 に する ため 、 型名 を 取り除き ます
前 に バックアップ し た 関数 を リストア し ます
画像 の レベル を 調整 し ます
利用 可能 な ハッシュ id の 最大 値 を 取得 し ます
現在 の directoryiterator アイテム が 読込 可能 か どう か を 調べ ます
トランザクション を コミット し 、 次 に pdo :: begintransaction で 新た な トランザクション が 開始 さ れる まで 、 データベース 接続 を オートコミットモード に 戻し ます
数 値型 を 有する pdi ドキュメントパラメータ の 内容 を 取得 し ます
修正版 utf - 7 の text を iso - 8 8 5 9 - 1 文字列 に デコード し ます
文字列 str について 、 . \ + * ? [ ^ ] $ の 前 に バックスラッシュ 文字 \ で クォート し て 返し ます
原因 の 型 を 返し ます
関数 は 、 signo が 指す シグナル に関する ハンドラ を 新た に 設定 する か 、 既存 の ハンドラ を 置き 換え ます
テンプレート を レンダリング し て 、 結果 を 返し ます
この メソッド を 使用 する と 、 空 の ディレクトリ が dirname に 作成 さ れ ます
デジタルフィルタ を 適用 し て 、 ノイジー な 画像 の 品質 を 向上 さ せ ます
リターン を 生じ た 子 プロセス が 現在 停止 し て いる かど う か を 調べ ます
画像 ヒストグラム を 均等 化 し ます
読み込み の セカンダリ へ の 分散 について の 情報 は 、 この マニュアル の 問い合わせ の 節 を 参照く ださい
は 、 文字列 を 与え られ た bzip 2 ファイルストリーム に 書き込み ます
指定 し た メールボックス の acl を 設定 し ます
ラベル を 画像 に 追加 し ます
クエリ の 次 の 行 を 内部 バッファ に 取得 し ます
この メソッド は 、 シリアライズ し た ハッシュ を 返し ます
固定 サイズ の サムネイル を 作成 し ます
指定 し た ttf ファイル を 読み込み 、( オプション で その データ を ドキュメント に 埋め込み ます
実行 中 の スクリプト 本体 の 最終 更新 時刻 を 取得 し ます
phar アーカイブ 内 の ファイル の メタデータ を 返し ます
指定 し た インデックス の エントリ に対する すべ て の 変更 を 取り消し ます
現在 の cpu 使用 状況 について の 情報 を 取得 し ます
前 に 行っ た 操作 の エラーコード を 返し ます
新しい paradox オブジェクト を 作成 し ます
この 関数 は 、 インデックス を 使用 し て エントリ の 詳細 情報 を 取得 し ます
識別 および 回帰 の 準備 が でき た モデルファイル を 読み込み ます
field の 精度 を 返し ます
指定 し た ファイル の タイプ を 返し ます
指定 し た 名前 の 属性 の 値 を 返し ます
内部 デバッグ 用 の 出力 を 有効 あるい は 無効 に し ます
仮想 ファイル を 削除 し 、 その データ 構造 体 を 開放 し ます ファイル の 中身 は 削除 し ませ ん 
ファイル file に パッチファイル patch を 適用 し 、 結果 を ファイル に 保存 し ます
この フック が 動く の は 、 ルーティング が 終了 し た とき です
破線 の 「線 」 の 部分 と 「 空白 」 の 部分 の 長さ を 設定 し ます
指定 し た 画像 あるい は 画像 群用 に imagick の インスタンス を 作り ます
で 準備 し た クエリ を 実行 し ます
指定 し た ファイル 名 の ファイル が 、 phar 拡張 モジュール で 利用 できる 正しい 形式 の phar ファイル で ある かど う か を 返し ます
指定 さ れ た クラス から 全 て の メソッド を エクスポート し ます
dir _handle で 指定 し た ディレクトリ の ストリーム を クローズ し ます
現在 の フォント で text を 出力 し ます
画像 の 配置 方法 を 取得 し ます
新しい zip アーカイブ を 、 読み込み / 書き込み / 変更 用 に オープン し ます
この 関数 は 次 の 関数 の エイリアス です
ドキュメント で 現在 使用 し て いる エンコーダ を 定義 し ます
指定 し た バッファ つき イベント の 読み込み タイムアウト および 書き込み タイムアウト を 設定 し ます
この 接続 の 直近 の クエリ について 、 発生 し た 警告 の 数 を 返し ます
その ページ の テキスト の レンダリングモード を 定義 し ます
この 関数 は 、 名前 を 使用 し て エントリ の 詳細 情報 を 取得 し ます
は 、 個々 の memcache サーバー に 問い合わせ て 、 その 時点 で 格納 さ れ て いる すべ て の キー の 配列 を 取得 し ます
グローバル 変数 が セッション に 登録 さ れ て いる かど う か を 調べ ます
新しい 属性 ノード attr を 要素 に 追加 し ます
は 、 指定 し た image を wbmp にし て 出力 あるい は 保存 し ます
画像 の 反復 を 取得 し ます
この 関数 は 、 module _name で 示し た モジュール で 定義 さ れ た 全て の 関数 の 名前 を 返し ます
は 、 指定 さ れ た システムリソース に対し て ソフトリミット および ハードリミット を 設定 し ます
この 関数 は 、 domprocessinginstruction クラス の 新しい インスタンス を 作成 し ます
直前 の 検索 結果 として 保存 さ れ た エントリ の 数 を 返し ます
指定 し た フィールド の 後 の フィールド の 名前 を 返し ます
パーサ の オプション を 設定 し ます
関数 は 、 指定 し た php コード の 文法 チェック （ lint ） を 行い 、 スクリプト の エラー を チェック し ます
多く の 関数 で 利用 さ れる パラメータ を 設定 し ます
インデックス を 使用 し て 、 エントリ 名 を 変更 し ます
例外 の スタックトレース を 返し ます
によっ て 開始 し た ページ を 終了 し ます
は 、 path へ の ハードリンク new _path を 作り ます
この メソッド を 使用 する と 、 画像 全体 を 読み込ま なく て も 画像 の 幅や高さ 、 サイズ そし て フォーマット を 取得 でき ます
引数 hex _string により 指定 さ れ た 1 6 進数 に 等価 な 1 0 進数 を 返し ます
ひとつ あるい は 複数 の オプション を 設定 し ます
は 、 キー key を サーバー から 削除 し ます
は png 画像 を 保存 する 際 に （ 単一色 の 透過 設定 で は ない ） 完全 な アルファチャネル 情報 を 保存 する フラグ を 設定 し ます
指定 さ れ た opcode を ユーザー 定義 の 関数 で オーバーロード し ます
オープン さ れ た モード の 暗号 が ブロックアルゴリズム で ある かど う か を 調べ ます
データベースファイル 内 の レコード の 数 を 取得 し ます
は 、 指定 し た variable _key を 有する 変数 variable の 挿入 また は 更新 を 行い ます
指定 さ れ た フォント と サイズ で 出力 し た 場合 に 、 グリフ の 幅 が 何 ポイント に なる か を 計算 し ます
この 関数 は 、 指定 し た 名前 name の タグ を 持つ すべて の 子孫 要素 から なる クラス domnodelist の 新しい インスタンス を 返し ます
プロパティ の 値 を 取得 し ます
現在 の リクエスト に対する レスポンス として 、 エラー を 表す 内容 を クライアント に 送信 し ます
指定 し た フィールド が 含ま れる テーブル の 名前 を 返し ます
指定 し た 文字数 で 、 指定 し た 文字 を 用い て 文字列 を 分割 し ます
と似 て い ます が 、 datetimeimmutable で 動作 し ます
指定 し た オフセット に 値 を 代入 し ます
グローバルユニーク id guid を 生成 し ます
は 、 最初 の 配列 の 値 を それ 以降 の 配列 の 同じ 要素 の 値 で 置き 換え ます
は 、 最初 の 配列 の 値 を それ 以降 の 配列 の 同じ 要素 の 値 で 置き 換え ます
指定 し た xml パーサ の カレント の カラム 番号 を 取得 し ます
ソースファイルポインタ から ストリームデータ を 取得 し 、 encoding を 適用 し て それ を 出力 ファイルポインタ に 書き込み ます
指定 し た ユーザー user の パスワード を 変更 し ます
既存 の stream に関する 情報 を 返し ます
ふたつ の ファイル の バイナリ diff を 作成 し 、 その 結果 を パッチファイル として 保存 し ます
画像 から チャネル を 分離 し 、 グレースケール 画像 を 返し ます
次 の libxml ドキュメント の 読込 ／ 書き こみ の ため に ストリームコンテキスト を 設定 し ます
現在 の 塗り つぶし の 色空間 を 取得 し ます
は 、 ファイルディスクリプタ fd で 指定 し た ファイル や ディレクトリ の パーミッション を 変更 し ます
既存 の blob を 読み込み 用 に オープン し ます
この メソッド を 直接 呼ぶ の は 推奨 し ませ ん
指定 し た rdn および パスワード を 用い て ldap ディレクトリ に バインド し ます
この 関数 は 、 n を d で 割り ます
楕円 を 画像 上 に 描き ます
現在 の ノード を 取得 し ます
は 、 mod _include の & lt ;! --# include virtual ... --& gt ; と 似 て いる apache 用関数 です
ホスト hostname 上 の hyperwave サーバー へ の 接続 を オープン し ます
マップ の 次 の 要素 に 進み ます
関数 は 、 object _id で 指定 し た snmp オブジェクト の 値 を 取得 し ます
ページ の 塗り つぶし 色 を 定義 し ます
バイナリ 属性 を 、 現在 の radius リクエスト に アタッチ し ます
与え られ た xpath 式 expression を 実行 し 、 可能 で あれ ば 型付け さ れ た 結果 を 返し ます
この 関数 は 、 ファイル の 拡張 属性 の 名前 の 一覧 を 取得 し ます
この 関数 は 次 の 関数 の エイリアス です
使用 可能 な 辞書 の 一覧 と 、 その 詳細 を 返し ます
シーケンス 内 の 特定 の 画像 の ファイル 名 を 設定 し ます
ひとつ あるい は 複数 の チャネル の 範囲 を 取得 し ます
キャッシュ の 内容 を 取得 し ます
指定 さ れ た offset から 始まる 内部 lob データ の 特定 の 位置 を 消去 し ます
この メソッド は 、 ファイル や ディレクトリ そし て リンク から パス 情報 を 除い た ベース 名 を 返し ます
var の boolean として の 値 を 返し ます
ページ の 表示 を 、 ウィンドウ の 高さ に あわせる よう に し ます
は 、 fifo スペシャルファイル を 作成 し ます
データ を 暗号 化 し て 、 それ を 返し ます
は 、 指定 し た ファイル の id3 タグ に 含ま れる すべ て の 情報 を 取得 する ため に 使用 さ れ ます
キュー にまだ ノード が ある かど う か を 調べ ます
directoryiterator の 指定 し た 位置 に 移動 し ます
メソッド によっ て 実行 さ れる sql ステートメント を 準備 し ます
この スレッド が 同期 さ れ て いる かど う か を 調べ ます
画像 の 解像 度 を 設定 し ます
クライアントライブラリ が スレッドセーフ で コンパイル さ れ て いる かど う か を 返し ます
id 型 と なる 属性 を localname および namespaceuri で 宣言 し ます
は 、 lzf で 符号 化 さ れ た 文字列 を 含む data を 伸長 し ます
現在 の php プロセス の id を 取得 し ます
は ストリーム の 配列 を 受け 取る と 、 それら の 状態 が 変化 する まで 待ち ます
lib _dir パラメータ に ある サポート する すべ て の アルゴリズム の 一覧 を 取得 し ます
オブジェクト を シリアライズ し て 、 json _encode が ネイティブ に シリアライズ できる 値 に し ます
ncurses の 色機 能 を 初期化 し ます
現在 の 行間 隔 の 値 を 取得 し ます
ファイル あるい は ディレクトリ が 存在 する かど う か を 調べ ます
新しい quickhashinthash オブジェクト を 作り ます
サーバー 上 で の 直近 の リクエスト に関する 詳細 な エラーメッセージ を 返し ます
この メソッド は 、 rmdir に対応 し て コール さ れ ます
newt インターフェイス を 終了 し ます
これ は 、 yaf プラグイン の フックシステム 内 で の 最初 の フック です
ファイルポインタ を 指定行 に 移動 さ せ ます
関数 socket _read は 、 関数 socket _create また は socket _accept により 作成 さ れ た ソケット リソース socket から 読み込み ます
これ は 、 読み込み 用 に 使う 新しい セカンダリ を ランダム に 選び ます
関数 の ドキュメントコメント を 取得 し ます
エントリ の インデックス を 使用 し て 、 エントリ の コメント を 返し ます
実行 中 の phar アーカイブ の フルパス を 返し ます
ビット start から 最上 位 ビット の 方 に 、 最初 の クリアビット が 見付 かる まで a を スキャン し ます
zip ファイルアーカイブ を 閉じ ます
購読 中 の メールボックス の 情報 を 取得 し ます
サーバー に おける 現在 の メールボックス の ステータス を 調べ ます
は 、 指定 し た postgresql result リソース に おける 指定 し た field _number の 型 の oid を 返し ます
この エントリ を 展開 する のに 必要 な rar プログラム winrar など の 最低 バージョン を 取得 し ます
別 の ストレージ に ある すべ て の オブジェクト と データ の ペア を 、 現在 の ストレージ に 追加 し ます
指定 し た rgb 値 に 「 近い 」 画像 パレット 中 の 色 の インデックス を 返し ます
インデックス を 使用 し て 、 エントリ の 名前 を 返し ます
soap リクエスト を 処理 し 、 必要 な 関数 を コール し 、 レスポンス を 返送 し ます
すべて の エラー 結果 ドキュメント を 取得 し ます
パラメータ として 配列 を ひとつ だけ 渡し た 場合 は 、 max は 配列 の 中 で 最も 大きい 数値 を 返し ます
apache の バージョン を 取得 し ます
final クラス で ある かど う か を 調べ ます
弱い 参照 が 指す先 に オブジェクト を 返し ます
gz ファイルポインタ について 現在 位置 から eof まで データ を 読み込み 、 標準 出力 に 伸長 さ れ た 結果 を 書き込み ます
blob の 読み込み あるい は 書き込み を 行お う とし て いる ファイル の 名前 を 設定 し ます
数 の 符号 を 調べ ます
最後 に 挿入 さ れ た 行 の id 、 あるい は シーケンスオブジェクト から 次 の 値 を を 返し ます
組み込み の 韓国 / 朝鮮語 フォント を 有効 に し ます
クライアント の バージョン 番号 を 整数 値 で 返し ます
( msdn ライブラリ による 以下 の 規則 に 従い 、 left を right に 加算 し ます
指定 し た リレーション relation に 拘束 を 設定 し ます
配列 の サイズ を 取得 し ます
により 、 標準 の libxml エラー を 無効 に し 、 ユーザー による エラー 処理 を 有効 に する こと が でき ます
指定 し た オフセット offset で ノード を 2 つに 分割 し ます
新しい 座標 系 の 原点 を 設定 し ます
ftp サーバー に site exec command リクエスト を 送信 し ます
variant オブジェクト の 型 を 返し ます
は 、 ファイル や ディレクトリ の パーミッション を 変更 し ます
ひとつ あるい は 複数 の 画像 チャネル の 極値 を 取得 し ます
画像 の ガンマ を 設定 し ます
現在 の ノード の 内容 を 文字列 で 読み込み ます
と ev :: resume が 、 それぞれ ループ の 一時 停止 と 再開 に 対応 し ます
は 、 ファイル に対する ユーザー の アクセス 権限 を 調べ ます
は 、 現在 の メールボックス に ある msg _number 番目 の メッセージ の 本文 を 返し ます
画像 リスト 内 の 次 の 画像 を imagick オブジェクト に 関連 付け ます
は 引数 filename から 得 られる 画像 を 表す イメージid を 返し ます
画像 の 明度 、 彩度 、 色相 を 制御 し ます
中心 の y 軸 を 基準 し て ピクセル を 反転 さ せ 、 水平 方向 の ミラー 画像 を 作成 し ます
この 関数 は 、 入力 さ れ た data を デコード し た もの を 返し ます
その 数 が 平方数 で ある かど う か を 調べ ます
mailbox へ の imap ストリーム を オープン し ます
特定 の 画像 チャネル の 深度 を 設定 し ます
イテレータ の ポインタ を 次 の 要素 に 移動 さ せ ます
現在 の directoryiterator アイテム の 最終 アクセス 時刻 を 取得 し ます
テキスト による 注記 を 画像 に 加え ます
は 、 指定 し た フィルタ filtertype を image に 適用 し ます
は date を パース し た 結果 を 配列 で 返し ます
これ は 、 現在 読み込み に 使っ て いる セカンダリ の アドレス を 探し ます
画像 の 角 を 丸め ます
スクリプト の 実行 を 終了 し ます
は クライアント の severity レベル の 最小値 を 設定 し ます
バッファ つき イベント の 入力 バッファ から データ を 読み込み ます
この 関数 は 、 map ファイル を 読み込み 、 照合 を 行い ます
は 、 ingres _query を コール し た 後 で 、 ingres サーバー により 返さ れ た 結果 の フィールド 数 を 返し ます
は 、 クエリ から の 結果 セット 中 に ある カラム に バインド さ れ た 特定 の 値 を 取得 する ため の 準備 を します
は 、 object _id で 指定 し た snmp オブジェクト の 値 を 設定 し ます
は 、 relation に 指定 さ れ た 現在 の 主キー を 、 domlist で 指定 さ れ た ドメイン に 変更 し ます
value を 双方 向 リンクリスト の 末尾 に 追加 し ます
テキスト を 指定 し た 位置 に 表示 し ます
指定 し た スキーマ 情報 を データベース から 取得 し ます
指定 さ れ た 値 base を 基数 （ デフォルト は 1 0 ） と する 、 var の integer として の 値 を 返し ます
は 、 fd が 指す ファイル の offset から 最大 length バイト まで を 読み込み ます
変数 が 既 に キャッシュ に 存在 し ない 場合 に のみ 変数 を ユーザーキャッシュ に 追加 し ます
中心 の x 軸 を 基準 し て ピクセル を 反転 さ せ 、 垂直 方向 の ミラー 画像 を 作成 し ます
すべて の http ヘッダ を 現在 の リクエスト から 取得 し ます
シリアライズ し ます
filtername で 指定 さ れ た フィルタ を 、 stream に 付加 さ れ て いる フィルタ の リスト に 加え ます
mysql の 結果 セット から ひとつ の セル の 内容 を 取得 し ます
old _data 文字列 と new _data 文字列 の 差分 を 含む unified diff を 作成 し 、 結果 を 返し ます
この 関数 は 、 指定 し た リソース の 型 を 取得 し ます
メソッド で 与え られ た スタイルシート を 適用 し 、 ソースノード を uri に 変換 し ます
イテレータ を 取得 し 、 データベース 内 の すべ て の キー / 値 を 反復 処理 できる よう に し ます
組み込み の 内部 関数 および ユーザー 定義 関数 の 中 から 、 function _name で 指定 し た 名前 の 関数 を 探し ます
現在 の directoryiterator アイテム が ディレクトリ で あり 、 かつ . あるい は .. のどちらか で ある かど う か を 調べ ます
指定 し た データベース に 、 結果 を 返さ ない クエリ を 実行 し ます
sql クエリ を 実行 し 、 クエリ が 結果 を 返す 場合 は sqlite 3result オブジェクト を 返し ます
3d モデル を 、 ディスク 上 あるい は 仮想 ファイル から 読み込み ます
は 、 callback の result 引数 で ファイル の 状態 を 返し ます
関数 は exec 関数 と 同様 、 command を 実行 し ます
mongodb を 普通 に 使っ て いる 限り 、 この メソッド は あまり 有用 で は あり ませ ん
graphicsmagick api の バージョン を 文字 列 と 数値 で 返し ます
文書 から フィールド を 除去 し ます
この 関数 は 出力 の バッファリング を オン に し ます
現在 の 文字 間隔 を 取得 し ます
直近 の soap リクエストヘッダ を 返し ます
は 指定 し た 結果 id に 関連 する 結果 から 1 行分 の データ を 取得 し ます
赤 が 一番 強い 点 を 返し ます
マッチ する 任意 の ピクセル の 色 を 、 fill で 定義 し た 色 に 変更 し ます
は 結果 の 行数 を 返し ます
この 関数 は 、 子要 素群 から 子要素 を 削除 し ます
指定 し た 色 チャネル の 値 を 取得 し ます
現在 の ページ に 生じ た 直近 の imap エラーメッセージ の 全文 を 返し ます
修飾子 を 取得 し ます
は 、 指定 し た フィールドインデックス の 名前 を 取得 し ます
str の metaphone キー を 計算 し ます
サブパス を 取得 し ます
パラメータ data から の データ を lob の 内部 ポインタ の 現在 位置 に 書き込み ます
インデックス を もと に し て 、 アーカイブ 内 の エントリ を 削除 し ます
新しい tidy オブジェクト を 作成 し ます
data を ラージオブジェクト に 保存 し ます
bourne シェル 経由 で コマンド を 実行 し 、 プロセス へ の pty ストリーム を オープン し ます
filename という 名前 の ファイル 、 また は シンボリックリンク の 情報 を 得 ます
指定 し た 変数 の 型 が 文字 列 か どう か を 調べ ます
位置 番号 を 指定 し て 、 画像 の カラーマップ を 移動 し ます
また は mdecrypt _generic を コール する 前 に 、 常 にこの 関数 を コール する 必要 が あり ます
指定 し た seconds および nanoseconds の 時間 だけ プログラム の 実行 を 遅延 さ せ ます
ファイル の 最終 アクセス 時刻 を 取得 し ます
は 、 relation の 名前 を name に 変更 し ます
指定 さ れ た 接続 id に関する カーソル 名 を 返し ます
指定 し た オブジェクト パラメータ を 省略 し た 場合 は 、 すべて の オブジェクト を 、 ワーカー の スタック から 削除 し ます
は 、 table _name で 指定 し た テーブル に assoc _array の 値 を を 挿入 し ます
キー と データ の 関係 を 維持 しつつ 、 配列 を キー で ソート し ます
slob オブジェクト を 削除 し ます
は 、 指定 し た データベース connection 上 で query を 実行 し ます
内部 の 整合 性 を チェック libev の デバッグ 用 し 、 もし データ 構造 が 壊れ て いる 場合 は プログラム を 終了 さ せ ます
は 、 指定 し た フィールド の 名前 を 返し ます
サーバー と の 接続 が 有効 か どう か を 調べ ます
は 、 main _str の offset 文字 目以降 の 最大 length 文字 を 、 str と 比較 し ます
別 の ストレージ に 含ま れ て いる もの 以外 の すべ て の オブジェクト を 現在 の ストレージ から 取り除き ます
blob オブジェクト の 内容 を 返し ます
ドキュメントデータ を 標準 出力 に 書き出し ます
いくつか の pdflib パラメータ の 内容 を 文字 列 として 取得 し ます
サーバー の 環境 変数 に setting を 追加 し ます
指定 し た リンク id に 関連 する frontbase サーバー へ の 接続 を 閉じ ます
画像 の 一部 を 抽出 し 、 新しい imagick オブジェクト として 返し ます
ノード の xpath ロケーションパス を 取得 し ます
は preg _replace と 似 て い ます が 、 マッチ し た 結果 を 変換 し た もの のみ を 返し ます
は 、 arg の コサイン を 返し ます
は 、 指定 し た ファイル 名 から 得 られ た イメージ を 表す イメージ id を 返し ます
options に 、 指定 さ れ た オプション が 予め 設定 さ れ た ストリームコンテキスト を 作成 し 、 それ を 返し ます
プロセス pid の プロセスグループ id を 返し ます
は 、 指定 し た x 5 0 9 cert に関する 情報 を 返し ます
指定 し た 結果 から 複数 の エントリ を 読み込み 、 その 属性 および 複数 の 値 を 読み込み ます
は 機能 的 に memcached :: set と 同等 です
は 、 table _name の テーブル 定義 を 配列 として 返し ます
は 、 テーブル を 配列 に コピー し ます
は 、 relation を 閉じ て 削除 し ます
直近 に 実行 さ れ た ステートメント が 成功 あるい は 失敗 し た 際 の エラーコード を 返し ます
指定 し た uid の メッセージ 番号 を 返し ます
エントリ 内 の 属性 を 取得 し ます
この 関数 は 、 ファイル の 拡張 属性 の 値 を 取得 し ます
recursiveiterator から recursivefilteriterator を 作成 し ます
与え られ た 文字 列 text のすべて の 文字 が 英字 また は 数字 で ある かど う か を 調べ ます
は 、 assoc _array で 指定 し た キー と 値 を 用い て テーブル から レコード を 削除 し ます
文字列 の 定義 から 新しい ハッシュ を 作る ファクトリーメソッド です
php の 変数 を 、 oci _fetch で 取得 する クエリ の カラム に 関連 づけ ます
レコード を 連結 し 、 左 に シフト し ます
は memcached :: setoption と 似 て い ます が 、 設定 する オプション の 配列 を 受け取り ます
これ は 、 データベース の すべ て の データ の 最新 コピー を 作成 し ます
cyrus imap サーバー へ の 接続 を 閉じ ます
は 、 指定 さ れ た リンク link _identifier が 指す sybase データベース へ の リンク を 閉じ ます
任意 の フォント に おける text の 幅 を 返し ます
画像 リスト 内 の 前 の 画像 を gmagick オブジェクト に 関連 付け ます
を シャットダウン 関数 として 登録 し ます
は 、 ms sql 結果 行 から セル の 内容 を 返し ます
現在 の 輪郭 色 を 指定 し た rgb 値 に 設定 し ます
ある 画像 と 再構 築 し た 画像 を 比較 し 、 指定 し た 歪み 係数 を 返し ます
は lob あるい は file の ディスクリプタ を 閉じ ます
直近 の insert クエリ に おい て 、 default unique 定義 さ れ て いる カラム で 生成 さ れ た id を 返し ます
が返し た ステートメントリソース 内 の sql 文 の パラメータ に php 変数 を バインド し ます
は 、 一般 ファイル や 特殊 ファイル こちら の ほう が 頻繁 に あり ます を 作り ます
画像 フォーマット を 直接 記憶 し ます
filename から の データ を ラージオブジェクト の 現在 の 位置 に 書き込み ます
arrayobject の public プロパティ の 数 を 取得 し ます
imagickpixel オブジェクト の 色 を 、 配列 で 返し ます
マイクロ 秒単 位 の 現在 時刻 に も とづい た 、 接頭 辞 つき の 一意 な id を 取得 し ます
データベースレプリケーション の マスタ を 設定 し ます
与え られ た ファイルポインタ を eof まで 読み 、 結果 を 出力 バッファ に 書き出し ます
関数 は 、 hostname で 指定 し た snmp エージェント から すべて の オブジェクト id とその 値 を 読み こむ ため に 使用 し ます
アンシリアライズ し ます
ルート 要素 の uri 文字列 を 返し ます
observer を デタッチ し 、 更新 を 通知 し ない よう に し ます
include と 似 て い ます が 、 関数 や クラス の 外部 に ある コード は 無視 さ れ ます
パラメータ および オプション の 情報 を 、 ストリーム あるい は コンテキスト から 取得 し ます
新規 soapvar オブジェクト を 生成 し ます
は 共有 メモリブロック から 文字列 を 読み込み ます
設定 し た フォント を 返し ます
文書 を コミット し ます
関数 の 拡張 モジュール 情報 を 取得 し ます
この 関数 は 、 openssl _pkey _new で 作成 し た 秘密 鍵 を 開放 し ます
 ;& nbsp ;rfc 2 8 2 2 の 定義 に 基づき 、 アドレス 文字列 を パース し ます
この 関数 は 、 timeoutms ミリ 秒 が 経過 する か キュー に メッセージ が 到着 する まで 待機 し ます
は xml ドキュメント を 処理 し ます
作業 コピー あるい は リポジトリ 内 に ディレクトリ を 作成 し ます
error _reporting の モード を 設定 し ます
接続 で 使用 さ れ て いる ホスト 名 を 取得 あるい は 設定 し ます
新規 テンプレート の 定義 を 開始 し ます
は 、 fd で 指定 し た ファイル を 閉じ ます
この メソッド は 、 既存 の セット を ディスク に 保存 し ます
は 、 ラージオブジェクト から 最大 len バイト 分読 み 込み 、 文字 列 として 返し ます
有効 期限 を 過ぎ た セッション を 削除 し ます
与え られ た 文字 列 text のすべて の 文字 が 印字 可能 な 文字 で ある かど う か を 調べ ます
を 使用 する の は 、 既存 の ファイル 情報 として は 表せ ない 独自 の 情報 を 保存 する 場合 のみ に 限る べき です
指定 し た bevent を event _base に 関連 づけ ます
接頭辞 と 接尾 辞 を つけ た 現在 の キー を 取得 し ます
は 、 その 他 の ヘッダ 情報 と 共に 送信 する クッキー を 定義 し ます
指定 し た ハッシュ が パスワード に マッチ する かど う か を 調べ ます
ユリウス 積算 日 を フランス 革命 暦 に 変換 し ます
新しい 画像 を 作成 し 、 imagickpixel の 値 を 背景 色 として 関連 付け ます
から 返さ れる error _code の 可読 性 が 高い 説明 を 返し ます
テーブル の ユニーク 行 id カラム を 含む 結果 セット を 返し ます
は 、 handle が 指す データベース から key が 指す データ を 取得 し ます
パラメータ が あらかじめ xsltprocessor :: setparameter で 設定 さ れ て いる 場合 、 それ を 取得 し ます
は 機能 的 に memcached :: add と 同等 です
与え られ た ファイルポインタ から 返さ れ た bzip 2 エラー の エラー 番号 と エラー 文字 列 を 返し ます
画像 の 型 を 設定 し ます
ビューエンジン を 無効 に し ます
イテレータ を 巻き戻し ます
は 機能 的 に memcached :: append と 同等 です
この メソッド は 、 closure クラス の インスタンス を 作れ ない よう に する ため に 存在 し ます
の 呼び出し を ブロック し て いる すべ て の スレッド に ブロードキャスト し ます
画像 を 指定 し た ファイル 名 で 書き出し ます
画像 の 前景 色 を 返し ます
link が 指す 接続 に おける 直近 の クエリ の カラム の 数 を 返し ます
は 、 keys 配列 で 指定 し た 複数 の キー の アイテム に対する リクエスト を memcache に 発行 し ます
この 関数 は 、 finfo _open が オープン し た リソース を 閉じ ます
関数 は 、 直近 に 実行 さ れ た クエリ に ついて の 情報 を 文字列 で 返し ます
現在 の パス の 終端 の 形式 を 取得 し ます
名前 空間 namespaceuri に ある localname という 名前 の 属性 を 、 指定 し た 値 に 設定 し ます
は 、 handle で 指定 し た データベース に key および value で 記述 さ れる エントリ を 置換 また は 挿入 し ます
指定 し た アルゴリズム の ブロック 長 を 取得 し ます
指定 し た フィールド が 含ま れる テーブル の 名前 を 返し ます
この 関数 は freetype テキスト 用 の バウンディングボックス を ピクセル 単位 で 算出 し 、 それ を 返し ます
現在 の 座標 空間 に対し て 水平 方向 と 垂直 方向 の 倍率 を 調整 し ます
イメージ を 置き 、 サイズ を 変更 し ます
その プロセス で 現在 制御 し て いる 端末 の パス 名 を 表す 文字 列 を 作成 し ます
field _number に対応 する フィールド 名 を 返し ます
arg の ハイパボリックコサイン を 返し ます
クローン し ます
画像 の 輪郭 を 明る く し たり 暗く し たり する こと によっ て 、 三次元 の ボタン 風 の 効果 を シミュレート し ます
修正 さ れ た html を 文字列 で 返し ます
論理 表記 の ヘブライ 語 を 物理 表記 に 変換 し ます
php 関数 を lua に & quot ;$ name &quot ; という 関数 として 登録 し ます
この メソッド は 、 テーブルデータベース で は サポート し て いませ ん
現在 の レスポンスオブジェクト を 取得 し ます
この クライアント により ロック さ れ た タプル を 全 て 解放 し ます
は 、 key に対応 する 項目 を 削除 し ます
は 、 配列 input の 中 から column _key で 指定 し た 単一 の カラム の 値 を 返し ます
最後 の http メソッド 、 url そして パラメータ 文字 列 あるい は 配列 に も とづい て oauth ヘッダ 文字 列 シグネチャ を 生成 し ます
直近 の curl 操作 に関する エラーメッセージ を クリアテキスト で 返し ます
name string あるい は boolean 型 の pcos パス の 値 を 取得 し ます
現在 の エントリ が 書き込み 可能 か どう か を 調べ ます
カラー 画像 の コントラスト を 強調 し ます
指定 し た オブジェクト が ストレージ に 含ま れる かど う か を 調べ ます
指定 し た マルチバイト 文字 列 に対する マルチバイト 正規 表現 マッチング を 行い ます
新しい domdocument オブジェクト を 作成 し ます
通常 の 操作 で は 、 この メソッド は 使い ませ ん
ステートメントリソース が 使用 し て いる カーソル の 型 を 返し ます
新しい 描画 パス の 開始 位置 を 定義 し ます
は key を パース し 、 他 の 関数 で 使用 できる よう 準備 し ます
この メソッド は 、 現在 の 値 と キー そし て 内部 イテレータ を 使っ て コールバック を コール し ます
は ストリーム に ping を 行い 、 まだ アクティブ で ある かど う か を 調べ ます
ワーカー が stackable を 実行 中 かど う か を 調べ ます
式 を 画像 の 各 ピクセル に 適用 し ます
有効 な グレゴリウス 暦 の 範囲 は 紀元 前 4 7 1 4 年 から 紀元 9 9 9 9 年 まで です
指定 し た ファイル filename に対し て 文法 チェック lint を 行い 、 スクリプト に エラー が ない か どう か を 調べ ます
この 関数 は 、 指定 し た ftp 接続 について option の 値 を 返し ます
指定 し た ftp ストリーム に ログイン し ます
スロー さ れ た オブジェクト に 関連 づけ られ た メッセージ を 返し ます
は 、 指定 し た キー に 新しい 有効 期限 を 設定 し ます
server 変数 を 取得 し ます
これ は arrayaccess インターフェイス を 実装 し た もの です
現在 の libev の 構成 で サポート する バックエンド 群 を 返し ます
新しい ページ を ドキュメント に 追加 し ます
すべて の 登録 済み _ _ autoload 関数 を 取得 し ます
は 、 fd で 指定 し た ファイル 内 で の オフセット を 、 offset と whence で 指定 し た 位置 に 移動 し ます
ストレージ 内 の オブジェクト に データ を 関連 づけ ます
静的 変数 を 取得 し ます
この メソッド は 、 fwrite に対応 し て コール さ れ ます
この 関数 は 、 指定 し た ファイル を 保持 する ファイルシステム が 拡張 属性 を サポート し て いる かど う か を 調べ ます
次 の 要素 に 移動 し ます
は 、 certificate signing request csr を 受け取り 、 それ を out に ascii テキスト として 保存 し ます
曜日 を 返し ます
graphicsmagick パッケージ 名 を 返し ます
実行 中 の システム で 使用 可能 な 、 登録 済み の ストリーム の 一覧 を 取得 し ます
によっ て セット さ れる 行 の 最大 バイト 数 を 取得 し ます
は 、 指定 し た relation の 空 の コピー を name という 名前 で 作成 し ます
中心 の y 軸 を 基準 し て ピクセル を 反転 さ せ 、 水平 方向 の ミラー 画像 を 作成 し ます
xml パーサ から オプション の 値 を 取得 し ます
指定 し た ファイル の モード の mode へ の 変更 を 試み ます
画像 リスト 内 で の イテレータ の 位置 を 、 index パラメータ で 指定 し た 場所 に 設定 し ます
この メソッド を 使う と 、 新しい カラム を 既存 の レコード に 追加 する こと が でき ます
取得 し た 行 に 対応 する 配列 を 返し 、 内部 の データポインタ を 前 に 進め ます
オブジェクト の 塗り つぶし に 使う 色 を 設定 し ます
リモート の ファイルサーバー から ディレクトリ を 削除 し ます
ストリームラッパー を オープン し た とき に 、 streamwrapper :: stream _open の 直前 に コール さ れ ます
結果 セット に おける フィールド 数 を 整数 として 返し ます
arg の ハイパボリックサイン を 返し ます
この タイムスタンプ の & quot ;sec &quot ; フィールド を 返し ます
新しい パターン を 開始 し ます
指定 さ れ た 引数 を format に 基づい て バイナリ 文字列 に パック し ます
yaf _route _simple は 、 ルート 情報 を クエリ 文字 列 から 取得 し ます
指定 し た code を php コード として 評価 し ます
パス の 終了 点 と 開始 点 を つなげ ます
は 、 id 3 タグ に 格納 さ れ て いる 情報 を 削除 する ため に 使用 さ れ ます
パースモード を 設定 し ます
と似 て い ます が 、 datetimeimmutable で 動作 し ます
指定 し た key が 配列 に 設定 さ れ て いる 場合 、 array _key _exists は true を 返し ます
画像 の 色 を 変換 し ます
フィールド が 存在 する か チェック し ます
ビット start から 最上 位 ビット の 方 に 、 セット さ れ て いる ビット が 最初 に 見付 かる まで a を スキャン し ます
条件 変数 へ の ハンドル の 破棄 は 、 条件 変数 を 使い 終え た とき に プログラマー が 明示 的 に 行う 必要 が あり ます
ファイル から 画像 を 読み込み ます
関数 により 、 単一 の 複数 形 メッセージ 参照 について 現在 の ドメイン を 上書き する こと が でき ます
現在 位置 から 指定 し た 位置 まで 直線 を 描画 し ます
を 使う と 、 特別 な イベントループ を 実装 でき ます
は 、 セッション を 作成 し ます
指定 し た relation の 次 の タプル から データ を 読み込み 、 tuple に 連想 配列 として 返し ます
それ 以降 の リクエスト 用 の トークン と secret を 設定 し ます
以降 の 描画 処理 で の 線幅 を 設定 し ます
イテレータ を 先頭 に 巻き戻し ます
辞書 が 存在 する かど う か を 調べ ます
構造体 要素 やその 他 の 内容 を 閉じ ます
を コール する 必要 が ある の は 、 スクリプト の 実行 中 に 大量 の メモリ を 使用 する こと が 気 に なる 場合 のみ です
例外 が 作られ た 行番 号 を 取得 し ます
現在 の 画像 上 の gmagickdraw オブジェクト を レンダリング し ます
子 プロセス を 終了 さ せ た シグナル 番号 を 返し ます
ファイル が グローバル な メタデータ を 持っ て いる かど う か を 返し ます
現在 の 描画 コンテキスト を 保存 し ます
フィールド は & quot ;fieldname &quot ; : bool 形式 で 指定 し ます
指定 し た dn に 属性 を 追加 し ます
緑 が 一番 強い 点 を 返し ます
この 関数 は 、 指定 し た 接続 上 で z 3 9 . 5 0 スキャンリクエスト の 準備 を します
フィールド の 外観 すなわち 、 / ap キー の 値 を 設定 し ます
現在 の 塗り つぶし 色 を 取得 し ます
libxml から 直近 の エラー を 取得 し ます
この 関数 を 使用 する と 、 大量 の 変数 を 取得 する 際 に filter _var を 繰り返し コール する 必要 が なく なる ので 便利 です
現在 の パス を 描画 し ます
画像群 を 、 ひとつ の 大き な 画像 に 追加 し ます
gmagick quantum depth を 文字列 で 返し ます
この 関数 は 、 出力 用 バッファ の 内容 を 出力 し 、 出力 の バッファリング を オフ に し ます
は 、 x 5 0 9 を pkcs # 1 2 ファイルフォーマット に し た もの を out で 指定 し た 文字列 に 格納 し ます
この 関数 は 、 指定 し た 文字列 str から 全 て の nul バイト と html および php タグ を 取り除き ます
これ は 高度 な 関数 な ので 、 今何 を し て いる の か を わかっ て いる 人以 外 は 使っ て はいけ ませ ん
は 、 指定 さ れ た 結果 id が 指す 結果 から 1 行分 の データ を 取り込み ます
ブートストラップ を 実行 し ます
イテレータ の 現在 位置 が 有効 か どう か を 調べ ます
long および longvarbinary の カラム を 処理 できる よう に し ます
この 関数 を 使う と 、 現在 有効 に なっ て いる ログ の レベル を 調べる こと が でき ます
文 の 属性 を 取得 し ます
この 関数 は 文字列 input の 左 、 右また は 両側 を 指定 し た 長さ で 埋め ます
handle の ファイル 位置 指示子 を 、 ファイルストリーム の 先頭 に セット し ます
は 、 ある クエリー の 結果 に おい て 、 フィールド に関する 情報 を 得る ため に 使用 し ます
gmp 数 を base を 基数 と する 文字 列表 現 に 変換 し ます
配列 イテレータ の クラス 名 を 取得 し ます
ibm db2 universal database 、 ibm cloudscape あるい は apache derby データベース へ の 新しい 接続 を 作成 し ます
全て の 種類 の 注記 の 境界 の 形式 を 設定 し ます
クラス が 定義 さ れ て いる ファイル の ファイル 名 を 取得 し ます
関数 は 、 ホスト 名 あるい は ip アドレス に 対応 する 国および 地域 を 返し ます
timezonedb の 現在 の バージョン を 返し ます
認証局 の 情報 を 取得 し ます
新規 soapheader オブジェクト を 生成 し ます
ラージオブジェクト 用 の バッファリング を on _off パラメータ の 値 で 設定 し ます
は ロケールカテゴリ の 独立 し た 要素 に アクセス する ため に 使用 さ れ ます
各 画像 を シーケンス 内 の 次 の 画像 と 比較 し 、 最大 の 境界 範囲 を 返し ます
画像 から すべ て の プロパティ や コメント を 除去 し ます
指定 し た 名前 について 、 特定 の 国 に おける 性別 を 取得 し ます
imagickpixel オブジェクト の 色 を 文字列 で 返し ます
この コンストラクタ により soapserver オブジェクト を wsdl また は 非 wsdl モード で 作成 する こと が 可能 です
現在 の 位置 に テキスト を 出力 し ます
lob を 切り つめ ます
結果 セット 内 の 行 を 表す 、 カラム 位置 および カラム 名 の 両方 を インデックス と する 配列 を 返し ます
現在 認証 済み の 公開鍵 の 一覧 を 表示 し ます
glob 式 から 見つかっ た ディレクトリ や ファイル の 数 を 取得 し ます
宣言 し て いる クラス を 取得 し ます
塗りつぶし や 描画 を 行わ ず 、 現在 の パス を 終了 し ます
xml バージョン を 文字列 で 設定 し ます
指定 し た キー の エントリ が ハッシュ に 存在 する かど う か を 調べ ます
この メソッド は 、 phar アーカイブ 内 の ファイル の 圧縮 を 解除 し ます
imagick インスタンス の quantum range を 文字列 で 返し ます
引数 で 指定 さ れ た 日付 の 妥当性 を チェック し ます
直近 の 国際 化関 数 の コール による エラーメッセージ を 取得 し ます
この 関数 は 配列 を ソート し ます
メールボックス 内 の すべ て の メッセージ の ヘッダ を 返し ます
現在 の directoryiterator アイテム の 所有 者 を 、 数値 形式 で 取得 し ます
lob の 内部 ポインタ の 現在 位置 を 取得 し ます
画像 に 関連 付け られ て いる 合成 演算子 を 返し ます
は 、 エントリ の データ を 展開 し ます
条件 変数 上 で シグナル を 待ち ます
引数 の 内容 が 、 関数 として コール 可能 か どう か を 調べ ます
raw ccitt イメージ を オープン し ます
各 要素 に対し て 、 子 を 持っ て いる かど う か を 調べる ため に コール し ます
icc プロファイル を 検索 し 、 後 に 使用 する ため に 準備 し ます
指定 し た 結果 セット から フィールド の 数 を 返し ます
は 、 mode で 指定 し た アクセスモード で ディレクトリ を 作り ます
指定 し た relation について 、 カレントタプル に関する データ を 読み込み ます
は 、 指定 し た 大きさ の 黒い 画像 を 表す 画像 id を 返し ます
event _base を event と 関連 づけ ます
テキスト による 注記 を 画像 に 加え ます
シリアライズ し た arrayobject を アンシリアライズ し ます
は 、 データベーススキーマ を 返し ます
は 、 assoc _array の 中 の 値 を チェック し 、 sql 文 の 中 で 使用 可能 な 形式 に 変換 し ます
新しい domimplementation オブジェクト を 作成 し ます
この メソッド は エントリ を 新しい 値 で 更新 し 、 更新 でき たか どう か を 返し ます
は sqlite _open と 同様 に sqlite データベース を オープン 、 もしく は データベース が 存在 し ない 場合 は 生成 しよ う と 試み ます
一段下 の 再帰 処理 が 終了 し た とき に コール さ れ ます
result の フィールド 番号 offset の 型 を 返し ます
the mqseries _conn mqconn を コール する と 、 アプリケーションプログラム を キューマネージャ に 接続 し ます
connection を 使っ て sql _text を パース し 、 ステートメント id を 返し ます
は 、 指定 し た link _identifier 上 で 使用 可能 な データベース の 一覧 を 返し ます
は 、 直近 の 強度 チェック から の メッセージ を 返し ます
reflectionmethod オブジェクト の 文字 列表 現 を 返し ます
arg の 平方根 を 返し ます
指定 し た tidy オブジェクト object の 設定 時 に 発生 し た tidy エラー の 数 を 返し ます
は クライアント の エンコーディング を 設定 し 、 成功 し た 場合 に 0 、 エラー 時 に - 1 を 返し ます
textflow オブジェクト を 作成 する か 、 既存 の textflow に テキスト と 明示 的 な オプション を 追加 し ます
ページ を 終了 し 、 さまざまな オプション を 適用 し ます
全て の select クエリ に関する デフォルト の テキストモード を 設定 し ます
指定 し た 名前 の 、 中断 し て いる サービス を 再開 し ます
イベント の 優先 度 レベル を 表す 数値 を 設定 し ます
は 、 サーバーリスト から すべ て の memcache サーバー を 削除 し 、 サーバーリスト を 空 に し ます
複数 形版 の gettext です
直近 の frontbase 操作 から の エラーメッセージ を 表す 数値 を 返し ます
と同じ です が 、 fgetss は 読み込ん だ テキスト から nul バイト や html および php の タグ を 取り除こ う と する こと が 異なり ます
エンコード さ れ た mime ヘッダ の 文字列 str を デコード し ます
現在 の テキストオブジェクト を 終了 し ます
は 、 msql _fetch _row の 拡張 版 です
画像群 を 平均 化 し ます
指定 し た エンコーディング の haruencoder の インスタンス を 取得 し ます
は 、 現在 の セッションモジュール の 名前 を 返し ます
テキスト の アノテーション に 適用 する デコレーション を 返し ます
リクエストグループ 内 の リクエスト 数 を 制限 し ます
指定 し た odbc 結果 id における フィールド 名 に 対応 する カラムスロット の 数 を 取得 し ます
サーバー から の レスポンス を 返し ます
イテレータ が 有効 な マップ 要素 を 指し て いる かど う か を 返し ます
画像 の 色空間 を 取得 し ます
unicode の ドメイン 名 を 、 idna が 定め た ascii 形式 に 変換 し ます
データベース から lob データ を 取得 する 際 の モード を 設定 し ます
lob の 内容 を ファイル に 出力 し ます
この メソッド が 返す ストリームリソース を 、 php のすべて の ファイル 操作 関数 群 ファイル を 読み込む 関数 で 使え ます
linecap を 設定 し 、 ストローク を 考慮 し たうえ で パス の 終端 の 形状 を 制御 し ます
クラス が 定義 さ れ て いる 名前 空間 の 名前 を 取得 し ます
は 、 一方 の ファイルディスクリプタ から もう 一方 の ファイルディスクリプタ に データ を コピー し ます
画像 シーケンス に 関連 付け られ た ファイル 名 を 取得 し ます
は サーバー の severity レベル の 最小値 を 設定 し ます
現在 の テキストライズ の 値 を 取得 し ます
ファイル php .ini で 定義 さ れ た クッキーパラメータ を 設定 し ます
リモートスクリプト を 実行 し ます
この 関数 は 、 gmp 数 を php ネイティブ の 整数 に 変換 し ます
ユーザー 定義 の 関数 を 使っ て 、 値 で エントリ を ソート し ます
タイムアウト は いつ でも 設定 可能 で 、 同じ カーソル で の それ 以降 の クエリ に 影響 を 及ぼ し ます
 mqdisc を コール する と 、 キューマネージャ と アプリケーションプログラム と の 間 の 接続 を 切断 し ます
は 、 指定 し た connection から 直近 の エラーメッセージ を 返し ます
指定 さ れ た ディレクトリエントリ を 閉じ ます
指定 さ れ た フォント と サイズ で 出力 し た 場合 に 、 文字列 の 幅 が 何 ポイント に なる か を 計算 し ます
画像 を 閉じ 、 その リソース を 開放 し ます
imagickpixel オブジェクト の hsl カラー を 正規 化 し た もの を 返し ます
画像 の 高さ を 取得 し ます
接続 オブジェクト に対し て & quot ;commit &quot ; メソッド を コール する と 、 現在 処理 中 の トランザクション の すべ て の 内容 を コミット し ます
は 文字列 str を 何らか の 文字 token によって 区切 られ て いる 小さ な 文字列 トークン に 分割 し ます
subject に関し て pattern を 用い て 検索 を 行い 、 replacement に 置換 し ます
この 関数 は variant _cast に 似 て い ます が 、 「 その 場 で 」 変換 さ れる という 点 が 異 なり ます
は 、 req で 指定 し た リクエスト を 取り消し ます
ラージオブジェクト の サイズ を 取得 し ます
エントリ の メタデータ が 存在 する 場合 に それ を 削除 し ます
array 配列 の 各要 素 に ユーザー 定義 関数 callback を 適用 し ます
ノード が 子 を 持つ かど う か を 調べ ます
は 指定 し た 文字 列 source を パース し 、 zend engine の 字句 解析 スキャナ により php 言語 の トークン に 分割 し ます
は 、 hash で 指定 し た ハッシュ 関数 を data に 適用 し ます
は 、 文字列 str を 受け取り 、 その 3 2 ビットハッシュ 値 を 返し ます
この 関数 は 、 アルファベット 文字 を マッチング さ せる 際 に 大文字 小文 字 の 区別 を し ない こと 以外 は ereg と 同じ です
現在 の 描画 色 を 取得 し ます
接続 ステータス の ビットフィールド を 取得 し ます
パラメータ が 参照 渡し で ある かど う か を 調べ ます
アタッチ し て いる すべ て の イテレータインスタンス を 次 に 移動 さ せ ます
php および php が 使っ て いる cgi web サーバー など の バックエンド の システム 書き込み バッファ を フラッシュ し ます
関数 dio _read は 記述子 fd で 示さ れる ファイル から len バイト を 読み込み 、 それ を 返し ます
は 画像 image を 保持 する メモリ を 解放 し ます
指定 し た map から 、 key に対応 する 値 を 返し ます
は postscript type 1 フォント が 使用 し た メモリ を 解放 し ます
ページ の 水平 方向 の 拡大 率 を 設定 し ます
画像 の 反復 を 取得 し ます
base 6 4 で エンコード さ れ た data を デコード し ます
ファイル から 読み込ん だ 公開鍵 を 使用 し た 認証 を 行い ます
は 実際 に サーバー に データ を 書き込み ます
private プロパティ で ある かど う か を 調べ ます
この メソッド は 、 rename に対応 し て コール さ れ ます
文字列 を utf - 3 2 フォーマット から utf - 1 6 に 変換 し ます
出力 圧縮 に 使用 さ れ た コーディング の 種類 を 返し ます
subject におい て mask の 文字 が どれ も 含ま れ て い ない 最初 の セグメント の 長さ を 返し ます
指定 し た 大きさ と フィルタ で 、 画像 の サイズ を 変更 し ます
statement の 現在 の 行 の 、 指定 し た フィールド field が null で ある かど う か を 調べ ます
は 、 field =& gt ;value 形式 の assoc _array で 指定 し た レコード を 選択 し ます
韓国 / 朝鮮語 エンコーディング を 有効 に し ます
この 関数 は 、 指定 し た 名前 localname および namespaceuri の タグ を 持つ すべて の 子孫 要素 を 取得 し ます
で オープン し た リレーション を 閉じ ます
は 、 指定 し た 座標 から 始まる 矩形 を 作成 し ます
指定 し た image から 、 png 画像 を 出力 あるい は 保存 し ます
データ の 比較 に コールバック 関数 を 用い 、 配列 の 差 を 計算 し ます
この 関数 は 現在 利用 可能 な spl クラス を 配列 で 返し ます
指定 し た 名前 で 画像 を 書き込み ます
3 0 2 ヘッダ を 送出 し て 、 url に リダイレクト し ます
指定 し た 名前 の 属性 の 値 を 返し ます
は rpm ファイルポインタ を 閉じ ます
は 、 指定 し た リンク id に 関連 づけ られ た informix データベース へ の 接続 を 閉じ ます
メソッド は 、 データベース と の 接続 を 強制 的 に 閉じ ます
は memcached :: res _* 定数 のい ずれ か を 返し ます
例外 が スロー さ れ た 際 の 内部 情報 を 返し ます
例外 が スロー さ れ た 際 の 内部 情報 を 返し ます
は 、 tiff あるい は jpeg 画像 に 埋め込ま れ た サムネイル を 読み込み ます
結果 セット から 行 の 数 を 取得 し ます
oracle データベース の バージョン と 利用 可能 な オプション を 返し ます
現在 の フォント の サイズ を 取得 し ます
それ 以降 の リクエスト 用 の oauth タイムスタンプ を 設定 し ます
この 関数 は 、 エラー 番号 errno が 意味 する エラーメッセージ 文字 列 を 返し ます
色 color で 塗り つぶ し た 矩形 を 、 指定 し た image 上 に 作成 し ます
この メソッド は 、 php 関数 を xsl スタイルシート で の xslt 関数 として 利用 できる よう に し ます
キュー から 先頭 の ノード を 取り出し ます
レコード の 次 の バッチ を 返し ます
内部 イテレータ の 巻き戻し 操作 を 阻止 し ます
は postgresql データベース から ラージオブジェクト を 取得 し 、 その 内容 を ローカルファイルシステム 上 の ファイル に 保存 し ます
画像 の 型 を 取得 し ます
harufont の インスタンス を 取得 し ます
ウェブサービス の wsdl で 定義 さ れ て いる 型 の 配列 を 返し ます
は 、 指定 し た 接続 に ログイン する ユーザー を 変更 し ます
直近 の interbase 関数 の コール によって 得 られ た エラーコード を 返し ます
は 画像 image 上 に 塗り つぶ し た 多角 形 を 生成 し ます
( x y を 中心 と し た 円 の 一部 を 描き ます
は 、 新規 の 辞書 を ロード し て 辞書 リンク id を 返し ます
フォントメトリクス を 表す 、 多次 元 配列 を 返し ます
は 、 直近 の リクエスト から 次 の 結果 を 取得 し ます
オブジェクト を 指定 し て 、 それ が 指す値 を 返し ます
結果 セット 内 の 行 を 表す 、 カラム を プロパティ と する オブジェクト を 返し ます
は 画像 image から gif ファイル filename を 作成 し ます
と同じ です が 、 ウォッチャー を 自動 的 に は 開始 し ませ ん
subject の 中 で 、 mask 内 の 文字 だけ を 含む 最初 の 部分 の 長さ を 返し ます
ページハンドル を 閉じ 、 その ページ に 関係 する 全て の リソース を 開放 し ます
は システムログ が 出力 する ログメッセージ を 生成 し ます
新しい ボタン を 作成 し ます
http リクエスト の 送信 に 使う リクエストエンジン を 設定 し ます
リモートエンド 上 の シェル を オープン し 、 その ため の ストリーム を 割り 当て ます
は 証明 書 を 調べ 、 purpose で 指定 し た 目的 に 使用 可能 で ある かど う か を 確認 し ます
index で 指定 し た 添字 の 値 を 返し ます
赤 が 一番 強い 点 を 返し ます
この 関数 は 、 php から 既存 の 定数 を バイトコード として 読み込み 、 開か れ て いる ファイルハンドル に 書き込み ます
ストリーム あるい は url が 、 ローカル の もの で ある かど う か を 調べ ます
variant の 論理 否定 演算 を 行い ます
は 、 postgresql 結果 リソース の フィールド が sql の null で ある かど う か を 調べ ます
格納 さ れ て いる 変数 を キャッシュ から 取り除き ます
次 の 素数 を 見つけ ます
アイテム を レジストリ から 削除 し ます
ユリウス 暦 は 紀元 前 4 7 1 3 年 から 紀元 9 9 9 9 年 の 範囲 で 使え ます
プラグイン yaf _plugin _abstract を 参照 を 登録 し ます
コンテンツ を 取得 し ます
は 、 その セマフォ が コール 元 の プロセス により 現在 確保 さ れ て いる 場合 、 解放 し ます
xml パーサ の オプション を 設定 し ます
実行 時 に クラス また は 関数 エントリ の フラグ を 取得 また は 設定 し ます
定数 群 を キャッシュ から 読み込み ます
この 関数 は 、 url の 様々 な 構成 要素 の うち 特定 できる もの に関し て 連想 配列 に して 返し ます
この 関数 は 、 url エンコード さ れ た 文字列 を デコード し ます
type 3 フォント 定義 を 終了 し ます
この メソッド は 、 simplexmliterator を 最初 の 要素 に 巻き戻し ます
は 、 検索 の 制約 を 追加 し ます
は 、 ファイル を 先読み し て ページキャッシュ に 格納 し ます
直近 の mysqli _fetch _field の コール で 使用 し た フィールドカーソル の 位置 を 返し ます
画像 の 色度 が 白い点 を 設定 し ます
ローカル また は リモートサーバー の データベース を 開始 し ます
directoryiterator を 最初 に 巻き戻し ます
apciterator オブジェクト を 作成 し ます
は 、 &# 0 3 9 ; exp number - 1 &# 0 3 9 ; の 値 を 返し ます
mysqli 拡張 モジュール が 接続 し て いる mysql サーバー の バージョン を 文字列 で 返し ます
モーションブラー を シミュレート し ます
handle が 指し て いる ファイル の ファイル 位置 識別子 を ファイル ・ ストリーム 中 の offset バイト 目 に セット し ます
は 、 eio を 初期化 し ます
dtd に 基づい て ドキュメント を 検証 し ます
db ++ サーバー は 、 各 クライアント 接続 について tcl インタプリタ を 準備 し ます
oauth リクエスト を チェック し ます
文書内 の フィールド 名 の 配列 を 返し ます
画像 の レンダリング 方向 を 設定 し ます
は 、 指定 し た 接続 で 検索 を 行う 準備 を します
ファイル 終端 に 到達 し たか チェック し ます
指定 し た 名前 の 画像 プロファイル を imagick オブジェクト に 追加 し ます
imagick オブジェクト 内 で 現在 アクティブ な 画像 の インデックス を 取得 し ます
は 、 queue で 指定 し た メッセージキュー の メタデータ を 返し ます
フレーム を id 3v 2 タグ に 追加 し ます
アノテーション の 枠 の 形式 を 定義 し ます
新しい ページ を 作成 し 、 指定 し た ページ の 直前 に 挿入 し ます
セット の 要素 数 を 返し ます
ファイル の 拡張子 を 取得 し ます
前 景色 と 背景 色 の 色ペア を 定義 / 再定 義 し ます
は 、 oid で 関連 付け られ た ラージオブジェクト を 削除 し ます
slob オブジェクト を オープン し ます
プロパティ として フィールド に アクセス する ため の マジックメソッド
論理 表記 を 物理 表記 に 変換 し ます
は 、 指定 し た サーバー を サーバープール に 追加 し ます
で 使用 する ため の inotify インスタンス を 初期化 し ます
指定 し た blob の 大きさ を 返し ます
2 - legged フロー あるい は リクエスト の 署名
により 、 結果 セット の 指定 し た カラム から 、 指定 し た サイズ の lob データ を 取得 し ます
関数 は 、 geoip データベース の バージョン を 返し ます
yaf _route _supervar は yaf _route _static と 似 て い ます
さまざまな オプション を もと にし て ブックマーク を 作成 し ます
は 、 指定 さ れ た site コマンド を ftp サーバー に 送信 し ます
別 の imagick オブジェクト から 画像 の クリップマスク を 設定 し ます
関数 は 、 ローカル の マシン に 設定 さ れ て いる 標準 的 な ホスト 名 を 取得 し ます
アクティブ な イベントループ を その 場 で 中止 し ます
この 関数 は 、 指定 し た 文字列 を & raquo ;& nbsp ;rfc 3 9 8 6 に 従っ て url エンコード し ます
指定 し た キー の エントリ が ハッシュ に 存在 する かど う か を 調べ ます
この 関数 は 、 指定 し た アルゴリズム の セルフテスト を 実行 し ます
現在 の エントリ が 配列 あるい は オブジェクト で ある かどう か 、 つまり recursivearrayiterator :: getchildren で イテレータ を 取得 できる かど う か を 返し ます
指定 し た 結果 セット result の 行数 を 取得 し ます
は 結果 の フィールド 数 を 返し ます
この メソッド は 、 実行 可能 で ない tar あるい は zip アーカイブ を 別 の 実行 可能 で ない 形式 に 変換 し ます
ファイル へ の パス を 返し ます
は 、 新しい com オブジェクト の インスタンス を 作成 する こと に 似 て い ます
イテレータ を 巻き戻し て 新た に 反復 処理 を 始め られる よう に し ます
指定 し た キー の エントリ が セット に 存在 する かど う か を 調べ ます
は 、 ユーザー 名 と パスワード を 設定 し ます
現在 の 描画 色 、 線幅 、 塗りつぶし 色 、 塗りつぶし テクスチャ を 使っ て 、 指定 し た 座標 の 配列 による ポリライン を 描き ます
指定 し た エンベロープ envelope および ボディセクション body に 基づい て mime メッセージ を 作成 し ます
オブジェクト の 親 を 取得 し ます
icu の エラーコード 名 を 返し ます
イテレータ から infiniteiterator を 作成 し ます
は 、 キー key に 格納 さ れ た アイテム を 返し ます
ユーザー 定義 の 関数 を 使っ て 、 キー で エントリ を ソート し ます
reflectionextension オブジェクト を 作成 し ます
さまざまな値 を 取得 し ます
この メソッド は 、 データベース 参照 を 作る ため の 柔軟 な インターフェイス です mongodbref を 参照く ださい 
は 、 htmlspecialchars および htmlentities におい て 内部 的 に 使用 さ れる 変換 テーブル を 返し ます
は 、 現在 の アーカイブエントリ を 追加 する 際 に 使用 し た メソッド の 番号 を 返し ます
ウェーブフィルタ を 画像 に 適用 し ます
この 関数 は pdflib バージョン 5 で 廃止 さ れ まし た
ドキュメント の 情報 フィールド を 設定 し ます
現在 の ディレクトリ が 暗号 化 さ れ て いる かど う か を 調べ ます
間隔 を フォーマット し ます
php 変数 var の 型 を 返し ます
既存 の セッション を 再度 初 期化 する か 、 あるい は 新しい セッション を 作成 し ます
は 、 id 3 タグ に 格納 さ れ て いる 情報 を 変更 する ため に 使用 さ れ ます
ユーザー が 定義 し た 関数 の 引数 リスト から 、 指定 し た 引数 を 取得 し ます
展開後 の アーカイブエントリ の サイズ を 取得 し ます
これ は 古い 関数 です
ビルトイン さ れ て いる 画像 を 使っ て php ロゴ を 表示 する 際 に 使用 できる id を 返し ます
ファイル へ の パス を 返し ます
指定 し た ドキュメント の パース で 発生 し た 警告 と エラー を 返し ます
oid が 指す ラージオブジェクト を データベース から 削除 し ます
現在 の テキストライズ の 値 を 設定 し ます
により 、 メッセージキューデータ 構造 体 の msg _perm .uid 、 msg _perm .gid 、 msg _perm .mode および msg _qbytes フィールド を 変更 する こと が 可能 です
は 、 現在 の プロセス の 優先 度 を increment で 指定 さ れ た 値 に 変更 し ます
新しい ミューテックス を 作り 、 オプション で 呼び出し 元用 に ロック し ます
と 、 それ に 関連 する recursiveiteratoriterator :: rewind を コール し た 後 で コール さ れ ます
number で 指定 し た 符号 なし 整数 値 を 1 6 進数 表現 し た 文字列 を 返し ます
gmagick オブジェクト 内 で 現在 アクティブ な 画像 の インデックス を 取得 し ます
関数 session _unset は 現在 登録 さ れ て いる 全て の セッション 変数 を 開放 し ます
油絵風 の 効果 を 施す フィルタ を 適用 し ます
gd イメージ を 、 指定 し た filename に 出力 し ます
mpeg ファイルヘッダ の バージョン を 返し ます
指定 さ れ た 接続 id が 指す データベースサーバー へ の 接続 を 閉じ ます
アニメーション 画像 の 繰り返し 回数 を 設定 し ます
与え られ た gz ファイルポインタ が 指す ファイル の ファイル 位置 記述子 を 、 ファイルストリーム の 先頭 に セット し ます
は 、 phar アーカイブ の スタブ 内 で のみ 使用 し ます
エンコーディング を 文字列 で 設定 し ます
key が 指す 要素 を ユーザーキャッシュ から 削除 し ます
パフォーマンス を 向上 さ せる ため 、 newt は 必要 時 に しか 画面 を 更新 しませ ん
例外 が 作ら れ た ファイル の 名前 を 取得 し ます
この 関数 は 、 domtext クラス の 新しい インスタンス を 作成 し ます
指定 し た 画像 の 補間 方式 を 返し ます
ページ の 平坦 度 を 定義 し ます
で オープン し た パイプ へ の ファイルポインタ を クローズ し ます
すで に 定義 さ れ て いる ストリームラッパー を 無効 に し ます
ページ の 表示 を 、 ページ の バウンディングボックス を ウィンドウ に あわせる よう 設定 し ます
指定 し た 文字列 を & raquo ;& nbsp ;rfc 3 9 8 6 に も とづい て エンコード し ます
画像 の 上 に テキスト を 描画 し ます
操作 モード を 返し ます
画像 シーケンス に 関連 付け られ た ファイル 名 を 取得 し ます
は 、 指定 し た result リソース が 指す 結果 から 1 行分 の データ を 取得 し ます
と似 て い ます が 、 getimagesizefromstring の 最初 の パラメータ は ファイル 名 で は なく 文字 列 と なり ます
新しい タイムスタンプ を 作成 し ます
get / post / cookie 変数 を グローバルスコープ に インポート し ます
ある 値 を 既存 の キー に 追記 し ます
キャッシュ の サイズ の 合計 を 取得 し ます
この メソッド は 、 opendir に対応 し て コール さ れ ます
string を 、 正規 表現 によっ て 配列 に 分割 し ます
ルート 要素 の 名前 を 返し ます
は 、 指定 さ れ た postgresql クエリ 結果 resource に関する メモリ と データ を 開放 し ます
str のすべて の アルファベット を 大文字 に して 返し ます
object _id で 指定 し た オブジェクト に 続く snmp オブジェクト の 値 を 取得 し ます
指定 し た テキスト を 復号 ・ 検証 し 、 署名 の 情報 を 返し ます
指定 し た apc キー が 存在 する かど う か を 調べ ます
は 、 link _identifier が 指す 接続 に おい て 直近 の insert 、 update 、 delete クエリ で 変更 さ れ た レコード の 数 を 返し ます
この 関数 は 、 php から 既存 の クラス を バイトコード として 読み込み 、 開か れ て いる ファイルハンドル に 書き込み ます
指定 し た ファイル を opcode キャッシュ から 削除 し ます
は 、 haystack の 中 で 最後 に needle が 現れる 場所 を 探し 、 haystack の 部分 文字 列 を 返し ます
dom 表現 から html ドキュメント を 作成 し ます
この 関数 は 、 phar の マニフェスト 内 の フラグセット を 返し ます
さまざまな オプション を もと に して 、 新しい pdf ファイル を 作成 し ます
読み込み もしく は 書き込み の ため に gzip . gz ファイル を オープン し ます
指定 し た rng ソース に 基づい て 、 ドキュメント を & raquo ;& nbsp ;relaxng で 検証 し ます
オブジェクト の 輪郭 の 描画 に 使う 色 を 返し ます
prefix に 基づい て 、 ノード の 名前 空間 uri を 取得 し ます
は 、 path で 指定 し た ファイル を ftp サーバー から 削除 し ます
引数 binary _string により 指定 さ れ た 2 進数 と 等価 な 1 0 進数 を 返し ます
この メソッド は 、 fseek に対応 し て コール さ れ ます
この 関数 は 、 暗号 化記 述子 td で 指定 し た 暗号 化 を 終了 し ます
現在 の フォント の フォントエンコーディングベクタ の 中 で ord 番目 の 位置 に ある グリフ を 出力 し ます
関連付け られ て いる プロファイル の うち 、 パターン に マッチ する もの を すべ て 返し ます
この クラス の アクセス 修飾子 の ビットフィールド を 返し ます
デフォルト の イベントループ で 直近 の 処理 が 始まっ た 時刻 を 返し ます
（ x y ） を 左下 の 角と する 矩形 を 描き ます
トランザクション の ロック locking および 分離 レベル isolation を 設定 し ます
画像 の 背景 色 を 設定 し ます
後 で 使用 する ため に 、 画像 を 読み込み ます
配列 から 画像 に ピクセル を インポート し ます
キー で 配列 を ソート し ます
hostname に対応 する mx レコード を dns から 探し ます
オブジェクト 内 の 指定 し た キー に 対応 する 値 を 返し ます
読み込み の セカンダリ へ の 分散 について の 情報 は 、 この マニュアル の 問い合わせ の 節 を 参照く ださい
chdb データベース から 、 キー に 対応 し た 値 を 取得 し ます
指定 し た テーブル について の 情報 を 取得 し ます
bcompiler の exe ファイル から データ を 読み込み 、 バイトコード から クラス を 生成 し ます
は データベース 内 に ラージオブジェクト を オープン し 、 それ を 操作 する ため の ラージオブジェクトリソース を 返し ます
画像 の 型 を 設定 し ます
文字数 に 基づき マルチバイト 対応 の substr 処理 を 行い ます
は 確立 さ れ た データベース を 閉じ 、 により 指定 し た データベースハンドル の 全て の リソース を 開放 し ます
指定 し た エンコーディング の mime charset 文字列 を 取得 し ます
イテレータ を デタッチ し ます
この 関数 は 、 出力 バッファ の 内容 の 長さ を バイト 単位 で 返し ます
直近 に 実行 さ れ た ステートメント が 成功 あるい は 失敗 し た 際 の エラーメッセージ を 文字列 で 返し ます
直近 で 発生 し た 例外 の テキスト や 、 関数 コール が 失敗 し た 理由 の テキスト を 取得 し ます
haystack におい て needle を 検索 し ます
リスト 内 で 逆方 向 に ひとつ 進ん だ とき にまだ オブジェクト が 画像 を 保持 し て いれ ば true を 返し ます
与え られ た 変数 が オブジェクト か どう か を 調べ ます
サーバー から 送 られる ページネーション 情報 を 取得 し ます
ssh の 認証 を 、 ssh agent を 使っ て 行い ます
この 関数 は 、 オブジェクト あるい は オブジェクト 階層 の 全体 を チェックイン し ます
指定 し た object に クラスメソッド が 存在 する かど う か を 調べ ます
結果 セット 内 の カラム を 表示 する ため に 必要 な 最大 の バイト 数 を 返す
指定 し た 画像 の 9 枚 の サムネイル を タイル 状 に 並べ 、 さまざまな 強度 で 画像 処理 を 適用 し ます
最後 に 実行 し た クエリ について の 、 次 の ingres エラー を 取得 し ます
画像 の 周り を 枠線 で 囲み ます
は 、 ftp サーバー から リモートファイル を 取得 し ます
この 関数 は 、 結果 セット に 新しい 名前 を 割り 当て ます
クライアント と の 接続 が 切断 さ れ て いる かど う か を 調べ ます
文字列 の 定義 から 新しい ハッシュ を 作る ファクトリーメソッド です
は 、 truecolor イメー ジ を パレットイメージ に 変換 し ます
例外 メッセージ を 返し ます
この メソッド は 、 stream _select に対応 し て コール さ れ ます
stream に タイムアウト の 値 を 設定 し ます
新しい レイヤー 定義 を 作成 し ます
内部 イテレータ の 現在 の 要素 の キー を 取得 し ます
アウトライン を 最初 に 表示 し た 際 に 、 この ノード を 開く か 開か ない か を 定義 し ます
は 、 指定 し た postgresql connection リソース が 接続 し て いる ポート の 番号 を 返し ます
magic _quotes _gpc の 現在 の 設定 を 返し ます
armor 形式 の 出力 を 切り 替え ます
この メソッド は 、 オブジェクト を クローン さ せ ない よう に し ます
中心 の x 軸 を 基準 し て ピクセル を 反転 さ せ 、 垂直 方向 の ミラー 画像 を 作成 し ます
cyrus imap サーバー へ クエリ を 送信 し ます
値 を 最後 の 要素 として 追加 し ます
result の フィールド 番号 offset の 名前 を 返し ます
抽象 メソッド で ある かど う か を 調べ ます
デフォルト で は 、 ドキュメント は ひとつ の pages オブジェクト を 持っ て おり 、 これ がすべて の ページ の ルート と なり ます
この メソッド は 、 現在 の 要素 の simplexmliterator オブジェクト あるい は null を 返し ます
参照 画像 内 の 色 を 解析 し 、 その 画像 を 表す ため の 色 を 固定 の 色数 で 選び ます
パスワード や 暗号 化 キー の よう な 加工 さ れ た データ を 復元 する 際 に は リクエスト 認証子 が 必要 と なり ます
現在 の 単語 間隔 の 値 を 取得 し ます
名前 を 使用 し て 、 エントリ の ファイルハンドラ を 取得 し ます
コンテンツ を len バイト 分読 み 込み 、 指定 し た バッファ に 保存 し ます
この 関数 の 動作 は 、 ほぼ preg _replace と 同じ です が 、 replacement の 代わり に callback を 指定 する ところ が 異 なり ます
リソース の 監視 を 終了 し ます
image で 指定 さ れ た 画像 上 の 特定 位置 に ある ピクセル の 色 の インデックス を 返し ます
関数 は 、 親 プロセス と その pid および ppid のみ が 異なる 子 プロセス を 生成 し ます
パラメータ が 省略 可能 で ある かど う か を 調べ ます
solrdocument オブジェクト の コピー を 作成 し ます
配列 の サイズ を 返し ます
ラベル を 画像 に 追加 し ます
現在 の プロセス の グループセット を 取得 し ます
ページ の 表示 方法 を 、 三つ の パラメータ left 、 top および zoom で 設定 し ます
反復 処理 が 終了 し た とき recursivetreeiterator :: valid が 最初 に false を 返し た とき に コール さ れ ます
与え られ た 引数 に 従っ て unix の タイムスタンプ を 返し ます
プリペアドステートメント を 実行 し ます
cyrus imap サーバー に 接続 し ます
この メソッド は 、 fread および fgets に対応 し て コール さ れ ます
クラス を 定義 する 拡張 モジュール を 表す reflectionextension オブジェクト を 取得 し ます
handle ファイル の 読み 書き 用 ポインタ の 現在 位置 を 返し ます
この 関数 を 使っ て 、 どの ドライバモジュール を ログ に 記録 し て いる のか を 調べ ます
指定 し た tcp _server tcplisten など に 接続 し 、 デバッグデータ を ソケット に 送信 し ます
arg の ハイパボリックタンジェント を 返し ます
ベンダー 固有 の バイナリ 属性 を 、 現在 の radius リクエスト に アタッチ し ます
を 処理 し ます
直近 の curl 処理 に関する エラー 番号 を 返し ます
画像 を 読み 書き する 前 に ファイル 名 を 設定 し ます
ページオフセット や 処理 方法 を 指定 し て 、 複数 の 画像 を 合成 し ます
現在 の 要素 の 値 を 取得 し ます
イテレータ 内 の すべ て の 要素 に対し て 関数 を コール し ます
ip アドレス 属性 を 、 現在 の radius リクエスト に アタッチ し ます
シーケンス 内 の 特定 の 画像 の フォーマット を 返し ます
は final メソッド な ので 、 オーバーライド でき ませ ん
通常 の ssl ピア 証明 書 および ホスト の チェック を 無効 に し ます
この 関数 は 、 subject の 中 の search を 全て replace に 置換 し ます
この メソッド は エントリ を 新しい 値 で 更新 し 、 更新 でき たか どう か を 返し ます
画像 の 方向 を 取得 し ます
 mqbegin を コール する と 、 作業 ユニット を 開始 し ます
結果 セット 内 の 指定 し た カラム の 位取り を 返し ます
結果 セット を 閉じ ます
複数 の curl ハンドル で 、 データ を 共有 できる よう に し ます
sqlite 3 ライブラリ の バージョン を 、 文字 列定 数 と 数値 で 返し ます
は 、 現在 の セッション 名 を 返し ます
この 関数 は str の 最初 および 最後 から 空白 文字 を 取り除き 、 取り除か れ た 文字列 を 返し ます
エラー の 配列 を 返し ます
は htmlentities の 反対 で 、 string に ある すべ て の html エンティティ を 適切 な 文字 に 変換 し ます
ユーザー / システム キャッシュ を クリア し ます
指定 し た 座標 を 中心 と する 楕円 を 描画 し ます
この 関数 は 、 シーケンス 内 の 文字 を 返し ます
は 、 挿入 さ れ た 行 に 割り 当て られ た oid を 取得 し ます
直近 の sql 文 で 変更 あるい は 挿入 、 削除 さ れ た 行 の 数 を 返し ます
プリペアドステートメント を 実行 し 、 結果 セットオブジェクト を 返し ます
現在 の 描画 パス に 矩形 を 追加 し ます
イテレータ に ある 要素 を カウント し ます
カーソル を 無効 に して 関連 付け られ た 全て の リソース を 開放 し 、 読み込み を キャンセル し ます
ingres データベース へ の 持続 的 接続 を オープン し ます
直近 の コミット 以降 に 発行 さ れ たすべて の 文 を ロールバック し 、 現在 の トランザクション を 終了 し ます
ヘッダ がす でに 送信 さ れ て いる かど う か を 調べ ます
結果内 の エントリ 属性 の 、 すべて の 値 を 読み込み ます
この 関数 は truetype テキスト の bounding box を ピクセル 単位 で 計算 し て 返し ます
ファイル 記述子 fd 上 で オープン し て いる 現在 の 端末 デバイス へ の 絶対 パス を 文字列 で 返し ます
は 、 配列 array から 全 て の 値 を 取り出し 、 数値 添字 を つけ た 配列 を 返し ます
指定 し た slob オブジェクト id bid の slob オブジェクト を 削除 し ます
インタプリタ を 再開 する ため に 、 一般 的 に は ソケット 経由 で 送信 し ます
プリペアドステートメント 内 の パラメータ の 数 を 返し ます
key が cert に対応 する 秘密 鍵 か どう か を 調べ ます
セッション を 破棄 し ます
楕円 を 現在 の パス に 追加 し ます
新しい バイナリデータオブジェクト を 作成 し ます
現在 の 要素 が 子 を 持っ て いる かど う か を 調べ ます
デストラクタ で ある かど う か を 調べ ます
ファイル を 配列 に して 返す こと 以外 は readgzfile と 同じ です
指定 し た 文字 オブジェクト bid に関し て 文字 オブジェクト の 内容 を 更新 し ます
は id を 返し ます
アーカイブ に対する すべ て の 変更 を 取り消し ます
カスタム の シリアライズ で 使わ れ ます
現在 の メールボックス に ある メッセージ 数 を 返し ます
木炭画 を シミュレート し ます
ldap の 検索 結果 を パース し ます
ファイル から 文字 エンコードベクトル を ロード し 、 変更 し ます
と同じ です が 、 ウォッチャー を 自動 的 に は 開始 し ませ ん
イテレータ を 、 次 の 配列 の 要素 に 進め ます
現在 の 塗り つぶし 色 を 取得 し ます
メソッド を アクセス 可能 に し ます
url 経由 で 渡さ れる クエリ 文字 列 と 同様 に str を 処理 し 、 現在 の スコープ に 変数 を セット し ます
現行 の フィールド を 取得 し ます
直近 の soap リクエスト で 送信 さ れ た xml を 返し ます
画像 の 色 を 、 ルックアップテーブル を もと に 置き 換え ます
現在 の directoryiterator アイテム の ファイル 名 を 取得 し ます
は 「 チェック し て 設定 」 という 操作 を 行い ます
この 関数 は 、 オブジェクト の 一意 な 識別子 を 返し ます
線端 を どの よう に 表示 する か を 設定 し ます
は 同名 の c 関数 と 同じ 動作 を します
テーブルデータベース から レコード を 削除 し ます
指定 し た ファイル が 通常 の ファイル か どう か を 調べ ます
指定 し た 名前 および 値 を 使用 し て 、 hw _api _attribute の 新しい インスタンス を 作成 し ます
は 、 数値 アイテム の 値 を offset で 指定 し ただけ 減ら し ます
画像 の 遅延 を 取得 し ます
新規 soapparam オブジェクト を 生成 し ます
2 つの lob / file ロケータ を 比較 し ます
トランザクション を ロールバック し ます
ポラロイド 写真 を シミュレート し ます
この 関数 は 、 指定 し た calendar について year 年 month 月 の 日数 を 返し ます
は 、 item で 指定 し た 文字列 を sqlite sql ステートメント で 使用 できる よう に 正しく クオート し ます
は 、 phar :: startbuffering メソッド と 組み合わせ て 使用 し ます
この 関数 は 、 出力 バッファ の 内容 を 消去 し ます
エージェントセッション 用 に 確保 さ れ た メモリ を 開放 し ます
 mqconnx を コール する と 、 アプリケーションプログラム を キューマネージャ に 接続 し ます
この 関数 は 、 db 2 データベースクライアント について の 情報 を 読み取り 専用 の プロパティ に 保持 する オブジェクト を 返し ます
シグナル sig を プロセス id pid の プロセス に 送信 し ます
は 、 ランダム に 生成 さ れ た 秘密 鍵 および 指定 し た method を 使用 し て data を シール 暗号 化 します
現在 の キー を 取得 し ます
パターン の 定義 を 終了 し ます
php が 出力 を 送信 し はじめる とき に コール する 関数 を 登録 し ます
textflow および 関連 付け られ た データ 構造 体 を 削除 し ます
次 の 要素 に 移動 し ます
msg _number が 指す メッセージ に 削除 予定 の マーク を します
入力 ／ 出力 ドキュメント の エンコーディング を 設定 し ます
小文字 の ベースライン から の 距離 を 取得 し ます
reflectionclass オブジェクト の 文字 列表 現 を 返し ます
xml 要素 の 名前 を 取得 し ます
ラージオブジェクト の データ を 他 の ラージオブジェクト に 追加 し ます
この rararchive オブジェクト の 文字 列表 現 を 取得 し ます
は 、( 0 1 の 範囲 の 疑似 乱数 を 返し ます
塗りつぶし 色 や 塗り つぶし テクスチャ を 使っ た 描画 の とき に 使う 不透 明度 を 設定 し ます
現在 定義 さ れ て いる 全て の 定数 の 名前 と 値 を 返し ます
は 、 ブラウザ に 送信 さ れる 際 クッキー の 値 が 自動 的 に url エンコード さ れ ない こと を 除き 、 setcookie と 等価 です
画像 に ラジアルブラー を 施し ます
複数 の 画像 を モーフィング し ます
特定 の 画像 チャネル の 深度 を 返し ます
現在 の 描画 色 、 線幅 、 塗りつぶし 色 、 塗りつぶし テクスチャ を 使っ て 、 指定 し た 座標 の 配列 による 多角 形 を 描き ます
関数 は 、 maxdb 拡張 モジュール で 使用 さ れ て いる 、 クライアント の バージョン を 表す 文字 列 を 返す ため に 使用 さ れ ます
プロセス の タイトル を 設定 し ます
指定 し た リレーション relation の 最初 の タプル の データ を 読み込み 、 連想 配列 として tuple に 返し ます
radius リクエスト を 発行 する 前 に は 、 ライブラリ が 接続 可能 な サーバー を 知っ て いる 必要 が あり ます
dn で 指定 し た エントリ について 、 名前 の 変更 また は 移動 を 行い ます
格納 さ れ て いる 変数 を キャッシュ から 取得 し ます
は 機能 的 に memcached :: setmulti と 同等 です
内部 的 な zend の 値 を 表す 文字列 を ダンプ し ます
キー で エントリ を ソート し 、 キー と 値 の 関係 は 保持 し ます
新しい domprocessinginstruction オブジェクト を 作成 し ます
これ は arrayaccess インターフェイス を 実装 し た もの です
データベース は 、 一回 の 応答 で 最大 4mb まで の ドキュメント を ひと まとめ に し て 送信 し ます
arg を 出力 し ます
開始行 を 取得 し ます
また は imagecolorallocatealpha で 確保 さ れ た 色 を 開放 し ます
多く の 関数 で 利用 さ れる 値 を 設定 し ます
メソッド は 、 最後 に 実行 し た memcached クラス の メソッド の 結果 コード の 内容 を 説明 し た 文字列 を 返し ます
php の カレントディレクトリ を directory に 変更 し ます
パラメータ を 変数 に バインド し ます
jpeg ファイル を wbmp ファイル に 変換 し ます
パラメータ value を 値と する num 個 の エントリ から なる 配列 を 埋め ます
新しい イテレータ を arrayobject インスタンス から 作成 し ます
id 3 タグ の ジャンル を 返し ます
クォート さ れ た 文字列 を 元 に 戻し ます
ドライバ 内 で 、 現在 トランザクション が アクティブ に なっ て いる かど う か を 調べ ます
オブジェクト を ストレージ に 追加 し 、 オプション で それ を 何ら か の データ に 関連 づけ ます
結果 セット の 次 の 結果 を 返し ます
画像 の 遅延 を 設定 し ます
この 色 に 関連 づけ られ た 色 カウント を 返し ます
filename が 存在 し て 、 かつ それ が 書き込み 可能 で あれ ば true を 返し ます
底 を 1 0 と する arg の 対数 を 返し ます
は 、 shm _identifier で 指定 し た 共有 メモリセグメント から 変数 variable _key を 読み こみ ます
は 、 指定 し た image を xbm にし て 出力 あるい は 保存 し ます
水平 方向 に 反転 さ せ た 画像 を 作成 し ます
path の 作業 コピー を revno で 指定 し た リビジョン に アップデート し ます
この 関数 は 、 xmlタグ の 中 で 定義 さ れ た 属性 と その 値 を 取得 し ます
parentiterator に 含まれる 内部 イテレータ の 子 を 取得 し ます
pdf ブロック を 、 その プロパティ に 基づい た さまざまな データ で 塗り つぶし ます
は 、 直近 の yaz _scan の 実行 時 に サーバー から 受信 し た 項目 と 関連 情報 を 返し ます
は 、 principal の 新しい パスワード を password に 設定 し ます
現在 の パス に 円 を 追加 し ます
現在 の エントリ の イテレータ を 返し ます
必須 パラメータ を 削除 し ます
データ を 順 に パース し 、 指定 し た mime メールリソース に 格納 し ます
現在 の ノード から 、 名前 空間 namespaceuri における localname という ローカル 名 の 属性 の 値 を 取得 し ます
ファイル から 1 文字取り出す
指定 し た フィールド の オプション を 設定 し ます
画像 の 深度 を 設定 し ます
結果 セット 内 の 指定 し た カラム の 名前 を 返し ます
ユリウス 積算 日 を & quot ;月 / 日 / 年 &quot ; の 形式 で ユリウス 暦 を 含む 文字 列 に 変換 し ます
指定 し た オフセット の 値 を 設定 し ます
ファイル を 読ん で 標準 出力 に 書き出し ます
ページ の サイズ および 方向 を 、 定義 済み の フォーマット に 変更 し ます
文字列 の 定義 から 新しい ハッシュ を 作る ファクトリーメソッド です
与え られ た ファイルポインタ から 返さ れ た bzip 2 エラー の エラー の 文字列 を 返し ます
sql の 集約 関数 として 使用 する php 関数 を 登録 し ます
は 、 マルチバイト 対応 の strripos 操作 を 、 文字数 に 基づい て 行い ます
mpeg ファイル が 著作 権 で 保護 さ れ て いる 場合 に true を 返し ます
結果 セット の 行数 を 返し ます
png 画像 を 読み込み ます
evprepare ウォッチャーオブジェクト を 作り 、 自動 的 に 開始 さ せ ます
マルチハンドル に対し て 、 個別 の 転送 に メッセージ / 情報 が 残っ て いる かど う か を 問い合わ せ ます
glob 式 から 新しい ディレクトリイテレータ を 作成 し ます
この 関数 は 、 入力 data を gzip プログラム の 出力 と 互換 性 の ある 形式 で 圧縮 し て 返し ます
指定 し た フィールド の フラグ を 設定 し ます
データベース に 送信 する 文字 列 は utf - 8 で なけれ ば なり ませ ん
ある 単語 が 、 現在 の セッション 内 に 既 に 存在 する かど う か を 調べ ます
スタック し た オブジェクト を すべ て 実行 し 終え た ワーカー を シャットダウン し ます
この メソッド は 、 memcached の オプション の 値 を 返し ます
文書 から フィールド を 除去 し ます
名前 空間 namespaceuri に ある localname という 名前 の 属性 を 要素 から 削除 し ます
は 、 ファイルシステム 上 の ファイル の データ を もと にし て 新しい ラージオブジェクト を データベース 内 に 作成 し ます
zip ファイルアーカイブ の 中 の 次 の エントリ を 読み込み ます
次 の 要素 が 利用 可能 と なっ た とき に コール さ れ ます
配列 の 要素 を glue 文字列 で 連結 し ます
ある 数 の 平方根 を 余り つき で 計算 し ます
例外 を 文字列 で 表現 し た もの を 返し ます
は event の 実行 予定 を 追加 し ます
バッファ つき イベント が 操作 する ファイル 記述子 を 変更 し ます
は 、 ftp list コマンド を 実行 し 、 結果 を 配列 として 返し ます
関数 は 、 現在 の 結果 セット の pos で 指定 し た 位置 に ある レコード を 調べ ます
クラス の ドキュメントコメント を 取得 し ます
tar あるい は zip アーカイブ を イテレータ から 作成 し ます
ファイルストリーム に おい て 現在 の オフセット を 表す ファイルポインタ の 現在 位置 を 返し ます
指定 し た エラー 番号 errno に対応 する posix システムエラーメッセージ を 返し ます
指定 し た データベース に おける フィールド （ カラム ） 数 を 取得 し ます
ファイル から 画像 を 読み込み ます
は 、 eio _poll を 呼ぶ カスタムループ の 中 から コール さ れ ます
現在 の directoryiterator アイテム が シンボリックリンク で ある かど う か を 調べ ます
は msql サーバー と の 接続 を 確立 し ます
指定 し た 大きさ と フィルタ で 、 画像 の サイズ を 変更 し ます
データベースオブジェクト から コレクション を 取得 する ため の 最 も 簡単 な 方法 です
指定 し た index の 値 を newval に 設定 し ます
結果 セット を 解放 し ます
テーブル を 、 ページ 全体 あるい は 部分 的 に 配置 し ます
例外 が スロー さ れ た 際 の 内部 情報 を 返し ます
現在 の 位置 から 指定 さ れ た 座標 まで の 直線 を 現在 の パス に 追加 し ます
パラメータ を reflectionparameter の 配列 で 取得 し ます
imagick オブジェクト に 関連 付け られ た ページ の ジオメトリ を 返し ます
新しい oauthprovider オブジェクト の インスタンス を 作成 し ます
この 関数 は 、 作成 し た ボタン を 含む グリッド を 返し ます
青 が 一番 強い 点 を 返し ます
perl の carp :: croak と 同じ よう に 動作 し ます
は フィールド 長 を 返し ます
8bim プロファイル の 最初 の パス が 存在 する 場合 に 、 それ に そっ て 切り 取り ます
新しい レコード を データベース に 書き込み ます
定義済 み の ディザリング 閾値 マップ に も とづい た 、 複数 の 強度 レベル による 配列 ディザリング を 行い ます
クエリ を 実行 し 、 単一 の 結果 を 返し ます
共通 の 属性 を 有する セッション を 検索 する 際 に 使用 し ます
指定 し た xml インスタンス 文字 列 から sdo _dataobjects の ツリー を 作成 し ます
format に 基づき 、 バイナリ 文字 列 から 配列 に 分解 し ます
は 、 指定 し た リンク id に関連付け られ た msql サーバー と の 持続 的 で ない 接続 を 閉じ ます
imagemagick の ホーム url を 返し ます
フラグ について の 情報 を 取得 し ます
は 機能 的 に memcached :: prepend と 同等 です
で 定義 し た pdf の 結果 を 出力 する 対象 の フレーム を 設定 し ます
オブジェクト の デフォルト の 圧縮 品質 を 設定 し ます
は 、 http リクエスト に対する レスポンス 内 で サーバー によっ て 送出 さ れ た ヘッダ の 配列 を 返し ます
は 、 jpeg あるい は tiff の 画像 ファイル から exif ヘッダ を 読み込み ます
特定 の フィールド に対する boost 値 を 取得 し ます
文字列 str に関し て 「 半角 」- 「 全角 」 変換 を 行い ます
新しい 行 を データベース に 格納 し ます
ファイル file に バイナリ 形式 の パッチファイル patch を 適用 し 、 結果 を ファイル dest に 保存 し ます
トークンハンドラコールバック として 登録 し た 関数 を コール し ます
hostname で 指定 し た インターネットホスト の ipv 4 アドレス を 返し ます
は 、 直近 の エラーメッセージ を 返し ます
現在 の ページ を 一時 停止 し ます
は 、 key を pem エンコード し た 文字 列 として 取得 し 、 out （ 参照渡 し ） に 格納 し ます
は 、 強力 な 一方向 ハッシュアルゴリズム を 使っ て 新しい パスワードハッシュ を 作り ます
イテレータ の 現在 の エントリ が 有効 か どう か を 返し ます
curl セッション 用 の 複数 の オプション を 設定 し ます
は 、 bzip 2 形式 の データ を 含む 文字 列 を 解凍 し ます
その ページ の 現在 の 変換 行列 を 取得 し ます
lob の 内部 ポインタ の 現在 位置 から length バイト 読み込み ます
コールバック 関数 を 取得 し ます
画像 の 背景 色 を 返し ます
 mqput 1 は 、 ひとつ の メッセージ を キュー に 置き ます
は 、 filename で 指定 し た ini ファイル を ロード し 、 連想 配列 として その 設定 値 を 返し ます
この オブジェクト の 、 指定 し た チャネル の 値 を 正規 化 し た もの を 設定 し ます
新しい domelement オブジェクト を 作成 し ます
アーカイブエントリ の ホスト os の コード を 返し ます
日付け を フランス 革命 暦 から ユリウス 積算 日 に 変換 し ます
ユーザーキャッシュ に 格納 さ れ た データ について の 情報 を 取得 し ます
は 、 キー （ 文字 列形 式 ） を 配列 に 分割 し ます
は 、 needle が haystack の 中 で 最初 に 現れる 位置 を 返し ます
ロック さ れ た オブジェクト の ロック を 解除 し ます
ステートメントリソース あるい は 接続 リソース から 、 指定 し た オプション の 値 を 取得 し ます
実行 中 の スクリプト に関する 情報 を 、 一般的 に は ソケット 経由 で リクエスト し ます
samconnection オブジェクト に対し て & quot ;disconnect &quot ; メソッド を コール する と 、 php スクリプト と メッセージングサーバー と の 接続 を 解除 し ます
この 関数 は 、 連想 配列 に おい て 各配 列 の キー と 要素 と の 関係 を 維持 しつつ 配列 を ソート し ます
は 、 指定 し た リビジョン url repos _url の 中身 の 完全 な 履歴 を 返し ます
この 関数 は 、 コマンドヒストリ を ファイル から 読み込み ます
個々 の ピクセル の 輝度 を 閾値 と 比較 し 、 その 色 を 変更 し ます
指定 し た 結果 id が 指す frontbase 結果 の 内部 行 ポインタ を 指定 し た 行番 号 に 移動 し ます
文字列 を utf - 1 6 フォーマット から utf - 8 に 変換 し ます
この 関数 は 、 apache の table _get および table _set の ラッパー です
文字列 の 長さ を 取得 し ます
大文字 小文字 を 区別 せ ず 、 文字 列内 で 最初 に あらわ れる 場所 の 書記 素単 位 の 位置 を 見つけ ます
と似 て い ます が 、 datetimeimmutable で 動作 し ます
プロセス の タイトル を 設定 し ます
ネゴシエート さ れ た メソッド の リスト を 返し ます
画像 の 遅延 を 設定 し ます
を 使っ て 、 文字 列内 の 特殊 文字 を エスケープ し て から データベース に 送信 し ます
が サポート する アルゴリズム で 生成 し た 有効 な ハッシュ を 渡す と 、 その ハッシュ に関する 情報 の 配列 を 返し ます
現在 の imagick オブジェクト へ の 参照 を 返し 、 画像 ポインタ を 正しい シーケンス に 設定 し ます
配列 input から offset および length で 指定 さ れ た 要素 を 削除 し 、 配列 replacement で それ を 置換 し ます
パーサ の オプション を 設定 あるい は 変更 し ます
この 関数 は 、 soap サーバー で soap エラーハンドラ を 使用 する かど う か を 設定 し ます
対象 に マッチ する 任意 の 点 の 色 の 値 を 変更 し ます
は ms sql サーバー へ の 接続 を 確立 し ます
paradox ファイル に 保存 さ れ て いる 日付 を 、 人間 が 理解 し やすい 形式 に 変換 し ます
form に 複数 の コンポーネント を 追加 し ます
配列 イテレータ の クラス 名 を 設定 し ます
は 、 結果 リソース の 行 の 位置 を 指定 さ れ た offset に セット し ます
は 、 mp 3 ファイル 内 の id3 タグ の バージョン を 取得 し ます
新規 テンプレート の 定義 を 開始 し ます
要素 の メンバ として name という 名前 の 属性 が 存在 する かど う か を 示し ます
さまざまな オブジェクト や イベント に 適用 可能 な アクション を 作成 し ます
は sybase _fetch _array に 似 て い ます が 、 違い が 一つ あり ます
で 実行 する ため の クエリ を 準備 し ます
テーブルデータベース 上 で 検索 を 実行 し ます
アプリケーション 内 で 、 場所 によっ て デバッグ の レベル を 増減 する 際 に 使用 可能 です
この 関数 は 、 domcdatasection クラス の 新しい インスタンス を 作成 し ます
opcode キャッシュ による メモリ 使用 状況 について の 情報 を 取得 し ます
それ 以降 の すべ て の リクエスト 用 の ノンス を 設定 し ます
新しい スレッド を 開始 し 、 実装 さ れ て いる run メソッド を 実行 し ます
この 関数 は 、 指定 し た アルゴリズム が ブロックアルゴリズム の 場合 に true 、 ストリームアルゴリズム の 場合 に false を 返し ます
この 関数 は 、 domattr クラス の 新しい インスタンス を 作成 し ます
スクリプト の 実行 を 停止 し 、 接続 し て いる ソケット から の 応答 を 待ち受ける ため に 使用 し ます
この 関数 は 、 現在 の ノード の インデックス を 返し ます
は 、 指定 し た filename から 得 られ た イメージ を 表す イメージ id を 返し ます
result に 関連 する 直近 の select 、 update あるい は delete クエリ により 変更 さ れ た 行 の 数 を 返し ます
allo コマンド を ftp サーバー に 送信 し 、 アップロード さ れる ファイル の ため の スペース を 確保 し ます
ディスク 上 に 新しい ファイル を 作成 し 、 postscript ドキュメント を その 中 に 書き込み ます
イベント 発生 時 に コール さ れる callable 関数 です
画像 の 解像 度 の 単位 を 設定 し ます
は 指定 さ れ た ファイル の サイズ を バイト 数 で 返し ます
内部 イテレータ の 現在 の 要素 が 子 を 持つ かど う か を 調べ ます
画像 の 輝度 を 引き伸ば し て 飽和 さ せ ます
指定 し た インターフェイス が 定義 さ れ て いる かど う か を 調べ ます
関数 は 、 error _reporting ディレクティブ を 実行 時 に 設定 し ます
paradox ファイル の リソース を 削除 し 、 メモリ を 開放 し ます
指定 し た バージョン version で 、 機能 feature が サポート さ れ て いる かど う か を 調べ ます
画像 の 輪郭 を なめらか に し ます
現在 の プロセス の 実効 ユーザー id を 設定 し ます
ページ を どの よう に 表示 する か を 定義 し ます
は 、 日付 / 時刻 関数 で 使用 さ れる デフォルトタイムゾーン を 設定 し ます
fdf ドキュメント を 文字 列 として 返し ます
は 、 指定 し た command を 実行 し 、 結果 を 出力 する c 言語 の system 関数 に 似 て い ます
指定 し た 符号 化方 式 で データ を 圧縮 し ます
は 、 指定 し た ingres database と の 接続 を オープン し ます
zip アーカイブ の コメント を 返し ます
通常 、 echo や print など の あらゆる 出力 は 、 親 の スコープ から 出力 し て いる か の よう に 出力 さ れ ます
array のすべて の キー を 小文 字 あるい は 大文字 に し た 配列 を 返し ます
テーブル および インデックス に関する 統計 情報 を 取得 し ます
クエリ の 並び順 を 設定 し ます
この メソッド は 、 参照 する ファイル の ファイル 名 を 返し ます
インポート さ れ た pdf ドキュメント の 要素 を 処理 し ます
internal _encoding で エンコード さ れ た 文字列 を output _encoding に 変換 し ます
ファイル を 読み込み 、 解凍 し 、 標準 出力 に 書き込み ます
テキスト の アノテーション で 使う フォント の ポイント 数 を 設定 し ます
crud 操作 以外 の ほと んどすべて の 操作 は 、 データベースコマンド で 行い ます
ローカルクラスプレフィックス を 登録 し ます
の よう な 描画 関数 によっ て 事前 に 作成 さ れ た パス を 塗り つぶし ます
シンボリックリンク の ターゲット を 返し ます
odbc クエリ から 、 連想 配列 を 取得 し ます
は 、 事前 に openssl _public _encrypt で 暗号 化 さ れ た data を 復号 し 、 それ を decrypted に 格納 し ます
指定 し た バッファ つき イベント に データ を 書き込み ます
ページ の 平坦 度 を 取得 し ます
アーカイブエントリ の 、 os に 依存 する 属性 を 返し ます
指定 し た wddx パケット を 終了 し 、 パケット を 含む 文字 列 を 返し ます
と同じ です が 、 ウォッチャー を 自動 的 に は 開始 し ませ ん
指定 し た メッセージ の 本文 全体 、 あるい は その 一部 を 保存 し ます
内部 イテレータ を 取得 し ます
は 、 array 1 の 各要 素 に callback 関数 を 適用 し た 後 、 その 全 て の 要素 を 含む 配列 を 返し ます
指定 し た 対象 を 指し て いる すべ て の ソースアンカー を 取得 し ます
関数 は 、 socket パラメータ で 指定 し た ソケット に o _nonblock フラグ を 設定 し ます
リポジトリ の url を 指定 し て 、 ファイル の svn blame を 取得 し ます
バッファ を 修正 する ため の ob _start コールバック 関数 です
この メソッド は 、 接続 を 認証 済み の 状態 に し ます
この 接続 に おける 全て の 未解 決 の 命令 を ロールバック し ます
複数 の クエリ を データベース 上 で 実行 し 、 マッチ する レコード を 返し ます
は 、 指定 し た image に 多角 形 を 作成 し ます
設定 し た フォント を 返し ます
現在 の 属性 の 親要 素 に カーソル を 移動 し ます
xml パーサ parser の 表記 法宣 言用 ハンドラ 関数 を 設定 し ます
指定 し た ファイル から 読み込ん だ yaml ドキュメントストリーム 全体 ある い は その 一部 を 、 php の 変数 に 変換 し ます
イテレータ を 取得 し 、 データベース 内 の すべ て の キー / 値 を 反復 処理 できる よう に し ます
imagick オブジェクト の グローバル gravity プロパティ を 設定 し ます
現在 の データベース の プロファイリングレベル を 返し ます
fam サービス へ の 接続 を クローズ し ます
oracle サーバー へ の 持続 的 接続 を 生成 し 、 ログオン し ます
終了 行番 号 を 取得 し ます
oldname を newname に リネーム し 、 必要 なら ディレクトリ を 移動 しよ う と 試み ます
最小 の メッセージ 深刻 度 を 設定 し ます
事前 に 作成 さ れ た 構造 体要 素 やその 他 の 内容 を アクティブ に し ます
ファイル を パース し ます
data で 指定 し た データ を socket で 指定 し た ソケット に 送信 し ます
この ノード が jste で ある かど う か を 調べ ます
現在 の 水平 方向 の 拡大 率 を 取得 し ます
は php バックトレース を 生成 し ます
は 、 指定 し た ドキュメント について 発生 し た tidy アクセシビリティ 警告 の 数 を 返し ます
php の 変数 variable を oracle プレースホルダ bv _name に バインド し ます
setsecurity は 、 snmp プロトコルバージョン 3 で 使う セキュリティ 関連 の セッションパラメータ を 設定 し ます
新しい 一時 ファイルオブジェクト を 作成 し ます
phar アーカイブ 内 で 、 この ファイル 用 の マニフェスト に 保存 さ れ た メタデータ を 返し ます
php が リンク さ れ て いる oracle c クライアント ・ライブラリ の バージョン 番号 を 含む 文字 列 を 返し ます
は 複数 回 コール さ れる こと も ありえ ます
値 を ビューエンジン に 代入 し ます
host に対応 する type 型 の レコード を dns から 探し ます
指定 し た 名前 の 画像 プロファイル を gmagick オブジェクト に 追加 し ます
新しい quickhashstringinthash オブジェクト を 作り ます
例外 が スロー さ れ た 際 の 内部 情報 を 返し ます
シリアライズ さ れ た php データ として xml レスポンス を 返し ます
すべて の 定義 済み 関数 を 配列 で 返し ます
が 呼ば れ た とき に 使用 する 、 カスタムクラス を 設定 し ます
文字 が アルファベット の 場合 、 str の 各単 語 の 最初 の 文字 を 大文字 に し た もの を 返し ます
さまざまな値 を 設定 し ます
から 返さ れ た 接続 id が 指す interbase データベース へ の リンク を 閉じ ます
トランザクション を コミット し ます
variant の 絶対 値 を 返し ます
ストリーム 再生 する ビデオ の 幅 と 高さ を 設定 し ます
画像 の 総 インク 密度 を 取得 し ます
テンプレート の ベースディレクトリ を 設定 し ます
オブジェクト を ストレージ から 取り除き ます
php スクリプト に 割り 当て られ た メモリ の 最大値 を 、 バイト 単位 で 返し ます
クエリ 結果 result _id の 全て の 行 を html テーブル に フォーマット し ます
配列 を 受け取っ て 、 要素 の 順番 を 逆に し た 新しい 配列 を 返し ます
画像 の レンダリング 方向 を 取得 し ます
は 、 ある クエリー 結果 の フィールド に関し て 情報 を 得る ため に 使用 し ます
は 、 ラージオブジェクト の カレント の シーク 位置 に データ を 書き込み ます
現在 の 描画 色 を 取得 し ます
disable _functions ディレクティブ で 関数 が 無効 に なっ て いる かど う か を 調べ ます
ベジエ 曲線 を 現在 の パス に 追加 し ます
パス を 閉じ 、 その 輪郭 を 描き ます
現在 の ファイル の パス と ファイル 名 を 取得 し ます
oracle サーバー へ の 新規 接続 を 確立 し 、 ログオン し ます
データベース に 新しい レコード を 挿入 し ます
関数 の 開始 行番 号 を 取得 し ます
content を テキスト に 持つ メールボックス の 名前 を 配列 で 返し ます
この メソッド は 、 ノード が 属性 を 保持 し て いる かど う か を 調べ ます
は 、 pid の 優先 度 を 設定 し ます
確保 し た 参照 を 解放 し ます
ストリーム を インポート し 、 ソケット を ソケットリソース に カプセル 化 し ます
直近 の レスポンス に関する http 情報 を 取得 し ます
現在 の パス を 閉じ ます
画像 シーケンス を マージ し ます
xml パーサ parser の 外部 エンティティ 参照 用 ハンドラ 関数 を 設定 し ます
使用 中 の 出力 ハンドラ の 一覧 を 返し ます
string の 単語 数 を 数え ます
カレントノード の 親 ノード を 返し ます
個々 の ピクセル の 輝度 を 閾値 と 比較 し 、 その 色 を 変更 し ます
イテレータ を 前 の ノード に 移動 し ます
2 つの gmp 数 の ビット and を 計算 し ます
この メソッド は 、 すべて の stat 関連 の 関数 に 対応 し て コール さ れ ます
この 関数 は コマンドヒストリ を ファイル に 書き込み ます
filename の 中 の コード を 構文 ハイライト 表示 し て 出力 し ます
この 関数 は 、 有効 な グリフ 名 を 取得 する ため に adobe の フォントメトリックファイル を 必要 と します
この 関数 は モード 名 を 返し ます
後 の 書式 設定 で 使用 する テキスト の 前処 理 を 行い 、 textflow オブジェクト を 作成 し ます
次 の xpath クエリ 用 の prefix / ns コンテキスト を 作成 し ます
 mqclose を コール する と オブジェクト へ の アクセス を 破棄 し ます
phar アーカイブ 内 の ファイル の crc 3 2 チェックサム を 返し ます
は 現在 の セッションid を 新しい もの と 置き 換え ます
現在 の バッファ の 中身 を 取得 し 、 出力 バッファ を 削除 し ます
文字列 haystack の 中 で 、 needle が 最後 に 現れる 位置 を 探し ます
ファイル file の バイナリパッチ を 元 ファイル に 適用 し て 作成 する ファイル の サイズ を 返し ます
は 、 データベース に key および value で 記述 さ れる エントリ を 挿入 し ます
によっ て 開始 し た パターン を 終了 し ます
この 関数 は 、 ibase _connect あるい は ibase _pconnect のいずれか によっ て オープン さ れ た データベース を 削除 し ます
handle が 指し て いる ファイル を クローズ し ます
この 関数 が 非推 奨 で ある かど う か を 調べ ます
gmagickpixel オブジェクト の 色 を 配列 で 返し ます
現在 の 配列 の 要素 を 取得 し ます
サンプルモード の xhprof プロファイラ を 終了 し ます
抽象 クラス で ある かど う か を 調べ ます
は 、 が 指す データベース の 次 の キー を 返し 、 内部 キーポインタ を 進め ます
固定 長配 列 から php の 配列 を 返し ます
この 関数 は 、 与え られ た クラス class とその 親 が 実装 し て いる インターフェイス を 配列 で 返し ます
は 、 指定 さ れ た リンク id が 指す サーバー 上 で 現在 アクティブ な データベース に クエリ を 送信 し ます
画像 の 合成 演算子 を 設定 し ます
ユーザー 定義 の 関数 あるい は メソッド で 、 パラメータ の デフォルト 値 を 取得 し ます
指定 し た フィールド の 長さ を 返し ます
ms -sql サーバー から の 直近 の メッセージ を 取得 し ます
result _id に 間連 する クエリ の リソース を 解放 し ます
は 配列 array の 最後 の 値 を 取り出し て 返し ます
すべて の 既存 ガベージサイクル を 強制 的 に 収集 し ます
周辺 の ピクセル の 輝度 の 範囲 に も とづい て 、 各 ピクセル の 閾値 を 選択 し ます
メモリ 内 で の ファイル の 状態 を ストレージデバイス に 同期 さ せ ます
直近 の mysql 関数 から の エラー 文字 列 を 返し ます
この 関数 は 、 有効 な dsn （ 複数 回 の コール の 後 ） の リスト を 返し ます
xml パーサ parser の 要素 ハンドラ 関数 を 設定 し ます
gmagick が サポート する フォーマット を 返し ます
この メソッド は 、 既存 の ハッシュ を ディスク に 保存 し ます
offset の 位置 に 、 文字列 data を 挿入 し ます
読み込み 用 に 新規 に zip アーカイブ を オープン し ます
は mssql _fetch _array に 似 て い ます が 、 配列 の 代わり に オブジェクト が 返さ れる という 違い が あり ます
もし パラメータ が 設定 さ れ て いれ ば 削除 し ます
現在 の パス を 、 描画 範囲 の 境界 として 定義 し ます
offset を whence で 指定 さ れる 位置 に 追加 する こと で 、 ファイル の 始め から バイト 単位 で ファイルポイント を 移動 さ せ ます
、 imap _mail _move 、 あるい は imap _setflag _full で 削除 用 マーク を 設定 さ れ たすべて の メッセージ を 削除 し ます
ディスク 上 の 定義 ファイル から 新しい ハッシュ を 作る ファクトリーメソッド です
直近 の mysql 関数 で 発生 し た エラー の 番号 を 返し ます
画像 の ガンマ を 取得 し ます
生成 さ れ た pdf データ を 含む バッファ の 内容 を 取得 し ます
input を multiplier 回 を 繰り返し た 文字列 を 返し ます
value を 双方 向 リンクリスト の 先頭 に 追加 し ます
は variable で 指定 さ れ た apache 環境 変数 の 値 を 設定 し ます
指定 し た 幅 の 一行 中 に 配置 できる 文字 の バイト 長 を 返し ます
関数 は 、 すべて の geoip データベース 形式 について の 詳細 情報 を 多次 元 配列 で 返し ます
は 、 データベース へ の 直近 の 接続 が 失敗 し た 原因 を 表す sqlstate を 返し ます
サポート する すべ て の エンコーディング の 配列 を 返し ます
リモート ftp サーバー の システム 型 id を 返し ます
fdf ドキュメント を 閉じ ます
mpeg ファイル の レイヤ 通常 は 3 で 、 これ は mp3 を 意味 し ます を 返し ます
で後 で 使用 する よう に ページ を 準備 し ます
この 接続 上 で 最後 に 成功 し た insert クエリ が 自動 生成 し た id を 返し ます
画像 の シーン を 設定 し ます
haystack 文字列 の 中 で needle が 最初 に 登場 し た 場所 を 含め て それ 以降 の 部分 文字 列 を 返し ます
は 新しい xml パーサ を 作成 し 、 他 の xml 関数 が 使用 する ハンドル を 返し ます
新しい テキストオブジェクト を 開始 し 、 テキスト の 現在 位置 を 0 0 に 設定 し ます
空 の domdocumenttype オブジェクト を 作成 し ます
は 、 req に 関連 づけ られ た 直近 の エラー の 説明 を 文字列 で 返し ます
は データベース 接続 を 調べ 、 その 接続 が 壊れ て いる 場合 に は 再度 接続 を 試み ます
フォント の 垂直 descent ベースライン の 下側 の 高さ を 取得 し ます
シンボリックリンク filename の グループ を group に 変更 しよ う と 試み ます
画像 の サイズ を 指定 し た もの に 変更 し 、 関連 付け られ た プロパティ を すべ て 削除 し ます
ページ の 幅 を 設定 し ます
トップレベル の 内部 イテレータ の 最初 の 要素 に イテレータ を 巻き戻し ます
埋め込ん だ ループ に対し て 単一 の 非 ブロックスイープ を 行い ます
新しい oauth オブジェクト を 作成 し ます
関数 により 、 単一 の メッセージ 参照 について 現在 の ドメイン を 上書き する こと が でき ます
ファイル filename の 所有 者 を 名前 また は 番号 で 指定 し た ユーザー user に 変更 しよ う と 試み ます
final メソッド で ある かど う か を 調べ ます
は 、 指定 し た result _identifier に関連付け られ た 結果 から データ を 1 行取 得 し ます
フォームデータ を 含む ファイル を オープン し ます
オープン し て いる ファイルハンドル から 画像 を 読み込み ます
sqlite 拡張 ライブラリ を 読み込み ます
は 、 配列 array の 値 を キー とし 、 array における その 値 の 出現 回数 を 値と し た 配列 を 返し ます
get 変数 を 取得 し ます
さまざまな パラメータ を 取得 し ます
指定 し た アドレス の xml インスタンスドキュメント から sdo _dataobjects の ツリー を 作成 し ます
str の soundex キー を 計算 し ます
は 、 指定 さ れ た データベース を 最適 化 し ます
この 関数 は 次 の 関数 の エイリアス です
内部 文字 エンコーディング を 設定 あるい は 取得 し ます
結果 の エントリ から 、 属性 の すべ て の 値 を 読み込み ます
は 指定 し た リンク id が 指す サーバー 上 の 現在 アクティブ な データベース に クエリ を 送信 し ます
ふたつ の パス path 1 および path 2 の 差分 を 再帰 的 に 取得 し ます
現在 の 要素 を 返し ます
は クライアント ・ プロトコル および サーバー の バージョン を 配列 で 返し ます
シーケンス 内 の 特定 の 画像 の ファイル 名 を 返し ます
は ftp サーバー から リモートファイル を 取得 し 、 それ を ローカルファイル に 保存 し ます
現在 の 塗り つぶし 色 を 取得 し ます
dom 表現 から xml ドキュメント を 作成 し ます
result から テーブル 名 を 取得 し ます
オブジェクト に パラメータ を 追加 し ます
システムエラー 、 また は zip メッセージ に関する エラー 情報 を 返す
name という 名前 の 属性 を 、 指定 し た 値 に 設定 し ます
直近 に 保存 さ れ た 描画 状態 を 復元 し ます
指定 し た データ から blob を 作成 し ます
splfileobject は 子 を 持た ない の で この メソッド は 常 に false を 返し ます
gmagick の コンストラクタ です
テキスト の アノテーション で 使う フォント の ウェイト を 設定 し ます
ステータスコード が 正常 終了 を 表し て いる かど う か を 調べ ます
ノード の コピー を 作成 し ます
は 、 指定 さ れ た 結果 id が 指す sybase 結果 の 内部 行 ポインタ を 指定 し た 行番 号 に 移動 し ます
は 、 bytea 型 の ため に 文字列 を エスケープ し 、 エスケープ し た 文字列 を 返し ます
現在 の directoryiterator の 位置 が 有効 な ファイル で ある かどう か チェック し ます
新規 セッション id を 生成 し て 返し ます
画像 の 仮想 ピクセルメソッド を 設定 し ます
現在 の エントリ が ディレクトリ で ある かど う か を 調べ ます
画面 の 再描 画 を readline に 依頼 し ます
は 、 ob _start の コールバック 関数 です
imagick オブジェクト に 関連 付け られ たすべて の リソース を クリア し ます
ファイル が 実行 可能 か どう か を 調べ ます
キャッシュヒット の 総数 を 取得 し ます
pdflib の マイナーバージョン 番号 を 返し ます
は 、 項目 の 値 を value だけ 減ら し ます
出力 バッファリングハンドラ の ネストレベル を 返し ます
新しい イベントベース を 返し ます
は 、 データ を 保存 せ ず に セッション を 終了 し ます
filename を リモートファイルシステム 上 の 有効 な 実パス に 変換 し ます
は 、 指定 し た リンク id に 関連 付け られ た サーバー 上 の 現在 アクティブ な データベース に クエリ を 送信 し ます
新しい paradox データベースファイル を 作成 し ます
この 関数 は 、 配列 を 逆順 に 高位 から 低位 に ソート し ます
テキスト 内 の バイト の 型 を 取得 し ます
は 、 memcached サーバー へ の 接続 を 確立 し ます
は 、 指定 さ れ た リンク id に 関連 付け られ た サーバー 上 の 現在 アクティブ な データベース に クエリ を 送信 し ます
マップ 内 の 反復 処理 中 に 、 現在 の 値 を 返し ます
補間 方法 を 設定 し ます
添付 さ れ た 画像 を 指定 し た ファイル 名 で 保存 し ます
imagick オブジェクト を 破棄 し 、 関連 する リソース を すべ て 開放 し ます
は 、 data から 最大 len バイト を ファイル fd に 書き込み ます
この 関数 は 、 指定 し た 色 の インデックス を 必ず返し ます
( 名前 また は 番号 で 指定 し た ファイル filename の グループ を group に 変更 しよ う と 試み ます
現在 の 要素 が 有効 か どう か を 調べ ます
オープン さ れ た slob オブジェクト に関し て 現在 の ファイル また は シーク 位置 を 返し ます
は 、 ファイルシステム の 状態 を callback の result で 返し ます
ページ の 線幅 を 定義 し ます
画像 の 高さ を 返し ます
この 関数 は 、 gettimeofday 2 への インターフェイス です
この 関数 は 物理 的 な コピー を 作成 し ます
矩形 を 描画 し ます
画像 の サイズ を 指定 し た 大きさ に 変更 し ます
ドキュメント の 現在 の ページ を 取得 し ます
left _operand の 、 modulus を 法と する 剰余 を 取得 し ます
現在 位置 を 次 の 要素 に 移動 し ます
は string の 内容 を 与え られ た gz ファイル に 書き込み ます
画像 の 配置 方法 を 設定 し ます
は 、 数値 アイテム の 値 を offset で 指定 し ただけ 増や し ます
aql query を 、 指定 し た server および dbpath で 実行 し ます
は 、 マルチバイト 対応 の strrpos 操作 を 、 文字数 に 基づい て 行い ます
hostname で 指定 し た リソース へ の ソケット 接続 を 開始 し ます
は 、 正規 化 し た 絶対 パス を callback 関数 の result 引数 で 返し ます
は 、 指定 し た host へ の ftp 接続 を オープン し ます
大文字 小文字 を 区別 し ない マッチング の ため の 正規 表現 を 作成 し ます
行列 を 現在 の 変換 行列 current transformation matrix : ctm に 追加 し ます
ページ の マイターリミット の 現在 値 を 設定 し ます
結果 を 保持 する リソース を 開放 し ます
直近 で 発生 し た 例外 の 番号 や 、 失敗 し た 関数 コール の 理由 を 表す 番号 を 取得 し ます
xmlreader オブジェクト が 現在 パース し て いる 入力 を 閉じ ます
frontbase の 警告 を 有効 また は 無効 に し ます
a と b をかけ 、 結果 を 返し ます
ストレージ の 文字 列表 現 を 返し ます
コマンドラインヒストリ 全体 を 取得 し ます
と似 て い ます が 、 datetimeimmutable で 動作 し ます
複数 の 画像 を 合成 し て 画像 を 作成 し ます
値 の 保存 可能 な 表現 を 生成 し ます
画像 に 特殊 効果 を 施し 、 印画紙 の 特定 の 箇所 の 露光 時間 を 長く し た よう な 画像 に なり ます
画像 の 解像 度 の 単位 を 設定 し ます
yaf _config _ini から php の 配列 を 返し ます
オブジェクト が 配列 として 扱わ れる 際 に 、 文書 に フィールド を 追加 する ため に 使用 さ れ ます
結果 の 指定 し た フィールド に 関連 付け られ た フラグ を 取得 し ます
指定 さ れ た フォント の 文字 の 高さ を ピクセル 単位 で 返し ます
画像 から チャネル を 分離 し 、 グレースケール 画像 を 返し ます
指定 し た データ から clob を 作成 し ます
は 、 / etc / protocols に 基づき プロトコル 番号 number が 指す プロトコル 名 を 返し ます
現在 の 要素 の 、 name という 名前 の 属性 ノード を 返し ます
関数 は 接続 し て いる （ link で 表さ れる ） サーバー の バージョン を 整数 値 で 返し ます
画像 の 明度 、 飽和 度 、 色相 を 制御 し ます
この 関数 は 、 domcomment クラス の 新しい インスタンス を 作成 し ます
オープン さ れ た ディレクトリエントリ から 読み込み ます
拡張 モジュール で 定義 さ れ て いる 定数 を 取得 し ます
mpeg ファイル の 長さ を 返し ます
画像 の 輪郭 を 明る く し たり 暗く し たり する こと によっ て 、 三次元 の ボタン 風 の 効果 を シミュレート し ます
は 、 指定 し た マップ map の マスタ nis サーバー の マシン 名 を 返し ます
この 文書 内 の フィールド 数 を 返し ます
この 関数 は 、 複合 語 を 正しい 複合 語 として 処理 する かど う か を 定義 し ます
は 、 カレント の phpリク エスト を 実行 し て いる apache プロセス を リクエスト 終了 時点 で 終了 しま す
arg の アークハイパボリックサイン を 返し ます
オブジェクト の 輪郭 の 不透 明度 を 返し ます
を もっと 簡単 に する もう ひとつ の 方法 です
result _id に 関連 する クエリ により 変更 さ れ た 行 の 数 を 返し ます
は 、 connection リソース で 指定 し た postgresql データベース へ の 持続 的 で ない 接続 を 閉じ ます
は 、 array の 先頭 に 指定 さ れ た 要素 を 加え ます
既 に 処理 が 始まっ て いる 場合 は 、 例外 を スロー し ます
文字列 str の 幅 を 返し ます
left および right を 整数 値 に 変換 し 、 整数 の 除算 を 行い ます
現在 の 行番 号 を 取得 し ます
配列 targets で 指定 し た 、 ローカル の 作業 コピー で 変更 さ れ た ファイル の 内容 を リポジトリ に コミット し ます
拡張 モジュール で 定義 さ れ て いる の クラス 名 の 一覧 を 取得 し ます
は 、 指定 し た リンク が 指す ingres サーバー へ の 接続 を クローズ し ます
画像 の 長さ を バイト 数 で 返し ます
php の 設定 オプション option の 値 を 取得 し ます
stream の モード を ブロック あるい は 非 ブロック に 設定 し ます
名前 を 使用 し て 、 エントリ の 場所 を 取得 し ます
青 が 一番 強い 点 を 設定 し ます
色度 が 白い点 を 返し ます
文字列 str を 指定 し た 幅 width で 丸め ます
この 関数 は 、 domdocument :: getelementsbytagname と 同じ です が 、 指定 し た id から 要素 を 検索 する 点 が 違い ます
指定 し た ファイルポインタ から の データ を 読み込み 、 uuencode さ れ た ファイル を 一時 ファイル に 展開 し ます
や odbc _exec から 返さ れ た 行 データ を 取得 し ます
指定 し た 変数 が リソース か どう か を 調べ ます
この 関数 は 、 インデックス と それ に 対応 する 要素 を 関連 づけ た 配列 を ソート し ます
代入 し た 変数 を 取得 し ます
接続 connection を 閉じ ます
は 、 数値 アイテム の 値 を offset で 指定 し ただけ 増や し ます
指定 し た 名前 の サービス を 中断 し ます
によっ て 開始 さ れ た 現在 の トランザクション を ロールバック し ます
以前 dbplus _lockrel により 得 られ た 書き込み ロック を 開放 し ます
これ は arrayaccess インターフェイス を 実装 し た もの です
指定 し た 画像 image の 指定 し た 位置 に 、 文字 c を 垂直 に 描画 し ます
この メソッド は 、 phar アーカイブ 内 の ファイル を bzip あるい は zlib で 圧縮 し ます
sdo _das _xml _document オブジェクト を 文字列 に 保存 し ます
ftp サーバー 上 の 、 指定 し た directory を 削除 し ます
プリペアドクエリ を 解放 し ます
与え られ た 結果 セット 中 にまだ レコード が ある かど う か を 見つけ ます
リモートファイルシステム 上 の ファイル を 削除 し ます
現在 の 破線 の パターン を 取得 し ます
新しい domcomment オブジェクト を 作成 し ます
タイムスタンプ を 変更 し た 新しい datetimeimmutable オブジェクト を 作り ます
で リレーションファイル を 探す際 の 仮想 カレントディレクトリ を 変更 し ます
xml ドキュメント を ファイル から 読み込み ます
この メソッド を 使用 する と 、 任意 の ファイル あるい は url を tar / zip アーカイブ に 追加 する こと が でき ます
関数 で 定義 さ れ て いる 必須 パラメータ の 数 を 取得 し ます
テキスト の アノテーション で 使う フォント の スタイル を 設定 し ます
画像 の 背景 色 を 設定 し ます
アクセストークン 、 secret そして 追加 の レスポンスパラメータ を サービスプロバイダ から 取得 し ます
solr サーバー から の 生 の レスポンス を 返し ます
クライアント から の 変数 を 取得 し ます
プロセス に対し て 、 指定 し た 秒数 後 に sigalrm シグナル を 送信 する タイマー を 作成 し ます
ご存知 の とおり 、 define は 非常 に 遅い です
事前 に 静的 メソッド create で 作成 し た xml das に対し て 、 2 番目 以降 の スキーマファイル を 読み込み ます
画像 の 前景 色 を 設定 し ます
指定 し た ユーザー に関する 情報 を 配列 で 返し ます
指定 し た 定数 imagetype _xxx に対応 する 拡張子 を 返し ます
現在 の ストレージ の 要素 を 返し ます
この 関数 は 、 指定 し た イベント の ハンドラ として php ユーザー 関数 を 登録 し ます
この 関数 は 、 url の 問い合わせ 部分 に 使用 する 文字 列 の エンコード や 次 の ページ へ 変数 を 渡す際 に 便利 です
select クエリ が 実行 さ れ た 後 、 フィールド に関する 情報 を 配列 として 返し ます
サーバー から の xml レスポンス を 表現 する solrobject を 返し ます
デジタル 透かし を 画像 に 埋め込み ます
次 の directoryiterator アイテム に 移動 し ます
直近 の mysqli 関数 の コール が 成功 あるい は 失敗 し た 際 の エラーコード を 返し ます
これ は 、 phar アーカイブ 内 の ファイル が gzip あるい は bzip 2 で 圧縮 さ れ て いる かど う か を 返し ます
文書内 の フィールド を 取得 し ます
クエリ を 準備 また は 実行 さ れ た 後 、 この 関数 を コール する こと により 、 クエリ 結果 中 で カラム 数 が 得 られ ます
これ は 、 イテレータ を 先頭 に 巻き戻し ます
この メソッド は 、 現在 の 要素 の xml タグ 名 を 取得 し ます
この 文書 に対する boost 値 を 設定 し ます
この 関数 は アルゴリズム 名 を 返し ます
ユーザー が サスペンドキー （ 通常 は ^ z ） を 押し た 際 に 起動 する コールバック 関数 を 設定 し ます
は 、 pathname で 指定 し た ファイル あるい は ディレクトリ へ の 監視 を 追加 あるい は 変更 し ます
は フィールド の 精度 を 返し ます
この 関数 は 、 ファイル の 拡張 属性 を 削除 し ます
localname および namespaceuri で 指定 し た ノード を 取得 し ます
この 関数 により 単一 の 参照 について カレント の ドメイン を 上書き する こと が でき ます
ダンプディレクトリ の apd _dump _{ process _id } への デバッグ を 開始 し ます
pwl ファイル を 使用 し て 辞書 を 作成 し ます
ピクセル の サンプリング によっ て 、 指定 し た 大きさ に 画像 の 倍率 を 変更 し ます
画像 の 一部 を 抽出 し ます
この メソッド は 、 レプリカセット へ の 接続 に対し て のみ 使え ます
内部 ポインタ を 次 の フィールド に 移動 し ます
シグナルイベント を デフォルトループ に 送り ます
ノード が 定義 さ れ た 行 の 番号 を 取得 し ます
オプション で 指定 し た 属性 を 使用 し て 、 構造体 要素 ある い は その 他 の 内容 を オープン し ます
指定 し た 領域 内 に テキスト を 表示 し ます
属性 の 、 指定 し た 言語 に おける 値 を 返し ます
は 、 配列 array の 各要 素 に callback 関数 を 繰り返し 適用 し 、 配列 を 一つ の 値 に 減ら し ます
ディスク 上 の 定義 ファイル から 新しい ハッシュ を 作る ファクトリーメソッド です
は 、 指定 し た link _identifier に関連付け られ た サーバー 上 の アクティブ な データベース を 設定 し ます
現在 の イテレータエントリ の 内部 イテレータ を 返し ます
は ハードリンク を 作成 し ます
指定 し た オフセット の 値 を 返し ます
シーケンス 内 の 特定 の 画像 の フォーマット を 返し ます
array 1 の キー を array 2 の キー と 比較 し 、 その 差 を 返し ます
グレースケール 画像 に 三次 元効 果 を 施し た もの を 返し ます
変数 を データ 領域 に キャッシュ し ます
現在 の 配列 の 添字 を 返し ます
pecl / oauth に関する sbs を 生成 し ます
アーカイブ 内 の ファイル を 削除 し ます
と似 て い ます が 、 stream _get _contents は 既 に オープン し て いる ストリームリソース に対し て 操作 を 行い ます
辞書 の 詳細 を 返し ます
イテレータ 上 に parentiterator を 作成 し ます
seed により 乱数 生成 器 に シード を 指定 し ます
ユーザー 定義 関数 の ファイル 名 を 取得 し ます
指定 し た 点 を 通る ベジエ 曲線 を 画像 上 に 描き ます
apc の 共有 メモリ 割り当て に関する 情報 を 取得 し ます
filename 内 の 各行 を パース し & lt ;meta &gt ; タグ 内 の 情報 を 配列 として 返し ます
コレクション の サイズ を 返し ます
は 、 新しい csr certificate signing request を dn の 情報 に 基づい て 作成 し ます
画像 の アルファチャネル の 値 を 取得 し ます
オフセット の 設定 を 解除 し ます
この メソッド は 、 テーブルデータベース で は サポート し て いませ ん
拡張 モジュール の ini エントリ を 取得 し ます
データベース 内 の レコード を 更新 し ます
この 関数 は 、 まだ ibase _blob _close で 閉じ られ て い ない 場合 に blob を 捨て ます
最初 の 属性 に カーソル を 移動 し ます
シード seed で 乱数 ジェネレータ を 初期化 し ます
直近 に 起動 し た プリペアドステートメント について の sqlstate エラーコード を 含む 文字 列 を 返し ます
コンシューマハンドラコールバック を 設定 し ます
画像 の 一部 を 削除 し 、 そこ に あっ た 画像 を なく し ます
enchant プロバイダ を 列挙 し 、 その 基本 情報 を 通知 し ます
文書 から フィールド を 除去 し ます
left _operand と right _operand を 比較 し 、 結果 を 整数 値 で 返し ます
key に 関連 づけ られ た 値 を 、 1 あるい は inc _by で 指定 し た 数 だけ 増や し ます
この クラス が インターフェイス で ある かど う か を 調べ ます
は 、 指定 し た アクセスモード で dbase データベース を オープン し ます
mode で 指定 さ れ た 方法 で string に対し て ケースフォルディング を 行い ます
パース する xml を 含む データ を 設定 し ます
現在 の ノード の 中身 を 、 ノード 自身 も 含め て 読み込み ます
有効 期限 を 過ぎ た セッション を 削除 し ます
は 、 sqldbc 通信 を トレース する ため に 使用 さ れ ます
イテレータ が アタッチ さ れ て いる かど う か を 調べ ます
アイテム を レジストリ に 追加 し ます
curl セッション を 閉じ 、 全て の リソース を 開放 し ます
は pclose と 似 て い ます が 、 proc _open で 開か れ た プロセス に対し て のみ 機能 する という 点 で 異 なり ます
バッファリング さ れ たすべて の 出力 を ファイル に 強制 的 に 書き込み ます
この 関数 で 、 どの 程度 の 冗長 性 で ログ を 記録 する か とどんな 活動 を 記録 する か を 設定 し ます
テンプレート の 定義 を 終了 し ます
キャッシュ さ れ た ファイル や ユーザー 変数 の バイナリダンプ を apc キャッシュ から 取得 し 、 指定 し た ファイル に 出力 し ます
画像 の 背景 色 と 同じ色 の 輪郭 を 削除 し ます
画像 を 元 の サイズ の 二 倍 に 比例 拡大 し ます
imagemagick パッケージ 名 を 返し ます
パース さ れる xml ドキュメント を 含む uri を 設定 し ます
指定 し た hash の 名前 を 取得 し ます
指定 し た フィールド が ある テーブル の 名前 を 返し ます
関数 は 、 socket から 送 られ て くる 受信 、 送信 ある い はすべ て （ デフォルト ） の データ を 停止 し ます
参照先 の オブジェクト が まだ 存在 する かど う か を 調べ ます
この 関数 は 、 オブジェクト あるい は オブジェクト 階層 の 全体 を チェックアウト し ます
指定 し た データベース の 現在 の 状態 を 取得 し ます
終了 し た 子 プロセス の リターンコード を 返し ます
この 関数 により 単一 の 複数 形 メッセージ の 参照 について カレント の ドメイン を 上書き する こと が でき ます
直近 の mysqli 関数 の コール が 成功 あるい は 失敗 し た 際 の エラーメッセージ を 返し ます
次 の 要素 が 利用 可能 と なっ た とき に コール さ れ ます
画像 の 透過 色 を 、 rgb 値 の 範囲 を 用い て 定義 し ます
ヒープ にまだ ノード が ある かど う か を 調べ ます
キー を 指定 し て ハッシュ から 値 を 取得 し ます
は 現在 の セッション id を 取得 また は 設定 する ため に 使用 さ れ ます
暗号化 さ れ た 画像 を 復号 し ます
この メソッド は 、 memcached の オプション の 値 を 設定 し ます
現在 の 接続 に おける 、 デフォルト の 文字 セット を 設定 し ます
空 の 配列 を 返し ます
ユーザー username の パスワード を 変更 し ます
現在 の イテレータ の キー を 取得 し ます
key -value ペア を データベース に 格納 し ます
文書 キャッシュサーバー の 統計 情報 を 返し ます
ファイル の 所有 者 を 取得 し ます
現在 の プロセス の グループ id を 設定 し ます
は 、 ラージオブジェクト を 作成 し て その oid を 返し ます
は 引数 filename から 得 られる 画像 を 表す 画像 id を 返し ます
登録済み の ルート を 取得 し ます
シェーディングオブジェクト に 基づい た シェーディング で 、 領域 を 塗り つぶし ます
スタックトレース の 配列 を 返し ます
与え られ た gz ファイルポインタ から 非圧縮 の 1 文字 を 読み込み 、 これ を 含む 文字列 を 返し ます
ip _address で 指定 し た インターネットホスト の ホスト 名 を 返し ます
syslog 関数 で 使用 さ れる 全て の 定数 を 初期化 し ます
は 、 指定 し た query を ingres サーバー に 送信 し ます
クエリ 中 の 全て の フィールド の informix sql フィールドプロパティ を 連想 配列 として 返し ます
swf 出力 の 圧縮 レベル を 設定 する
field の 名前 を 返し ます
ファイル の splfileobject オブジェクト を 作成 し ます
この 関数 は 、 mysql _query で 指定 可能 なよう に unescaped _string を エスケープ し ます
直近 の フラッシュ 以降 に リレーション relation に 適用 さ れ たすべて の 変更 を ディスク に 書き込み ます
圧縮後 の アーカイブエントリ の サイズ を 取得 し ます
環境 を 取得 し ます
テキスト の 出力 位置 を 設定 し ます
readline に 、 カーソル が 新しい 行 に 移動 し た こと を 通知 し ます
現在 の プロセス の 有効 な グループ id を 返し ます
この 関数 は 、 php スクリプト を コンパイル し て opcode キャッシュ に 追加 し ます が 、 スクリプト は 実行 し ませ ん
文字列 に 変換 し ます
他 の イベントループ に 埋め込める バックエンド 群 を 返し ます
ドキュメント 内 の 次 の ノード に カーソル を 移動 し ます
ディレクトリ から 次 の エントリ の 名前 を 返し ます
は 共有 メモリブロック を 作成 また は オープン し ます
新しい マップ を 作り ます
は 、 path で 指定 し た ファイル を アクセスモード mode で 開き ます
が コール さ れる まで は 、 これ は null を 返し ます
により 中断 さ れ た 指定 し た リソース へ の 監視 を 再開 し ます
ページ の リクエスト の 間か エラースタック が リセット さ れ て 以来 生じ た 全て の imap エラー 存在 すれ ば を 返し ます
sql の スカラー 関数 として 使用 する php 関数 を 登録 し ます
は 、 セッション ・ ストレージ に 保存 さ れ て い た 元 の 値 で セッション を 再初 期化 し ます
この 関数 は 、 domelement クラス の 新しい インスタンス を 作成 し ます
許可 さ れる 最大 の 深さ を 設定 し ます
メモリ 上 の 画像 フォーマット を 直接 操作 し ます
整形式 xml 文字列 を オブジェクト として 返し ます
left _operand の right _operand 乗 を 求め ます
その バイトストリーム が 指定 し た エンコーディング で 有効 なもの かど う か を 調べ ます
id 3 タグ の トラック 番号 を 返し ます
指定 し た フィールド の 値 を 取得 し ます
シーケンス 内 の 特定 の 画像 の ファイル 名 を 設定 し ます
web リソース へ の リンク を 追加 し ます
画像 を x 軸方 向 あるい は y 軸方 向 に 押しつぶし 、 平行 四 辺形 を 作成 し ます
uri を 使用 し て データベース に 接続 し ます
は 、 system v セマフォ を 指定 し た キー で アクセス する ため に 使用 可能 な id を 返し ます
ビューエンジン を 取得 し ます
現在 の パス を クリッピングパス として 使用 し 、 パス を 終了 し ます
 / f キー の 値 を 取得 し ます
unix タイムスタンプ 値 timestamp を vt _date 型 の variant に 変換 し ます
検証 の 際 に 使用 する relaxng スキーマ の ファイル 名 あるい は uri を 設定 し ます
へ の エイリアス です
の 結果 や oracle から 取得 し た 、 oracle の カーソル および 文 に 関連 付け られ た 全て の リソース を 解放 し ます
名前 で フィールド を 取得 し ます
次 の 要素 が ある とき は 、 イテレータ を 次 の 要素 に 移動 し ます
pdostatement オブジェクト に 相当 する 結果 セット に ある カラム 数 を 返す ため に pdostatement :: columncount を 使用 し ます
複数 の ヘッダ 要素 を 含む オブジェクト を 取得 し ます
この 関数 は 、 端末 に ビープ 音 を 送信 し ます
現在 の directoryiterator アイテム を 取得 し ます
グリフ 名 や unicode 値 を 、 カスタムエンコーディング に 追加 し ます
は string で 指定 さ れ た 文字列 が pattern で 指定 さ れ た シェルワイルドカード に マッチ する かどう か チェック し ます
ハッシュ の 要素 数 を 返し ます
画像 に 特殊 効果 を 施し 、 セピア 調 の 写真 の よう な 画像 に し ます
開い て いる ファイルハンドル に 画像 シーケンス を 書き出し ます
画像 の レイヤー を ひとつ にまとめ ます
指定 さ れ た メールボックス mailbox の 購読 を 中止 し ます
は 、 memcached サーバー と の 接続 を 閉じ ます
クエリ から 、 結果 セット の 次 の 行 を 含む オブジェクト を 返し ます
は 、 memcached :: * bykey 系 の 操作 で 指定 さ れ た server _key に対応 する サーバー を 返し ます
各 画像 を シーケンス 内 の 次 の 画像 と 比較 し 、 最大 の 境界 範囲 を 返し ます
msglist で 指定 さ れ た メッセージ を 、 指定 し た メールボックス に コピー し ます
呼び出し元 が 、 ファイル に 割り 当て られ た ディスク 空間 を 直接 操作 できる よう に し ます
ブローカーリソース を 、 その 辞書 ととも に 開放 し ます
指定 し た odbc 結果 id の 番号 で 指定 し た フィールド の 精度 を 取得 し ます
自身 と 同じ 本体 と バインド 変数 を 持つ新しい 無名 関数 を 作っ て 返し ます
作業 コピー あるい は リポジトリ の 内容 を 、「 クリーン な 」 ディレクトリ に エクスポート し ます
クエリーパラメータ を 指定 さ れ た 値 に 設定 し ます
は 、 互い に 接続 さ れ て おり 区別 でき ない ソケットストリーム の 組 を 作成 し ます
画像 を シャープ に し ます
最小 の エラー 深刻 度 を 設定 し ます
は 機能 的 に memcached :: getmulti と 同等 です
ふたつ の 画像 を 合成 し て ひとつ の 画像 に し ます
readline コールバックインターフェイス を 設定 し 、 プロンプト prompt を 表示 し て 入力 を 受け取り ます
作成 さ れ た pdf ファイル を 閉じ 、 さまざまな オプション を 適用 し ます
は 、 他 の 全て の 引数 に 存在 する array 1 の 値 を 全て 有 する 配列 を 返し ます
findandmodify コマンド は 、 単一 の ドキュメント を アトミック に 変更 し て 返し ます
画像 の 色 を 、 参照 画像 の 中 の 最も 近い色 に 置き 換え ます
offset で 指定 し た 位置 から count 文字 ぶん の 文字 を 削除 し ます
blob の 長さ や 他 の 便利 な 情報 を 返し ます
次 の 待機 中 の fam イベント を 返し ます
一つ 以上 の ランダム な エントリ を 配列 から 取り出し 、 取り出し た エントリ の キー を 返し ます
指定 し た 色 に 最も 近い 色合 い 、 白 、 黒 を 有する 色 の インデックス を 取得 し ます
opcode キャッシュ の 中身 と その 利用 状況 について の 情報 を 取得 し ます
関数 は 、 object _id から 始まる snmp オブジェクト を 走査 し 、 その 値 と オブジェクト id を 返し ます
関数 socket _sendto は 、 アドレス addr の port を 使用 し 、 buf から ソケット socket に len バイト の データ を 送信 し ます
は 、 クライアントライブラリ の バージョン を 表す 文字 列 を 返し ます
imagemagick の ライセンス を 文字列 で 返し ます
変数 に 含ま れる すべ て の 要素 、 あるい は オブジェクト に 含まれる 何か の 数 を 数え ます
関数 は 、 ホスト 名 あるい は ip アドレス に 対応 する 二文字 の 国 コード を 返し ます
は 、 複数 の 配列 を 一度 に 、 また は 、 多次 元 の 配列 を その 次元 の 一つ で ソート する 際 に 使用 可能 です
mod を 法として base の exp 乗 を 計算 し ます
指定 し た filename から postscript type 1 フォント を 読み込み ます
直近 の クエリ 通常 は insert により auto _increment カラム 用 に 生成 さ れ た id を 取得 し ます
は 、 uuencode さ れ た 文字列 を デコード し ます
新しい イベントリソース を 作成 し て 返し ます
読込み 用 に zip ファイル の 中 に ディレクトリエントリ を オープン し ます
プロファイラ を 終了 し て 、 xhprof の 実行 結果 データ を 返し ます
この 関数 は 、 子要素 oldnode を 新しい ノード に 置き換え ます
は 、 クライアントライブラリ が スレッドセーフ に コンパイル さ れ て いる かど う か を 示し ます
ドキュメント の 使用 権限 を 定義 し ます
imagick オブジェクト に 関連 付け られ て いる 画像 の 数 を 返し ます
textflow の 次 の 部分 を 、 矩形 領域 に 配置 し ます
自動 文字 エンコーディング 検出 の 順番 を encoding _list に 設定 し ます
この 関数 は 、 fsockopen と 全く 同様 に 動作 し ます
画像 リスト から 画像 を 削除 し ます
オープン さ れ た 、 あるい は 作成 さ れ た アーカイブ を 閉じ 、 変更 内容 を 保存 し ます
soap リクエスト を 処理 する ハンドラ として 、 soapserver :: setclass のよう な 単 なる クラス で は なく 特定 の オブジェクト を 設定 し ます
は 、 libxml エラーバッファ を クリア し ます
ベジエ 曲線 を 現在 の パス に 追加 し ます
この 関数 は 、 cc および bcc 受信 者 の 正確 な 処理 を 行っ て email を 送信 する こと が 可能 です
は ラージオブジェクトリソース の 位置 を シーク し ます
ディレクトリ を 指定 する こと により 、 この 関数 は 対応 する ファイルシステム また は ディスクパーティション で 利用 可能 な バイト 数 を 返し ます
文字列 str の 文字 セット を in _charset から out _charset に 変換 し ます
fbsql デーモン で 現在 使用 可能 な データベース を 含む 結果 ポインタ を 返し ます
与え られ た 文字 列 text のすべて の 文字 が 数字 で ある かど う か を 調べ ます
サーバー 上 で 実行 中 の トランザクション の 状態 を 返し ます
例外 の コピー を 作成 しよ う とし ます
は 機能 的 に memcached :: delete と 同等 です
この メソッド は 、 新た な エントリ を ハッシュ に 追加 し て 追加 に 成功 し た かどう か を 返し ます
この 関数 は 、 キャッシュ ・ インスタンス について の 構成 情報 を 返し ます
テーブル の カラム および 関連 する メタデータ を 含む 結果 セット を 返し ます
それ 以降 の リクエスト 用 の oauth の バージョン を 設定 し ます
画像 の インターレース 手法 を 取得 し ます
が返す ldap 検索 結果 を ソート し ます
指定 し た curl 共有 ハンドル に 、 オプション を 設定 し ます
リダイレクト 先 を 自動 的 に たどる 機能 を 無効 に し 、 リクエスト を 手動 で リダイレクト できる よう に し ます
chdb の ファイル を メモリ に マップ する こと によって 読み込み ます
file _name で 指定 し た ファイル 用 の 新しい splfileinfo オブジェクト を 作成 し ます
magic .mime ファイル の 情報 を 用い て 、 ファイル の mime content type を 返し ます
文字列 の ハッシュ を 返し ます
木炭画 を シミュレート し ます
実行 可能 で ない tar / zip アーカイブ は エイリアス を 持つ こと が でき ない ので 、 この メソッド は 単 に 例外 を スロー し ます
画像 の 前景 色 を 返し ます
solrparams :: setparam の エイリアス
この 関数 が ユーザー 定義 関数 な の か 内部 関数 な のか を 調べ ます
タグ が 存在 する けれ ども 中身 が 空 の 場合 に true を 返し ます
は 、 relation に 新しい セカンダリインデックス を 作成 し ます
は 、 af _inet 型 で すべて の ローカルインターフェイス の 指定 し た ポート 上 で 新規 接続 を 待ち受ける 新規 ソケットリソース を 作成 し ます
与え られ た ファイルポインタ から 返さ れ た bzip 2 エラー の エラー 番号 を 返し ます
参照 する ファイル の ファイルサイズ を バイト 数 で 返し ます
すべて の サブツリー を 飛ば し て 、 カーソル を 次 の ノード に 移動 し ます
は ラージオブジェクト を クローズ し ます
指定 し た ファイル および ユーザー 変数 の バイナリダンプ を apc キャッシュ から 返し ます
新規 に pdflib オブジェクト を 作成 し ます
は 指定 さ れ た コマンド command を 実行 し ます
配列 にまだ 要素 が ある かど う か を 調べ ます
この 関数 は 、 引数 で 渡し た フォーム を 実行 し ます
赤 が 一番 強い 点 を 設定 し ます
指定 し た rgb 値 と alpha レベル に 「 近い 」 画像 パレット 中 の 色 の インデックス を 返し ます
は 、 すべて の 既存 項目 を 直ち に 無効 に し ます
yaf _config _ini の コンストラクタ です
idna の ascii 方式 で エンコード さ れ た ドメイン 名 を utf - 8 で エンコード さ れ た unicode に 変換 し ます
指定 し た サーバー 上 で 新しい データベース の 作成 を 試み ます
データ の 比較 に コールバック 関数 を 用い 、 追加 さ れ た 添字 の 確認 も 含め て 配列 の 共通項 を 計算 し ます
attempts to strip 読み込む テキスト から html と php タグ を 取り除こ う と する こと 以外 、 splfileobject :: fgets と 同じ です
ビット の implication 操作 を 行い ます
は 、 shm _attach で 作成 さ れ 、 指定 し た shm _identifier を 有する 共有 メモリ へ の 接続 を 閉じ ます
署名 方式 を 設定 し ます
ノード が 兄弟 ノード を 持つ かど う か を 調べ ます
mpeg ファイル の ビットレート を 返し ます
は 、 文字列 string の start および オプション の length パラメータ で 区切 られ た 部分 を replacement で 指定 し た 文字列 に 置換 し ます
指定 し た 座標 に 文字列 string を 描画 し ます
大文字 の ベースライン から の 距離 を 取得 し ます
描画 の 方向 以外 は 、 この 関数 の 動作 は pdf _arc とまっ たく 同じ です
この メソッド は 、 phar .readonly が 0 かつ ディスク 上 の 実際 の phar アーカイブ が 読み取り 専用 で ない 場合 に true を 返し ます
全 二重 接続 を 一時 的 ある い は そう で なく 終了 し ます
は 、 全て の 利用 可能 な memcached サーバー の バージョン 情報 を 含ん だ 配列 を 返し ます
オブジェクト の 輪郭 の 描画 に 使う 線 の 幅 を 設定 し ます
（ & raquo ;& nbsp ;rfc 2 0 4 5 section 6 . 7 に 基づき ）quoted -printable 文字列 を 8 ビット 文字 列 に 変換 し ます
反復 処理 中 に 次 の キー に 移動 し 、 その 値 を 返し ます
配列 から 現在 の キー と 値 の ペア を 返し て 、 カーソル を 進め ます
配列 の コピー を 取得 し ます
アイテム を レジストリ から 取得 し ます
は 、 hostname で 指定 し た snmp エージェント から すべ て の 値 を 読み込み ます
は 、 サーバー の 統計 情報 を 含む 連想 配列 を 返し ます
imagick オブジェクト の ページジオメトリ を 設定 し ます
ディレクトリエントリ の 実際 の ファイルサイズ を 返し ます
sqlite ライブラリ は 、 iso - 8 8 5 9 - 1 また は utf - 8 互換 モード の どちらか で コンパイル する こと が でき ます
現在 の directoryiterator アイテム の ファイルサイズ を 取得 し ます
画像 の サイズ を 指定 し た 大きさ に 変更 し ます
プロパティ の 値 を 取得 する ため に 使用 さ れ ます
直近 の 書き込み クエリ によっ て 変更 さ れ た レコード 数 を 返し ます
その ページ の テキスト 変換 行列 を 定義 し ます
domxpath オブジェクト に 、 namespaceuri および prefix を 登録 し ます
現在 の ページ の 変換 行列 と 指定 し た 行列 を 連結 し ます
を コール し て 、 ingres から の 値 の 出力 に 影響 する 環境 設定 を します
検索 クエリー を 設定 し ます
key に 関連 づけ られ た 値 を 、 1 あるい は dec _by で 指定 し た 数 だけ 減ら し ます
指定 し た キー の エントリ が ハッシュ に 存在 する かど う か を 調べ ます
指定 し た 変数 が boolean で ある かど う か を 調べ ます
この メソッド は 、 画像 を x サーバー に 表示 し ます
ユーザー が 入力 し た 文字 を 読み込み ます
文字列 の テンプレート を レンダリング し て 結果 を 返し ます
拡張 モジュール の 名前 を 取得 し ます
この メソッド は 、 値 を 返し ます
csv 形式 の 文字 列入 力 の フィールド を パース し て 、 読み込ん だ フィールド の 内容 を 配列 で 返し ます
nodename で 指定 さ れ た ノード を 取得 し ます
結果用 に 確保 さ れ た メモリ を 開放 し ます
フォント の 文字 の 幅 を 取得 し ます
画像 が マットチャネル を 持っ て いる 場合 に true 、 そう で ない 場合 に false を 返し ます
は dbx _sort の ヘルパ 関数 で 、 独自 の ソート 関数 を 作成 しやすくし ます
は データベース を 選択 し 、 そこに対し て クエリ を 実行 し ます
緑 が 一番 強い 点 を 設定 し ます
ページ の 文字 間隔 を 定義 し ます
traversable な 何 か から イテレータ を 作成 し ます
次 の 要素 に 移動 し ます
これ は 、 solrparams :: addparam に対する エイリアス です
event を キャンセル し ます
mime ヘッダフィールド を デコード し ます
によっ て フェッチ さ れ た 現在 の 行 の フィールド field から データ を 返し ます
value を キュー の 末尾 に 追加 し ます
関数 は 、 object _id で 指定 し た snmp オブジェクト の 値 を 設定 する ため に 使用 し ます
原因 の 説明 を 返し ます
現在 の ヘルプ 行 を スタック に 保存 し 、 新しい 行 を 表示 し ます
ファイル は ふたつ の コレクション に また がっ て 格納 さ れ ます
マルチバイト 文字 列 に対する 正規 表現 マッチング を 行い ます
により 返さ れ た dn を 分割 し 、 複数 の 要素 に 分け ます
magickpixeliterator を 返し ます
整数 また は 文字 列 から gmp 数 を 生成 し ます
ログイン 中 の 全 ユーザー の 一覧 を 返し ます
オブジェクト あるい は クラス の 親 クラス の 名前 を 取得 し ます
の コール 結果 を 、 独自 の ソート 関数 で 並べ 替え ます
現在 の 値 を 取得 し ます
その メソッド が 宣言 さ れ て いる クラス を 取得 し ます
エクスポート し ます
パラメータ 名 を 取得 し ます
ssh 上 で プレーン な パスワード を 使用 し た 認証 を 行い ます
リモート snmp エージェント に対し て 、 object _id で 指定 し た snmp オブジェクト の 値 を 設定 さ せ ます
は 、 サーバー から の メッセージ を 処理 する ユーザー 関数 を 設定 し ます
結果 セット 内 の 行 を 表す 、 カラム 名 を インデックス と する 配列 を 返し ます
address で 指定 し た 名前 を socket で 指定 し た ソケット に バインド し ます
画像 に 関連 づけ られ た アーチファクト を 削除 し ます
アーカイブ の メタデータ を 取得 し ます
すで に 接続 さ れ た ssh 2 サーバー から sftp サブシステム を 要求 し ます
色度 が 白い点 を 返し ます
は 、 指定 し た postgresql の result リソース に おい て 、 指定 し た field _number の 型名 を 保持 する 文字列 を 返し ます
指定 し た ファイル の パーミッション を 取得 し ます
指定 し た ドキュメント の fdf バージョン を version に 設定 し ます
は 、 connection _string で 指定 さ れ た 情報 を 用い て データベース と の 接続 を オープン し ます
属性 の すべ て の 値 を 取得 し ます
ディスク 上 の 定義 ファイル から 新しい セット を 作る ファクトリーメソッド です
は ソケット の 配列 を 受け取り 、 それら の 状態 が 変化 する まで 待ち ます
は fbsql _fetch _row と fbsql _fetch _assoc を 組み合わ せ た もの です
アタッチ さ れ て いる イテレータインスタンス の 数 を 取得 し ます
テーブル の カラム および 関連 する 権限 情報 を 含む 結果 セット を 返し ます
は 、 haystack の 中 で 最後 に needle が 現れる 場所 を 探し 、 haystack の 部分 文字 列 を 返し ます
type 1 フォント を 指定 し た ファイル から 読み込み 、 pdf ドキュメント に 登録 し ます
オブジェクト が スロー さ れ た ファイル の 名前 を 返し ます
指定 し た 年 year におい て 、 3 月 2 1 日 から 復活 祭 まで の 日数 を 返し ます
以下 の 表 に 基づい た 論理 and 処理 を 行い ます
この メソッド を 使用 し て 、 splfileinfo オブジェクト が 参照 する ファイル が リンク で ある かど う か を 調べ ます
この 関数 は 、 ibase _blob _open によって 読み込み 用 に オープン し た blob から 最大 len バイト を 返し ます
solr サーバー に 送られ た 生 の リクエスト を 返し ます
既存 の 画像 を コピー し て 新しい 画像 を 作成 し ます
この 関数 は 、 指定 し た メッセージ に関する すべ て の 構造 化 さ れ た 情報 を 取り出し ます
データベース を 選択 し 、 そこ で クエリ を 実行 し ます
arg の アークサイン を ラジアン で 返し ます
関数 は libc の glob 関数 で 使わ れる ルール に 基づい て pattern に マッチ する 全て の パス 名 を 検索 し ます
この 関数 の 目的 は 、 イベントシンク に 使用 する スケルトンクラス の 作成 を 支援 する こと です
実行 時 に 定数 を 除去 し ます
remote _socket で 指定 さ れ た 接続 先 と の 、 ストリーム また は データグラム 接続 を 確立 し ます
は 、 rpm ファイル の ヘッダ から 指定 し た タグ を 取得 し て それ を 返し ます
コード 変換 指令 request に 基づき 文字 列 string の コード を 変換 し ます
テクスチャ 画像 を タイル 状 に 繰り返し 並べ ます
ミューテックス へ の ハンドル の 破棄 は 、 ミューテックス を 使い 終え た とき に プログラマー が 明示 的 に 行う 必要 が あり ます
指定 し た ディレクトリ および それ に 含まれる 全 て の ファイル を 監視 する よう 指示 し ます
a *s + b *t = g = gcd a b となる よう な g s t を 計算 し ます
 / status キー の 値 を 設定 し ます
鉛筆画 を シミュレート し ます
パラメータ を 設定 し ます
関数 の 引数 リスト を 配列 で 取得 し ます
( drm の よう な 保護 機構 が この ファイル で 有効 に なっ て いる 場合 に true を 返し ます
ページ の 表示 を 、 パラメータ で 指定 し た 矩形 に あわせる よう 設定 し ます
画像 の 影 を シミュレート し ます
この 関数 は 、 検索 、 取得 等 で 使用 する １つ また は 複数 の データベース を 指定 し ます
指定 し た リソース の メモリ 使用 状況 を メガバイト 単位 で 返し ます
呼び出し 元用 に 、 ミューテックス の ロック を 試み ます
タグ を 使用 し て 新しい 辞書 を 作成 し ます
アタッチ さ れ たすべ て の observer に 通知 し ます
クエリ query を 、 サーバー 上 の 現在 アクティブ な データベース に 送信 し ます
現在 の 内部 イテレータ の インデックス を 取得 し ます
この 関数 は 、 uri に リクエスト の 一部 を 行い ます
mongo に は 、 追尾 可能 tailable カーソル という 機能 が あり ます
その 後 の ページ 出力 で 使用 する レイヤー を 開始 し ます
指定 し た 名前 の 画像 プロファイル を 削除 し て それ を 返し ます
テキスト の アノテーション で 使う フォント の 完全 な 名前 を 設定 し ます
この 関数 は hwapi _insert の 短縮 版 です
この メソッド は 、 php の 関数 を xpath 式 の 中 で 使える よう に し ます
は 、 指定 し た ファイル の s / mime メッセージ を 読み込み 、 デジタル 署名 を 評価 し ます
は 、 postgresql の result の 指定 し た 値 に関し て 、 実際 に 表示 し た 場合 の 長さ 文字 の 数 を 返し ます
solrdocument に対する デストラクタ
シグナル の 受信 を シミュレート し ます
データベース 内 の レコード の 数 を 返し ます
field に対応 する カラム の 桁数 を 返し ます
全て の select クエリ に関する デフォルト の blob モード を 設定 し ます
は 、 その memcache インスタンス が 直近 に 作ら れ た もの かど う か を 調べ ます
関数 は 、 対応 する geoip データベース が 存在 し 、 ディスク 上 に オープン できる かど う か を 調べ ます
msglist で 指定 さ れ た メッセージ を 、 指定 さ れ た メールボックス mbox に 移動 し ます
sql 文 の 中 で 使える よう 適切 に エスケープ さ れ た 文字列 を 返し ます
は 、 文字列 を シングルクオート で 括り 、 既存 の シングルクオート を 全て クオート / エスケープ し ます
新しい 条件 変数 を 作り ます
リフレクション を エクスポート し ます
文字 列内 で 最後 に あらわ れる 場所 の 書記 素単 位 の 位置 を 見つけ ます
この 関数 を 呼ぶ と 、 bucket brigade の 先頭 に bucket を 追加 でき ます
座表系 の スケール を 設定 し ます
は 、 ファイルポインタ が 指す データ を ftp サーバー 上 の リモートファイル へ アップロード し ます
新しい ページ を 開始 し ます
この メソッド は 、 オブザーバ が アタッチ さ れ て いる 任意 の splsubject が splsubject :: notify を コール し た とき に コール さ れ ます
ベジエ 曲線 を 現在 の パス に 追加 し ます
認証 パラメータ key の 値 を value に 設定 し ます
php の 文字 列用 の xmlrpc 型 を 、 base 6 4 あるい は datetime に 設定 し ます
関数 の 挙動 は pcntl _sigwaitinfo とほぼ 同じ です が 、 さらに 2 つの パラメータ が あり ます
画像 が マットチャネル を 持っ て いる 場合 に true 、 そう で ない 場合 に false を 返し ます
すべて の 接続 プール に関する 情報 の 配列 を 返し ます
プレーン な ピクセル 群 を 暗号 化 し ます
function パラメータ で 指定 し た ユーザー 定義 の 関数 あるい は メソッド を コール し ます
id 3 タグ の 年 を 返し ます
事前 に gnupg _addencryptkey で 設定 し た キー を 使用 し 、 指定 さ れ た テキスト を 暗号 化 し ます
この スレッド の id を 返し ます
は 機能 的 に memcached :: get と 同等 です
この 関数 は 、 指定 し た クラス が 使っ て いる トレイト の 名前 を 配列 で 返し ます
空 の テキストノード を 削除 し 、 この ノード に 隣接 する テキストノード と その すべ て の 子 を マージ し ます
与え られ た ファイルポインタ から 最大 length - 1 バイト の 文字 を 読み込み 、 これ を 含む 非圧縮 の 文字列 を 返し ます
開発 中 や テスト 時 に 、 クエリ を 改善 する ため に 便利 な 関数 です
直近 に 配置 さ れ た テーブルインスタンス について の テーブル の 情報 を 取得 し ます
現在 の 要素 を 返し ます
は 、 文字列 haystack から char _list を 探し ます
fdf ドキュメント を 保存 し ます
現在 位置 が 属性 ノード の 場合 は 次 の 属性 に カーソル を 移動 し ます
リモートクライアント 用 に 単一 も しく は 複数 の 関数 を エクスポート し ます
文字列 str の 文字 エンコーディング を 、 オプション で 指定 し た from _encoding から to _encoding に 変換 し ます
変数 var の 型 を type に セット し ます
指定 し た データベースハンドル db _handle を 閉じ ます
この 関数 は 、 参照 し て いる ノード の 直前 に 新しい ノード を 挿入 し ます
最後 の レスポンス の ヘッダ を 取得 し ます
は mailbox で 指定 さ れ た 新しい メールボックス を 作成 し ます
名前 空間 宣言 の スコープ を 抜ける とき に コール さ れる ハンドラ を 設定 し ます
radius 関数 が 失敗 し た 場合 に は エラーメッセージ が 記録 さ れ ます
与え られ た データ を データベース に 追加 し ます
現在 の directoryiterator アイテム が ディレクトリ か どう か を 調べ ます
kerberos データベース から principal を 削除 し ます
前 に 発生 し た 例外 exception :: __ construct の 3 番目 の 引数 を 返し ます
tar 形式 の phar アーカイブ で は 、 この メソッド は badmethodcallexception を スロー し ます
マルチバイト 正規 表現 に マッチ し た 部分 を 返し ます
は 、 バックエンド データベースサーバ の プロセス の プロセス id を 取得 し ます
指定 し た blob オブジェクト id bid に関する blob オブジェクト の 内容 を 更新 し ます
は 取得 し た レコード 行 を 有 する 配列 を 返し ます
直近 の soap レスポンスヘッダ を 返し ます
wddx packet を デシリアライズ し ます
この 関数 は 、 filename という 名前 の ファイル から 読み込ん だ html ドキュメント を パース し ます
画像 の サンプリング 係数 を 設定 し ます
を コール し た とき に 発生 し た javascript の 例外 の 中 で 未処 理 の もの を v 8jsexception で 返し ます
例外 コード を 返し ます
オプションリスト で 定義 し た 破線 パターン を 設定 し ます
が radius _vendor _specific を 返す 場合 に 、 ベンダ を 特定 する ため に radius _get _vendor _attr を コール し ます
出力用 バッファ の 内容 を 取得 し ます
キー を 指定 し て ハッシュ から 値 を 取得 し ます
指定 し た 範囲 の 全て の プロシージャ の リスト を 取得 し ます
は 、 関係 の 中 の タプル に 完全 に 一致 する 場合 、 tuple を 削除 し ます
unix タイムスタンプ 1 9 7 0 / 1 / 1 から の 秒数 timestamp を ユリウス 歴 に 変換 し て 返し ます
get / post / cookie データ を パース し 、 グローバル 変数 を 設定 し ます
トランザクション を 閉じ ず に コミット し ます
b を 法と し た a の 逆 を 計算 し ます
phar ファイルフォーマット の api バージョン を 返し ます
冗長 な リクエスト 情報 を 無効 に し ます デフォルト は 無効 です 
指定 し た 文字列 を 、 正規 表現 で 分割 し ます
配列 を キー により 逆順 に ソート し ます
oauth プロバイダ の 必須 パラメータ を 追加 し ます
ユーザーキャッシュ による メモリ 使用 状況 について の 情報 を 取得 し ます
関数 は 、 現在 の 接続 の スレッド id を 返し ます
apc の データ から 、 キャッシュ さ れ た 情報 および メタデータ を 取得 し ます
spl が 提供 する _ _ autoload キュー から 、 関数 を 削除 し ます
行 を テーブルデータベース から 取得 し ます
結果 の 行 を array に 取得 し ます
は 、 変数 の 値 に関する 情報 を 解り 易い 形式 で 表示 し ます
現在 の 配列 を 、 別 の 配列 あるい は オブジェクト と 交換 し ます
ストレージ の エントリ を アンシリアライズ し 、 現在 の ストレージ に 追加 し ます
ファイル が 実行 可能 か どう か を 調べ ます
この 関数 は 、 swfvideostream の ビデオフレーム 数 を 返し ます
この 関数 は 次 の エントリ に イテレータ を 移動 し ます
複数 クエリ は まだ サポート さ れ て い ない ので 、 maxdb _next _result は 常 に false を 返し ます
画像 の サイズ を 元 の 半分 に 比例 縮小 し ます
画像 の 幅 を 返し ます
新規メールボックス を 購読 し ます
は 、 指定 し た フィールド の フィールドフラグ を 返し ます
オブジェクト の すべ て の 対象 アンカー を 取得 し ます
は 、 mysql _field _name 関数 に 似 て い ます
セット さ れ て いる ビット の 数 を 返し ます
ふたつ の ファイル の バイナリ diff を 作成 し 、 その 結果 を パッチファイル として 保存 し ます
配列 の 要素 の 数 、 あるい は オブジェクト の public プロパティ の 数 を 取得 し ます
指定 し た 添字 の 値 を 消去 し ます
指定 し た 定数 が 存在 し 、 定義 さ れ て いる かど う か を 調べ ます
paradox ファイル に 保存 さ れ て いる タイムスタンプ を 、 人間 が 理解 し やすい 形式 に 変換 し ます
画像 の レンダリング 方向 を 取得 し ます
は 、 結果 リソース の 指定 し た カラム について 全 て の 行 （ レコード ） を 含む 配列 を 返し ます
で 準備 さ れ た 命令 を 実行 し ます
repos に ある リポジトリ の リビジョン revision を 、 targetpath の 作業 コピー に チェックアウト し ます
文字列 属性 を 、 現在 の radius リクエスト に アタッチ し ます
デジタルフィルタ を 適用 し て 、 ノイジー な 画像 の 品質 を 向上 さ せ ます
マップ の 呼出 番号 を 返し ます
出力用 バッファ の 内容 を 消去 し 、 出力 の バッファリング を オフ に し ます
この メソッド は 、 yaf _view _simple で は なく カスタムビューエンジン を 使い たい とき に 利用 し ます
filename で 指定 さ れ た ファイル に ついて の 統計 情報 を 取得 し ます
指定 し た xml パーサ の カレント の 行番 号 を 取得 し ます
既存 の コンテンツ を 消去 し ます
デストラクタ です
ファイル 記述子 fd が 、 有効 な 端末 デバイス を 指し て いる かど う か を 調べ ます
text のすべて の 文字 が 小文字 だっ た 場合 に true 、 そう で ない 場合 に false を 返し ます
テキスト の アノテーション で 使う コードセット を 表す 文字 列 を 設定 し ます
は 、 出力 バッファ を フラッシュ し て その 内容 を 文字 列 として 返し た 後 、 出力 バッファリング を 終了 し ます
現在 の カテゴリ と 同じ レベル の 全て の カテゴリ の 一覧 を 配列 として 返し ます
フォント を 設定 し ます
& # 0 3 9 ; タグ &# 0 3 9 ; で 表さ れる 言語 で 使用 する 辞書 の 優先 順位 を 宣言 し ます
画像 の 一部 を 削除 し 、 そこ に あっ た 画像 を なく し ます
テンプレート を レンダリング し て 、 結果 を すぐ に 返し ます
ルーティングプロセス で 使わ れ て いる ルート 名 を 取得 し ます
paradox データベース に レコード を 保存 し ます
指定 し た 名前 の 属性 を 削除 し ます
は ftp サーバー から リモートファイル を 取得 し 、 それ を ローカルファイル に 保存 し ます
パラメータ の デフォルト 値 が 存在 する かど う か を 調べ ます
指定 し た オブジェクト id の 文字 オブジェクト を 削除 し ます
画像 を ページ に 表示 し ます
gmagick オブジェクト を 破棄 し 、 関連 する リソース を すべ て 解放 し ます
エラーメッセージ を web サーバー の エラーログ あるい は ファイル に 送り ます
この 関数 は 、 いずれか の バージョン の オブジェクト の 属性 情報 を 取得 し ます
を コール する と 、 dbplus _find により relation に 設定 さ れ た 制約 が 削除 さ れ ます
この メソッド で 、 splfileinfo :: getfileinfo および splfileinfo :: getpathinfo が コール さ れ た 際 に 使用 する カスタムクラス を 設定 し ます
内部 イテレータ の 現在 の 要素 が 子 を 持つ かど う か を チェック し ます
現在 の 位置 から パス の 開始 位置 に 直線 を 追加 し ます
事前 に stream _filter _prepend あるい は stream _filter _append で ストリーム に 追加 し た フィルタ を 削除 し ます
最初 の エラー の 原因 を 返し ます
現在 の メールボックス に ある 新しい メッセージ の 数 を 返し ます
拡張 モジュール で 定義 さ れ て いる 関数 を 取得 し ます
charlist パラメータ に 羅列 さ れ た 文字 の 前 に バックスラッシュ を 付け た 文字列 を 返し ます
指定 し た ファイル が ディレクトリ か どう か を 調べ ます
principal および 指定 し た password を 使用 し て kadm 5 ライブラリ と の 接続 を オープン し 、 admin _server から 証明 書 を 取得 し ます
指定 し た event _base を 破棄 し 、 関連 づけ られ た リソース を すべ て 解放 し ます
これ は 、 yaf プラグイン の フックシステム 内 で の 最後 の フック です
は 、 指定 さ れ た arg を lzf 符号 化方 式 で 圧縮 し ます
与え られ た gz ファイルポインタ が eof ファイル 終端 を 指す かど う か を 調べ ます
php の ソースコード filename から コメント と 空白 文字 を 取り除い た もの を 返し ます
ある 文字 列 の 中 で 別 の 文字 列 が 最初 に 現れる 位置 を 見つけ ます
画像 の 遅延 を 取得 し ます
は 、 指定 さ れ た 定義 で dbase データベース を 作成 し ます
指定 し た フィールドオフセット に 移動 し ます
は 、 リクエストグループ を 作り ます
アクティブ な カーソル の 名前 を 文字列 で 返し ます
ある 文字 列 str に 、 unified 形式 の パッチ 文字 列 patch を 適用 し て その 結果 を 返し ます
callback 関数 により フィルタ 処理 が 行わ れ た array の 全て の 要素 を 含む 配列 を 返し ます
画像 の 前景 色 を 設定 し ます
与え られ た ファイルポインタ の 現在 位置 から 終端 まで を 読み込み 結果 を 出力 バッファ に 書き出し ます
xml ドキュメント の 最初 に xml 宣言 を 生成 する かど う か を 制御 し ます
solr の 現行 バージョン を 返し ます
サポート する シグネチャ 型 の 配列 を 返し ます
現行 の キー を 返し ます
この 関数 は 、 ingres _fetch _row の 拡張 版 です
指定 し た cipher / mode の 組み合わせ に おける iv の 大きさ を 取得 し ます
stream 、 fstream あるい は string 型 の pcos パス の 内容 を 取得 し ます
属性 の 名前 を 返し ます
画像 の 中心 から 、 ピクセル を 渦巻 状 に し ます
通信 の エンドポイント 終端 と 呼ば れる こと も ある ソケット の リソース を 作成 し 、 返し ます
ビジーハンドラ を 設定 し ます
は 、 data を 公開鍵 key で 暗号 化 し 、 それ を crypted に 格納 し ます
この メソッド は 、 指定 し た 要素 の 子 を 見つけ ます
truetype コレクション ttc ファイル から 、 指定 し た インデックス の truetype フォント を 読み込み ます
ページ を 再開 し 、 さらに 内容 を 追加 し ます
新しい filesystem イテレータ を path から 作成 し ます
セッションクッキー の パラメータ を 取得 し ます
元 オブジェクト の 現在 の 位置 に ある 新しい 画像 を 、 imagick オブジェクト の 画像 リスト に 追加 し ます
oci ステートメント statement の 種類 を あらわす キーワード を 返し ます
指定 し た データベースリンク id の カラム 構造 について の 情報 を 返し ます
代数 演算 、 関係 演算 、 論理 演算 など を 疑似 画像 に 適用 し ます
別 の パーサ を bbcode _container に アタッチ し ます
調べ て いる クラス を エクスポート し ます
排他 的 論理 和 を 計算 し ます
hash に ユーザー が 指定 し た password を 用い て キー を 生成 し ます
これ は 、 圧縮 さ れ た ファイル を 含む phar を 読み込む 前 に 、 圧縮 が 可能 か どう か を 調べる ため に 使用 し ます
この メソッド は カーソル の 状態 に は 何 の 影響 も 及ぼ しませ ん
クエリ が 返す 結果 の 最大 数 を 設定 し ます
指定 し た フィールド の 投稿 フォームアクション を 設定 し ます
画像 シーケンス を はめ 込み 合成 し て 単一 の 画像 に し ます
直近 の エラー の 内容 を 文字列 で 返し ます
この メソッド は xsltprocessor に 変換 の ため の スタイルシート を 取り込み ます
この 関数 は 収縮 さ れ た 文字列 を 伸長 し ます
関数 は 、 特定 の キー と 値 の ペア を 含む chdb ファイル を 作成 し ます
クライアント の 接続 が 切断 さ れ た 際 に スクリプト の 実行 を 終了 する かど う か を 設定 し ます
直近 に 実行 さ れ た プリペアドステートメント の エラー について 、 sqlstate エラーコード を 含む 文字 列 を 返し ます
( x y を 中心 と し た 円 の 一部 を 描き ます
は 、 x 5 0 9 certdata で 指定 し た 証明 書 を パース し 、 その 証明 書用 の リソース id を 返し ます
phar アーカイブ を ディスク と メモリ から 削除 し ます
この メソッド は エントリ を ハッシュ から 削除 し 、 削除 でき たか どう か を 返し ます
イテレータ の 要素 を 配列 に コピー し ます
は 、 指定 し た ファイル 名 から 得 られる 画像 を 表す id を 返し ます
現在 の エントリ の イテレータ が 取得 可能 か どう か を 返す この イテレータ は recursiveregexiterator :: getchildren で 取得 し ます
path が 指す ファイル 、 ディレクトリ あるい は シンボリックリンク を 作業 コピー に 追加 し ます
コマンド を リモートエンド で 実行 し 、 チャネル を 割り 当て ます
gender クラス の 定数 から 、 国 を 表す 文字 列 を 取得 し ます
要素 の メンバ として localname という 名前 の 属性 が 名前 空間 namespaceuri に 存在 する かど う か を 示し ます
画像 の 反復 を 設定 し ます
引数 number を 2 進数 表現 し た 文字列 を 返し ます
は 、 pkcs 1 2 で 指定 し た pkcs # 1 2 認証 ストア を パース し て certs で 指定 し た 配列 に 格納 し ます
は 、 与え られ た 文字列 を 圧縮 し 、 bzip 2 形式 の データ として 返し ます
この 関数 は 、 fopen 、 fwrite 、 fclose を 続け て コール し て データ を ファイル に 書き込む の と 等価 です
は ローカルファイル を ftp サーバー に 保存 し ます
結果 セット の カラム 数 を 返し ます
新しい 正規 表現 を 作成 し ます
油絵風 の 効果 を 施す フィルタ を 適用 し ます
オブジェクト の 属性 および 内容 を 置き 換え ます
ベンダー 固有 の 文字 列属 性 を 、 現在 の radius リクエスト に アタッチ し ます
現在 の 要素 の 子 を 取得 し ます
パース し て いる ドキュメント が 妥当 なもの で ある かど う か を 論理 型 で 返し ます
指定 し た 文字列 に 定義 さ れ て いる スキーマ に 基づい て ドキュメント を 検証 し ます
画像 あるい は 画像 シーケンス を 書き込み ます
メソッド の プロトタイプ を 取得 し ます
は 、 ファイルディスクリプタ fd で 指定 し た ファイル を 切り 詰め て 、 ちょうど length バイト に し ます
直近 の informix エラー に関する informix エラーメッセージ を 返し ます
は ラージオブジェクト を 生成 し 、 その ラージオブジェクト の oid を 返し ます
この 関数 は 、 domdocumentfragment クラス の 新しい インスタンス を 作成 し ます
色および 描画 状態 パラメータ を 全て デフォルト 値 に リセット し ます
は sql クエリ query を mysql に 送信 し ます
事前 に 生成 さ れ た 他 の コレクション から コレクション の 値 を 割り 当て ます
指定 し た バイナリダンプ を apc の ファイル / ユーザーキャッシュ に 読み込み ます
より 以前 に 得 た 指定 tuple の 書き込み ロック を 解放 し ます
エントリ を ソート し ます
さまざまな 方式 で 画像 を 歪め ます
現在 の プロセス の 実際 の ユーザー id を 設定 し ます
遠く から 光 を あて て いる よう に 見せる 三次 元効 果 を 作成 し ます
ベンダー 固有 の ip アドレス 属性 を 、 現在 の radius リクエスト に アタッチ し ます
を 使い 、 指定 し た object _id を 起点 と する snmp サブツリー を 読み込み ます
は 、 connection で 指定 し た 接続 の ステータス を 返し ます
指定 さ れ た constant を value として 再定 義 し ます
ページ の 破線 パターン を 定義 し ます
イテレータ の 現在 位置 を 返し ます
内部 iterator の 、 ゼロ から 数え た 現在 位置 を 返し ます
関数 は 、 指定 し た ファイル の 文法 チェック （ lint ） を 行い 、 スクリプト の エラー を チェック し ます
imagick オブジェクト の フォーマット を 設定 し ます
リスト 内 で ひとつ 先 に 進ん だ とき にまだ オブジェクト が 画像 を 保持 し て いれ ば true を 返し ます
画像 シーケンス 内 の 色 を 解析 し 、 その 画像 を 表す ため の 色 を 固定 の 色数 で 選び ます
関数 の 名前 を 取得 し ます
mpeg ファイル の サンプルビットレート を 返し ます
link が 使用 し て いる 接続 の 情報 を 文字列 で 返し ます （ サーバー の ホスト 名 を 含み ます ）
は 、 オープン し た fd の 端末 属性 と ボーレート を 指定 し ます
コンテンツ の mimetype を 返し ます
現在 の 言語 を 設定 あるい は 取得 し ます
data を 復号 し 、 復号 さ れ た データ を 返し ます
sql 文 を 直接 実行 し ます
a の 階乗 a ! を 計算 し ます
は 、 data を 秘密 鍵 key で 暗号 化 し 、 それ を crypted に 格納 し ます
画像 に 特殊 効果 を 施し 、 印画紙 の 特定 の 箇所 の 露光 時間 を 長く し た よう な 画像 に なり ます
指定 し た ハッシュ が 、 特定 の アルゴリズム と オプション を 満た し て いる かど う か を 調べ ます
pdflib オブジェクト を 削除 し 、 内部 リソース を 全 て 開放 し ます
hue 色相 、 saturation 彩度 および luminosity 明度 を 正規 化 し た 値 によっ て imagickpixel オブジェクト の 色 を 設定 し ます
指定 さ れ た sybase 結果 セット に おい て 、 指定 し た 行お よび オフセット に おける セル の 内容 を 返し ます
searchd に 接続 し 、 指定 し た ドキュメント の 抜粋 を 作成 する よう 要求 し 、 その 結果 を 返し ます
設定 で 定義 し た ルート を yaf _router の スタック に 追加 し ます
yield し た 値 の キー を 取得 し ます
算術 演算 、 関係 演算 、 論理 演算 など を 画像 に 適用 し ます
利用 可能 な ダイジェスト ・メソッド の 一覧 を 取得 し ます
取得 する レコード の 範囲 を 指定 し ます
指定 し た 位置 に 、 同 一 ドキュメント 内 の ページ へ の ハイパーリンク を 設定 し ます
文字列 に 変換 し ます
は 、 透明度 を 指定 する パラメータ alpha が 追加 さ れ て いる 以外 は imagecolorallocate と 等価 です
この メソッド を 使用 する と 、 画像 全体 を 読み込ま なく て も 画像 の 幅や高さ 、 サイズ そし て フォーマット を 取得 でき ます
variant の 整数 部 を 取得 し ます
namespaceuri が デフォルト の 名前 空間 で ある かど う か を 調べ ます
variant の 整数 部 を 返し ます
コメント を 画像 に 追加 し ます
指定 し た 型 と ドキュメント 要素 の domdocument オブジェクト を 作成 し ます
画像 から すべ て の プロパティ や コメント を 除去 し ます
位置 offset から count 文字 ぶん の データ を 、 data に 置換 し ます
は 指定 し た フィールド の 長さ を 返し ます
現在 の プロセス の 実際 の グループ id を 返し ます
カーソル は 一般 的 に 、 結果 オブジェクト を バッチ で 取得 し て ローカル に 格納 し ます
指定 さ れ た blob オブジェクト id の blob オブジェクト を 削除 し ます
は 、 notify sql コマンド により 送信 さ れ た 通知 メッセージ を 取得 し ます
グローバル の 関数 テーブル で 関数 名 を 変更 し ます
フィールド に null を 設定 可能 か どう か を 調べ ます
現在 の ノード の 、 名前 空間 namespaceuri における localname という ローカル 名 の 属性 ノード を 返し ます
は 、 現在 オープン し て いる トランザクション を コミット し 、 全 て の 変更 を データベース に 保存 し ます
関数 は 、 直近 の maxdb _connect の コール の エラーコード を 返し ます
data を 修正 版 utf - 7 テキスト に 変換 し ます
開始 位置 offset と 最大 数 count を 指定 し た イテレータ iterator から 新しい limititerator を 作成 し ます
マイターリミット の 値 を 取得 し ます
イテレータ の 現在 の 要素 が この フィルタ を 通過 する かど う か を 返し ます
現在 の 画像 の 圧縮 形式 を 取得 し ます
は 、 指定 し た relation の 空 の コピー を name という 名前 で 作成 し ます が 、 デフォルト の インデックス を 使用 し ます
imagemagick api の バージョン を 文字 列 と 数値 で 返し ます
文書内 の フィールド 数 を 返し ます
この 関数 は 、 include 、 include _once 、 require あるい は require _once により スクリプト に ロード さ れ たすべて の ファイル の 名前 を 取得 し ます
comobject が 生成 し た イベント を php オブジェクト sinkobject に 通知 する よう 、 com に 指示 し ます
現在 の 要素 から 作っ た ツリー を 取得 し ます
指定 し た パス path の recursivedirectoryiterator を 作成 し ます
現在 の フォントサイズ 、 文字 エンコーディング および 単語 間隔 を 使用 し て テキスト の 幅 を 取得 し ます
この 関数 は 、 指定 し た アンカー が 属し て いる オブジェクト を 取得 し ます
ストアドプロシージャ また は リモート の ストアドプロシージャ を 初期化 し ます
アタッチ し て いる すべ て の イテレータインスタンス を 巻き戻し ます
samconnection オブジェクト に対し て & quot ;connect &quot ; メソッド を コール する と 、 php スクリプト を メッセージングサーバー と 接続 さ せ ます
この 関数 は 、 指定 し た imap ストリーム の 現在 オープン し て いる メールボックス におい て 検索 を 行い ます
添付 さ れ た 画像 フレーム の 画像 の mime type を 返し ます
この 関数 は 、 人間 が 行う よう な 手法 で アルファベット また は 数字 の 文字列 の 順序 を 比較 する アルゴリズム を 実装 し ます
現在 の ページ に ブックマーク を 追加 し ます
指定 し た イベントベース の イベントループ を 開始 し ます
は 、 ファイル の 大きさ を 最大 offset バイト まで に 丸め ます
組み込み の 日本語 フォント を 有効 に し ます
指定 し た hash の ブロックサイズ を 取得 し ます
val が （ 正また は 負 の ） 無限 大 で ある 場合 に true を 返し ます
は ある クエリ 結果 に 含ま れる フィールド の 情報 を 取得 する 際 に 使用 する こと が でき ます
ページ の 現在 の フォント および フォントサイズ を 定義 し ます
クエリ から 、 結果 セット の 次 の 行 を 含む 配列 を 返し ます
pattern で 指定 し た 正規 表現 により subject を 検索 し ます
string におい て 各 バイト 値 0 .. 2 5 5 が 存在 する 数 を かぞえ 、 様々 な 手法 で 返し ます
bcompiler ファイル の ヘッダ を 書き込み ます
ディレクトリ を 含む 文字 列 を 指定 し て くだ さい
画像 を シャープ に し ます
オープン さ れ た filepro データベース に おける 行 の 数 を 返し ます
left と right を 比較 し ます
は 、 array の 最初 の 値 を 取り出し て 返し ます
この 関数 は 、 指定 し た ftp ストリーム に関し て の さまざまな 実行 時 オプション を 制御 し ます
は 接続 を リセット し ます
書き込み 可 の モード w + で ユニーク な 名前 を 有する テンポラリファイル を 作成 し 、 ファイルハンドル を 返し ます
新しい haruannotation の インスタンス を 作成 し ます
指定 し た 画像 image 上 の 透明 色 を 設定 し ます
非 ブロッキングモード で 、 ファイル の 取得 / 送信 を 継続 し ます
は 、 配列 の 中 の 値 の 合計 を 整数 また は float として 返し ます
塗りつぶし 色 に 指定 し た 色 に マッチ する ピクセル を 変更 し ます
現在 の 塗り つぶし および 輪郭 描画 色 を 0 から 1 まで の グレー 値 に 設定 し ます
web 上 の ターゲット url へ の web リンク を 追加 し ます
指定 し た オフセット の 値 を 取得 し ます
フォントエンコーディング の 名前 を 取得 し ます
指定 し た リモートファイル の パーミッション を mode に 設定 し ます
name で 指定 し た オプション の 値 を 返し ます
修飾子 の 名前 を 取得 し ます
は 、 str の 先頭 から offset バイト の 位置 から 、 最大 で length バイト まで 書き込み ます
プロパティ の ドキュメントコメント を 取得 し ます
libevent は 、 通常 の イベント api の 上位 に 抽象 化 レイヤー を 用意 し て い ます
この 関数 は 、 php インタプリタ に コンパイル 、 ロード さ れ て いる 全て の モジュール の 名前 を 返し ます
ページ の 塗り つぶし 色 を 定義 し ます
直近 の sql 文 の エラーメッセージ を 含む 文字 列 を 返し ます
さまざまな オプション に 基づい て 、 インポート し た pdf ページ を 配置 し ます
例外 の スタックトレース を 文字列 で 返し ます
は 、 haystack の 中 で 最初 に needle が 現れる 場所 を 探し 、 haystack の 部分 文字 列 を 返し ます
許可 さ れる 最大 の 深さ を 取得 し ます
mnogosearch セッションパラメータ を 定義 し ます
は 、 リモートソケット から 最大 length バイト の データ を 受け取り ます
mongodb の & raquo ;& nbsp ;aggregation フレームワーク を 使う と 、 値 を 集約 する とき に mapreduce を 使わず に 済ませる こと が でき ます
テキスト を 出力 する 位置 を 設定 し ます
現在 の mysql デーモン で 利用 可能 な データベース の 結果 ポインタ を 返し ます
アンシリアライズ 後 に 配列 を 再初 期化 し ます
システム について の 情報 を 取得 し ます
は データベース の 最初 の キー を 返し 、 内部 キーポインタ を リセット し ます
initialize the weights using widrow + nguyen ’s algorithm .
静的 メソッド を 実行 し た 場合 など 、 エラーコード を 取得 する オブジェクト が 存在 し ない 場合 の エラー 処理 に 便利 です
curl 共有 ハンドル を 閉じ 、 すべて の リソース を 解放 し ます
カスタム の シリアライズ で 使わ れ ます
を 使用 し て 削除 マーク が つけ られ た レコード を 完全 に 削除 する こと で 、 指定 し た データベース を 圧縮 し ます
変数 が セット さ れ て おり 、 それ が null で ない こと を 調べ ます
色空間 の 名前 を 取得 し ます
各 要素 が 子 を 持っ て いる かど う か を 調べる とき に コール し ます
は 、 log 1 + number の 値 を 返し ます
は 、 指定 し た テーブル に関する 情報 を 返し ます
画像 の 圧縮 品質 を 設定 し ます
ファイル の inode が 変更 さ れ た 時刻 を 返し ます
プロパティ を アクセス 可能 に し ます
array 1 を array 2 と 比較 し 、 その差 を 返し ます
指定 し た リンク id が 指す サーバー 上 の データベース を 、 アクティブ な データベース に 設定 し ます
これ は 、 phar アーカイブ 内 の ファイル が crc 検証 さ れ て いる かど う か を 返し ます
一意 な テンポラリファイル 名 を 、 パーミッション を 0 6 0 0 に 設定 し 、 指定 し た ディレクトリ に 作成 し ます
ふたつ の ファイル の バイナリ diff を 作成 し 、 その 結果 を パッチファイル として 保存 し ます
対処 の 色 に マッチ する ピクセル を 透過 さ せ ます
data で 渡し た データ を yaml 形式 に して filename に 書き込み ます
指定 し た ファイル 名 の メッセージセクション を 展開 / デコード し ます
ストレージ から オブジェクト を 取り除き ます
画像 の レンダリング 方向 を 設定 し ます
は memcached :: set と 同等 です が 、 キー key が サーバー 上 に ない 場合 は 失敗 し ます
結果 セット に 関連 付け られ た システムリソース および データベースリソース を 開放 し ます
は 、 複数 データベース 接続 に エージェント を 作成 し ます
結果 セット 内 の 指定 し た カラム の 現在 値 の 幅 を 返し ます
ファイル の キャッシュエントリ を リフレッシュ し ます
id で 指定 し た 接続 を クローズ し ます
指定 し た ユーザー id の ユーザー について の 情報 を 配列 で 返し ます
内部 イテレータ を 取得 し ます
イテレータ が 有効 か どう か を 調べ ます
レコード を 削除 し ます
グローバルメモリ の 使用 状況 について の 統計 情報 を 取得 し ます
関数 から 取得 さ れ た image を 閉じ ます
timestamp に関する 日付 情報 を 有する 連想 配列 を 返し ます
画像 の 色空間 を 取得 し ます
は 、 クライアント / サーバー 間 の オーバーヘッド を 防い です ばやく アクセス する ため に 、 リレーション file を ローカル に オープン し ます
指定 し た link _identifier に関し て 、 直近 の ldap コマンド により 生成 さ れ た エラー を 表す エラーメッセージ 文字 列 を 返し ます
mnogosearch セッション を 割り 当て ます
この 関数 は 、 拡張 サービス の リクエスト を 準備 し ます
ウィンドウ あるい は その クライアント 領域 の キャプチャ を 、 ウィンドウハンドル com インスタンス の hwnd プロパティ を 指定 し て 取得 し ます
xml パーサ parser の 、 処理 さ れ ない エンティティ 宣言 用 ハンドラ 関数 を 設定 し ます
mysql サーバー へ の 接続 を オープン あるい は 再利 用 し ます
結果 の 行 を 、 連想 配列 あるい は 数値 添字 配列 ある い は その 両方 で 取得 し ます
この 関数 は コマンドラインヒストリ 全体 を クリア し ます
perl の carp :: cluck と 同じ よう に 動作 し ます
現在 の プロセス の グループ id を 返し ます
読み込み の セカンダリ へ の 分散 について の 情報 は 、 この マニュアル の 問い合わせ の 節 を 参照く ださい
dom 表現 から xml ドキュメント を 作成 し ます
現在 の ページ に サムネイル として 既存 の イメージ を 追加 し ます
は 、 msql サーバー 上 に データベース の 作成 を 試み ます
現在 の 描画 状態 を 保存 し ます
指定 し た バッファ つき イベント を 破棄 し 、 関連 づけ られ たすべて の リソース を 解放 し ます
この 関数 は hwapi _insert の 短縮 版 です
調べ た 拡張 モジュール を エクスポート し 、 文字 列 として 返し ます
は 、 memcache サーバー と の 接続 を すべ て 閉じ ます
は 、 ラージオブジェクト を 読み込み 未送 信 の ヘッダ を 全 て 送信 し た 後 、 ブラウザ に 直接 ラージオブジェクト を 送信 し ます
指定 し た 接続 について 、 ひとつ あるい は 複数 の オプション を 設定 し ます
ms sql サーバーデータベース で ストアドプロシージャ を 実行 し ます
以前 に dbplus _xlockrel で 取得 し た 排他 的 ロック を 開放 し ます
結果 に 保持 さ れ た エントリ を 取得 し ます
や readfile 、 file _get _contents 、 opendir など の stat 関連 の 関数 を すべ て phar に 横取り させ ます
は フィールド の スケール を 返し ます
この 関数 は 、 deflate データフォーマット を 用い て 与え られ た 文字列 を 圧縮 し ます
現在 の プロセス の 親 プロセス の id を 返し ます
条件 を クエリ に 追加 し ます
接頭辞 と 接尾 辞 を つけ た 現在 の 要素 を 取得 し ます
直近 で 失敗 し た sqlite リクエスト の 結果 コード を 数値 で 返し ます
コレクション の 最後 に 要素 を 追加 し ます
現在 の 画像 の 圧縮 品質 を 取得 し ます
画像 の インターレース 手法 を 設定 し ます
また は ifx _do クエリ の 後 、 result _id を 有する クエリ に関し て これ まで 取得 さ れ た 行 の 数 を 返し ます
内部 ポインタ が 有効 な 要素 を 指し て いる かど う か を 調べ ます
ドキュメント で 宣言 さ れ て いる 名前 空間 を 返し ます
w 3c xsd スキーマ を 用い て 、 処理 中 の ドキュメント を 検証 し ます
事前 に oci _new _descriptor を 使用 し て 割り 当て られ た ディスクリプタ に 関連 付け られ たり ソース を 解放 し ます
クライアント の バージョン 番号 を 整数 値 で 返し ます
渡さ れ た javascript script を v 8js コンテキスト で 利用 する 拡張 として 登録 し ます
ドキュメント を どの よう に 表示 する か を 定義 し ます
現在 動作 中 の php パーサ あるい は 拡張 モジュール の バージョン を 表す 文字 列 を 返し ます
関数 dio _close は 、 ファイル 記述子 fd を 閉じ ます
は 、 handle が 指す ファイルポインタ から 最高 length バイト 読み込み ます
ローカルファイル を ftp サーバー に 保存 し ます
画像 の 色空間 を 設定 し ます
は 、 ディレクトリ を 削除 し ます
端末 が 色 を 扱える かどう か 、 そして プログラマ が ncurses _init _color で色 を 変更 できる かど う か を 返し ます
拡張 モジュール が ロード さ れ て いる かど う か を 調べ ます
指定 し た relation で 保持 さ れ て いる 全て の タプルロック を 解放 し ます
は 、 infile という 名前 の ファイル の 内容 を rc2 4 0 ビット 暗号 により 暗号 化 し ます
は 、 pg _execute あるい は pg _send _execute で後 に 実行 する ため の プリペアドステートメント を 作成 し ます
すべて の アクティブ な レイヤー を 無効 に し ます
クリック し た 際 に ファイル が 実行 さ れる ハイパーリンク を 、 指定 し た 場所 に 設定 し ます
は 現在 の session .cache _expire の 設定 を 返し ます
は 、 ibase _blob _create で 作成 し た blob に データ を 追加 し ます
名前 を 使用 し て 、 エントリ の 内容 を 返し ます
この 関数 は 、 object の 内部 から parser を 使用 可能 に し ます
ストアドプロシージャ は 、 複数 の 結果 セット を 返す こと が でき ます
データベース と の 接続 を 閉じ ます
再 構築 さ れ た 画像 と 画像 の 差異 を 含む 配列 を 返し ます
pdflib パラメータ を 文字 列型 で 設定 し ます
高速 な & quot ;exact division &quot ; アルゴリズム を 使用 し て n を d で 割り ます
関数 dio _seek は 、 指定 さ れ た ファイル 記述子 の ファイル 内 の 位置 を 変更 する 際 に 使用 さ れ ます
指定 さ れ た ファイル の モード を mode で 指定 し た もの に 変更 しよ う と 試み ます
ページ の 単語 間隔 を 設定 し ます
画像 の 圧縮 を 設定 し ます
この 関数 は 、 ユーザー 定義 の 比較 関数 により 配列 を その 値 で ソート し ます
ドメイン domain の マップ map から 、 最初 の キー / 値 の 組 を 取得 し ます
例外 が try / catch ブロック の 中 で キャッチ さ れ なかっ た 場合 の デフォルト の 例外 ハンドラ を 設定 し ます
指定 し た メッセージ の 指定 し た body セクション の 構造 を 読み込み ます
は 、 結果 リソース result に関連 し た エラーメッセージ を 返し ます
curl ハンドル を コピー し 、 同じ 設定 を 保持 し ます
環境 変数 の 値 を 取得 し ます
この 関数 は エントリ を ソート し ます
は 、 array を スタック として 処理 し 、 渡さ れ た 変数 を array の 最後 に 加え ます
関数 は 、 result が 指す 結果 セット の 現在 の 行 について 、 すべて の カラム の 長さ を 含む 配列 を 返し ます
と同じ です が 、 dir _handle の デフォルト が $ this に なり ます
は 、 connection で 指定 し た postgresql サーバー から の 直近 の 通知 メッセージ を 返し ます
直近 の エラーメッセージ 文字 列 を 返し ます
指定 し た フィールドオフセット に 移動 し ます
この メソッド は 、 テーブルデータベース で は サポート し て いませ ん
全て の オープン さ れ た ページハンドル を クローズ し 、 pdf ドキュメント 入力 pdi を 閉じ ます
ステートメントリソース に 関連 付け られ た システムリソース および データベースリソース を 開放 し ます
現在 の アイテム が 有効 か どう か を 調べ ます
は 、 サーバー の パラメータ を 実行 時 に 変更 し ます
radius パラメータ で 定義 し た ブロック 内 の 各 ピクセル を 、 ランダム に 移動 さ せ ます
画像 の マットチャネル を 設定 し ます
関数 は 、 object _id で 指定 し た オブジェクト に 続く snmp オブジェクト の 値 を 取得 し ます
xsltprocessor を 使っ た 変換 の ため の 1 つ あるい は 多く の パラメータ の 値 を 設定 し ます
反復 処理 が 始まる とき 最初 に recursiveiteratoriterator :: rewind が コール さ れ た 後 に コール さ れ ます
この 関数 は 次 の 関数 の エイリアス です
現在 の 塗り つぶし 色 を 取得 し ます
描画色 、 塗りつぶし 色 、 あるい は その 両方 を 設定 し ます
リンク さ れ て いる sqlite ライブラリ の バージョン を 文字 列 として 返し ます
文字列 の 定義 から 新しい セット を 作る ファクトリーメソッド です
アノテーションアイコン の 形式 を 定義 し ます
は 、 フィールド が 属 する テーブル の 名前 か あるい は oid _only が true の 場合 に テーブル の oid を 返し ます
結果 id で 指定 し た 結果 に 対応 する データ の ひとつ の 行 を 取得 し ます
以前 に stream _socket _server によって 作 られ た ソケット の 接続 を 受け 入れ ます
この メソッド は 、 ディスク 上 の tar / zip アーカイブ が 読み込み 専用 で ない 場合 に true を 返し ます
文 の 属性 を 設定 し ます
は 、 指定 し た リンク id が 指す サーバー の 現在 アクティブ な データベース を 設定 し ます
インターフェイス の 名前 を 取得 し ます
画像 の 中 の 暗め の 部分 と 明るめ の 部分 の 輝度 の 差 を 強調 し ます
この 関数 が 内部 関数 な の か ユーザー 定義 関数 な のか を 調べ ます
セキュリティ 上 の 理由 により 、( パスワード 、 ms -chapv 1 mppe キー など いくつか の データ は 変形 さ れ ます
簡体 字中 国語 エンコーディング を 有効 に し ます
ページ の 塗り つぶし 色 を 定義 し ます
関数 は 、 pcntl _signal が インストール し た シグナルハンドラ を 各 ペンディングシグナル に対し て コール し ます
a の 平方根 を 計算 し ます
は 、 msql サーバー で 最後 に 発生 し た エラー を 返し ます
string の 先頭 文字 の ascii 値 を 返し ます
エントリ を ldap ディレクトリ に 追加 し ます
メール を 送信 し ます
デフォルト の 書記 素 クラスタシーケンス を テキストバッファ から 取り出す 関数 です
この 関数 は 指定 し た クラス が 定義 さ れ て いる かど う か を 調べ ます
この メソッド は 、 新た な エントリ を ハッシュ に 追加 し て 追加 に 成功 し た かどう か を 返し ます
マップ 内 の 生き た エントリ を 数え ます
 mqopen は 、 オブジェクト へ の アクセス を 確立 し ます
は php バックトレース を 表示 し ます
は 、 指定 し た セマフォ を 削除 し ます
デジタルフィルタ を 適用 し て ノイジー な 画像 の 品質 を 向上 さ せ ます
は 、 最大 length バイト の データ を zp が 指す gz ファイルポインタ から 読み込み ます
リモートサーバー から ローカルファイルシステム に scp プロトコル を 使用 し て コピー し ます
は final メソッド な ので 、 オーバーライド でき ませ ん
ドキュメント が 現在 使用 し て いる haruencoder を 取得 し ます
特定 の プロパティ が 定義 さ れ て いる かど う か を 調べ ます
は 、 connection に 非同 期 クエリ を 送信 し ます
指定 し た テキスト について 、 テキスト 全体 の 幅 、 文字数 、 単語 数 および 空白 の 数 を 取得 し ます
数値 を 含む 配列 を 引数 として 受け 取り 、 画像 全体 にわ たっ て 見つかっ た 座標 の 色 を 補間 し ます
特定 の キー が 共有 メモリセグメント 内 に 存在 する かど う か を 調べ ます
ムービー で 使用 する swf の バージョン を 設定 し ます
イベント の チェック と デフォルトループ の コールバック の 呼び出し を 開始 し ます
を コール し た 後 に newt インターフェイス の 使用 を 再開 し ます
無地 の 画像 を 作成 し ます
新しい コレクションオブジェクト を 割り 当て ます
ファイル の 終端 に 到達 し て いる か 調べ ます
この メソッド は 、 実行 可能 な phar アーカイブ を tar あるい は zip ファイル に 変換 し ます
は 共有 メモリブロック を 削除 する ため に 使用 さ れ ます
ページ の 移動 方式 を 設定 し ます
この メソッド は 、 fstat に対応 し て コール さ れ ます
指定 し た 設定 オプション の 値 を 設定 し ます
これ は 、 オブジェクト が 配列 として 扱わ れる 際 に 、 フィールド を 取得 する ため に 使用 さ れ ます
mysql サーバー と の 持続 的 な 接続 を 確立 し ます
ストリーム の メタデータ を 設定 し ます
この メソッド は 次 の コード と 同じ 意味 です
xml パーサ の エラーコード を 取得 し ます
オープン さ れ た モード で サポート さ れる 最大 キー 長 を 取得 し ます
指定 さ れ た スキーマファイル に 基づい て ドキュメント を 検証 し ます
複数 の mime ヘッダフィールド を 一度 に デコード し ます
指定 し た プレフィックス を もと に 、 スコープ の 名前 空間 を 検索 し ます
新しい harudoc の インスタンス を 作成 し ます
は 、 指定 し た key で system v メッセージキュー に アクセス する ため に 使用 さ れる id を 返し ます
画像 の シーン を 設定 し ます
この メソッド は 、 静的 メソッド 版 の closure :: bindto です
この 関数 は hwapi _insert の 短縮 版 です
テキスト の 位置 を 、 指定 し た オフセット に 移動 し ます
指定 し た リンク id が 指す ms sql server データベース へ の リンク を 閉じ ます
は 、 現在 の unix タイムスタンプ を マイクロ 秒単 位 で 返し ます
は 、 出力 形式 を 完全 か 数値 のい ずれか に 設定 し ます
オブジェクト の デフォルト の 圧縮 方式 を 設定 し ます
データソース が サポート する データ 型 について の 情報 を 取得 し ます
指定 し た signed _text を 検証 し 、 署名 について の 情報 を 返し ます
指定 し た 接続 リソース 上 で 実行 中 の トランザクション を コミット し 、 新しい トランザクション を 開始 し ます
指定 し た 名前 の 画像 プロパティ を 返し ます
ページ の 高さ を 定義 し ます
現在 の ページ に 矩形 の 注記 を 作成 し ます
プリペアドステートメント 内 の パラメータマーカ の 数 を 返し ます
norewinditerator を 作成 し ます
すべて の 持続 的 な リソース を 配列 で 返し ます
は fbsql _fetch _array と 似 て い ます が 1 点 だけ 違い が あり ます
ストレージ を シリアライズ し ます
アーカイブエントリ の 名前 パス つき を 返し ます
base の exp 乗 を 計算 し ます
yaf _application の インスタンス を 作成 し ます
クラス の 新しい インスタンス を 作成 し ます
フラグ を 設定 し ます
画像 の 各色 コンポーネント で 使用 する ビット 数 を 取得 し ます
セッションキャッシュ の 中身 と その 利用 状況 について の 情報 を 取得 し ます
スクリプト 処理 が 完了 し た とき 、 あるい は exit が コール さ れ た とき に 実行 する コールバック 関数 を 登録 し ます
さまざまな パラメータ を 設定 し ます
は 機能 的 に memcached :: replace と 同等 です
ドキュメント に 新しい ページ を 追加 し 、 さまざまな オプション を 設定 し ます
は 人為 的 に 負荷 を 高め 、 実行 前 に delay 秒待 ち ます
その アルゴリズム で サポート さ れる 最大 キー 長 を バイト 単位 で 返し ます
この 関数 は 、 jday で 指定 し た ユリウス 歴 に 対応 する unix タイムスタンプ を 返し ます
ノード を 文字列 に 正規 化 し ます
デフォルト の イベントループ を 止め ます
調べ た 関数 を 起動 し ます
ビネット 形式 で 画像 の 輪郭 を ぼかし ます
認証 パラメータ key を 取得 し ます
この 関数 は 、 暗号 化記 述子 で 指定 し た アルゴリズム の iv の 大きさ を バイト 単位 で 返し ます
現在 の ページレイアウト を 取得 し ます
操作 モード を 設定 し ます
描画 出力 の ため の 現在 の 点 を 設定 し ます
は 、 結果 コード に 対応 する メッセージ を 返し ます
ルート sdo _dataobject を 返し ます
この 関数 は 、 ingres _query で 実行 し た クエリ から 取得 し た データ を 連想 配列 に 保存 し ます
この 関数 は 、 __ autoload の デフォルト 実装 として 使用 さ れる こと を 意図 し て い ます
これ は arrayaccess インターフェイス を 実装 し た もの です
非線形 s 字 コントラストアルゴリズム を 用い て 画像 の コントラスト を 調整 し ます
solr サーバー に 送られ た 生 の リクエストヘッダ を 返し ます
この 関数 は 、 指定 し た ローカルタグ 名 の すべ て の 要素 を 含む domnodelist クラス の 新しい インスタンス を 返し ます
指定 し た 名前 空間 内 で 、 指定 し た 名前 の 属性 に カーソル を 移動 し ます
は 、 検索 に関する 制約 を リセット し ます
自動 コミット の 挙動 を 切り 替え ます
リスト 内 で 逆方 向 に ひとつ 進ん だ とき にまだ オブジェクト が 画像 を 保持 し て いれ ば true を 返し ます
生成 さ れ た pdf ファイル を 閉じ 、 ドキュメント の 関係 する 全て の リソース を 開放 し ます
ある 範囲 の 整数 を 有する 配列 を 作成 し ます
サーバー の パラメータ 設定 を 検索 し ます
指定 し た 日付 について の 詳細 情報 を 連想 配列 で 返し ます
オブジェクト の 輪郭 の 描画 に 使う 色 を 設定 し ます
ステートメントリソース あるい は 接続 リソース の オプション を 設定 し ます
は 、 query _identifier が 指す メモリ を 開放 し ます
サブイテレータ の 有効 性 を 調べ ます
ページ の 定義 は 文字列 で 、 書式 は wxh +x +y と なり ます
与え られ た bzip 2 ファイルポインタ を 閉じ ます
クエリ から の 複数 の 行 を 二次 元配 列 に 取得 し ます
miter limit を 設定 し ます
その リクエスト が ajax リクエスト で ある かど う か を 調べ ます
プロセス id pid の プロセス について の 統計 情報 を 取得 し ます
画像 ヒストグラム を 均等 化 し ます
指定 し た 色 チャネル の 値 を 取得 し ます
反復 処理 中 の 現在 の 値 を 返し ます
文字 フィールド から データ を 取得 する 際 の エンコーディング を 設定 し ます
文字 列内 で 最初 に あらわ れる 場所 の 書記 素単 位 の 位置 を 見つけ ます
結果 セット に 含まれる フィールド の 数 を 返し ます
この 関数 は 、 デフォルト の タイムゾーン を 以下 の 優先 順位 で 取得 し て 返し ます
この 関数 は まさ に ベータ 版 で あり 、 9 9 % の ユーザー にとって は 使い道 の ない もの です
id 型 と なる 属性 を name で 宣言 し ます
int あるい は double 値 を 加算 し ます
ユリウス 積算 日 を & quot ;月 / 日 / 年 &quot ; の 形式 で グレゴリウス 日 を 含む 文字 列 に 変換 し ます
塗りつぶし や 描画 を 行わ ず に 現在 の パスオブジェクト を 終了 し ます
指定 し た relation から 直近 の タプル に関する データ を 読み込み 、 tuple に 連想 配列 として 代入 し ます
は 、 rows の 内容 を テーブル に 挿入 し ます
幅 と 高さ を 連想 配列 で 返し ます
これ は 、 イテレータ を 先頭 に 巻き戻し ます
type で 指定 さ れ た 内部 設定 変数 の 値 を 、 charset に 変更 し ます
この 関数 は 、 与え られ た プロパティ property が 指定 さ れ た クラス に 存在 する かど う か を 確認 し ます
画像 の 各 ピクセル に 、 塗りつぶし 色 を 混合 し ます
イテレータ を 前 に 移動 し ます
文字列 に 変換 し ます
停止 し た evcheck ウォッチャー の インスタンス を 作り ます
実行 時 に 関数 を 作成 し ます
オブジェクト へ の 強い 参照 を 確保 し 、 事実 上 、 弱い 参照 を 強い 参照 に 切り 替え ます
端末 が カラー 表示 機能 を 持つ かど う か を 調べ ます
コード 変換 指令 request に 基づき ファイルハンドル input が 指す ファイル を ファイルハンドル output が 指す ファイル に コード 変換 し ます
指定 し た 画像 を 設定 し ます
a と p の & raquo ;& nbsp ; ルジェンドル 記号 を 計算 し ます
は apache の 書き込み タイマー を リセット し ます
文字 列型 の pdi ドキュメントパラメータ の 内容 を 取得 し ます
指定 し た 文 statement における カラム の 数 を 返し ます
シーケンス 内 の 特定 の 画像 の ファイル 名 を 返し ます
この メソッド を 使用 する と 、 画像 全体 を 読み込ま なく て も 画像 の 幅や高さ 、 サイズ そし て フォーマット を 取得 でき ます
oracle が 追跡 する クライアント 情報 を 設定 し ます
を 処理 し ます
svn クライアントライブラリ の バージョン を 返し ます
指定 し た パラメータ により 匿名 関数 を 作成 し 、 その 関数 の ユニーク な 名前 を 返し ます
結果 セット の 行 の 数 を 返し ます
operand の 平方根 を 返し ます
を コール し た 結果 から データベース 名 を 取得 し ます
を 使用 し て 、 デッドロック の 際 の 再試 行回 数 を 定義 する こと が 可能 です
priority 1 と priority 2 を 比較 し ます
オブジェクト の 輪郭 の 不透 明度 を 設定 し ます
指定 し た 名前 の 属性 に カーソル を 移動 し ます
この 関数 は 、 xml 文字列 を 処理 し 、 2つ の 配列 構造 体 に 代入 し ます
新しい sphinxclient オブジェクト を 作成 し ます
が返し た statement を 実行 し ます
画像 の マット 色 を 返し ます
は 、 informix サーバー へ の 接続 を 確立 し ます
部分 文字 列 を 返し ます
画像 の 色 を 、 replacement で 定義 し た もの に 置き 換え ます
現在 の 塗り つぶし 色 から スポット 色 を 作成 し ます
指定 し た ファイル から 、 バイナリダンプ を apc の ファイル / ユーザーキャッシュ に 読み込み ます
imagemagick の リリース 日 を 文字列 で 返し ます
icc 、 iptc あるい は 汎用 の プロファイル を 画像 に 追加 あるい は 削除 し ます
は 、 oid が 指す データ に アクセス する ため の ストリーム を オープン し ます
名前 空間 を 宣言 し た ところ で コール さ れる ハンドラ を 設定 し ます
この 関数 は まさ に ベータ 版 で あり 、 9 9 % の ユーザー にとって は 使い道 の ない もの です
は 、 指定 し た フィールド の フィールドフラグ を 返し ます
データベース 内 の すべ て の コレクション の リスト を 取得 し 、 mongocollection オブジェクト の 配列 で 返し ます
関数 は 、 ip アドレス に 対応 する インターネットサービスプロバイダ isp 名 を 返し ます
csv フィールド 処理 用 の 区切り 文字 と 囲み 文字 を セット し ます
この メソッド は 、 すべて の シンボリックリンク を 展開 し て 相対 参照 を 解決 し 、 ファイル へ の 実際 の パス を 返し ます
ファイル の inode 変更 時刻 を 取得 し ます
オープン し た filepro データベース の フィールド （ カラム ） の 数 を 返し ます
この 関数 は 、 キャッシュ ・ インスタンス について の ステータス 情報 を 返し ます
指定 さ れ た メッセージ 本文 中 の 特定 の セクション を 取得 し ます
スクリプト 実行 時 の メモリ 使用 量 が 過大 で ある と 懸念 さ れる 場合 のみ mssql _free _result は コール する べき です
は object _id で 指定 し た snmp オブジェクト の 値 を 読み とる ため に 使用 さ れ ます
この 関数 は 、 bbcode _create が オープン し た リソース を 閉じ ます
新規 fdf ドキュメント を 作成 し ます
は 、 data に関し て condition に マッチ する レコード を 更新 し ます
画像 を 折り た たむ 任意 の メソッド imagick :: convolveimage など について 画像 の バイアス を 設定 し ます
この メソッド は 、 シリアライズ し た セット を 返し ます
シンボルテーブル を 書き 換える こと で 、 組み込み の 関数 を 上書き し ます
solr オブジェクト を 生成 し ます
は 、 image が truecolor 画像 か どう か 調べ ます
ノンゼロワインディング 規則 を 使用 し て 現在 の パス を 塗り つぶし ます
座標系 の 回転 を 設定 し ます
テキスト の 行 の フォーマット を 行い 、 その 結果 の メトリクス を 問い合わ せ ます
現在 の リクエストオブジェクト を 取得 し ます
この 関数 は 、 指定 し た シーケンス sequence の メッセージ の フラグ から 、 指定 し た フラグ flag を 削除 し ます
指定 し た 座標 左上 が 0 0 です から 、 指定 し た 色 color で image を 塗り つぶし ます
リポジトリ 内 の ファイル を 指す url repos _url の 中身 を 返し ます
に 入っ た 回数 から ev :: run を 正常 終了 し た 回数 を 引い た 結果 、 つまり 、 再帰 の 深さ を 返し ます
特定 の フィールド が 存在 する かどう か チェック し ます
作業 コピー 内 の パス で の ローカル の 変更 内容 を 取り消し ます
zip アーカイブ の コメント を 設定 し ます
ch ハンドル を 、 マルチハンドル mh に 追加 し ます
コレクション 内 の 要素 の 最大 数 を 返し ます
以降 の 描画 処理 で 使わ れる グレー 値 を 設定 し ます
は 、 データベース 内 の ドキュメント の 数 を 返し ます
は 、 指定 し た filename から 得 られ た イメージ を 表す イメージid を 返し ます
は 、 postgresql 結果 リソース から フィールド （ カラム ） の 数 を 返し ます
ファイル の グループ を 取得 し ます
ページ の 高さ を 取得 し ます
フレーム の 文字 列表 現 を 返し ます
は ftp サーバー 上 の ファイル や ディレクトリ の 名前 を 変更 し ます
画像 を ぼかし ます
iis の 各仮 想 サーバー に は 、 インスタンス 番号 が 付け られ て い ます
フラグ を 設定 し ます
画像 の インターレース 手法 を 取得 し ます
slob オブジェクト を 文字列 に 書き こみ ます
 ;& nbsp ;rfc 2 0 4 5 の section 6 . 7 に 従っ て 作成 し た quoted printable 文字列 を 返し ます
は 、 現在 の 配列 位置 に おける 連想 配列 要素 の キー を 返し ます
組み込み の スポット 色名 を 検索 する か 、 現在 の 塗り つぶし 色 から 名前 付き の スポット 色 を 作成 し ます
インターフェイス を 実装 し て いる かど う か を 調べ ます
この メソッド は 、 エントリ を 新しい 値 で 更新 し ます
この 関数 は 次 の 関数 の エイリアス です
http ステータス に関する 詳細 を 返し ます
sql 命令 を データベースサーバー に 送り ます
セッションキャッシュ による メモリ 使用 状況 について の 情報 を 取得 し ます
新規 の pdf ファイル を 指定 し た ファイル 名 で 作成 し ます
処理 フラグ を 設定 し ます
この 関数 は 、 コールバック 関数 を 設定 し ます
class に interface を 実装 さ せ ます
現在 の ヘルプ 行 を 、 スタック の 内容 で 置き 換え ます
組み込み の 繁体 字中 国語 フォント を 有効 に し ます
は 、 指定 し た link _identifier が 指す データベース 全体 を サーバー から 破棄 削除 しよ う とし ます
これ を 使用 し て 、 外部 の phar アーカイブ の 内容 を 読み込む こと が でき ます
apc の キー の 名前 に マッチ する pcre 正規 表現
希望 する 書式
一覧 に する 形式
キャッシュ の 形式
チャンクサイズ
成功 し た 場合 に apciterator オブジェクト 、 失敗 し た 場合 に null を 返し ます
apciterator イテレータオブジェクト を 作成 する
成功 し た 場合 に ヒット 数 、 失敗 し た 場合 に false を 返し ます
キャッシュヒット の 総数 を 取得 する
キャッシュ の サイズ の 合計 を 返し ます
キャッシュ の サイズ の 合計 を 取得 する
成功 し た 場合 に キー 、 失敗 し た 場合 に false を 返し ます
イテレータ の キー を 取得 する
ポインタ を 次 の 項目 に 移動 さ せる
現在 位置 が 有効 か どう か を 調べる
追加 する イテレータ
イテレータ を 追加 する
現在 の 内部 イテレータ を 返し ます
内部 イテレータ を 取得 する
現在 の 内部 イテレータ の インデックス 最初 は ゼロ を 整数 値 で 返し ます
イテレータ の インデックス を 取得 する
有効 な 状態 の 場合 は 現在 の キー 、 それ 以外 の 場合 は null を 返し ます
現在 の キー を 取得 する
次 の 要素 に 移動 する
現在 の イテレーション が 有効 な 場合 に true 、 それ 以外 の 場合 に false を 返し ます
現在 の 要素 が 有効 か どう か を 調べる
取得 し たい オフセット
すべて の 型 の 値 を 返す こと が でき ます
オフセット を 取得 する
設定 し たい 値
値 を 代入 し たい オフセット
指定 し た オフセット に 値 を 設定 する
設定 解除 し たい オフセット
オフセット の 設定 を 解除 する
追加 する 値
要素 を 追加 する
連想 配列 の 場合 は 要素 の 数 、 オブジェクト の 場合 は public プロパティ の 数 を 返し ます
要素 を 数える
配列 の コピー を 返し ます
配列 の コピー を 取得 する
この 関数 は 、 現在 の 配列 キー を 返し ます
現在 の 配列 キー を 返す
キー で 配列 を ソート する
次 の エントリ に 移動 する
調べ たい オフセット
オフセット が 存在 する かど う か を 調べる
値 を 取得 し たい オフセット
オフセット index の 値 を 返し ます
オフセット の 値 を 取得 する
設定 し たい インデックス
インデックス に 格納 する 新しい 値
オフセット の 値 を 設定 する
シリアライズ し た arrayiterator を 返し ます
シリアライズ する
次 の ビットマスク
振る 舞い の フラグ を 設定 する
ソート に 使う 比較 関数
ユーザー 定義 の ソート
ソート に 使う 比較 関数
ユーザー 定義 の ソート
シリアライズ し た arrayiterator オブジェクト
arrayiterator を 返し ます
アンシリアライズ する
値 で エントリ を ソート する
arrayobject の public プロパティ の 数 を 返し ます
arrayobject の public プロパティ の 数 を 取得 する
現在 の 配列 と 交換 する 配列 あるい は オブジェクト
元 の 配列 を 返し ます
配列 を 別 の 配列 と 交換 する
配列 の コピー を 返し ます
arrayobject の コピー を 作成 する
arrayobject の 振る 舞い の フラグ を 返し ます
振る 舞い の フラグ を 取得 する
arrayobject から イテレータ を 返し ます
arrayobject インスタンス から 新規 イテレータ を 生成 する
この オブジェクト の 反復 処理 に 使う イテレータ の クラス 名 を 返し ます
arrayobject の イテレータクラス 名 を 取得 する
キー で エントリ を ソート する
大文字 小文字 を 区別 し ない & quot ; 自然順 &quot ; アルゴリズム で エントリ を ソート する
この オブジェクト の 反復 処理 に 使う 配列 イテレータ の クラス 名
arrayobject の イテレータクラス 名 を 設定 する
関数 cmp _function は 二つ の パラメータ を 受け取り ます
ユーザー 定義 の 比較 関数 で エントリ を ソート し 、 キー と の 対応 は 保持 する
シリアライズ し た arrayobject
arrayobject を アンシリアライズ する
キャッシュ の 内容 を 含む 配列 を 返し ます
キャッシュ の 内容 を 取得 する
現在 の アイテム を 受け 付ける 場合 に true 、 それ 以外 の 場合 に false を 返し ます
現在 の 値 、 現在 の キー 、 そして 内部 イテレータ を 引数 として で コールバック を 呼び出す
読み込む ファイル 名
chdb クラス の インスタンス を 生成 し ます
値 を 取得 する ため の キー
与え られ た key に対応 し た 値 を 含む 文字 列 を 返し ます
キー に 対応 し た 値 を 取得 する
バインド する 無名 関数
指定 し た 無名 関数 を バインド する オブジェクト
クロージャ を 関連 づける クラススコープ 、 あるい は & # 0 3 9 ; static &# 0 3 9 ; で 現在 の スコープ を 維持 し ます
新しい closure オブジェクト を 返し ます
バインド さ れ た オブジェクト と クラス の スコープ で クロージャ を 複製 する
指定 し た 無名 関数 を バインド する オブジェクト
クロージャ を 関連 づける クラススコープ 、 あるい は & # 0 3 9 ; static &# 0 3 9 ; で 現在 の スコープ を 維持 し ます
新しい closure オブジェクト を 返し ます
新しく バインド し た オブジェクト と クラス の スコープ で 、 クロージャ を 複製 する
インスタンス 作成 を 無効 化 し た コンストラクタ
cond :: create を 呼ん で 取得 し た 条件 変数 へ の ハンドル
成功 し た かどう か を 返し ます
条件 を ブロードキャスト する
条件 変数 へ の ハンドル を 返し ます
条件 を 作る
cond :: create を 呼ん で 取得 し た 条件 変数 へ の ハンドル
成功 し た かどう か を 返し ます
条件 を 破棄 する
cond :: create を 呼ん で 取得 し た 条件 変数 へ の ハンドル
オプション の タイムアウト 時間
呼び出し元 が mutex :: create を 呼ん で 所有 ロック し て いる ミューテックス へ の ハンドル
成功 し た かどう か を 返し ます
条件 を 待つ
次 の 文字 を 、 format パラメータ 文字 列 に 使用 する こと が でき ます
フォーマット さ れ た 間隔 を 返し ます
間隔 を フォーマット する
初期化 配列
新しい datetime オブジェクト の インスタンス を 返し ます
_ _set _state ハンドラ
_ _wakeup ハンドラ
年月 日時 分秒 の 値 を 加える
手続き 型 のみ : date _create が 返す datetime オブジェクト
日付 / 時刻 文字列
新しく 作っ た オブジェクト を 返し ます
タイムスタンプ を 変更 し た 新しい オブジェクト を 作る
_ _set _state ハンドラ
日付 を 設定 する
unix タイムスタンプ を 用い て 日付 と 時刻 を 設定 する
タイムゾーン を 設定 する
年月 日時 分秒 の 値 を 引く
ディレクトリハンドル を 元 に 戻す
現在 の directoryiterator アイテム を 返し ます
現在 の directoryiterator アイテム を 返す
ファイル の 最終 アクセス 時刻 を 、 unix タイムスタンプ で 返し ます
現在 の directoryiterator アイテム の 最終 アクセス 時刻 を 取得 する
ベース 名 が suffix で 終わる 場合 は 、 これ が カット さ れ ます
現在 の directoryiterator の アイテム の ベース 名 を 返し ます
現在 の directoryiterator の アイテム の ベース 名 を 取得 する
ファイル の 最終 更新 時刻 を 、 unix タイムスタンプ で 返し ます
現在 の directoryiterator アイテム の inode 修正 時刻 を 取得 する
ファイル の 拡張子 を 文字列 で 返し ます
ファイル の 拡張子 を 取得 する
現在 の directoryiterator アイテム の ファイル 名 を 返し ます
現在 の directoryiterator アイテム の ファイル 名 を 返す
ファイル の inode 番号 を 返し ます
現在 の directoryiterator アイテム の inode を 取得 する
ファイル の 所有 者 を 、 数値 形式 で 返し ます
現在 の directoryiterator アイテム の 所有 者 を 取得 する
現在 の ファイル の パス と ファイル 名 を 返し ます
現在 の directoryiterator アイテム の パス と ファイル 名 を 返す
ファイルサイズ を バイト 単位 で 返し ます
現在 の directoryiterator アイテム の サイズ を 取得 する
ディレクトリ の 場合 に true 、 そう で ない 場合 に false を 返し ます
現在 の directoryiterator アイテム が ディレクトリ で ある かど う か を 調べる
エントリ が
現在 の directoryiterator アイテム が '
エントリ が シンボリックリンク で ある 場合 に true 、 そう で ない 場合 に false を 返し ます
現在 の directoryiterator アイテム が シンボリックリンク で ある かど う か を 調べる
ファイル が 読込 可能 で ある 場合 に true 、 そう で ない 場合 に false を 返し ます
現在 の directoryiterator アイテム が 読込 可能 で ある かど う か を 調べる
次 の directoryiterator アイテム に 移動 する
directoryiterator を 最初 に 巻き戻す
異動先 を 表す 、 ゼロ から 始まる 位置
directoryiterator の アイテム を 移動 する
有効 な 位置 で ある 場合 は true 、 それ 以外 の 場合 は false を 返し ます
現在 の directoryiterator の 位置 が 有効 な ファイル で ある かどう か チェック する
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
属性 が 定義 済み の id かどう か を 調べる
追加 する 文字列
ノード の 文字 データ の 最後 に 文字列 を 追加 する
削除 開始 位置 の オフセット
削除 する 文字 の 数
指定 し た 範囲 の 文字列 を ノード から 削除 する
挿入 する 場所 の 文字 オフセット
挿入 する 文字列
指定 し た 1 6 ビット 単位 の オフセット に 、 文字列 を 挿入 する
置換 開始 位置 の オフセット
置換 する 文字 の 数
置換 する 文字列
domcharacterdata ノード の 文字列 の 一部 を 置換 する
コメント の 値
新しい domcomment オブジェクト を 作成 する
xml 宣言 の 一部 で ある 、 ドキュメント の バージョン 番号
xml 宣言 の 一部 で ある 、 ドキュメント の エンコーディング
新しい domdocument オブジェクト を 作成 する
属性 の 名前
新しい domattr 、 あるい は エラー が 発生 し た 場合 は false を 返し ます
新しい 属性 を 作成 する
属性 の タグ 名 と プレフィックス を 、 prefix :tagname の よう な 形式 で 指定 する
名前 空間 の uri
新しい domattr 、 あるい は エラー が 発生 し た 場合 は false を 返し ます
関連付け られ た 名前 空間 に 新しい 属性 を 作成 する
cdata の 内容
新しい domcdatasection 、 あるい は エラー が 発生 し た 場合 は false を 返し ます
新しい cdata ノード を 作成 する
コメント の 内容
新しい domcomment 、 あるい は エラー が 発生 し た 場合 は false を 返し ます
新しい comment ノード を 作成 する
新しい domdocumentfragment 、 あるい は エラー が 発生 し た 場合 は false を 返し ます
新しい 文書 片 を 作成 する
要素 の タグ 名
要素 の 値
新しい domelement クラス の 新しい インスタンス 、 あるい は エラー が 発生 し た 場合 は false を 返し ます
新しい 要素 ノード を 作成 する
処理 命令 の 内容
処理 命令 の 対象
新しい domprocessinginstruction 、 あるい は エラー が 発生 し た 場合 に は false を 返し ます
新しい pi ノード を 作成 する
テキスト の 内容
新しい domtext 、 あるい が エラー が 発生 し た 場合 に は false を 返し ます
新しい テキストノード を 作成 する
要素 の id
domelement 、 あるい は 要素 が 見つ から なかっ た 場合 は null を 返し ます
id に対応 する 要素 を 検索 する
タグ の ローカル 名 名前 空間 を 除い た もの に 一致 する 名前
一致 する すべ て の 要素 を 含む 、 新しい domnodelist オブジェクト を 返し ます
指定 し た ローカルタグ 名 に 対応 する すべ て の 要素 を 検索 する
libxml オプション 定数 を ビット or で 連結 し た もの
xml ドキュメント へ の パス
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ファイル から xml を 読み込む
html ファイル へ の パス
php 5
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ファイル から html を 読み込む
拡張 し た クラス の 名前
拡張 し たい dom クラス
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
基底 ノード 型 を 作成 する 際 に 使用 する 拡張 クラス を 登録 する
rng スキーマ を 含む 文字列
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ドキュメント を relaxng で 検証 する
保存 さ れ た xml ドキュメント へ の パス
追加 の オプション
書き込ん だ バイト 数 、 あるい は エラー が 発生 し た 場合 は false を 返し ます
内部 の xml ツリー を ファイル に 出力 する
ドキュメント の サブセット を 出力 する オプション の パラメータ
html 、 あるい は エラー が 発生 し た 場合 は false を 返し ます
内部 の ドキュメント を html 形式 の 文字 列 として 出力 する
保存 さ れ た html ドキュメント へ の パス
書き込ん だ バイト 数 、 あるい は エラー が 発生 し た 場合 は false を 返し ます
内部 の ドキュメント を html 形式 で ファイル に 出力 する
ドキュメント 全体 で は なく 、 xml 宣言 以外 の 特定 の ノード だけ を 出力 し たい 場合 に この パラメータ を 使用 し ます
追加 の オプション
xml 、 あるい は エラー が 発生 し た 場合 は false を 返し ます
内部 の xml ツリー を 文字 列 として 出力 する
libxml の スキーマ 検証 フラグ の ビットマスク
スキーマ へ の パス
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
スキーマ に 基づい て ドキュメント を 検証 する
スキーマ を 含む 文字列
libxml の スキーマ 検証 フラグ の ビットマスク
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
スキーマ に 基づい て ドキュメント を 検証 する
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
dtd に 基づい て ドキュメント を 検証 する
要素 の タグ 名
要素 の 値
指定 し た 名前 空間 の 中 で 要素 を 作成 する ため の 名前 空間 uri
新しい domelement オブジェクト を 作成 する
属性 の 名前
属性 ノード を 返し ます
属性 ノード を 返す
ローカル 名
名前 空間 uri
属性 ノード を 返し ます
属性 ノード を 返す
ローカル 名
名前 空間 uri
属性 の 値 、 あるい は localname および namespaceuri に対応 する 属性 が 見つから なかっ た 場合 に は 空 の 文字列 を 返し ます
属性 の 値 を 返す
タグ 名
この 関数 は 、 一致 し たすべて の 要素 から なる domnodelist クラス の インスタンス を 返し ます
タグ 名 から 要素 を 取得 する
ローカル 名
名前 空間 uri
この 関数 は 、 一致 し たすべて の 要素 から なる domnodelist クラス の インスタンス を 返し ます
名前 空間 uri と ローカル 名 から 要素 を 取得 する
要素名
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
属性 が 存在 する かど う か を 調べる
ローカル 名
名前 空間 uri
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
属性 が 存在 する かど う か を 調べる
属性 の 名前
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
属性 を 削除 する
ローカル 名
名前 空間 uri
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
属性 を 削除 する
属性 の 名前
属性 の 値
新しい domattr 、 あるい は エラー が 発生 し た 場合 は false を 返し ます
新しい 属性 を 追加 する
属性 ノード
属性 が 置換 さ れ た 場合 は 置換 前 の ノード 、 そう で ない 場合 は null を 返し ます
新しい 属性 ノード を 要素 に 追加 する
属性 ノード
属性 が 置換 さ れ た 場合 は 置換 前 の ノード を 返し ます
新しい 属性 ノード を 要素 に 追加 する
属性 の 値
名前 空間 uri
prefix :tagname 形式 で 表し た 属性 名
新しい 属性 を 追加 する
属性 の 名前
name を id 型 に し たい 場合 に true 、 それ 以外 の 場合 に false を 設定 し ます
id 型 の 属性 を 名前 で 宣言 する
属性 の ローカル 名
属性 の 名前 空間 uri
name を id 型 に し たい 場合 に true 、 それ 以外 の 場合 に false を 設定 し ます
id 型 の 属性 を ローカル 名 および 名前 空間 uri で 宣言 する
新しい domimplementation オブジェクト を 作成 する
作成 する ドキュメント 要素 の 修飾 名
作成 する ドキュメント の 型 、 あるい は null
作成 する ドキュメント 要素 の 名前 空間 uri
新しい domdocument オブジェクト を 返し ます
指定 し た 型 と ドキュメント 要素 の domdocument オブジェクト を 作成 する
外部 サブセット の 公開 id
外部 サブセット の システム id
作成 さ れる ドキュメント 型 の 修飾 名
ownerdocument を null に 設定 し た 新しい domdocumenttype ノード を 返し ます
空 の domdocumenttype オブジェクト を 作成 する
調べる 機能
調べる feature の バージョン 番号
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
dom 実装 が 、 指定 し た 機能 を 実装 し て いる かど う か を 調べる
取得 する ノード の 名前
指定 し た 任意 の 型 の nodename の ノード 、 あるい は ノード が 見つ から なかっ た 場合 に は null を 返し ます
名前 で 指定 さ れ た ノード を 取得 する
取得 する ノード の ローカル 名
取得 する ノード の 名前 空間 uri
指定 し た 任意 の 型 の ローカル 名 および 名前 空間 uri の ノード 、 あるい は ノード が 見つ から なかっ た 場合 に は null を 返し ます
ローカル 名 および 名前 空間 uri で 指定 し た ノード を 取得 する
マップ 内 の インデックス
マップ 内 の index 番目 の 位置 に ある ノード 、 あるい は インデックス が 不正 な 形式 マップ 内 の 要素 数 以上 の 場合 は null を 返し ます
インデックス で 指定 し た ノード を 取得 する
指定 し た xpath あるい は 名前 空間 プレフィックス に マッチ する ノード だけ を 対象 と し た パース を 有効 に する
ノード を 絞り込む ため の 名前 空間 プレフィックス の 配列
コメント を 残し て 出力 する
ノード を 絞り込む ため の xpath の 配列
正規化 し た ノード を 文字列 で 返し ます
ノード を 文字列 に 正規 化 する
子孫 要素 を 含め て コピー する かど う か を 指定 し ます
複製 さ れ た ノード を 返し ます
ノード を 複製 する
常 に ノード が 定義 さ れ た 行 の 番号 を 返し ます
ノード が 存在 する 行 の 番号 を 取得 し ます
xpath を 含む 文字 列 、 あるい は エラー 時 に null を 返し ます
ノード の xpath を 取得 する
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ノード が 属性 を 保持 し て いる かど う か を 調べる
参照 ノード
新しい ノード
挿入 さ れ た ノード を 返し ます
参照 し て いる ノード の 前 に 新しい 子 を 追加 する
調べる 名前 空間 uri
namespaceuri が デフォルト の 名前 空間 で ある 場合 に true 、 それ 以外 の 場合 に false を 返し ます
指定 し た namespaceuri が デフォルト の 名前 空間 か どう か を 調べる
調べる 機能
調べる 機能 feature の バージョン 番号
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
指定 し た バージョン で 機能 が サポート さ れ て いる かど う か を 調べる
名前 空間 の プレフィックス
ノード の 名前 空間 uri を 返し ます
プレフィックス に 基づい て 、 ノード の 名前 空間 uri を 取得 する
ノード を 正規 化 する
削除 する 子要素
子要素 の 削除 に 成功 し た 場合 に 、 削除 し た 要素 を 返し ます
子要 素群 から 子要素 を 削除 する
古い ノード
新しい ノード
古い ノード 、 あるい は エラー が 発生 し た 場合 は false を 返し ます
子 を 置き 換える
コレクション 内 の ノード の インデックス
domnodelist 内 の index 番目 の 位置 に ある ノード 、 あるい は インデックス が 不正 な 形式 の 場合 は null を 返し ます
インデックス で 指定 し た ノード を 取得 する
処理 命令 の タグ 名
処理 命令 の 値
新しい domprocessinginstruction オブジェクト を 作成 する
ノード に ゼロ 個以上 の 空白 文字 だけ が 含まれる 場合 に true 、 それ 以外 の 場合 に false を 返し ます
この テキストノード が 空白 を 含む か どう か を 示す
分割 する 位置 を 示す オフセット
同じ型 の 新しい ノード を 返し ます
指定 し た オフセット で ノード を 2 つに 分割 する
domxpath に関連付け られ た domdocument
新しい domxpath オブジェクト を 作成 する
実行 する xpath 式
オプション の registernodens で 、 コンテキストノード の 自動 登録 を 無効 に する こと が でき ます
相対 xpath クエリ を 実行 する 場合 に 、 オプション で 基準 ノード を 指定 する こと が 可能 です
可能 で あれ ば 型付け さ れ た 結果 、 あるい は 指定 さ れ た xpath 式 expression に マッチ する すべ て の ノード を 含む domnodelist を 返し ます
与え られ た xpath 式 を 評価 し 、 可能 で あれ ば 結果 を 返す
名前 空間 の uri
プレフィックス
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
domxpath オブジェクト の 名前 空間 を 登録 する
この パラメータ を 使っ て 、 特定 の 関数 のみ を xpath から コール できる よう に 制限 する こと が でき ます
php の 関数 を xpath 関数 として 登録 する
next メソッド
ev _depth は 、 デフォルト の ループ の 再帰 の 深さ を 返し ます
再帰 の 深さ を 返す
他 の イベントループ に 埋め込める バックエンド 群 を 返す
シグナル 番号
シグナルイベント を ev に 送る
シグナル 番号
シグナルイベント の 情報 を デフォルトループ に 送る
デフォルト の イベントループ の ポーリング 回数 を 返し ます
デフォルト の イベントループ が 新しい イベント を ポーリング し た 回数 を 返す
デフォルト の イベントループ で 直近 の 処理 が 始まっ た 時刻 を 表す 秒数 を 返し ます
デフォルト の イベントループ で 直近 の 処理 が 始まっ た 時刻 を 返す
一時 停止 し て い た デフォルト の イベントループ を 再開 さ せる
オプション の パラメータ で 、 以下 のい ずれ か に なり ます
イベント の チェック と デフォルトループ の コールバック の 呼び出し を 開始 する
ev :: break _* 定数 のいずれ か
デフォルト の イベントループ を 止める
現在 の libev の 構成 で サポート する バックエンド 群 を 返す
デフォルト の イベントループ を 一時 停止 する
epoch から 現在 時刻 まで の 秒数 を 返し ます
epoch から 現在 時刻 まで の 秒数 を 返す
内部 の 整合 性 を チェック する デバッグ 用
ウォッチャー の 優先 度
この ウォッチャー に 関連 づける カスタムデータ
ウォッチャー の コールバック を 参照く ださい
成功 し た 場合 に evcheck オブジェクト を 返し ます
evcheck ウォッチャーオブジェクト を 作る
ウォッチャー の 優先 度
この ウォッチャー に 関連 づける カスタムデータ
ウォッチャー の コールバック を 参照く ださい
成功 し た 場合 に evcheck オブジェクト を 返し ます
停止 し た evcheck ウォッチャー の インスタンス を 作る
状態 の 変更 を 待つ プロセス の pid 0 に する と 、 すべて の プロセス を 対象 に し ます
ウォッチャー の 優先 度
この ウォッチャー に 関連 づける カスタムデータ
false に する と 、 プロセス が 終了 し た とき に だけ ウォッチャー を アクティブ に し ます
ウォッチャー の コールバック を 参照く ださい
成功 し た 場合 に evchild オブジェクト を 返し ます
evchild ウォッチャーオブジェクト を 作る
evchild :: __ construct と同じ
ウォッチャー の 優先 度
evchild :: __ construct と同じ
この ウォッチャー に 関連 づける カスタムデータ
ウォッチャー の コールバック を 参照く ださい
停止 し た evchild ウォッチャー の インスタンス を 作る
ウォッチャー の 優先 度
この ウォッチャー に 関連 づける カスタムデータ
evembed :: __ construct と同じ
ウォッチャー の コールバック を 参照く ださい
停止 し た evembed ウォッチャー の インスタンス を 作る
埋め込ん だ ループ に対し て 単一 の 非 ブロックスイープ を 行う
ウォッチャー の 優先 度
この ウォッチャー に 関連 づける カスタムデータ
ウォッチャー の コールバック を 参照く ださい
成功 し た 場合 に 、 停止 し た evfork オブジェクト を 返し ます
停止 し た evfork ウォッチャー の インスタンス を 作る
ウォッチャー の 優先 度
この ウォッチャー に 関連 づける カスタムデータ
ウォッチャー の コールバック を 参照く ださい
成功 し た 場合 に evprepare オブジェクト を 返し ます
evprepare ウォッチャーオブジェクト を 作る
例外 を コピー する
例外 コード を 整数 値 で 返し ます
例外 コード を 取得 する
例外 が 作ら れ た ファイル の 名前 を 返し ます
例外 が 発生 し た ファイル を 取得 する
例外 が 作られ た 行番 号 を 返し ます
例外 が 発生 し た 行 を 取得 する
例外 メッセージ 文字 列 を 返し ます
例外 メッセージ を 取得 する
前 に 発生 し た exception 、 あるい は それ が 存在 し ない 場合 は null を 返し ます
前 の 例外 を 返す
例外 の スタックトレース を 配列 で 返し ます
スタックトレース を 取得 する
例外 の スタックトレース を 文字列 で 返し ます
スタックトレース を 文字列 で 取得 する
例外 を 文字列 で 表現 し た もの を 返し ます
例外 の 文字 列表 現
反復 処理 し たい ファイルシステム 上 の アイテム へ の パス
フラグ を 指定 する と 、 いくつか の メソッド の 振る 舞い を 変更 する こと が でき ます
新しい filesystem イテレータ を 作成 する
先頭 に 巻き戻す
設定 する 処理 フラグ
処理 フラグ を 設定 する
現在 の 要素 が 通過 する 場合 に true 、 それ 以外 の 場合 に false を 返し ます
イテレータ の 現在 の 要素 が フィルタ を 満た す かどう か を 調べる
フィルタリング の 対象 と なる イテレータ
filteriterator を 返し ます
filteriterator を 作成 する
finfo _buffer の エイリアス
finfo _file の エイリアス
エスケープ し たい 文字列
エスケープ の 対象 と なる 文字 を 並べ た もの
エスケープ さ れ た 文字列 を 返し ます
c 言語 と 同様 に スラッシュ で 文字列 を クォート する
もし php が apache 1 モジュール として 実行 し て いる 場合 、 true を 返し ます
この リクエスト の 後 に apache プロセス を 終了 する
成功 時 は apache の バージョン 、 失敗 し た 場合 に false を 返し ます
apache の バージョン を 取得 する
リクエスト さ れ て いる ファイル 名 uri
uri に関する 情報 の オブジェクト です
リクエスト の 一部 を 指定 し た uri に対し て 行い 、 全て の 情報 を 返す
記号 の 値
記号 の 名前
引数 が 1つ だけ 指定 さ れ て コール さ れ た 場合 、 現在 の 記号 の 値 note _name が 返さ れ ます
apache リクエスト 記号 note を 取得 / 設定 する
現在 の リクエスト に おける すべ て の http ヘッダ の 連想 配列 、 あるい は 失敗 時 は false を 返し ます
すべて の http リクエストヘッダ を 取得 する
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
apache の 書き込み タイマー を リセット する
全て の apache レスポンスヘッダ の 配列 、 失敗 し た 場合 に false を 返し ます
http レスポンスヘッダ を 全 て 取得 する
variable の 新しい 値
全て の apache レイヤ に対し て 有効 な トップレベル の 変数 を 設定 する かどう か
設定 する 環境 変数
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
apache サブプロセス の 環境 変数 を 設定 する
格納 する 変数
名前 を キー 、 変数 を 値 に 指定 し ます
この 名前 を 用い て 変数 を 格納 し ます
有効 期間
何か が キャッシュ に 正しく 追加 さ れ た とき に true 、 それ 以外 の 場合 に false を 返し ます
新規 の 変数 を データ 領域 に キャッシュ する
ファイル
ユーザー 変数
指定 し た ファイル および ユーザー 変数 の バイナリダンプ を apc キャッシュ から 返し ます
指定 し た ファイル および ユーザー 変数 の バイナリダンプ を 取得 する
the filename where the dump is being saved
flags passed to the filename stream
the context passed to the filename stream
the user variables being dumped
the file names being dumped
the number of bytes written to the file otherwise false if apc is not enabled filename is an invalid file name filename can &# 0 3 9 ; t be opened the file dump can &# 0 3 9 ; t be completed e
キャッシュ さ れ た ファイル や ユーザー 変数 の バイナリダンプ を ファイル に 出力 する
読み込む バイナリダンプ
apc _bin _verify _crc 3 2 、 apc _bin _verify _md5 あるい は その 両方
バイナリダンプ の 読み込み に 成功 し た 場合 に true 、 それ 以外 の 場合 に false を 返し ます
バイナリダンプ を apc の ファイル / ユーザーキャッシュ に 読み込む
apc _bin _verify _crc 3 2 、 apc _bin _verify _md5 あるい は その 両方
ファイル の コンテキスト
ダンプ を 含む ファイル の 名前
バイナリダンプ の 読み込み に 成功 し た 場合 に true 、 それ 以外 の 場合 に false を 返し ます
バイナリダンプ を ファイル から apc の ファイル / ユーザーキャッシュ に 読み込む
limited が true の 場合 は 、 返り値 に キャッシュエントリ の 個々 の 一覧 が 含まれ ませ ん
cache _type が & quot ; user & quot ; の 場合 は ユーザーキャッシュ の 情報 を 返し ます
キャッシュ さ れ た データ （ および メタデータ ） の 配列 を 返し ます
apc の データ から 、 キャッシュ さ れ た 情報 を 取得 する
cache _type が & quot ; user & quot ; の 場合 は ユーザーキャッシュ が クリア さ れ ます
常 に true を 返し ます
apc キャッシュ を クリア する
constant _name = & gt ; value 形式 の 連想 配列
key は 、 格納 さ れる 定数 群 の 名前 を 表し ます
デフォルト で は 、 定数 名 の 大文字 ・ 小文字 は 区別 さ れ ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
定数 の 組 を 定義 し 、 それ を 取得 あるい は 一括 定義 する
削除 し たい ファイル
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ファイル を opcode キャッシュ から 削除 する
（ apc _store を 用い て ） 値 を 格納 する 際 に 使用 さ れ た key
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
格納 さ れ て いる 変数 を キャッシュ から 取り除く
キー を 含む 文字 列 、 あるい は 文字列 の 配列
キー が 存在 する 場合 に true 、 それ 以外 の 場合 に false を 返し ます
apc キー が 存在 する かど う か を 調べる
( apc _store を 用い て 値 を 格納 する 際 に 使用 さ れ た key
成功 し た ば あい に true 、 失敗 し た 際 に false が 設定 さ れ ます
成功 し た 場合 に 格納 さ れ て い た 変数 あるい は 配列 、 失敗 し た 場合 に false を 返し ます
格納 さ れ て いる 変数 を キャッシュ から 取得 する
デフォルト で は 、 定数 名 の 大文字 ・ 小文字 は 区別 さ れ ます
取得 し たい 定数 群 （ apc _define _constants を 使用 し て 格納 さ れ た もの ）
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
定数 群 を キャッシュ から 読み込む
false デフォルト を 設定 する と 、 apc _sma _info は 各 セグメント の 詳細 な 情報 を 返し ます
共有 メモリ 割り当て データ の 配列 を 返し ます
apc の 共有 メモリ 割り当て に関する 情報 を 取得 する
格納 する 変数
名前 を キー 、 変数 を 値 に 指定 し ます
この 名前 を 用い て 変数 を 格納 し ます
有効 期間
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
変数 を データ 領域 に キャッシュ する
xxx _trace 定数 の 組み合わせ による 整数 値
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
インタプリタ の 処理 を 停止 し 、 ソケット から の cr を 待つ
スロー する 警告
区切り 文字
警告 と コールスタック を スロー する
xxx _trace 定数 の 組み合わせ による 整数 値
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
インタプリタ を 再開 する
スロー する 警告
区切り 文字
エラー と コールスタック を スロー し 、 終了 する
現在 の コールスタック を 含む 配列 を 返し ます
すべて の 持続 的 な リソース を 配列 で 返す
デバッグ さ れ た 変数
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
デバッグ 用 ソケット に 表示 する
任意 の ポート を 使用 でき ます が 、 できる だけ 大きめ の 数 を 使用 する ほう が いい でしょ う
tcp サーバー の ip あるい は unix ドメインソケット ファイル など
ファイルベース の ソケット なら af _unix 、 標準 の tcp / ip なら apd _af _inet
xxx _trace 定数 の 組み合わせ による 整数 値
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
リモートセッション の デバッグ を 開始 する
プロファイル の ダンプファイル を 書き込む ディレクトリ
xxx _trace 定数 の 組み合わせ による 整数 値
セッション の デバッグ を 開始 する
xxx _trace 定数 の 組み合わせ による 整数 値
現在 の デバッグレベル を 変更 あるい は 設定 する
処理 を 行う 配列
case _upper あるい は case _lower デフォルト
すべて の キー を 小文 字 あるい は 大文字 に し た 配列 を 返し ます
配列 の すべ て の キー の 大文 字小 文字 を 変更 する
各 部分 の サイズ
処理 を 行う 配列
true の 場合 は キー を その まま 保持 し ます
数 値添 字 の 多次 元 配列 を 返し ます
配列 を 分割 する
値 を 返し たい カラム
値 を 取り出し たい 多次 元配 列 あるい は オブジェクト の 配列
返す 配列 の インデックス として 使う カラム
入力 配列 の 単一 の カラム を 表す値 の 配列 を 返し ます
入力 配列 から 単一 の カラム の 値 を 返す
値 を 数える 配列
array の キー と その 登場 回数 を 組み合わせ た 連想 配列 を 返し ます
配列 の 値 の 数 を 数える
さらに 比較 する 対象 と なる 配列
比較 する 対象 と なる 配列
比較元 の 配列
array 1 の 要素 の うち 、 その 他 の 配列 のい ずれ に も 含まれ ない もの だけ を 残し た 配列 を 返し ます
追加 さ れ た 添字 の 確認 を 含め て 配列 の 差 を 計算 する
さらに 比較 する 対象 と なる 配列
比較 する 対象 と なる 配列
比較 関数 は 、 最初 の 引数 と 二番目 の 引数 の 比較 結果 を 返し ます
比較元 の 配列
array 1 の 要素 の うち 、 その 他 の 配列 のい ずれ に も 含まれ ない もの だけ を 残し た 配列 を 返し ます
キー を 基準 に し 、 コールバック 関数 を 用い て 配列 の 差 を 計算 する
埋め たい 値
キー として 使用 する 値 の 配列
値 を 埋め た 配列 を 返し ます
キー を 指定 し て 、 配列 を 値 で 埋める
挿入 する 要素 数
要素 に 使用 する 値
返さ れる 配列 の 最初 の インデックス
値 を 埋め た 配列 を 返し ます
配列 を 指定 し た 値 で 埋める
処理 する 配列
使用 する コールバック 関数
引数 として 、 何 を callback に 送る の か を 決める フラグ
フィルタリング さ れ た 結果 の 配列 を 返し ます
コールバック 関数 を 使用 し て 、 配列 の 要素 を フィルタリング する
さら に それ 以外 の 配列
値 を 調べる も とと なる 配列
値 を 比較 する 対象 と なる 配列
array 1 の 値 の うち 、 すべて の 引数 に 存在 する 値 の もの を 含む 連想 配列 を 返し ます
配列 の 共通項 を 計算 する
調べる 値
キー が 存在 する かど う か を 調べ たい 配列
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
指定 し た キー また は 添字 が 配列 に ある かど う か を 調べる
コールバック 関数 を 適用 する 配列
コールバック 関数 に 渡す 引数 を 指定 する 配列 の 可変 リスト
配列 の 各要 素 に 適用 する コールバック 関数
array 1 の 各要 素 に callback 関数 を 適用 し た 後 、 その 全 て の 要素 を 含む 配列 を 返し ます
指定 し た 配列 の 要素 に コールバック 関数 を 適用 する
ソート し たい 配列
先ほど の 引数 array の ソート 順
先ほど の 引数 array の ソート 方法
追加 の 配列
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
複数 の 多次 元 の 配列 を ソート する
値 を 取り出す 配列
配列 array の 最後 の 値 を 取り出し て 返し ます
配列 の 末尾 から 要素 を 取り除く
入力 の 配列
array の 最後 に 追加 する 値
処理後 の 配列 の 中 の 要素 の 数 を 返し ます
一つ 以上 の 要素 を 配列 の 最後 に 追加 する
入力 の 配列
取得 する エントリ の 数 を 指定 し ます
エントリ を 一つ だけ 取得 する 場合 、 array _rand は ランダム な エントリ の キー を 返し ます
配列 から 一つ 以上 の 要素 を ランダム に 取得 する
入力 の 配列
mixed callback mixed $ carry mixed $ item carry 前回 の 反復 処理 の 結果 を 保持 し ます
前回 の 反復 処理 の 結果 を 保持 し ます
現在 の 反復 処理 の 値 を 保持 し ます
オプション の intial が 利用 可能 な 場合 、 処理 の 最初 で 使用 さ れ たり 、 配列 が 空 の 場合 の 最終 結果 として 使用 さ れ ます
結果 の 値 を 返し ます
コールバック 関数 を 用い て 配列 を 普通 の 値 に 変更 する こと により 、 配列 を 再帰 的 に 減らす
オプション
置き換え たい 要素 を 含む 配列
要素 を 置き 換え たい 配列
配列 を 返し ます
渡さ れ た 配列 の 要素 を 再帰 的 に 置き 換える
置き換え たい 要素 を 含む 配列
置き換え たい 要素 を 含む 、 さらに 別 の 配列
要素 を 置き 換え たい 配列
配列 を 返し ます
渡さ れ た 配列 の 要素 を 置き 換える
入力 の 配列
true の 場合 は 数値 の キー を 保持 し ます
逆転 さ せ た 配列 を 返し ます
要素 を 逆順 に し た 配列 を 返す
オプション の 3 番目 の パラメータ strict に true が 指定 さ れ た 場合 、 array _search は identical 要素 を haystack から 探し ます
配列
検索 し たい 値
needle が 見つかっ た 場合 に 配列 の キー 、 それ 以外 の 場合 に false を 返し ます
指定 し た 値 を 配列 で 検索 し 、 見つかっ た 場合 に 対応 する キー を 返す
入力 の 配列
取り出し た 値 を 返し ます
配列 の 先頭 から 要素 を 一つ 取り出す
配列 replacement が 指定 さ れ た 場合 、 削除 さ れ た 要素 は 、 この 配列 の 要素 で 置換 さ れ ます
offset が 正 の 場合 、 削除 さ れる 部分 は 配列 input の 最初 から 指定 オフセット の ぶん だけ 進ん だ 位置 から と なり ます
length が 省略 さ れ た 場合 、 offset から 配列 の 最後 まで が 全 て 削除 さ れ ます
入力 の 配列
抽出 さ れ た 要素 を 含む 配列 を 返し ます
配列 の 一部 を 削除 し 、 他 の 要素 で 置換 する
入力 の 配列
値 の 合計 を 整数 また は float として 返し ます
配列 の 中 の 値 の 合計 を 計算 する
2 番目 の 配列
比較用 の コールバック 関数
最初 の 配列
他 の 引数 のい ずれ に も 存在 し ない array 1 の 値 の 全て を 有する 配列 を 返し ます
データ の 比較 に コールバック 関数 を 用い 、 配列 の 差 を 計算 する
比較 関数 は 、 最初 の 引数 と 二番目 の 引数 の 比較 結果 を 返し ます
2 番目 の 配列
最初 の 配列
全て の 引数 に 現れる array 1 の 全て の 値 を 含む 配列 を 返し ます
データ の 比較 に コールバック 関数 を 用い 、 追加 さ れ た 添字 の 確認 も 含め て 配列 の 共通項 を 計算 する
入力 の 配列
加える 最初 の 値
処理後 の array の 要素 の 数 を 返し ます
一つ 以上 の 要素 を 配列 の 最初 に 加える
配列
数 値添 字 の 値 の 配列 を 返し ます
配列 の 全て の 値 を 返す
入力 の 配列
通常 、 callback は 引数 を 二つ とり ます
オプション の userdata パラメータ が 指定 さ れ た 場合 、 コールバック 関数 callback へ の 三番目 の 引数 として 渡さ れ ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
配列 の 全て の 要素 に 、 ユーザー 関数 を 再帰 的 に 適用 する
処理 する 角度
arg の アークサイン を ラジアン で 返し ます
逆正弦 （ アークサイン ）
処理 する 角度
arg の アークハイパボリックサイン を 返し ます
逆双 曲線 正弦 （ アークハイパボリックサイン ）
入力 の 配列
オプション の パラメータ sort _flags により ソート の 動作 を 修正 可能 です
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
連想キー と 要素 と の 関係 を 維持 しつつ 配列 を ソート する
オプション に 指定 する 新しい 値
assert オプション オプション ini 設定 デフォルト 値 説明 assert _active assert
その オプション の 元 の 値 、 あるい は エラー 時 に false を 返し ます
様々 な assert フラグ を 設定 / 取得 する
処理 する 引数
arg の アークタンジェント を ラジアン で 返し ます
逆正接 （ アークタンジェント ）
ロード する クラス の 名前
未定義 の クラス の ロード を 試みる
デコード さ れる データ
入力 に base 6 4 アルファベット の 範囲 外 の 文字 が 含まれる 場合 に false を 返す
も と の データ を 返し ます
mime base 6 4 方式 により エンコード さ れ た データ を デコード する
エンコード する データ
エンコード さ れ た データ を 文字列 で 返し ます
mime base 6 4 方式 で データ を エンコード する
bbcode _create が 返す bbcode _container
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
bbcode _container リソース を 閉じる
bbcode _create が 返す bbcode _container リソース
bbcode _create が 返す bbcode _container リソース
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
別 の パーサ を アタッチ し て 、 引数 の パース 用 に 別 の ルールセット を 設定 する
bbcode _create が 返す bbcode _container リソース
bbcode _set _flags _* 定数 のい ずれ か
bbcode _container オプション に 適用 する フラグ の セット
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
パーサ の オプション を 設定 あるい は 変更 する
オプション の scale パラメータ で 、 小数 点以 下 の 桁数 を 指定 し ます
右 オペランド を 表す 文字列
左 オペランド を 表す 文字列
ふたつ の オペランド が 等しけれ ば 0 、 left _operand が right _operand より 大きけれ ば 返り値 は 1 、 小さけれ ば - 1 を 返し ます
2 つの 任意 精度 数値 を 比較 する
法 を 表す 文字列
左 オペランド を 表す 文字列
剰余 を 文字列 で 返し ます
2 つの 任意 精度 数値 の 剰余 を 取得 する
この オプションパラメータ を 使用 し て 、 結果 の 小数 点以 下 の 桁数 を 指定 し ます
右 オペランド を 表す 文字列
左 オペランド を 表す 文字列
結果 を 文字列 で 返し ます
2つ の 任意 精度 数値 の 乗算 を 行う
exe ファイル の パス を 表す 文字列
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
bcompiler の exe ファイル を 読み込み 、 クラス を 生成 する
bzcompress さ れ た ファイル の パス を 表す 文字列
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
bz 圧縮 さ れ た ファイル を 読み込み 、 クラス を 生成 する
クラス 名 を 表す 文字列
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
クラス の バイトコード を 読み込み 、 ユーザー 関数 を コール する
fopen が 返す ファイルハンドル
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ファイルハンドル を 読み込み 、 クラス を 生成 する
クラス 名 を 表す 文字列
fopen が 返す ファイルハンドル
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
定義 し た クラス を バイトコード として 書き込む
定義済み の 定数 名 を 表す 文字列
fopen が 返す ファイルハンドル
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
定義 し た 定数 を バイトコード として 書き込む
fopen が 返す ファイルハンドル
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
コンパイル さ れ た データ の 終了 を 示す 文字 \ x 0 0 を 書き込む
関数 名 を 表す 文字列
fopen が 返す ファイルハンドル
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
定義 し た 関数 を バイトコード として 書き込む
以前 に 使わ れ て い た フォーマット で バイトコード を 書き込む際 に 使用 し ます
fopen が 返す ファイルハンドル
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
bcompiler の ヘッダ を 書き込む
この オプションパラメータ を 使用 し て 、 結果 の 小数 点以 下 の 桁数 を 指定 し ます
右 オペランド を 表す 文字列
左 オペランド を 表す 文字列
結果 を 文字列 で 返し ます
任意 精度 数値 を べき 乗 する
法 を 表す 文字列
この オプションパラメータ を 使用 し て 、 結果 の 小数 点以 下 の 桁数 を 指定 し ます
右 オペランド を 表す 文字列
左 オペランド を 表す 文字列
結果 を 文字列 で 返し ます
任意 精度 数値 の べき 乗 の 、 指定 し た 数値 による 剰余
スケール
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
すべて の bc 演算 関数 に おける デフォルト の スケール を 設定 する
この オプションパラメータ を 使用 し て 、 結果 の 小数 点以 下 の 桁数 を 指定 し ます
オペランド を 表す 文字列
平方根 を 文字列 で 返し ます
任意 精度 数値 の 平方根 を 取得 する
この オプションパラメータ を 使用 し て 、 結果 の 小数 点以 下 の 桁数 を 指定 し ます
右 オペランド を 表す 文字列
左 オペランド を 表す 文字列
減算 の 結果 を 文字列 で 返し ます
任意 精度 数値 の 減算 を 行う
変換 し たい 2 進数 文字列
binary _string を 1 0 進 に 変換 し た 値 を 返し ます
2 進数 を 1 0 進数 に 変換 する
boolean に 変換 し たい スカラー 値
var の boolean として の 値 を 返し ます
変数 の boolean として の 値 を 取得 する
復元 し たい bson
bson オブジェクト を 復元 し た もの を 返し ます
bson オブジェクト を php の 配列 に 復元 する
変換 し たい 変数
変換 し た 文字列 を 返し ます
php の 変数 を bson 文字列 に 変換 する
ファイルポインタ
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
bzip 2 ファイル を 閉じる
圧縮 する 文字列
繰り返し が 多い 、 最悪 の 入力 データ の 場合 の 圧縮 処理 の 動作 を 制御 し ます
圧縮 時 の ブロック 長 を 指定 し ます
圧縮 さ れ た 文字 列 、 もしく は エラー 時 は エラー 数
文字列 を bzip 2 形式 の データ に 圧縮 する
解凍 する 文字列
true の 場合 、 より メモリ の 消 費量 が 少ない 所要メモリ は 最大 2 3 0 0 k 程度 まで 少なく なり ます 別 の 圧縮 アルゴリズム が 使用 さ れ ます が 、 速度 は 約半 分 に なっ て しまい ます
解凍 さ れ た 文字 列列 、 もしく は エラー 時 は エラー 数
bzip 2 形式 の データ を 解凍 する
ファイルポインタ
整数 として の エラー 番号 を 返し ます
bzip 2 エラー 番号 を 返す
ファイルポインタ
errno エントリ に エラーコード 、 errstr エントリ に エラーメッセージ を 持つ 連想 配列 を 返し ます
bzip 2 エラー 番号 と エラー 文字 列 を 配列 で 返す
ファイルポインタ
エラーメッセージ を 含む 文字 列 を 返し ます
bzip 2 エラー 文字 列 を 返す
ファイルポインタ
指定 さ れ ない 場合 、 bzread は 一度 に 圧縮前 の 状態 で 1 0 2 4 バイト 読み込み ます
非 圧縮 データ 、 もしく は エラー 時 に false を 返し ます
バイナリ 対応 の bzip 2 ファイル 読み込み
書き込む データ
ファイルポインタ
指定 し た 場合 、 圧縮 前 の length バイト 分 の 書き込み が 終っ た か 、 data の 終端 に 達し た か で 書き込み は 終了 し ます
書き込ん だ バイト 数 、 もしく は エラー 時 に false を 返し ます
バイナリ 対応 の bzip 2 ファイル へ の 書き込み
計算 に 使用 する カレンダー
選択 し た カレンダー に おける月
選択 し た カレンダー に おける 年
指定 し た カレンダー の 、 その月 の 日数 を 返し ます
指定 し た 年 と カレンダー について 、月 の 日数 を 返す
作成 する chdb の ファイルパス 名 指定 さ れ た パス と 同じ ファイル が 既 に ある 場合 は 上書き さ れ ます
chdb ファイル に 格納 する キー と 値 の ペア を 含ん だ 配列 キー と 値 は ファイル に 書き出さ れる 前 に 文字列 に 変換 さ れ ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
chdb ファイル を 作成 する
新しい カレントディレクトリ
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ディレクトリ を 変更 する
年 は 1 から 3 2 7 6 7 の 間 と なり ます
月 は 1 から 1 2 の 間 と なり ます
日 は 、 指定 さ れ た month の 日数 の 範囲 内 に なり ます
指定 し た 日付 が 有効 な 場合 に true 、 そう で ない 場合 に false を 返し ます
グレゴリオ 暦 の 日付 / 時刻 の 妥当性 を 確認 し ます
host は 、 ドット で 4 つに 分け られ た 形式 の ip アドレス か 、 あるい は ホスト 名 です
type は 、 a mx ns soa ptr cname aaaa a 6 srv naptr any のどれ か 一つ です
レコード が 見つかっ た 場合 に true 、 何 も 見つ から ない か エラー が 発生 し た 場合 に false を 返し ます
指定 し た インターネットホスト 名 もしく は ip アドレス に 対応 する dns レコード を 検索 する
ファイル へ の パス
グループ 名 あるい は グループ 番号
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ファイル の グループ を 変更 する
mode は 自動 的 に は 8 進数 と 見なさ れ ない の で 注意 し て くだ さい
ファイル へ の パス
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ファイル の モード を 変更 する
ユーザー 名 あるい は ユーザー 番号
ファイル へ の パス
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ファイル の 所有 者 を 変更 する
元 の クラス が 見つ から ない 場合 に オートロード する かどう か
クラス の エイリアス 名
元 と なる クラス
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
クラス の エイリアス を 作成 する
クラス 名
デフォルト で _ _ autoload を コール する かし ない か
クラス class _name が 定義 さ れ て いる 場合 に true 、 それ 以外 の 場合 に false を 返し ます
クラス が 定義 済み か どう か を 確認 する
オブジェクト クラス の インスタンス もしく は 文字列 クラス 名 あるい は インターフェイス 名 を 指定 し ます
_ _autoload マジックメソッド を 通じ て 、 この 関数 に クラス を 自動 的 に ロード さ せる かど う か を 指定 し ます
成功 し た 場合 に 配列 、 エラー 時 に false を 返し ます
与え られ た クラス あるい は インターフェイス が 実装 し て いる インターフェイス を 返す
_ _autoload マジックメソッド を 通じ て 、 この 関数 に クラス を 自動 的 に ロード さ せる かど う か を 指定 し ます
オブジェクト もしく は クラス の 文字列 を 指定 し ます
成功 し た 場合 に 配列 、 エラー 時 に false を 返し ます
与え られ た クラス の 親 クラス を 返す
オブジェクト クラス の インスタンス あるい は 文字列 クラス 名
マジックメソッド _ _ autoload で 、 この 関数 から クラス を 自動 的 に 読み込ま せる かどう か
成功 し た 場合 に 配列 、 エラー 時 に は false を 返し ます
指定 し た クラス が 使っ て いる トレイト を 返す
新しい タイトル
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
プロセス の タイトル を 設定 する
opendir が 事前 に オープン し た ディレクトリハンドル リソース
ディレクトリハンドル を クローズ する
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
システムログ へ の 接続 を 閉じる
guid を 文字列 で 返し ます
グローバルユニーク id guid を 生成 する
php は comobject に 関連 する タイプライブラリ で 指定 さ れ た デフォルト の ディスパッチインターフェイス を 使用 しよ う と し ます が 、 使用 さ せ たい インターフェイス 名 を sinkinterface に 指定 する こと で 、 それ を 上書き する こと が 可能 です
sinkobject に は 、 要求 さ れる ディスパッチ インターフェイス と 同じ 名前 の メソッド を 持つ クラス の インスタンス を 指定 する 必要 が あり ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
com オブジェクト の イベント を php オブジェクト に 接続 する
progid は 、 アクセス し たい オブジェクト の progid あるい は clsid たとえ ば word
com クラス の 場合 と 同様 の 働き を し ます
要求 さ れ た オブジェクト が 実行 中 の 場合 は 、 他 の com オブジェクト と 同様 に スクリプト へ 返さ れ ます
すで に 実行 中 の com オブジェクト の インスタンス へ の ハンドル を 返す
タイムアウト
タイムアウト の 前 に メッセージ が 到着 し た 場合 は 、 その メッセージ が 処理 さ れ て 関数 は true を 返し ます
com メッセージ を 処理 し 、 timeoutms ミリ 秒 の 間待 つ
結果 を 表示 し たい インターフェイス で 、 この インターフェイス は idispatch を 継承 し た もの です
comobject は 、 com オブジェクト の インスタンス か あるい は タイプライブラリ の 名前 com _load _typelib の 規則 に し た がっ て 名前 解決 さ れ ます のいずれ か です
true の 場合 、 対応 する シンクインターフェイス が 代わり に 表示 さ れ ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ディスパッチインターフェイス の ため に 、 php の クラス 定義 を 出力 する
クライアント と の 接続 が 切断 さ れ て いる 場合 に 1 、 それ 以外 の 場合 に 0 を 返し ます
クライアント と の 接続 が 切断 さ れ て いる かど う か を 調べる
接続 ステータス の ビットフィールド を 返し ます
接続 ステータス の ビットフィールド を 返す
uuencode さ れ た データ
デコード し た データ を 文字列 で 返し ます
uuencode さ れ た 文字列 を デコード する
ラジアン で 表し た 角度
arg の コサイン を 返し ます
余弦 （ コサイン ）
処理 する 引数
arg の ハイパボリックコサイン を 返し ます
双曲 線余 弦 （ ハイパボリックコサイン ）
調べ たい 文字列
返り値 を 参照く ださい
mode の 値 により 、 count _chars は 以下 の 値 の どれ か を 返し ます
文字列 で 使用 さ れ て いる 文字 に関する 情報 を 返す
配列 あるい は countable オブジェクト
オプション の mode 引数 が count _recursive また は 1 に セット さ れ た 場合 、 count は 再帰 的 に 配列 を カウント し ます
array _or _countable に 含まれる 要素 の 数 を 返し ます
変数 に 含ま れる すべ て の 要素 、 あるい は オブジェクト に 含まれる 何か の 数 を 数える
直近 の 強度 チェック による メッセージ 、 あるい は チェック が まだ 行わ れ て い ない 場合 は false を 返し ます
直近 の 強度 チェック から の メッセージ を 返す
関数 の 引数
関数 の コード
一意 な 関数 名 を 表す 文字 列 、 あるい は エラー 時 に false を 返し ます
匿名 関数 ラムダ 形式 を 作成 する
ハッシュ の も とと なる salt 文字列
ハッシュ し たい 文字列
ハッシュ し た 文字列 を 返し ます
文字列 の 一方向 の ハッシュ 化 を 行う
調べる 文字列
text のすべて の 文字 が 英字 また は 数字 だっ た 場合 に true 、 そう で ない 場合 に false を 返し ます
英数 字 か どう か を 調べる
調べる 文字列
text のすべて の 文字 が 現在 の ロケール の 制御 文字 だっ た 場合 に true 、 そう で ない 場合 に false を 返し ます
制御 文字 か どう か を 調べる
調べる 文字列
string text のすべて の 文字 が 1 0 進数 字 だっ た 場合 に true 、 そう で ない 場合 に false を 返し ます
数字 か どう か を 調べる
調べる 文字列
text のすべて の 文字 が カレント の ロケール で 小文字 だっ た 場合 に true 、 そう で ない 場合 に false を 返し ます
小文字 か どう か を 調べる
調べる 文字列
text のすべて の 文字 が （ 空白 を 含め て ） 実際 に 出力 を 行う 場合 に true 、 text に 制御 文字 また は まっ たく 出力 も 制御 も 行わ ない 文字 が 含まれる 場合 に false を 返し ます
印字 可能 な 文字 か どう か を 調べる
調べる 文字列
text のすべて の 文字 が 出力 可能 で あり 、 かつ 文字 でも 数字 でも 空白 で も なかっ た 場合 に true 、 そう で ない 場合 に false を 返し ます
空白 、 英数 字以 外 の 出力 可能 な 文字 か どう か を 調べる
curl _init が 返す curl ハンドル
curl セッション を 閉じる
curl _init が 返す curl ハンドル
新しい curl ハンドル を 返し ます
curl ハンドル を 、 その 設定 も 含め て コピー する
curl _init が 返す curl ハンドル
エラー 番号 を 返し ます
直近 の エラー 番号 を 返す
curl _init が 返す curl ハンドル
エラーメッセージ 、 あるい は エラー が 発生 し なかっ た 場合 は & # 0 3 9 ;& # 0 3 9 ; 空文字 を 返し ます
現在 の セッション に関する 直近 の エラー 文字 列 を 返す
curl _init が 返す curl ハンドル
エンコード する 文字列
エスケープ し た 文字列 を 返し ます
指定 し た 文字列 を url エンコード する
curl _init が 返す curl ハンドル
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
curl セッション を 実行 する
curl _init が 返す curl ハンドル
これ は 、 以下 のい ずれ か の 定数 と なり ます
opt を 指定 し た 場合 は 、 その 値 を 返し ます
指定 し た 伝送 に関する 情報 を 得る
curl _multi _init が 返す curl マルチハンドル
curl _init が 返す curl ハンドル
成功 し た 場合 に 0 、 あるい は エラーコード curlm _xxx のいずれか を 返し ます
curl マルチハンドル に 、 通常 の curl ハンドル を 追加 する
curl _multi _init が 返す curl マルチハンドル
curl ハンドル の セット を 閉じる
curl _multi _init が 返す curl マルチハンドル
まだ キュー の 中 に 残っ て いる メッセージ の 数
成功 し た 場合 に メッセージ の 連想 配列 、 失敗 し た 場合 に false を 返し ます
現在 の 転送 について の 情報 を 表示 する
設定 する オプション と その 値 を 指定 し た 配列
curl _init が 返す curl ハンドル
すべて の オプション が うまく 設定 でき た 場合 に true を 返し ます
curl 転送 用 の 複数 の オプション を 設定 する
curl _share _init が 返す curl 共有 ハンドル
curl 共有 ハンドル を 閉じる
&quot ;curl share handle &quot ; 型 の リソース を 返し ます
curl 共有 ハンドル を 初期化 する
curl _share _init が 返す curl 共有 ハンドル
オプション 説明 curlshopt _share 共有 さ せる データ の 種類 を 指定 し ます
値 説明 curl _lock _data _cookie クッキー の データ を 共有 する
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
curl 共有 ハンドル の オプション を 設定 する
curl _init が 返す curl ハンドル
デコード 対象 の 文字列
デコード し た 文字列 を 返し ます
url エンコード さ れ た 文字列 を デコード する
接続 ハンドル
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
cyrus imap サーバー へ の 接続 を 閉じる
ポート 番号
cyrus imap ホスト 名
成功 し た 場合 に 接続 ハンドラ 、 失敗 し た 場合 に false を 返し ます
cyrus imap サーバー に 接続 する
クエリ 文字列
接続 ハンドル
text 、 msgno 、 そして keyword の キー を 持つ 連想 配列 を 返し ます
cyrus imap サーバー へ クエリ を 送信 する
string を 返し ます
スクリプト 中 の 日付 / 時刻 関数 で 使用 さ れる デフォルトタイムゾーン を 取得 する
タイムゾーン id
この 関数 は 、 timezone _identifier が 無効 なもの で ある 場合 に false 、 それ 以外 の 場合 に true を 返し ます
スクリプト 中 の 日付 / 時刻 関数 で 使用 さ れる デフォルトタイムゾーン を 設定 する
日付 を あらわす 文字列
datetime :: createfromformat が 理解 できる フォーマット
指定 し た 日付 について の 詳細 情報 を 連想 配列 で 返し ます
指定 し た 書式 で フォーマット さ れ た 日付 について の 情報 を 取得 する
以下 の 定数 のい ずれ か
db 2 _ connect あるい は db2 _ pconnect が返し た 有効 な データベース 接続 リソース
autocommit を 有効 に し ます
autocommit を 無効 に し ます
db 2 _ autocommit に connection パラメータ のみ を 渡し た 場合 、 指定 し た 接続 の autocommit の 状態 を 整数 値 で 返し ます
データベース 接続 の autocommit の 状態 を 取得 また は 設定 する
変数 を データベース に バインド する 際 の 精度 を 指定 し ます
php 変数 を どの sql データ 型 に バインド する のか を 指定 する 定数
変数 を データベース に バインド する 際 の 位取り を 指定 し ます
parameter -number で 指定 し た パラメータ に バインド する php 変数 の 名前 を 表す 文字列
プリペアドステートメント の パラメータ の 位置
db 2 _ prepare が 返す プリペアドステートメント
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
php 変数 を sql 文 の パラメータ に バインド する
アクティブ な db2 クライアント 接続 を 指定 し ます
成功 し た 場合 に オブジェクト 、 失敗 し た 場合 に false を 返し ます
db 2 データベースクライアント の 情報 を プロパティ に 保持 する オブジェクト を 返す
カラム の 名前
テーブル を 含む スキーマ
ibm db 2 、 cloudscape あるい は apache derby データベース へ の 有効 な 接続
os / 3 9 0 あるい は z / os サーバー 上 で 稼動 し て いる db2 データベース の 修飾子
テーブル あるい は ビュー の 名前
指定 し た パラメータ に 一致 する カラム の 権限 情報 を 含む ステートメントリソース を 返し ます
テーブル の カラム および 関連 する 権限 情報 を 含む 結果 セット を 返す
カラム の 名前
テーブル を 含む スキーマ
ibm db 2 、 cloudscape あるい は apache derby データベース へ の 有効 な 接続
os / 3 9 0 あるい は z / os サーバー 上 で 稼動 し て いる db2 データベース の 修飾子
テーブル あるい は ビュー の 名前
指定 し た パラメータ に 一致 する カラム の 情報 を 含む 結果 セット の ステートメントリソース を 返し ます
テーブル の カラム および 関連 する メタデータ を 含む 結果 セット を 返す
db 2 _ connect あるい は db2 _ pconnect が返し た 有効 な データベース 接続 リソース
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
トランザクション を コミット する
当初 は 成功 し た もの の 、 その後 に 無効 に なっ た 接続 に 関連 付け られ た 接続 リソース
失敗 し た 接続 試行 の 結果 を 表す sqlstate を 返し ます
直近 の 接続 から 返さ れ た sqlstate を 含む 文字 列 を 返す
データベースサーバー の ホスト 名 あるい は ip アドレス
db 2 _ i 5 _ sep _period - ピリオド
データベース へ の カタログ 接続 の 場合 に は 、 database は db2 クライアントカタログ 内 で の データベースエイリアス を 表し ます
データベース が 要求 を 待ち受ける tcp / ip ポート
db 2 _ first _io すべて の クエリ は 、 結果 の 一行目 を できる だけ 早く 返す よう に 最適 化 さ れ ます
i 5 _ commit 属性 は 、 db2 _ connect の 前 に 設定 し なけれ ば なり ませ ん
データベース の 名前
db 2 _ i 5 _ dbcs _alloc _on は 、 dbcs トランザクションカラムサイズ 用 の db2 6x アロケーション を 有効 に し ます
ファイル 参照 を 解決 する 際 に 用いる ライブラリ 一覧 を 表す 文字
db 2 _ forward _only を 渡す と 、 ステートメントリソース で 前進 のみ の カーソル を 使用 し ます
db 2 _ trusted _context _enable を 渡す と 、 この 接続 ハンドル で の 信頼 済み コンテキスト を 有効 に し ます
db 2 _ i 5 _ fmt _iso - 国際 標準 化機 構 iso の 時刻 書式 hh
接続 の 振る 舞い を 指定 する 接続 オプション の 連想 配列
未解決 の ファイル 参照 を 解決 する 際 に 使用 する デフォルト の ライブラリ を 指定 し ます
データベース に 接続 する ユーザー 名
db 2 _ autocommit _on を 渡す と 、 この 接続 ハンドル で 自動 コミット を 有効 に し ます
データベース に 接続 する パスワード
db 2 _ i 5 _ sep _colon - コロン : を 時刻 の 区切り 文字 として 使用 し ます
db 2 _ case _natural を 渡す と 、 カラム 名 の 大文 字小 文字 を 変換 せ ずに 返し ます
db 2 _ i 5 _ naming _on は 、 db 2 udb cli iseries の システムネーミングモード を 有効 に し ます
db 2 _ i 5 _ fmt _iso - 国際 標準 化機 構 iso の 日付 書式 yyyy -mm -dd を 使用 し ます
db 2 _ i 5 _ sep _slash - スラッシュ / を 日付 の 区切り 文字 として 使用 し ます
接続 に 成功 し た 場合 は 接続 ハンドルリソース を 返し ます
データベース へ の 接続 を 返す
有効 な ステートメントリソース
ステートメントリソース が 前進 のみ の カーソル を 使用 し て いる 場合 に db2 _ forward _only 、 スクロール 可能 な カーソル を 使用 し て いる 場合 に db2 _ scrollable を 返し ます
ステートメントリソース が 使用 し て いる カーソル の 型 を 返す
db 2 _ connect あるい は db2 _ pconnect が返し た 有効 な データベース 接続 リソース
sql 文
文 の オプション を 含む 連想 配列
sql 文 の 実行 に 成功 し た 場合 に ステートメントリソース 、 sql 文 の 実行 に 失敗 し た 場合 に false を 返し ます
sql 文 を 直接 実行 する
結果 セット 内 の 1 から 始まる 行番 号 を 指定 し ます
結果 セット を 含む 有効 な stmt リソース
結果 セット の 次 の 行 あるい は 要求 し た 行 の データ を 表す 、 カラム 名 を インデックス と し た 連想 配列 を 返し ます
結果 セット 内 の 行 を 表す 、 カラム 名 を インデックス と する 配列 を 返す
結果 セット 内 の 1 から 始まる 行番 号 を 指定 し ます
結果 セット を 含む 有効 な stmt リソース
結果 セット の 次 の 行 あるい は 要求 し た 行 の データ を 表す 、 カラム 名 および 0 から 始まる カラム 番号 の 両方 を インデックス と し た 連想 配列 を 返し ます
結果 セット 内 の 行 を 表す 、 カラム 位置 および カラム 名 の 両方 を インデックス と する 配列 を 返す
結果 セット 内 の 1 から 始まる 行番 号 を 指定 し ます
結果 セット を 含む 有効 な stmt リソース
結果 セット 内 の 行 を 表す オブジェクト を 返し ます
結果 セット 内 の 行 を 表す 、 カラム を プロパティ と する オブジェクト を 返す
結果 セット を 含む ステートメントリソース を 指定 し ます
結果 セット 内 の カラム を 指定 し ます
指定 し た カラム を 表示 する ため に 必要 な 最大 バイト 数 を 表す 整数 値 を 返し ます
カラム を 表示 する ため に 必要 な 最大 の バイト 数 を 返す
結果 セット を 含む ステートメントリソース を 指定 し ます
結果 セット 内 の カラム を 指定 し ます
指定 し た カラム の 名前 を 含む 文字 列 を 返し ます
結果 セット 内 の カラム の 名前 を 返す
結果 セット を 含む ステートメントリソース を 指定 し ます
結果 セット 内 の カラム を 指定 し ます
指定 し た カラム の 位取り を 整数 値 で 返し ます
結果 セット 内 の 指定 し た カラム の 位取り を 返す
結果 セット を 含む ステートメントリソース を 指定 し ます
結果 セット 内 の カラム を 指定 し ます
結果 セット 内 の 文字 型 あるい は バイナリデータ 型 の カラム について 、 その幅 を 整数 値 で 返し ます
結果 セット 内 の 指定 し た カラム の 現在 値 の 幅 を 返す
有効 な ステートメントリソース
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
結果 セット に 関連 付け られ た リソース を 開放 する
有効 な ステートメントリソース
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
指定 さ れ た ステートメントリソース に 関連 付け られ た リソース を 開放 する
ステートメント や 接続 の 、 有効 な オプション
db 2 _ prepare が 返す 有効 な ステートメントリソース 、 あるい は db2 _ connect や db2 _ pconnect が 返す 有効 な 接続 リソース
sql _attr _info _acctstr - ヌル 終端 の 文字 列 へ の ポインタ で 、 db 2 接続 の 際 に ホストデータベースサーバー に 送信 する クライアント の アカウンティング ・ ストリング として 使用 し ます
sql _attr _info _applname - ヌル 終端 の 文字 列 へ の ポインタ で 、 db 2 接続 の 際 に ホストデータベースサーバー に 送信 する クライアント の アプリケーション 名 として 使用 し ます
sql _attr _info _userid - ヌル 終端 の 文字 列 へ の ポインタ で 、 db 2 接続 の 際 に ホストデータベースサーバー に 送信 する クライアント の ユーザー id として 使用 し ます
sql _attr _info _wrkstnname - ヌル 終端 の 文字 列 へ の ポインタ で 、 db 2 接続 の 際 に ホストデータベースサーバー に 送信 する クライアント の ワークステーション 名 として 使用 し ます
成功 し た 場合 に 接続 属性 の 現在 の 設定 内容 、 失敗 し た 場合 に false を 返し ます
ステートメントリソース あるい は 接続 リソース から オプション の 値 を 取得 する
db 2 _ connect あるい は db2 _ pconnect が 返す 接続 リソース
この 接続 上 で 最後 に 成功 し た insert クエリ が 自動 生成 し た id を 返し ます
この 接続 上 で 最後 に 成功 し た insert クエリ が 自動 生成 し た id を 返す
stmt リソース から 取得 する lob データ の サイズ
stmt リソース の 結果 セット 内 の 、 有効 な カラム 番号
lob データ を 含む 有効 な stmt リソース
指定 し た サイズ の データ を 返し ます
lob ファイル から 、 ユーザー が 定義 し た サイズ の 内容 を 取得 する
db 2 _ exec あるい は db2 _ execute から 返さ れる プリペアドステートメント
ストアドプロシージャ が 別 の 結果 セット を 返し て いる 場合 に は 次 の 結果 セット を 含む新しい ステートメントリソース 、 別 の 結果 セット を 返し て い ない 場合 に は false を 返し ます
ストアドプロシージャ から 、 次 の 結果 セット を 要求 する
結果 セット を 含む 有効 な ステートメントリソース
指定 し た ステートメントリソース に 関連 付け られ た 結果 セット 内 の フィールド の 数 を 表す 整数 値 を 返し ます
結果 セット に 含まれる フィールド の 数 を 返す
結果 セット を 含む 有効 な stmt リソース
指定 し た ステートメントハンドル によっ て 発行 さ れ た 、 直近 の sql 文 によっ て 変更 さ れ た 行 の 数 を 返し ます
sql 文 によっ て 変更 さ れ た 行 の 数 を 返す
db 2 _ connect あるい は db2 _ pconnect が返し た 有効 な データベース 接続 リソース
ひとつ 以上 の パラメータマーカ を 含む sql 文
文 の オプション を 含む 連想 配列
sql 文 の パース に 成功 し 、 データベースサーバー 内 で 正しく 準備 さ れ た 場合 に ステートメントリソース を 返し ます
実行 する sql 文 を 準備 する
プロシージャ を 含む スキーマ
ibm db 2 、 cloudscape あるい は apache derby データベース へ の 有効 な 接続
プロシージャ の 名前
os / 3 9 0 あるい は z / os サーバー 上 で 稼動 し て いる db2 データベース の 修飾子
パラメータ の 名前
指定 し た パラメータ に 一致 する ストアドプロシージャ の パラメータ 情報 を 含む 結果 セット の ステートメントリソース を 返し ます
ストアドプロシージャ の パラメータ を 含む 結果 セット を 返す
有効 な stmt リソース
結果 セット 内 の カラム の 位置 を 表す 0 から 始まる インデックス 、 あるい は カラム 名 を 表す 文字列
指定 し た フィールド が 結果 セット に 存在 する 場合 に その フィールド の 値 を 返し ます
結果 セット の 行 から ひとつ の カラム を 返す
db 2 _ connect あるい は db2 _ pconnect が返し た 有効 な データベース 接続 リソース
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
トランザクション を ロールバック する
db 2 _ rowcount _prefetch _on - クライアント は 、 取得 する 前 に 全行 数 を 問い合わ せる こと が でき ます
db 2 _ i 5 _ fetch _on - カーソル は 読み込み 専用 と なり 、 場所 を 指定 し て の 更新 や 削除 に は 使用 でき ませ ん
db 2 _ prepare が 返す 有効 な ステートメントリソース か 、 あるい は db2 _ connect や db2 _ pconnect が 返す 有効 な 接続 リソース
ユーザー を 信頼 済み ユーザー に 変更 する 際 に 、 信頼 済み ユーザー の ユーザー id 文字列 を この キー の 値 として 渡し ます
trusted _user キー で 指定 し た ユーザー に 対応 する パスワード 文字列
db 2 _ binary を 渡す と 、 バイナリデータ が その まま の 形式 で 返さ れる よう に なり ます
この 関数 に 渡す リソース の 型 を 、 整数 値 で 指定 し ます
db 2 _ case _lower を 渡す と 、 結果 セット の カラム 名 を 小文字 で 返し ます
sql _attr _info _userid - ヌル 終端 の 文字 列 へ の ポインタ で 、 db 2 接続 の 際 に ホストデータベースサーバー に 送信 する クライアント の ユーザー id として 使用 し ます
sql _attr _info _applname - ヌル 終端 の 文字 列 へ の ポインタ で 、 db 2 接続 の 際 に ホストデータベースサーバー に 送信 する クライアント の アプリケーション 名 として 使用 し ます
db 2 _ autocommit _on を 渡す と 、 指定 し た 接続 リソース の 自動 コミット を オン に し ます
db 2 _ forward _only を 渡す と 、 ステートメントリソース に 前進 のみ の カーソル を 指定 し ます
sql _attr _info _acctstr - ヌル 終端 の 文字 列 へ の ポインタ で 、 db 2 接続 の 際 に ホストデータベースサーバー に 送信 する クライアント の アカウンティング ・ ストリング として 使用 し ます
ステートメント あるい は 接続 の オプション を 含む 連想 配列
db 2 _ deferred _prepare _on を 渡す と 、 指定 し た ステートメントリソース について 遅延 プリペア を 有効 に し ます
sql _attr _info _wrkstnname - ヌル 終端 の 文字 列 へ の ポインタ で 、 db 2 接続 の 際 に ホストデータベースサーバー に 送信 する クライアント の ワークステーション 名 として 使用 し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
接続 リソース あるい は ステートメントリソース の オプション を 設定 する
テーブル を 含む スキーマ
ibm db 2 、 cloudscape あるい は apache derby データベース へ の 有効 な 接続
os / 3 9 0 あるい は z / os サーバー 上 で 稼動 し て いる db2 データベース の 修飾子
テーブル の 名前
ユニーク 行 id の 有効 期間 の 最小値 を 表す 整数 値
テーブル の ユニーク 行 id 情報 を 含む 結果 セット の ステートメントリソース を 返し ます
テーブル の ユニーク 行 id カラム を 含む 結果 セット を 返す
有効 な ステートメントリソース
sql 文 の 発行 により 直近 に 発生 し た エラー を 表す エラーメッセージ および sqlstate を 返し ます
直近 の sql 文 の エラーメッセージ を 含む 文字 列 を 返す
テーブル 型 の 識別子 を カンマ で 区切っ た リスト
テーブル を 含む スキーマ
ibm db 2 、 cloudscape あるい は apache derby データベース へ の 有効 な 接続
os / 3 9 0 あるい は z / os サーバー 上 で 稼動 し て いる db2 データベース の 修飾子
テーブル の 名前
指定 し た パラメータ に 一致 する テーブル の 情報 を 含む 結果 セット の リソース を 返し ます
データベース 内 の テーブル および 関連 する メタデータ を 含む 結果 セット を 返す
dba _open あるい は dba _popen によって 返さ れ た データベースハンドル
dba データベース を 閉じる
dba _open あるい は dba _popen によって 返さ れ た データベースハンドル
削除 する エントリ の キー
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
キー が 指す dba エントリ を 削除 する
確認 を 行う キー
dba _open あるい は dba _popen によって 返さ れ た データベースハンドル
キー が 存在 する 場合 に true 、 それ 以外 の 場合 に false を 返し ます
キー が 存在 する かど う か を 確認 する
dba データベース を 使用 する 際 に 無視 する キー / 値 の 組み合わせ 数
データ を 取得 する キー
dba _open あるい は dba _popen によって 返さ れ た データベースハンドル
キー / データ の 組 が 見つかっ た 場合 に それ に 関連 する 文字 列 、 それ 以外 の 場合 に false を 返し ます
キー が 指す データ を 取得 する
dba _open あるい は dba _popen によって 返さ れ た データベースハンドル
成功 し た 場合 に キー 、 失敗 し た 場合 に false を 返し ます
最初 の キー を 取得 する
結果 の 全て の 情報 を 表示 する かど う か を 切り 替え ます
データベースハンドラ の 配列 を 返し ます
利用 可能 な ハンドラ の 一覧 を 得る
挿入 する エントリ の キー
挿入 する 値
dba _open あるい は dba _popen によって 返さ れ た データベースハンドル
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
エントリ を 挿入 する
文字列 形式 の キー
array 0 = & gt ; group 1 = & gt ; value _name 形式 の 配列 を 返し ます
文字列 形式 の キー を 配列 形式 に 分割 する
dba _open あるい は dba _popen によって 返さ れ た データベースハンドル
成功 し た 場合 に キー 、 失敗 し た 場合 に false を 返し ます
次 の キー を 取得 する
dba _open あるい は dba _popen によって 返さ れ た データベースハンドル
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
データベース を 最適 化 する
dba _open あるい は dba _popen によって 返さ れ た データベースハンドル
置換 さ れる 値
置換 する エントリ の キー
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
エントリ を 置換 また は 挿入 する
dba _open あるい は dba _popen によって 返さ れ た データベースハンドル
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
データベース を 同期 する
データ の 配列
データベース の リンク id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
データベース に レコード を 追加 する
配列 の 配列 で 、 各配 列 は データベース に おける ひとつ の フィールド の フォーマット を 記述 し ます
データベース の 名前
データベース の 作成 に 成功 し た 場合 に リンク id 、 エラー が 発生 し た 場合 に false を 返し ます
データベース を 作成 する
データベース の リンク id
データベース の 各 カラム について の 要素 を 格納 し た 配列 を 返し ます
データベース の ヘッダ 情報 を 得る
レコード の インデックス
データベース の リンク id
レコード の 連想 配列 を 返し ます
データベース から レコード を 連想 配列 として 得る
データベース の リンク id
データベース の フィールド 数 を 返し ます
データベース の フィールド 数 を 得る
open システムコール に 対応 する 整数 値 （ 通常 、 0 は 読み込み のみ 可 ・ 1 は 書き込み のみ 可 ・ 2 は 読み 書き 両 方可 を 意味 し ます ）
データベース の 名前
データベース の オープン に 成功 し た 場合 に リンク id 、 エラー が 発生 し た 場合 に false を 返し ます
データベース を オープン する
データベース の リンク id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
データベース を 圧縮 する
aql algebraic query language に関する より 詳細 な 情報 について は 、 オリジナル の db ++ マニュアル で 提供 さ れ て い ます
成功 時 に 関係 ハンドル を 返し ます
aql クエリ を 実行 する
リレーションファイル の 新しい ディレクトリ
カレントディレクトリ の 絶対 パス を 返し ます
データベース 仮想 カレントディレクトリ を 設定 / 取得 する
dbplus _open で オープン し た リレーション
成功 し た 場合 に true 、 失敗 し た 場合 に dbplus _err _unknown を 返し ます
リレーション を 閉じる
データ が この パラメータ に 連想 配列 として 返さ れ ます
dbplus _open で オープン し た リレーション
この 関数 は 、 成功 時 に ゼロ すなわち dbplus _err _noerr 、 失敗 時 に db ++ エラーコード を 返し ます
リレーション から カレントタプル を 取得 する
エラーコード を 表す 整数 値 を 返し ます
直近 の 操作 に関する エラーコード を 取得 する
拘束 は 、 ドメイン 名 、 比較 演算子 、 比較 値 を 含む 複合 文字 列 です
dbplus _open で オープン し た リレーション
リレーション に 拘束 を 設定 する
dbplus _open で オープン し た リレーション
成功 し た 場合 に dbplus _err _noerr 、 失敗 し た 場合 に db ++ エラーコード を 返し ます
リレーション から 最初 の タプル を 取得 する
dbplus _open で オープン し た リレーション
成功 し た 場合 に dbplus _err _noerr 、 失敗 し た 場合 に db ++ エラーコード を 返し ます
リレーション に 行っ た 全て の 変更 を フラッシュ する
この クライアント により 保持 さ れ た 全て の ロック を 解放 する
dbplus _open で オープン し た リレーション
タプル の 書き込み ロック を 解放 する
dbplus _open で オープン し た リレーション
指定 し た リレーション に関する 全て の タプルロック を 解放 する
dbplus _open で オープン し た リレーション
成功 し た 場合 に dbplus _err _noerr 、 失敗 し た 場合 に db ++ エラーコード を 返し ます
リレーション から 直近 の タプル を 取得 する
dbplus _open で オープン し た リレーション
成功 し た 場合 に dbplus _err _noerr 、 失敗 し た 場合 に db ++ エラーコード を 返し ます
リレーション から 次 の タプル を 取得 する
dbplus _open で オープン し た リレーション
成功 し た 場合 に dbplus _err _noerr 、 失敗 し た 場合 に db ++ エラーコード を 返し ます
リレーション から 前 の タプル を 取得 する
dbplus _open で オープン し た リレーション
リレーション の 許可 属性 を 変更 する
コピー する リレーション
この パラメータ が true で あり 他 の プロセス が その リレーション を 使用 し て い ない 場合 に のみ 、 同 じ 名前 の 既存 の リレーション が 上書き さ れ ます
成功 し た 場合 に リソース 、 失敗 し た 場合 に dbplus _err _unknown を 返し ます
インデックス を 含む 、 リレーション の 空 の コピー を 作成 する
コピー する リレーション
この パラメータ が true で あり 他 の プロセス が その リレーション を 使用 し て い ない 場合 に のみ 、 同 じ 名前 の 既存 の リレーション が 上書き さ れ ます
成功 し た 場合 に リソース 、 失敗 し た 場合 に dbplus _err _unknown を 返し ます
デフォルト の インデックス で 、 リレーション の 空 の コピー を 作成 する
ドメイン の 組み合わせ
dbplus _open で オープン し た リレーション
成功 し た 場合 に リソース 、 失敗 し た 場合 に dbplus _err _unknown を 返し ます
リレーション の 主キー を 新規 に 指定 する
リレーションファイル を ローカル に オープン する
ローカル raw aql クエリ を 実行 する
dbplus _open で オープン し た リレーション
リレーション の 名前 を 変更 する
ドメイン 名 の 組み合わせ
dbplus _open で オープン し た リレーション
成功 し た 場合 に リソース 、 失敗 し た 場合 に dbplus _err _unknown を 返し ます
リレーション に 新規 セカンダリインデックス を 作成 する
dbplus _open で オープン し た リレーション
ファイルシステム から リレーション を 削除 する
サーバー 側 で tcl コード を 実行 する
dbplus _open で オープン し た リレーション
タプル を 削除 し 、 新規 カレントタプル を 返す
dbplus _open で オープン し た リレーション
リレーション の 書き込み ロック を 中断 する
dbplus _open で オープン し た リレーション
リレーション から 制約 を 削除 する
dbplus _open で オープン し た リレーション
リレーション の 排他 的 ロック を 解放 する
比較 する カラム
二番目 の 行
flags によっ て 比較 の 方向 を 指定 し ます
最初 の 行
ソート する ため に 二つ の レコード を 比較 する
データベース 名
sql サーバー の ホスト
パスワード
persistent パラメータ に dbx _persistent を 設定 する と 、 持続 的 接続 が 作成 さ れ ます
ユーザー 名
module パラメータ に は 文字列 また は 定数 を 設定 し ます
dbx _connect は 成功 時 に オブジェクト 、 エラー 時 に false を 返し ます
接続 / データベース を オープン する
dbx _connect が 返す dbx リンクオブジェクト
抽象化 さ れ た モジュール （ 例え ば mysql モジュール ） の 直近 の 関数 コール から エラーメッセージ を 有する 文字 列 を 返し ます
使用 する モジュール の 最新 の 関数 コール に おける エラーメッセージ を 出力 する
エスケープ する 文字列
dbx _connect が 返す dbx リンクオブジェクト
テキスト を 返し ます
sql ステートメント で 安全 に 使用 できる よう に 文字列 を エスケープ する
dbx _query が 返す 結果 セット
ユーザー 定義 の 比較 関数
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
カスタマイズ さ れ た ソート 関数 により 、 dbx _query から 結果 を ソート する
カテゴリ
ドメイン
メッセージ
成功 し た 場合 に 文字列 を 返し ます
単一 の 参照 に関する ドメイン を 上書き する
ドメイン
成功 し た 場合 に 文字列 を 返し ます
dcgettext の 複数 形版
5
php 5
連想 配列 の 配列 を 返し ます
バックトレース を 生成 する
5
php 5
バックトレース を 表示 する
評価 さ れる 変数
内部 的 な zend の 値 を 表す 文字列 を ダンプ する
変換 し たい 1 0 進数 値
binary _string を 2 進文 字列 で 表し た 値 を 返し ます
1 0 進数 を 2 進数 に 変換 する
変換 し たい 1 0 進数 値
number を 1 6 進文 字列 で 表し た 値 を 返し ます
1 0 進数 を 1 6 進数 に 変換 する
変換 し たい 1 0 進数 値
number を 8 進文 字列 で 表し た 値 を 返し ます
1 0 進数 を 8 進数 に 変換 する
syslog に 関係 する 全て の 定数 を 初期化 する
定数 の 値
定数 の 名前
true を 指定 する と 、 定数 は 大文字 小文字 を 区別 し ない よう に なり ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
名前 を 指定 し て 定数 を 定義 する
定数 名
name で 指定 し た 名前 の 定数 が 定義 さ れ て いる 場合 に true 、 その 他 の 場合 に false を 返し ます
指定 し た 名前 の 定数 が 存在 する かど う か を 調べる
ドメイン
メッセージ
成功 し た 場合 に 文字列 を 返し ます
現在 の ドメイン を 上書き する
dio _open が 返す ファイル 記述子
fd で 指定 し た ファイル 記述子 を 閉じる
dio _open が 返す ファイル 記述子
以下 の 処理 のい ずれ か
args は 連想 配列 で 、 cmd が f _setlk あるい は f _setllw の 際 に 以下 の キー を 保持 し ます
c ライブラリ を コール し た 結果 を 返し ます
fd について c ライブラリ の fcntl を 実行 する
読み込む バイト 数
dio _open が 返す ファイル 記述子
fd から 読み込ん だ バイトデータ を 返し ます
ファイル 記述子 から バイトデータ を 読み込む
位置 pos をど の よう に 解釈 する か を 指示 し ます
dio _open が 返す ファイル 記述子
新しい 位置
fd 上 で whence から pos に 移動 する
現在 使用 可能 な オプション は 以下 の とおり です
dio _open が 返す ファイル 記述子
シリアルポート の 端末 属性 と ボーレート を 設定 する
dio _open が 返す ファイル 記述子
オフセット の バイト 数
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ファイル 記述子 fd を オフセットバイト へ 丸める
書き込む データ
dio _open が 返す ファイル 記述子
書き込む データ の バイト 長
fd に 書き込ん だ バイト 数 を 返し ます
オプション で 丸め 長さ を 指定 し て データ を 書き込む
ファイルシステム の ディレクトリ あるい は ディスクパーティション
利用 可能 な バイト 数 を float 型 で 返し ます
ファイルシステム あるい は ディスクパーティション 上 で 利用 可能 な 領域 を 返す
ファイルシステム の ディレクトリ あるい は ディスクパーティション
総 バイト 数 を float 型 で 返し ます
ファイルシステム あるい は ディスクパーティション の 全体 サイズ を 返す
この パラメータ に 指定 できる の は 拡張 モジュール の ファイル 名 だけ であり 、 それ は プラットフォーム に 依存 し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
実行 時 に php 拡張 モジュール を ロード する
ドメイン
成功 し た 場合 に 文字列 を 返し ます
dgettext の 複数 形版
simplexmlelement ノード
追加 さ れ た domelement ノード 、 あるい は 何らか の エラー が 発生 し た 場合 は false を 返し ます
simplexmlelement オブジェクト から domelement オブジェクト を 取得 する
入力 の 配列
配列 array から 現在 の キー と 値 の ペア を 返し ます
配列 から 現在 の キー と 値 の ペア を 返し て 、 カーソル を 進める
cal _easter _roman に 設定 する と 1 5 8 2 年 から 1 7 5 2 年 まで の 復活 祭 の 日付 を グレゴリオ 暦 に も とづい て 計算 し ます
正 の 数値 で 表し た 年
指定 し た 年 year におい て 、 3 月 2 1 日 から 復活 祭 まで の 日数 を 返し ます
指定 し た 年 に おい て 、 3 月 2 1 日 から 復活 祭 まで の 日数 を 得る
すべて の グループリクエスト が 終わっ た とき に 呼ば れる コールバック
リクエスト の 優先 順位
待つ 秒数
callback に 渡す 任意 の 引数
eio _busy は 成功 し た 場合 に リクエストリソース を 返し ます
人為 的 に 負荷 を 高く する
は 、 リクエスト に 渡す カスタムデータ です
リクエストリソース
callback に 渡す 任意 の 引数
リクエスト の 優先 順位
callback 関数 が 、 リクエスト 終了 時 に コール さ れ ます
は オプション で 指定 する リクエストリソース です
に は リクエスト 固有 の 結果 が 格納 さ れ ます
リクエスト を 取り消す
は 、 リクエスト に 渡す カスタムデータ です
新しい パーミッション
対象 と なる ファイル や ディレクトリ の パス
callback に 渡す 任意 の 引数
リクエスト の 優先 順位
callback 関数 が 、 リクエスト 終了 時 に コール さ れ ます
は オプション で 指定 する リクエストリソース です
に は リクエスト 固有 の 結果 が 格納 さ れ ます
eio _chmod は 、 成功 し た 場合 に リクエストリソース を 返し ます
ファイル や ディレクトリ の パーミッション を 変更 する
は 、 リクエスト に 渡す カスタムデータ です
ファイル や ディレクトリ へ の パス
callback に 渡す 任意 の 引数
は オプション で 指定 する リクエストリソース です
グループ id
リクエスト の 優先 順位
callback 関数 が 、 リクエスト 終了 時 に コール さ れ ます
ユーザー id
に は リクエスト 固有 の 結果 が 格納 さ れ ます
eio _chown は 、 成功 し た 場合 に リクエストリソース を 返し ます
ファイル や ディレクトリ の オーナー を 変更 する
は 、 リクエスト に 渡す カスタムデータ です
callback に 渡す 任意 の 引数
リクエスト の 優先 順位
callback 関数 が 、 リクエスト 終了 時 に コール さ れ ます
は オプション で 指定 する リクエストリソース です
ストリーム 、 ソケットリソース 、 あるい は 数値 で 表し た ファイルディスクリプタ
に は リクエスト 固有 の 結果 が 格納 さ れ ます
eio _close は 、 成功 し た 場合 に リクエストリソース を 返し ます
ファイル を 閉じる
複製先 の ストリーム 、 ソケットリソース 、 あるい は ファイルディスクリプタ
は 、 リクエスト に 渡す カスタムデータ です
は オプション で 指定 する リクエストリソース です
callback に 渡す 任意 の 引数
リクエスト の 優先 順位
callback 関数 が 、 リクエスト 終了 時 に コール さ れ ます
複製元 の ストリーム 、 ソケットリソース 、 あるい は ファイルディスクリプタ
に は リクエスト 固有 の 結果 が 格納 さ れ ます
eio _dup 2 は 、 成功 し た 場合 に リクエストリソース を 返し ます
ファイルディスクリプタ を 複製 する
は 、 リクエスト に 渡す カスタムデータ です
現在 サポート する フラグ は eio _falloc _fl _keep _size posix の 定数 falloc _fl _keep _size と 同じ 意味 だけ です
ストリーム 、 ソケットリソース 、 あるい は 数値 で 表し た ファイルディスクリプタ たとえ ば eio _open が 返す もの
バイト 幅 の 長さ
callback に 渡す 任意 の 引数
リクエスト の 優先 順位
バイト 幅 の 開始 位置
callback 関数 が 、 リクエスト 終了 時 に コール さ れ ます
は オプション で 指定 する リクエストリソース です
に は リクエスト 固有 の 結果 が 格納 さ れ ます
eio _fallocate は 、 成功 し た 場合 に リクエストリソース を 返し ます
呼び出し元 が 、 ファイル に 割り 当て られ た ディスク 空間 を 直接 操作 できる よう に する
は 、 リクエスト に 渡す カスタムデータ です
ストリーム 、 ソケットリソース 、 あるい は 数値 で 表し た ファイルディスクリプタ eio _open が 返す もの など
新しい パーミッション
callback に 渡す 任意 の 引数
リクエスト の 優先 順位
callback 関数 が 、 リクエスト 終了 時 に コール さ れ ます
は オプション で 指定 する リクエストリソース です
に は リクエスト 固有 の 結果 が 格納 さ れ ます
eio _fchmod は 、 成功 し た 場合 に リクエストリソース を 返し ます
ファイル の パーミッション を 変更 する
は 、 リクエスト に 渡す カスタムデータ です
callback に 渡す 任意 の 引数
は オプション で 指定 する リクエストリソース です
グループ id
リクエスト の 優先 順位
callback 関数 が 、 リクエスト 終了 時 に コール さ れ ます
ユーザー id
ストリーム 、 ソケットリソース 、 あるい は 数値 で 表し た ファイルディスクリプタ
に は リクエスト 固有 の 結果 が 格納 さ れ ます
ファイル の オーナー を 変更 する
は 、 リクエスト に 渡す カスタムデータ です
ストリーム 、 ソケットリソース 、 あるい は 数値 で 表し た ファイルディスクリプタ eio _open が 返す もの など
callback に 渡す 任意 の 引数
リクエスト の 優先 順位
callback 関数 が 、 リクエスト 終了 時 に コール さ れ ます
は オプション で 指定 する リクエストリソース です
に は リクエスト 固有 の 結果 が 格納 さ れ ます
eio _fdatasync は 、 成功 し た 場合 に リクエストリソース を 返し ます
ファイル の コア 内 の 情報 を ストレージデバイス に 同期 さ せる
は 、 リクエスト に 渡す カスタムデータ です
callback に 渡す 任意 の 引数
リクエスト の 優先 順位
callback 関数 が 、 リクエスト 終了 時 に コール さ れ ます
は オプション で 指定 する リクエストリソース です
ストリーム 、 ソケットリソース 、 あるい は 数値 で 表し た ファイルディスクリプタ
に は リクエスト 固有 の 結果 が 格納 さ れ ます
eio _fsync は 、 成功 し た 場合 に リクエストリソース を 返し ます
メモリ 内 で の ファイル の 状態 を ストレージデバイス に 同期 さ せる
は 、 リクエスト に 渡す カスタムデータ です
ファイル の 先頭 から の オフセット
callback に 渡す 任意 の 引数
リクエスト の 優先 順位
callback 関数 が 、 リクエスト 終了 時 に コール さ れ ます
は オプション で 指定 する リクエストリソース です
ストリーム 、 ソケットリソース 、 あるい は 数値 で 表し た ファイルディスクリプタ
に は リクエスト 固有 の 結果 が 格納 さ れ ます
eio _ftruncate は 、 成功 し た 場合 に リクエストリソース を 返し ます
ファイル を 切り 詰める
は 、 リクエスト に 渡す カスタムデータ です
ストリーム 、 ソケットリソース 、 あるい は 数値 で 表し た ファイルディスクリプタ eio _open が 返す もの など
アクセス 時刻
callback に 渡す 任意 の 引数
リクエスト の 優先 順位
callback 関数 が 、 リクエスト 終了 時 に コール さ れ ます
は オプション で 指定 する リクエストリソース です
に は リクエスト 固有 の 結果 が 格納 さ れ ます
変更 時刻
eio _futime は 、 成功 し た 場合 に リクエストリソース を 返し ます
ファイル の 最終 アクセス 時刻 と 変更 時刻 を 変更 する
リクエストリソース
eio _get _last _error は 、 req に 関連 づけ られ た 直近 の エラー の 説明 を 文字列 で 返し ます
リクエストリソース に 関連 づけ られ た 直近 の エラー の 説明 を 文字列 で 返す
リクエストリソース
eio _grp が 返す リクエストグループリソース
リクエスト を リクエストグループ に 追加 する
リクエストグループリソース
グループ 内 の リクエスト 数
グループリミット を 設定 する
は 、 リクエスト に 渡す カスタムデータ です
は オプション で 指定 する リクエストリソース です
に は リクエスト 固有 の 結果 が 格納 さ れ ます
callback 関数 が 、 リクエスト 終了 時 に コール さ れ ます
callback に 渡す 任意 の 引数
eio _grp は 、 成功 し た 場合 に リクエストグループリソース を 返し ます
リクエストグループ を 作る
eio を 初期化 する
は 、 リクエスト に 渡す カスタムデータ です
リンク 先 の パス
リンク 元 の パス
callback に 渡す 任意 の 引数
リクエスト の 優先 順位
callback 関数 が 、 リクエスト 終了 時 に コール さ れ ます
は オプション で 指定 する リクエストリソース です
に は リクエスト 固有 の 結果 が 格納 さ れ ます
ファイル の ハードリンク を 作る
は 、 リクエスト に 渡す カスタムデータ です
ファイル へ の パス
callback に 渡す 任意 の 引数
リクエスト の 優先 順位
callback 関数 が 、 リクエスト 終了 時 に コール さ れ ます
は オプション で 指定 する リクエストリソース です
に は リクエスト 固有 の 結果 が 格納 さ れ ます
eio _lstat は 、 成功 し た 場合 に リクエストリソース を 返し ます
ファイル の 状態 を 取得 する
は 、 リクエスト に 渡す カスタムデータ です
アクセスモード
callback に 渡す 任意 の 引数
リクエスト の 優先 順位
callback 関数 が 、 リクエスト 終了 時 に コール さ れ ます
は オプション で 指定 する リクエストリソース です
に は リクエスト 固有 の 結果 が 格納 さ れ ます
新しい ディレクトリ へ の パス
eio _mkdir は 、 成功 し た 場合 に リクエストリソース を 返し ます
ディレクトリ を 作る
は 、 リクエスト に 渡す カスタムデータ です
新しい ノード ファイル への パス
利用 する パーミッション と 作成 する ノード の 型 を 指定 し ます
ファイルタイプ が eio _s _ifchr あるい は eio _s _ifblk の 場合 に 、 新しく 作る デバイスファイル の メジャー 番号 と マイナー 番号 を 指定 し ます
callback に 渡す 任意 の 引数
リクエスト の 優先 順位
callback 関数 が 、 リクエスト 終了 時 に コール さ れ ます
は オプション で 指定 する リクエストリソース です
に は リクエスト 固有 の 結果 が 格納 さ れ ます
eio _mknod は 、 成功 し た 場合 に リクエストリソース を 返し ます
特殊 ファイル あるい は 一般 ファイル を 作る
eio _nreqs は 、 処理 対象 の リクエスト 数 を 返し ます
処理 対象 の リクエスト 数 を 返す
は 、 リクエスト に 渡す カスタムデータ です
eio _o _* 定数 のい ずれ か 、 あるい は 複数 の 組み合わせ
開き たい ファイル へ の パス
callback に 渡す 任意 の 引数
リクエスト の 優先 順位
callback 関数 が 、 リクエスト 終了 時 に コール さ れ ます
は オプション で 指定 する リクエストリソース です
に は リクエスト 固有 の 結果 が 格納 さ れ ます
eio _s _i * 定数 のい ずれ か 、 あるい は 複数 の ビット or による 組み合わせ
eio _open は 、 成功 し た 場合 に callback の result 引数 で ファイルディスクリプタ を 返し ます
ファイル を 開く
何か の リクエスト を 実行 し て それ が 非 ゼロ を 返し た 場合 は 、 その 値 を 返し ます
未処理 の リクエスト が ある かど う か を 調べる
は 、 リクエスト に 渡す カスタムデータ です
callback に 渡す 任意 の 引数
リクエスト の 優先 順位
callback 関数 が 、 リクエスト 終了 時 に コール さ れ ます
ファイル 内 で の オフセット
は オプション で 指定 する リクエストリソース です
ストリーム 、 ソケットリソース 、 あるい は 数値 で 表し た ファイルディスクリプタ
読み込む バイト 数 の 最大 値
に は リクエスト 固有 の 結果 が 格納 さ れ ます
eio _read は 、 読み込ん だ データ を callback 関数 の result 引数 に 格納 し ます
ファイル を 、 指定 し た オフセット から 読み込む
は 、 リクエスト に 渡す カスタムデータ です
読み込む バイト 数
callback に 渡す 任意 の 引数
リクエスト の 優先 順位
callback 関数 が 、 リクエスト 終了 時 に コール さ れ ます
は オプション で 指定 する リクエストリソース です
ストリーム 、 ソケットリソース 、 あるい は 数値 で 表し た ファイルディスクリプタ
に は リクエスト 固有 の 結果 が 格納 さ れ ます
読み込み の 開始 位置
eio _readahead は 、 成功 し た 場合 に リクエストリソース を 返し ます
ファイル を 先読み し て ページキャッシュ に 格納 する
短い 形式 の パス
正規化 し た 絶対 パス を 取得 する
は 、 リクエスト に 渡す カスタムデータ です
変更後 の パス
元 の パス
callback に 渡す 任意 の 引数
リクエスト の 優先 順位
callback 関数 が 、 リクエスト 終了 時 に コール さ れ ます
は オプション で 指定 する リクエストリソース です
に は リクエスト 固有 の 結果 が 格納 さ れ ます
eio _rename は 、 成功 し た 場合 に リクエストリソース を 返し ます
ファイル 名 や 場所 を 変更 する
は 、 リクエスト に 渡す カスタムデータ です
ディレクトリ へ の パス
callback に 渡す 任意 の 引数
リクエスト の 優先 順位
callback 関数 が 、 リクエスト 終了 時 に コール さ れ ます
は オプション で 指定 する リクエストリソース です
に は リクエスト 固有 の 結果 が 格納 さ れ ます
eio _rmdir は 、 成功 し た 場合 に リクエストリソース を 返し ます
ディレクトリ を 削除 する
は 、 リクエスト に 渡す カスタムデータ です
読み込む バイト 数
callback に 渡す 任意 の 引数
リクエスト の 優先 順位
callback 関数 が 、 リクエスト 終了 時 に コール さ れ ます
は オプション で 指定 する リクエストリソース です
ストリーム 、 ソケットリソース 、 あるい は 数値 で 表し た ファイルディスクリプタ
に は リクエスト 固有 の 結果 が 格納 さ れ ます
読み込み の 開始 位置
eio _seek は 、 成功 し た 場合 に リクエストリソース を 返し ます
fd で 指定 し た ファイル 内 で の オフセット を 、 offset と whence に 従っ て 移動 する
は 、 リクエスト に 渡す カスタムデータ です
コピー する バイト 数
出力先 の ストリーム 、 ソケットリソース 、 あるい は ファイルディスクリプタ
callback に 渡す 任意 の 引数
元 ファイル 内 で の オフセット
リクエスト の 優先 順位
callback 関数 が 、 リクエスト 終了 時 に コール さ れ ます
は オプション で 指定 する リクエストリソース です
に は リクエスト 固有 の 結果 が 格納 さ れ ます
入力元 の ストリーム 、 ソケットリソース 、 あるい は ファイルディスクリプタ
eio _sendfile は 、 成功 し た 場合 に リクエストリソース を 返し ます
ファイルディスクリプタ 間 で データ を 転送 する
は 、 リクエスト に 渡す カスタムデータ です
ファイル へ の パス
callback に 渡す 任意 の 引数
リクエスト の 優先 順位
callback 関数 が 、 リクエスト 終了 時 に コール さ れ ます
は オプション で 指定 する リクエストリソース です
に は リクエスト 固有 の 結果 が 格納 さ れ ます
eio _stat は 、 成功 し た 場合 に リクエストリソース を 返し ます
ファイル の 状態 を 取得 する
は 、 リクエスト に 渡す カスタムデータ です
callback に 渡す 任意 の 引数
リクエスト の 優先 順位
callback 関数 が 、 リクエスト 終了 時 に コール さ れ ます
は オプション で 指定 する リクエストリソース です
マウント さ れ た ファイルシステム 内 の ファイル の パス
に は リクエスト 固有 の 結果 が 格納 さ れ ます
eio _statvfs は 、 成功 し た 場合 に リクエストリソース を 返し ます
ファイルシステム の 状態 を 取得 する
は 、 リクエスト に 渡す カスタムデータ です
リンク 先 の パス
リンク 元 の パス
callback に 渡す 任意 の 引数
リクエスト の 優先 順位
callback 関数 が 、 リクエスト 終了 時 に コール さ れ ます
は オプション で 指定 する リクエストリソース です
に は リクエスト 固有 の 結果 が 格納 さ れ ます
eio _symlink は 、 成功 し た 場合 に リクエストリソース を 返し ます
シンボリックリンク を 作る
は 、 リクエスト に 渡す カスタムデータ です
ファイル の 先頭 から の オフセット
ファイル へ の パス
callback に 渡す 任意 の 引数
リクエスト の 優先 順位
callback 関数 が 、 リクエスト 終了 時 に コール さ れ ます
は オプション で 指定 する リクエストリソース です
に は リクエスト 固有 の 結果 が 格納 さ れ ます
eio _busy は 、 成功 し た 場合 に リクエストリソース を 返し ます
ファイル を 切り 詰める
は 、 リクエスト に 渡す カスタムデータ です
ファイル へ の パス
callback に 渡す 任意 の 引数
リクエスト の 優先 順位
callback 関数 が 、 リクエスト 終了 時 に コール さ れ ます
は オプション で 指定 する リクエストリソース です
に は リクエスト 固有 の 結果 が 格納 さ れ ます
eio _unlink は 、 成功 し た 場合 に リクエストリソース を 返し ます
名前 を 削除 し 、 その 名前 で 参照 し て いる ファイル も 削除 する
は 、 リクエスト に 渡す カスタムデータ です
ストリーム 、 ソケットリソース 、 あるい は 数値 で 表し た ファイルディスクリプタ eio _open が 返す もの など
ソース 文字列
ファイル の 先頭 から の オフセット
callback に 渡す 任意 の 引数
リクエスト の 優先 順位
callback 関数 が 、 リクエスト 終了 時 に コール さ れ ます
は オプション で 指定 する リクエストリソース です
に は リクエスト 固有 の 結果 が 格納 さ れ ます
書き込む 最大 バイト 数
eio _write は 、 成功 し た 場合 に リクエストリソース を 返し ます
ファイル に 書き込む
チェック する 変数 注意 : php 5
var が 存在 し 、 かつその 値 が 空や 0 で なけれ ば false を 返し ます
変数 が 空 で ある かど う か を 検査 する
ブローカーリソース
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
enchant プロバイダ を 列挙 する
ブローカーリソース
空 で ない 、 locale 形式 の タグ
タグ が 存在 する 場合 に true 、 存在 し ない 場合 に false を 返し ます
辞書 が 存在 する かど う か を 調べる
辞書 リソース
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
辞書 リソース を 開放 する
ブローカーリソース
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ブローカーリソース および その 辞書 を 開放 する
ブローカーリソース
エラー が 見つかっ た 場合 に メッセージ 文字 列 、 それ 以外 の 場合 に false を 返し ます
ブローカー の 直近 の エラー を 返す
ブローカーリソース
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
使用 可能 な 辞書 の 一覧 を 返す
ブローカーリソース
ロケール を 表す タグ
成功 し た 場合 に 辞書 リソース 、 失敗 し た 場合 に false を 返し ます
タグ を 使用 し て 新しい 辞書 を 作成 する
ブローカーリソース
pwl ファイル へ の パス
成功 し た 場合 に 辞書 リソース 、 失敗 し た 場合 に false を 返し ます
pwl ファイル を 使用 し て 辞書 を 作成 する
ブローカーリソース
言語タグ
プロバイダ 名 を カンマ 区切り でつ ない だ リスト
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
その 言語 で 使用 する 辞書 の 優先 順位 を 宣言 する
辞書 リソース
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
個々 の 辞書 について 説明 する
辞書 リソース
エラーメッセージ を 表す 文字 列 、 あるい は エラー が 発生 し て い ない 場合 に false を 返し ます
現在 の スペリングセッション の 直近 の エラー を 返す
探す 単語
辞書 リソース
単語 が 存在 する 場合 に true 、 それ 以外 の 場合 に false を 返し ます
この スペリングセッション に ' 単語 ' が 存在 する かど う か を 調べる
pattern の 括弧 でくく られ た 部分 文字列 に マッチ し 、 かつこの 関数 が 3 番目 の 引数 regs を 指定 し て コール さ れ た 場合 、 マッチ し た 部分 が 配列 regs に 格納 さ れ ます
入力 文字列
大文字 小文字 を 区別 し ない 正規 表現
string の 中 で pattern が マッチ し た 場合 に は マッチ し た 文字 列 の 長さ を 返し 、 マッチ し なかっ た 場合 また は エラー と なっ た 場合 は false を 返し ます
大文字 小文字 を 区別 せ ず に 正規 表現 による マッチング を 行う
追加 の ヘッダ
ログ に 記録 さ れる エラーメッセージ
メッセージ を どこ に 送る の か を 指定 し ます
メッセージ の 送信 先
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
定義 さ れ た エラー 処理 ルーチン に エラーメッセージ を 送信 する
新しい error _reporting レベル
変更前 の error _reporting レベル を 返し ます
出力 する php エラー の 種類 を 設定 する
エスケープ さ れる 引数
エスケープ さ れ た 文字列
シェル 引数 として 使用 さ れる 文字列 を エスケープ する
有効 な php コード
評価 さ れる コード の 中 で return が コール さ れ ない 限り 、 eval は null を 返し ます
文字列 を php コード として 評価 する
オプション の タイムアウト マイクロ 秒
有効 な イベントリソース
event _add は 、 成功 し た 場合 に true 、 エラー 時 に false を 返し ます
モニタ する イベント に 追加 する
有効 な イベントベースリソース
イベントベース を 破棄 する
有効 な イベントベースリソース
オプション の パラメータ
event _base _loop は 、 成功 し た 場合 に 0 、 エラー 時 に - 1 、 イベント が 登録 さ れ て い なけれ ば 1 を 返し ます
イベント を 処理 する
有効 な イベントベースリソース
event _base _loopbreak は 、 成功 し た 場合 に true 、 エラー 時 に false を 返し ます
イベントループ を 中止 する
event _base _new は 、 成功 し た 場合 に 有効 な イベントベースリソース 、 エラー 時 に false を 返し ます
新しい イベントベース を 作成 し て 初期化 する
有効 な イベントベースリソース
イベント の 優先 度 レベル を 表す 数値
event _base _priority _init は 、 成功 し た 場合 に true 、 エラー 時 に false を 返し ます
イベント の 優先 度 レベル の 数値 を 設定 する
有効 な イベントベースリソース
有効 な イベントリソース
event _base _set は 、 成功 し た 場合 に true 、 エラー 時 に false を 返し ます
イベントベース を イベント と 関連 づける
有効 な バッファ つき イベントリソース
有効 な イベントベースリソース
event _buffer _base _set は 、 成功 し た 場合 に true 、 エラー 時 に false を 返し ます
バッファ つき イベント を イベントベース と 関連 づける
有効 な バッファ つき イベントリソース
ev _read と ev _write の 任意 の 組み合わせ
event _buffer _disable は 、 成功 し た 場合 に true 、 エラー 時 に false を 返し ます
バッファ つき イベント を 無効 に する
有効 な バッファ つき イベントリソース
ev _read と ev _write の 任意 の 組み合わせ
event _buffer _enable は 、 成功 し た 場合 に true 、 エラー 時 に false を 返し ます
バッファ つき イベント を 有効 に する
有効 な バッファ つき イベントリソース
有効 な php ストリーム
バッファ つき イベント の ファイル 記述子 を 変更 する
有効 な バッファ つき イベントリソース
バッファ つき イベント を 破棄 する
データ を 読み込む とき に 起動 する コールバック
記述子 の 書き込み 準備 が でき た とき に 起動 する コールバック
記述子 で エラー が 発生 し た とき に 起動 する コールバック
各 コールバック に 渡す 引数 任意
有効 な php ストリームリソース
event _buffer _new は 、 成功 し た 場合 に 新しい バッファ つき イベント 、 エラー 時 に false を 返し ます
新しい バッファ つき イベント を 作成 する
優先度 レベル
有効 な バッファ つき イベントリソース
event _buffer _priority _set は 、 成功 し た 場合 に true 、 エラー 時 に false を 返し ます
バッファ 着き イベント の 優先 度 を 設定 する
有効 な バッファ つき イベントリソース
データサイズ バイト 単位
バッファ つき イベント から データ を 読み込む
書き込み タイムアウト 秒数
有効 な バッファ つき イベントリソース
読み込み タイムアウト 秒数
バッファ つき イベント の 読み込み タイムアウト および 書き込み タイムアウト を 設定 する
オプション で サイズ を 指定 し ます
有効 な バッファ つき イベントリソース
書き込む データ
event _buffer _write は 、 成功 し た 場合 に true 、 エラー 時 に false を 返し ます
バッファ つき イベント に データ を 書き込む
有効 な イベントリソース
event _del は 、 成功 し た 場合 に true 、 エラー 時 に false を 返し ます
モニタ する イベント から 削除 する
有効 な イベントリソース
イベントリソース を 解放 する
event _new は 、 成功 し た 場合 に イベントリソース 、 エラー 時 に false を 返し ます
新しい イベント を 作成 する
引数 output が 存在 する 場合 、 指定 し た 配列 は 、 コマンド から の 出力 の 各行 で 埋め られ ます
実行 する コマンド
引数 return _var が 、 引数 output と 共に 存在 する 場合 、 実行 し た コマンド の ステータス が この 変数 に 書か れ ます
コマンド 結果 の 最後 の 行 を 返し ます
外部 プログラム を 実行 する
各 セクション を 配列 と する かど う か を 指定 し ます
読み込む 画像 ファイル の 名前
結果 の 配列 を 作成 する ため に 存在 する 必要 の ある セクション の カンマ 区切り リスト
true を 指定 する と 、 サムネイル 本体 を 読み込み ます
ヘッダ 名 が キー ・ ヘッダ の 内容 が 値と なる 連想 配列 を 返し ます
jpeg あるい は tiff から exif ヘッダ を 読み込む
返さ れる サムネイル の 幅 が 格納 さ れ ます
読み込む 画像 ファイル の 名前
返さ れる サムネイル の 高さ が 格納 さ れ ます
返さ れる サムネイル の 画像 タイプ が 格納 さ れ ます
埋め込ま れ た サムネイル を 返し ます
tiff あるい は jpeg 形式 の 画像 に 埋め込ま れ た サムネイル を 取得 する
status が 文字列 の 場合 は 、 この 関数 は 終了 直前 に status を 表示 し ます
メッセージ を 出力 し 、 現在 の スクリプト を 終了 する
実行 する コマンド
プロセス の 標準 入力 ・ 標準 出力 ・ 標準 エラー 出力 へ の pty ストリーム を 返し ます
bourne シェル 経由 で コマンド を 実行 し 、 プロセス へ の pty ストリーム を オープン する
処理 する 引数
& # 0 3 9 ; e &# 0 3 9 ; の arg 乗 から 1 を 引い た 値 を 返し ます
値 が ゼロ に 近い 時 に でも 精度 を 保つ ため に exp number - 1 を 返す
拡張 モジュール の 名前
name で 指定 する 拡張 機能 が ロード さ れ て いる 場合 に true を 返し ます
ある 拡張 機能 が ロード さ れ て いる かど う か を 調べる
この 関数 は 連想 配列 var _array を 引数 と し 、 その キー を 変数 名 、 値 を 変数 の 値として 処理 し ます
衝突 が あっ た 場合 、 存在 する 変数 が 上書き さ れ ます
現在 の シンボルテーブル に 既 に 存在 する 場合 に のみ 上書き し ます
同じ 変数 だ が 接頭 辞 を つけ て い ない バージョン の 変数 が 現在 の シンボルテーブル に 存在 する 場合 に のみ 変数 を 生成 し ます
全て の 変数 の 前 に prefix を 付け ます
衝突 が あっ た 場合 、 存在 する 変数 は 上書き さ れ ませ ん
prefix は 、 flags が extr _prefix _same 、 extr _prefix _all 、 extr _prefix _invalid あるい は extr _prefix _if _exists の 場合 に のみ 必要 で ある こと に 注意 し て くだ さい
無効 また は 数値 キー および 衝突 に関する 対処 法 は 、 flags で 定義 さ れ ます
無効 また は 数値 の 変数 名 のみ に 接頭 辞 prefix を 付け ます
変数 を 参照 として 展開 し ます
衝突 が あっ た 場合 、 prefix を 前 につけた 新しい 変数 と なり ます
シンボルテーブル に インポート し た 変数 の 数 を 返し ます
配列 から シンボルテーブル に 変数 を インポート する
fam _monitor _xxx 関数 のい ずれ か が 返す リソース
a resource representing a connection to the fam service returned by fam _open
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
監視 を 終了 する
fam _open が 返す 、 fam サービス へ の 接続 を 表す リソース
fam 接続 を 閉じる
fam _open が 返す 、 fam サービス へ の 接続 を 表す リソース
監視 する ディレクトリ へ の パス
モニタリングリソース 、 あるい は エラー 時 に false を 返し ます
ディレクトリ の 変更 を 監視 する
fam _open が 返す 、 fam サービス へ の 接続 を 表す リソース
監視 する ファイル へ の パス
モニタリングリソース 、 あるい は エラー 時 に false を 返し ます
通常 の ファイル の 変更 を 監視 する
fam _open が 返す 、 fam サービス へ の 接続 を 表す リソース
次 の 待機 中 の fam イベント を 返す
fam _open が 返す 、 fam サービス へ の 接続 を 表す リソース
fam _next _event により 取得 可能 な 待機 中 の イベント が ある 場合 に ゼロ 以外 の 値 、 ない 場合 に ゼロ を 返し ます
待機 中 の fam イベント の 有無 を 調べる
fam _open が 返す 、 fam サービス へ の 接続 を 表す リソース
fam _monitor _xxx 関数 のい ずれ か が 返す リソース
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
中断 さ れ た 監視 処理 を 再開 する
ニューラルネットワークトレーニングリソース
ニューラルネットワークリソース
成功 し た 場合 に true 、 それ 以外 の 場合 に false を 返し ます
initialize the weights using widrow + nguyen &rsquo ;s algorithm
fbsql _connect あるい は fbsql _pconnect が 返す frontbase リンク id
直近 の クエリ が 失敗 し た 場合 、 この 関数 は - 1 を 返し ます
直近 の frontbase 操作 により 変更 さ れ た レコード の 数 を 得る
fbsql _connect あるい は fbsql _pconnect が 返す frontbase リンク id
fbsql _create _blob が 返す blob ハンドル
blob の 大きさ を 整数 値 で 返し ます
blob の 大きさ を 取得 する
新しい ユーザー 名
fbsql _connect あるい は fbsql _pconnect が 返す frontbase リンク id
指定 し た 場合 、 これ が ユーザー 変更 後 の デフォルト また は カレントデータベース と なり ます
新しい ユーザー の パスワード
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
アクティブ な 接続 に ログイン し て いる ユーザー を 変更 する
fbsql _connect あるい は fbsql _pconnect が 返す frontbase リンク id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
frontbase 接続 を 閉じる
接続用 の ユーザー 名
サーバー の ホスト 名
接続用 の パスワード
成功 時 に 正 の frontbase リンク id 、 エラー 時 に false を 返し ます
frontbase サーバー へ の 接続 を オープン する
fbsql _connect あるい は fbsql _pconnect が 返す frontbase リンク id
blob データ
新しく 作成 し た blob の リソースハンドル を 返し ます
blob を 作成 する
fbsql _connect あるい は fbsql _pconnect が 返す frontbase リンク id
clob データ
新しく 作成 し た clob の リソースハンドル を 返し ます
clob を 作成 する
fbsql _connect あるい は fbsql _pconnect が 返す frontbase リンク id
データベース 名 を 表す 文字列
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
frontbase データベース を 作成 する
fbsql _query あるい は fbsql _db _query が 返す 結果 id
行番号
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
内部 結果 ポインタ を 移動 する
データベース 名
fbsql _connect あるい は fbsql _pconnect が 返す frontbase リンク id
この 接続 で 使用 する データベース の 名前 を 返し ます
接続 で 使用 する データベース 名 を 取得 あるい は 設定 する
実行 する sql クエリ
fbsql _connect あるい は fbsql _pconnect が 返す frontbase リンク id
選択 し た データベース
クエリ 結果 へ の 正 の frontbase 結果 id 、 また は エラー 時 に は false を 返し ます
frontbase クエリ を 送信 する
fbsql _connect あるい は fbsql _pconnect が 返す frontbase リンク id
データベース 名
現在 の 状態 を 表す 整数 値 を 返し ます
指定 し た データベース の 状態 を 取得 する
fbsql _connect あるい は fbsql _pconnect が 返す frontbase リンク id
データベース 名 を 表す 文字列
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
frontbase データベース を 破棄 削除 する
fbsql _connect あるい は fbsql _pconnect が 返す frontbase リンク id
直近 の fbsql 関数 の エラー 番号 、 あるい は エラー が 発生 し なかっ た 場合 に 0 ゼロ を 返し ます
前 の frontbase 操作 による エラーメッセージ の 数値 を 返す
fbsql _query あるい は fbsql _db _query が 返す 結果 id
fbsql _assoc 、 fbsql _num あるい は fbsql _both のいずれか の 定数 値
取得 し た 行 に 対応 する 配列 を 返し ます
連想 配列 、 数値 配列 、 また は その 両方 として 結果 レコード を 取得 する
fbsql _query あるい は fbsql _db _query が 返す 結果 id
フィールド の 数値 オフセット
フィールド 情報 を 含む オブジェクト 、 あるい は エラー 時 に false を 返し ます
結果 から カラム 情報 を 得て 、 オブジェクト として 返す
fbsql _query あるい は fbsql _db _query が 返す 結果 id
取得 し た 行 に 対応 する プロパティ を もつ オブジェクト を 返し ます
オブジェクト として 結果 レコード を 取得 する
fbsql _list _fields が 返す 結果 ポインタ
フィールド の 数値 オフセット
指定 し た フィールド の フィールドフラグ を 返し ます
クエリ 結果 に おい て 指定 し た フィールド に関する フラグ を 得る
fbsql _list _fields が 返す 結果 ポインタ
フィールド の 数値 オフセット
指定 し た フィールド の 長さ を 返し ます
指定 し た フィールド の 長さ を 返す
fbsql _query あるい は fbsql _db _query が 返す 結果 id
フィールド の 数値 オフセット
テーブル 名 を 文字列 で 返し ます
指定 し た フィールド が ある テーブル の 名前 を 得る
fbsql _query あるい は fbsql _db _query が 返す 結果 id
フィールド の 数値 オフセット
フィールド の 型 を 文字列 で 返し ます
結果 の 中 で 指定 し た フィールド の 型 を 得る
fbsql _query あるい は fbsql _db _query が 返す 結果 id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
結果 メモリ を 開放 する
指定 し た 場合 は 、 これ が 新しい 接続 の ホスト 名 と なり ます
fbsql _connect あるい は fbsql _pconnect が 返す frontbase リンク id
現在 の 接続 で 使用 し て いる ホスト 名 を 返し ます
接続 で 使用 さ れ て いる ホスト 名 を 取得 あるい は 設定 する
fbsql _connect あるい は fbsql _pconnect が 返す frontbase リンク id
直近 の insert クエリ が 生成 し た id を 返し ます
直近 の insert 処理 により 生成 さ れ た id を 得る
fbsql _connect あるい は fbsql _pconnect が 返す frontbase リンク id
結果 ポインタ あるい は エラー 時 に false を 返し ます
frontbase サーバー で 利用 可能 な データベース の 一覧 を 得る
テーブル 名
fbsql _connect あるい は fbsql _pconnect が 返す frontbase リンク id
データベース 名
結果 ポインタ を 返し ます
frontbase 結果 フィールド の 一覧 を 得る
データベース 名
fbsql _connect あるい は fbsql _pconnect が 返す frontbase リンク id
結果 ポインタ を 返し ます
frontbase データベース の テーブル 一覧 を 得る
fbsql _query あるい は fbsql _db _query が 返す 結果 id
直近 の select 文 が 返す行 の 数 を 返し ます
結果 の レコード 数 を 得る
接続 時 の ユーザー 名
接続 時 の パスワード
ホスト 名
成功 し た 場合 に は 正 の frontbase 持続 的 リンク id 、 エラー 時 に は false を 返し ます
frontbase サーバー へ の 持続 的 接続 を オープン する
実行 する sql クエリ
fbsql _connect あるい は fbsql _pconnect が 返す frontbase リンク id
fbsql _query は 、 クエリ が 成功 し た かどう か を 示す ため に true 非 ゼロ あるい は false を 返し ます
frontbase クエリ を 送信 する
fbsql _connect あるい は fbsql _pconnect が 返す frontbase リンク id
fbsql _create _blob が 返す blob ハンドル
指定 し た blob データ を 含む 文字 列 を 返し ます
データベース から blob を 読み込む
fbsql _connect あるい は fbsql _pconnect が 返す frontbase リンク id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
データベース へ の トランザクション を ロールバック する
fbsql _connect あるい は fbsql _pconnect が 返す frontbase リンク id
選択 する データベース の 名前
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
frontbase データベース を 選択 する
fbsql _query あるい は fbsql _db _query が 返す 結果 id
以下 のい ずれ か です
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
frontbase 結果 セット の lob 取得 モード を 設定 する
も と の パスワード
設定 する 新しい パスワード
fbsql _connect あるい は fbsql _pconnect が 返す frontbase リンク id
ユーザー 名
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
指定 し た ユーザー の パスワード を 変更 する
設定 する 分離 レベル
設定 する ロック の 形式
fbsql _connect あるい は fbsql _pconnect が 返す frontbase リンク id
トランザクション の ロック と 分離 レベル を 設定 する
fbsql _connect あるい は fbsql _pconnect が 返す frontbase リンク id
データベース 名
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ローカル また は リモートサーバー の データベース を 開始 する
fbsql _connect あるい は fbsql _pconnect が 返す frontbase リンク id
データベース 名
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ローカル また は リモートサーバー の データベース を 停止 する
警告 を 有効 に する かし ない か
警告 を オン に し た 場合 は true 、 そう で ない 場合 は false を 返し ます
frontbase 警告 を 有効 また は 無効 に する
ファイルポインタ は 有効 なもの で なけれ ば なら ず 、 また fopen また は fsockopen で 正常 に オープン さ れ た ファイル を 指し て いる 必要 が あり ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
オープン さ れ た ファイルポインタ を クローズ する
fdf _create 、 fdf _open あるい は fdf _open _string が 返す fdf ドキュメントハンドル
fdf ドキュメント を 閉じる
fdf ドキュメントハンドル 、 あるい は エラー 時 に false を 返し ます
新規 fdf ドキュメント を 作成 する
fdf _errno で 取得 し た エラーコード
エラーメッセージ を 表す 文字 列 、 あるい は 何 も 問題 が ない 場合 は no error を 返し ます
直近 の fdf エラーコード について の 説明 を 返す
fdf _create 、 fdf _open あるい は fdf _open _string が 返す fdf ドキュメントハンドル
ファイル 名 また は 既存 の ディレクトリ 名 を 指定 し 、 ディレクトリ 名 を 指定 し た 場合 は その 下 に 元 の ファイル 名 で 保存 さ れ ます
返さ れる 配列 は 以下 の よう な フィールド を 保持 し ます
fdf に 埋め込ま れ て いる 、 アップロード さ れ た ファイル を 展開 する
fdf _create 、 fdf _open あるい は fdf _open _string が 返す fdf ドキュメントハンドル
キー の 値 を 文字列 を 返し ます
/ f キー の 値 を 得る
fdf _create 、 fdf _open あるい は fdf _open _string が 返す fdf ドキュメントハンドル
キー の 値 を 文字列 で 返し ます
/ status キー の 値 を 得る
fdf _create 、 fdf _open あるい は fdf _open _string が 返す fdf ドキュメントハンドル
この オプションパラメータ を 渡す こと で 、 配列 フィールド の 要素 が 取得 可能 です
fdf フィールド の 名前 を 表す 文字列
フィールド の 値 を 返し ます
フィールド の 値 を 得る
fdf _create 、 fdf _open あるい は fdf _open _string が 返す fdf ドキュメントハンドル
バージョン を 表す 文字 列 を 返し ます
fdf api あるい は ファイル の バージョン を 取得 する
fdf _create 、 fdf _open あるい は fdf _open _string が 返す fdf ドキュメントハンドル
fdf フィールド 名 を 表す 文字列
フィールド 名 を 文字列 で 返し ます
次 の フィールド 名 を 得る
fdf ファイル へ の パス
fdf ドキュメント の ハンドル 、 あるい は エラー 時 に false を 返し ます
fdf ドキュメント を オープン する
fdf _create 、 fdf _open あるい は fdf _open _string が 返す fdf ドキュメントハンドル
ドキュメント を 表す 文字 列 、 あるい は エラー 時 に false を 返し ます
fdf ドキュメント を 文字 列 として 返す
fdf _create 、 fdf _open あるい は fdf _open _string が 返す fdf ドキュメントハンドル
指定 し た 場合 は 、 結果 の fdf がここ に 書き込ま れ ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
fdf ドキュメント を 保存 する
fdf _create 、 fdf _open あるい は fdf _open _string が 返す fdf ドキュメントハンドル
fdfnormalap 、 fdfrolloverap および fdfdownap のいずれ か が 使用 可能 です
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
フィールド の 外観 を 設定 する
fdf _create 、 fdf _open あるい は fdf _open _string が 返す fdf ドキュメントハンドル
エンコーディング 名
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
fdf 文字 エンコーディング を 設定 する
絶対 url で 指定 する 必要 が あり ます
fdf _create 、 fdf _open あるい は fdf _open _string が 返す fdf ドキュメントハンドル
この パラメータ を 使用 し て 、 ドキュメント を 表示 する フレーム を 指定 し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
fdf データ を 表示 する pdf ドキュメント を 設定 する
fdf _create 、 fdf _open あるい は fdf _open _string が 返す fdf ドキュメントハンドル
fdf フィールド 名 を 表す 文字列
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
フィールド の フラグ を 設定 する
fdf _create 、 fdf _open あるい は fdf _open _string が 返す fdf ドキュメントハンドル
fdf フィールド 名 を 表す 文字列
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
フィールド の javascript アクション を 設定 する
fdf _create 、 fdf _open あるい は fdf _open _string が 返す fdf ドキュメントハンドル
fdf フィールド 名 を 表す 文字列
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
フィールド の オプション を 設定 する
fdf _create 、 fdf _open あるい は fdf _open _string が 返す fdf ドキュメントハンドル
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
/ status キー の 値 を 設定 する
fdf _create 、 fdf _open あるい は fdf _open _string が 返す fdf ドキュメントハンドル
fdf フィールド 名 を 表す 文字列
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
フィールド の 投稿 フォームアクション を 設定 する
fdf _create 、 fdf _open あるい は fdf _open _string が 返す fdf ドキュメントハンドル
フレーム 名 を 表す 文字列
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
フォーム の 表示 対象 と なる フレーム を 設定 する
fdf _create 、 fdf _open あるい は fdf _open _string が 返す fdf ドキュメントハンドル
バージョン を 表す 文字列
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
fdf ファイル の バージョン 番号 を 設定 する
オプション の 3 番目 の 引数 を 使用 し て 、 取り除く 必要 が ない タグ を 指定 する こと が でき ます
ファイルポインタ は 、 有効 な ファイルポインタ で ある 必要 が あり 、 fopen また は fsockopen で 正常 に オープン さ れ た （ そして まだ fclose で クローズ さ れ て い ない ） ファイル を 指し て いる 必要 が あり ます
取得 し たい データ の 長さ
handle で 指定 し た ファイルポインタ から 最大 length - 1 バイト 読み出し 、 html や php コード を 取り除い た 文字列 を 返し ます
ファイルポインタ から 1 行取り出し 、 html タグ を 取り除く
ファイル あるい は ディレクトリ へ の パス
filename で 指定 し た ファイル また は ディレクトリ が 存在 すれ ば true を 返し 、 そう で なけれ ば false を 返し ます
ファイル また は ディレクトリ が 存在 する かどう か 調べる
stream _context _create で 作成 し た コンテキストリソース
書き込む データ
データ を 書き込む ファイル へ の パス
flags の 値 は 、 以下 の フラグ を 組み合わ せ た もの と なり ます 組み合わせる 際 に は 、 論理 or | 演算子 で 連結 し ます
この 関数 は ファイル に 書き込ま れ た バイト 数 を 返し ます
文字列 を ファイル に 書き込む
ファイル へ の パス
ファイル の 最終 更新 時刻 を 返し 、 失敗 し た 場合 に false を 返し ます
ファイル の inode 変更 時刻 を 取得 する
ファイル へ の パス
ファイル の 所有 者 の グループ id を 返し 、 エラー の 場合 は false を 返し ます
ファイル の グループ を 取得 する
ファイル へ の パス
ファイル の 所有 者 の ユーザー id を 返し 、 失敗 し た 場合 に false を 返し ます
ファイル の 所有 者 を 取得 する
ファイル へ の パス
ファイル の パーミッション を 数値 モード で 返し ます
ファイル の パーミッション を 取得 する
オープン し た filepro データベース の フィールド 数 、 あるい は エラー の 場合 に false を 返し ます
filepro データベース 中 の フィールド 数 を 返す
フィールド 番号
フィールド 名 を 表す 文字 列 、 あるい は エラー の 場合 に false を 返し ます
フィールド 名 を 取得 する
フィールド 番号
フィールド の 幅 を 表す 整数 値 、 あるい は エラー の 場合 に false を 返し ます
フィールド 幅 を 取得 する
行番号
フィールド 番号
指定 し た データ 、 あるい は エラー の 場合 に false を 返し ます
filepro データベース から データ を 取得 する
オープン さ れ た filepro データベース に おける 行 の 数 を 返し ます
filepro データベース の 行 の 数 を 返し ます
map ディレクトリ
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
map ファイル の 読み込み と 照合 を 行う
ファイル へ の パス
ファイル の タイプ を 返し ます
ファイルタイプ を 取得 する
引数 を 定義 する 配列
存在 し ない キー は null として 返り値 に 追加 し ます
文字列キー の 配列
成功 し た 場合 は 要求 さ れ た 変数 の 値 を 含む 配列 、 あるい は 失敗 し た 場合 に false を 返し ます
複数 の 変数 を 受け取り 、 オプション で それら を フィルタリング する
finfo _open が 返す fileinfo リソース
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
fileinfo リソース を 閉じる
システム 出力 バッファ を フラッシュ する
調べ たい 文字列
flags の 値 は 、 以下 の フラグ を 論理 or |) 演算子 で 連結 し た 任意 の 組み合わせ です
シェル の ワイルドカードパターン
マッチ し た 場合 に true 、 それ 以外 の 場合 に false を 返し ます
ファイル 名 が パターン に マッチ する か 調べる
この ひとつ の パラメータ に 、 メソッド に 渡す すべ て の パラメータ を 配列 で 指定 し ます
コール し たい 関数 あるい は メソッド
関数 の 結果 、 あるい は エラー 時 に false を 返し ます
静的 メソッド を コール し 、 引数 を 配列 で 渡す
関数 に 渡し たい パラメータ
コール し たい 関数 あるい は メソッド
関数 の 結果 、 あるい は エラー 時 に false を 返し ます
静的 メソッド を コール する
ファイルポインタ は 、 有効 な ファイルポインタ で ある 必要 が あり 、 fopen また は fsockopen で 正常 に オープン さ れ た （ そして まだ fclose で クローズ さ れ て い ない ） ファイル を 指し て いる 必要 が あり ます
エラー が 起こっ た 場合 、 fpassthru は false を 返し ます
ファイルポインタ 上 に 残っ て いる すべ て の データ を 出力 する
fopen を 使用 し て 作成 し た ファイルシステムポインタリソース
format について は 、 sprintf の ドキュメント で 説明 さ れ て い ます
書き込ま れ た 文字 列 の 長さ を 返し ます
フォーマット さ れ た 文字列 を ストリーム に 書き込む
fopen を 使用 し て 作成 し た ファイルシステムポインタリソース
最大 length バイト まで 読み込む
読み込ん だ 文字列 を 返し ます
バイナリセーフ な ファイル の 読み込み
日 を 表す 、 1 から 3 0 まで の 数字
年 を 表す 、 1 から 1 4 まで の 数字
月 を 表す 、 1 vendăšmiaire から 1 3 各年 の 最後 の 5 - 6 日 まで の 数字
フランス 革命 暦 の 日付 を ユリウス 積算 日 に なおし た 結果 を 整数 値 で 返し ます
フランス 革命 暦 を ユリウス 積算 日 に 変換 する
fribidi _rtl 、 fribidi _ltr あるい は fribidi _auto のいずれ か ひとつ
論理 表記 の 文字列
fribidi _charset _xxx のいずれ か ひとつ
成功 し た 場合 に 物理 表記 の 文字 列 、 失敗 し た 場合 に false を 返し ます
論理 表記 を 物理 表記 に 変換 する
fopen を 使用 し て 作成 し た ファイルシステムポインタリソース
オフセット
whence の 値 は 以下 の よう に なり ます
成功 する と 0 を 返し 、 そう で なけれ ば - 1 を 返し ます
ファイルポインタ を 移動 する
ポート 番号
接続 タイムアウト 秒数
エラーメッセージ を 表す 文字列
指定 し た 場合 は 、 システムコール connect で 発生 し た エラー の エラー 番号 が 格納 さ れ ます
fsockopen は 、 ファイルポインタ を 返し ます
インターネット 接続 もしく は unix ドメインソケット 接続 を オープン する
fopen を 使用 し て 作成 し た ファイルシステムポインタリソース
ファイル の 統計 情報 の 配列 を 返し ます
オープン し た ファイルポインタ から ファイル に関する 情報 を 取得 する
ファイルポインタ は 有効 なもの で なけれ ば なら ず 、 また fopen 、 popen で 正常 に オープン さ れ た ファイル を 指し て いる 必要 が あり ます
handle が 示す ファイルポインタ の 位置 、 すなわち ファイル ・ ストリーム 上 の オフセット を 整数 値 で 返し ます
ファイル の 読み 書き 用 ポインタ の 現在 位置 を 返す
もし 変数 が 指定 さ れ て い た 場合 、 サーバー から の 応答 テキスト の 内容 の 参照 が 格納 さ れ ます
確保 し たい バイト 数
ftp 接続 の リンク id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
アップロード さ れる ファイル の ため の スペース を 確保 する
ftp 接続 の リンク id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
親 ディレクトリ に 移動 する
新しい パーミッション
リモートファイル
ftp 接続 の リンク id
成功 し た 場合 に 新しい パーミッション を 、 エラー 時 に false を 返し ます
ftp 経由 で ファイル の パーミッション を 設定 する
この パラメータ は 接続 先 の ポート を 指定 し ます
この パラメータ は 、 以降 の ネットワーク 操作 時 の タイムアウト を 指定 し ます
ftp サーバー の アドレス
成功 し た 場合 に ftp ストリーム を 、 エラー 時 に false を 返し ます
ftp 接続 を オープン する
削除 する ファイル
ftp 接続 の リンク id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ftp サーバー 上 の ファイル を 削除 する
実行 し たい コマンド
ftp 接続 の リンク id
コマンド が 成功 し た （ サーバー の 応答 コード が 2 0 0 ） 場合 に true を 、 それ 以外 の 場合 に false を 返し ます
ftp サーバー 上 で の コマンド の 実行 を リクエスト する
リモートファイル 内 で の 、 アップロード 開始 位置
リモートファイル の パス
転送 モード
ftp 接続 の リンク id
ローカル で オープン さ れ て いる ファイル の ポインタ
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
オープン 中 の ファイル を ftp サーバー に アップロード する
ftp 接続 の リンク id
現在 、 以下 の オプション が サポート さ れ て い ます : サポート さ れる 実行 時 ftp オプション ftp _timeout _sec ネットワーク 関連 処理 で 使用 さ れる カレント の タイムアウト を 返し ます
成功 し た 場合 は その 値 を 、 指定 し た option が サポート さ れ て い ない 場合 は false を 返し ます
カレント ftp ストリーム で の 種々 の 実行 時動 作 を 取得 する
ローカルファイル の パス （ ファイル がす でに 存在 する 場合 は 上書き さ れ ます ）
リモートファイル の パス
転送 モード
ftp 接続 の リンク id
リモートファイル の 、 ダウンロード を 開始 する 位置
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ftp サーバー から ファイル を ダウンロード する
ユーザー 名 （ user ）
ftp 接続 の リンク id
パスワード （ pass ）
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ftp 接続 に ログイン する
ftp 接続 の リンク id
作成 さ れる ディレクトリ の 名前
成功 し た 時 に は 新規 に 作成 し た ディレクトリ 名 、 エラー 時 に false を 返し ます
ディレクトリ を 作成 する
ftp 接続 の リンク id
ftp _failed 、 ftp _finished あるい は ftp _moredata を 返し ます
ファイル の 取得 / 送信 を 継続 する （ 非 ブロッキング ）
ダウンロード を 開始 する 、 リモートファイル 内 の 位置
リモートファイル の パス
転送 モード
ftp 接続 の リンク id
オープン さ れ て いる ファイル の ポインタ
ftp _failed 、 ftp _finished あるい は ftp _moredata を 返し ます
ftp サーバー から ファイル を ダウンロード し 、 オープン 中 の ファイル に 保存 する （ 非 ブロッキング ）
ダウンロード を 開始 する 、 リモートファイル 内 の 位置
リモートファイル の パス
ローカルファイル の パス （ ファイル がす でに 存在 する 場合 、 上書き さ れ ます ）
ftp 接続 の リンク id
転送 モード
ftp _failed 、 ftp _finished あるい は ftp _moredata を 返し ます
ftp サーバー から ファイル を 取得 し 、 ローカルファイル に 書き込む （ 非 ブロッキング ）
ローカルファイル の パス
リモートファイル 内 で の 、 アップロード 開始 位置
リモートファイル の パス
転送 モード
ftp 接続 の リンク id
ftp _failed 、 ftp _finished あるい は ftp _moredata を 返し ます
ftp サーバー に ファイル を 保存 する （ 非 ブロッキング ）
true の 場合 は パッシブモード を オン に 、 そう で ない 場合 は オフ に し ます
ftp 接続 の リンク id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
パッシブモード を オン また は オフ に する
ローカルファイル の パス
リモートファイル 内 で の 、 アップロード 開始 位置
リモートファイル の パス
転送 モード
ftp 接続 の リンク id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ftp サーバー に ファイル を アップロード する
実行 し たい コマンド
ftp 接続 の リンク id
サーバー から の 応答 を 文字 列 の 配列 で 返し ます
ftp サーバー に 任意 の コマンド を 送信 する
true を 設定 し た 場合 、 発行 さ れる コマンド は list - r と なり ます
ディレクトリ の パス
ftp 接続 の リンク id
各 要素 が 1 行分 の テキスト に 対応 する 配列 を 返し ます
指定 し た ディレクトリ の 詳細 な ファイル 一覧 を 返す
現在 の ファイル / ディレクトリ の 名前
ftp 接続 の リンク id
新しい 名前
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ftp サーバー 上 の ファイル また は ディレクトリ の 名前 を 変更 する
削除 する ディレクトリ
ftp 接続 の リンク id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ディレクトリ を 削除 する
現在 、 以下 の オプション が サポート さ れ て い ます : サポート さ れる 実行 時 ftp オプション ftp _timeout _sec 全 て の ネットワーク 関連 関数 に関し て 秒単 位 で タイムアウト を 変更 します
ftp 接続 の リンク id
この パラメータ の 内容 は 、 どの option を 変更 しよ う とし て いる か によって 変わり ます
オプション が 設定 でき た 場合 に true 、 そう で ない 場合 に false を 返し ます
さまざまな ftp 実行 時 オプション を 設定 する
site コマンド
ftp 接続 の リンク id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
site コマンド を サーバー に 送信 する
リモートファイル
ftp 接続 の リンク id
成功 し た 場合 は ファイル の サイズ を 、 エラー 時 に は - 1 を 返し ます
指定 し た ファイル の サイズ を 返す
ftp 接続 の リンク id
リモートシステム 型 を 返し ます
リモート ftp サーバー の システム 型 id を 返す
ファイルポインタ
丸める 大きさ
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ファイル を 指定 し た 長さ に 丸める
引数 の 位置
指定 し た 引数 、 あるい は エラー 時 に false を 返し ます
引数 の リスト から 要素 を ひとつ返す
配列 を 返し ます
関数 の 引数 リスト を 配列 として 返す
関数 名 を 表す 文字列
function _name が 存在 し 、 関数 で ある 場合 に true 、 それ 以外 の 場合 に false を 返し ます
指定 し た 関数 が 定義 さ れ て いる 場合 に true を 返す
収集 し た サイクル の 数 を 返し ます
すべて の 既存 ガベージサイクル を 強制 的 に 収集 する
循環 参照 コレクタ を 無効 に する
場所 を 探す 対象 と なる ホスト 名 あるい は ip アドレス
成功 し た 場合 に は 二文字 の iso 国 コード 、 アドレス が データベース で 見つ から ない 場合 に は false を 返し ます
二文字 の 国 コード を 取得 する
場所 を 探す 対象 と なる ホスト 名 あるい は ip アドレス
成功 し た 場合 に は 国名 、 アドレス が データベース で 見つ から ない 場合 に は false を 返し ます
完全 な 国名 を 取得 する
データベース の 型 を 整数 値 で 指定 し ます
対応 する データベース の バージョン 、 あるい は エラー 時 に null を 返し ます
geoip データベース の 情報 を 取得 する
データベース の 形式 を 表す 整数 値
データベース が 存在 する 場合 に true 、 存在 し ない 場合 に false 、 エラー 時 に null を 返し ます
geoip データベース が 使用 可能 か どう か を 調べる
データベース の 形式 を 表す 整数 値
対応 する データベース の ファイル 名 、 あるい は エラー 時 に null を 返し ます
対応 する geoip データベース の ファイル 名 を 返す
連想 配列 を 返し ます
すべて の geoip データベース 形式 について の 詳細 情報 を 返す
ホスト 名 あるい は ip アドレス
成功 し た 場合 に は isp 名 、 アドレス が データベース で 見つ から ない 場合 に は false を 返し ます
インターネットサービスプロバイダ isp 名 を 取得 する
地域 を 探す 対象 と なる ホスト 名 あるい は ip アドレス
成功 し た 場合 に は 連想 配列 、 アドレス が データベース で 見つ から ない 場合 に は false を 返し ます
国 コード および 地域 を 取得 する
二文字 の 国 コード geoip _country _code _by _name を 参照く ださい
二文字 あるい は 二桁 の 地域 コード geoip _region _by _name を 参照く ださい
成功 し た 場合 は 地域 名 、 国 コード と 地域 コード の 組 に 対応 する 地域 が 見つ から なかっ た 場合 は false を 返し ます
国 コード と 地域 コード から 地域 名 を 返す
設定 オプション の 名前
option で 指定 さ れ た php 設定 オプション の 現在 の 値 を 返し 、 エラー の 場合 は false を 返し ます
php 設定 オプション の 値 を 取得 する
調べる オブジェクト
オブジェクト object が インスタンス で ある クラス の 名前 を 返し ます
オブジェクト の クラス 名 を 返す
これ を 渡す と 、 この 関数 は 多次 元 の 配列 を 返す よう に なり ます
定数 名 = & gt ; 定数 値 の 配列 の 配列 を 返し ます
すべて の 定数 の 名前 と その 値 を 連想 配列 として 返す
この 関数 は 、 組込 内部 関数 および ユーザー 定義 関数 を 共に 含む 定義 済み の 全て の 関数 の リスト を 有する 多次 元 配列 を 返し ます
定義済み の 全て の 関数 を 配列 で 返す
モジュール 名
すべて の 関数 を 含む 配列 を 返し ます
ある モジュール の 関数 名 を 配列 として 返す
オプション の format パラメータ が ゼロ 以外 に セット さ れ た 場合 、 get _headers は レスポンス を パース し 、 配列 の キー を セット し ます
対象 と なる url
数 値添 字配 列 あるい は 連想 配列 で ヘッダ を 返し ます
http リクエスト に対する レスポンス 内 で サーバー によっ て 送出 さ れ た 全て の ヘッダ を 取得 する
使用 する エンコーディング
どちら の テーブル を 返す か
以下 の フラグ の ビットマスク による 組み合わせ で 、 どの クォート を テーブル に 含める の か 、 そし て ど の ドキュメント 形式 用 の テーブル に する のか を 指定 し ます
変換 テーブル を 配列 で 返し ます
htmlspecialchars および htmlentities で 使用 さ れる 変換 テーブル を 返す
すべて の ファイル 名 を 含む 配列 を 返し ます
include また は require で 読み込ま れ た ファイル の 名前 を 配列 として 返す
zend 拡張 モジュール のみ を 返し ます
モジュール 名 の 配列 を 返し ます
コンパイル / ロード さ れ て いる 全て の モジュール の 名前 を 配列 として 返す
magic _quotes _gpc が オフ の 場合 に 0 、 そう で ない 場合 に 1 を 返し ます
magic _quotes _gpc の 現在 の 設定 を 得る
html ファイル へ の パス を 表す 文字列
use _include _path を true に 指定 する と 、 include _path ディレクティブ の 内容 に し た がっ て ファイル を 探し ます
パース さ れ た メタタグ を 含む 配列 を 返し ます
ファイル 上 の すべ て の メタタグ 情報 を 配列 に 展開 する
オブジェクト の インスタンス
指定 し た オブジェクト object について 、 その スコープ 内 で アクセス 可能 な 非 static プロパティ を 連想 配列 として 返し ます
指定 し た オブジェクト の プロパティ を 取得 する
調べ たい オブジェクト あるい は クラス の 名前
object が インスタンス あるい は 名前 で ある クラス の 親 クラス 名 を 返し ます
オブジェクト の 親 クラス の 名前 を 取得 する
評価 さ れる リソースハンドル
指定 さ れ た handle が リソース で あっ た 場合 、 この 関数 は その 型 を 表す 文字 列 を 返し ます
リソース 型 を 返す
全て の http リクエストヘッダ の 連想 配列 、 もしく は 失敗 時 に false を 返し ます
全て の http リクエストヘッダ を 取得 する
オプション の パラメータ timestamp は 、 integer 型 の unix タイムスタンプ です
timestamp に 関連 する 情報 を 連想 配列 で 返し ます
日付 / 時刻 情報 を 取得 する
変数 の 名前
varname が 示す 環境 変数 の 値 を 返し 、 環境 変数 varname が 存在 し ない 場合 は false を 返し ます
環境 変数 の 値 を 取得 する
ホスト の ip アドレス
成功 し た 場合 は ホスト 名 を 返し ます
指定 し た ip アドレス に 対応 する インターネットホスト 名 を 取得 する
ホスト 名
ipv 4 アドレス を 返し ます
インターネットホスト 名 に 対応 する ipv 4 アドレス を 取得 する
ホスト 名
ipv 4 アドレス の 配列 を 返し ます
指定 し た インターネットホスト 名 に 対応 する ipv 4 アドレス の リスト を 取得 する
成功時 に は ホスト 名 を 示す 文字列
ホスト 名 を 取得 する
この パラメータ は 、 情報 を 取得 し たい ファイル の 名前 を 指定 し ます
オプション の パラメータ で 、 画像 ファイル から 何ら か の 拡張 情報 を 引き出す こと が 可能 です
最大 7 つの 要素 から なる 配列 を 返し ます
画像 の 大きさ を 取得 する
getimagesize を 参照く ださい
文字列 で 表し た 画像 データ
getimagesize を 参照く ださい
画像 の 大きさ を 文字 列 から 取得 する
現在 の ページ の 最終 更新 時刻 を 返し ます
最終更 新 時刻 を 取得 する
見つかっ た mx レコード の リスト が 、 配列 mxhosts に 格納 さ れ ます
配列 weight を 指定 する と 、 そこに 重み 情報 が 格納 さ れ ます
インターネットホスト 名
何 か レコード が 見つかっ た 場合 に true 、 何 も 見つ から ない か エラー が 発生 し た 場合 に false を 返し ます
指定 し た インターネットホスト 名 に 対応 する mx レコード を 取得 する
現在 の php の プロセス id を 返し 、 エラー の 場合 は false を 返し ます
php の プロセス id を 取得 する
プロトコル 番号
プロトコル 名 を 文字列 で 返し ます
プロトコル 番号 が 指す プロトコル 名 を 取得 する
true を 指定 する と 、 配列 で は なく float で 返し ます
デフォルト で は 配列 を 返し ます
現在 の 時間 を 得る
型 を 調べ たい 変数
返さ れ た 文字 列 は 、 以下 のい ずれ か の 値 を 持ち ます
変数 の 型 を 取得 する
有効 な フラグ は 次 の とおり です
パターン
マッチ する ファイル ／ ディレクトリ を 含む 配列 を 返し ます
パターン に マッチ する パス 名 を 探す
php 5
php 5
ビット and 演算 の 結果 を gmp 数 で 返し ます
ビット and を 計算 する
n を 割る 数
引数 round の 説明 について は 、 gmp _div _q 関数 を 参照く ださい
割られる 数
配列 を 返し ます
除算 を 行い 、 商 と 余り を 得る
割られる 数
a を 割る 数
php 5
正確 な 除算
階乗 を 求める 数
php 5
階乗
php 5
php 5
gmp 数 の 配列 を 返し ます
最大 公約 数 と 乗数 を 計算 する
整数 値 あるい は 文字列
基数
php 5
gmp 数 を 作成 する
php 5
gmpnumber を 整数 に 変換 し た 結果 を 返し ます
gmp 数 を 整数 に 変換 する
php 5
php 5
成功 し た 場合 に gmp 数 、 逆 が 存在 し ない 場合 に false を 返し ます
法 による 逆
php 5
php 5
php 5
ヤコビ 記号
php 5
php 5
php 5
ルジェンドル 記号
php 5
法 として 使用 する 値
php 5
モジュロ 演算
b を 掛け られる 数
a に 掛ける 数
php 5
数値 を 乗算 する
php 5
- a を gmp 数 で 返し ます
符号 を 反転 する
php 5
a より 大きい 次 の 素数 を gmp 数 として 返し ます
次 の 素数 を 見つける
平方数 か どう か を 調べ たい 数
a が 平方数 の 場合 に true 、 その 他 の 場合 に false を 返し ます
平方数 か どう か を 調べる
php 5
a に セット さ れ て いる ビット の 数 を 返し ます
セット さ れ て いる ビット の 数
も とと なる 数
正 の 数 で 、 base を 何乗 する か を 指定 し ます
べき 乗 の 結果 を gmp 数 で 返し ます
べき 乗 を 計算 する
も とと なる 数
正 の 数 で 、 base を 何乗 する か を 指定 し ます
モジュロ
結果 を gmp 数 で 返し ます
べき 乗 と モジュロ を 計算 する
素数 か どう か を 調べ たい 数
reps の 合理 的 な 値 は 5 から 1 0 くらい まで 変動 し ます デフォルト は 1 0 です
この 関数 が 0 を 返す 場合 、 a は 確実 に 素数 で は あり ませ ん
数 が &quot ; おそらく 素数 &quot ; で ある かど う か を 調べる
スキャン する 数
開始 する ビット
ビット が 見つかっ た 場所 の インデックス を 整数 値 で 返し ます
0 を 探す
スキャン する 数
開始 する ビット
ビット が 見つかっ た 場所 の インデックス を 整数 値 で 返し ます
1 を 探す
php 5
a が 正 の 場合 に 1 、 a が 負 の 場合 に - 1 、 そして a が ゼロ の 場合 に 0 を 返し ます
数 の 符号
php 5
平方根 の 整数 部分 を gmp 数 で 返し ます
平方根 を 計算 する
平方根 を 計算 し たい 数
最初 の 要素 が a の 整数 平方根 gmp _sqrt も 参照く ださい 、 2 番目 の 要素 が 余り すなわち 、 a と 最初 の 要素 の 2 乗 の 差 で ある よう な 配列 を 返し ます
余りつき の 平方根
文字列 の 変換 し たい gmp 数
返り値 の 基数
数 を 文字列 で 表し た もの を 返し ます
gmp 数 を 文字列 に 変換 する
a から 引く 数
引か れる 数
php 5
数値 の 減算
plaintext に は 復号 し た テキスト が 格納 さ れ ます
復号 し たい テキスト
gnupg _init あるい は gnupg の コール で 得 られ た gnupg id
成功 し た 場合 、 この 関数 は 署名 の 情報 を 返し 、 復号 さ れ た テキスト を plaintext に 保存 し ます
指定 さ れ た テキスト を 復号 し 、 検証 する
暗号化 し たい テキスト
gnupg _init あるい は gnupg の コール で 得 られ た gnupg id
成功 し た 場合 、 この 関数 は 暗号 化 さ れ た テキスト を 返し ます
指定 し た テキスト を 暗号 化 する
フィンガープリントキー
gnupg _init あるい は gnupg の コール で 得 られ た gnupg id
成功 し た 場合 、 この 関数 は キー の データ を 返し ます
キー を エクスポート する
インポート し たい キー の データ
gnupg _init あるい は gnupg の コール で 得 られ た gnupg id
成功 し た 場合 、 この 関数 は インポート 処理 の 情報 を 配列 で 返し ます
キー を インポート する
ゼロ 以外 の 整数 値 を この 関数 に 渡す と 、 armor 形式 の 出力 を 有効 に し ます デフォルト
gnupg _init あるい は gnupg の コール で 得 られ た gnupg id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
armor 形式 を 切り 替える
エラー 形式
gnupg _init あるい は gnupg の コール で 得 られ た gnupg id
エラー 報告 モード を 設定 する
gnupg _init あるい は gnupg の コール で 得 られ た gnupg id
署名 の 形式
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
署名 方式 を 設定 する
平文 テキスト
署名
the signed text
gnupg _init あるい は gnupg の コール で 得 られ た gnupg id
成功 し た 場合 、 この 関数 は 署名 について の 情報 を 返し ます
署名済 み テキスト を 検証 する
返す 項目 $ extract _type に 基づく の 最大 数
検索 する 文字列
$haystack 内 で の 開始 位置 を バイト 数 で 指定 し ます
次 の 開始 位置 へ の 参照 が 設定 さ れ ます
$size パラメータ の 単位 の 形式 を 指定 し ます
オフセット $ start から 始まり 、 指定 し た $ size と $ extract _type を 満た す 、 デフォルト の 書記 素 クラスタバウンダリ で 終わる 文字 列 を 返し ます
デフォルト の 書記 素 クラスタシーケンス を テキストバッファ から 取り出す 関数
探す 対象 と なる 文字列
探し たい 文字列
オプション の $ offset パラメータ で 、$ haystack のど の 位置 バイト 数 や 文字数 で は なく 、 書記 素単 位 から 探し 始める のか を 指定 し ます
位置 を 表す 整数 値 を 返し ます
大文字 小文字 を 区別 せ ず 、 文字 列内 で 最初 に あらわ れる 場所 の 書記 素単 位 の 位置 を 見つける
探す 対象 と なる 文字列
探し たい 文字列
オプション の $ offset パラメータ で 、$ haystack のど の 位置 バイト 数 や 文字数 で は なく 、 書記 素単 位 から 探し 始める のか を 指定 し ます
位置 を 表す 整数 値 を 返し ます
文字 列内 で 最初 に あらわ れる 場所 の 書記 素単 位 の 位置 を 見つける
探す 対象 と なる 文字列
探し たい 文字列
オプション の $ offset パラメータ で 、$ haystack のど の 位置 バイト 数 や 文字数 で は なく 、 書記 素単 位 から 探し 始める のか を 指定 し ます
位置 を 表す 整数 値 を 返し ます
大文字 小文字 を 区別 せ ず 、 文字 列内 で 最後 に あらわ れる 場所 の 書記 素単 位 の 位置 を 見つける
探す 対象 と なる 文字列
探し たい 文字列
オプション の $ offset パラメータ で 、$ haystack のど の 位置 バイト 数 や 文字数 で は なく 、 書記 素単 位 から 探し 始める のか を 指定 し ます
位置 を 表す 整数 値 を 返し ます
文字 列内 で 最後 に あらわ れる 場所 の 書記 素単 位 の 位置 を 見つける
入力 文字列
探し たい 文字列
true の 場合 、 grapheme _strstr は needle が 最初 に 登場 し た 場所 より 前 の 部分 文字 列 を 返し ます needle は 含め ませ ん
部分 文字 列 、 あるい は needle が 見つ から なかっ た 場合 に false を 返し ます
haystack 文字列 の 中 で 、 needle が 最初 に 登場 し た 場所 以降 の 部分 文字 列 を 返す
入力 文字列
デフォルト の 書記 素単 位 で の 開始 位置
長さ を 書記 素単 位 で 指定 し ます
$string の 部分 文字 列 を 返し ます
部分 文字 列 を 返す
年 を 表す 、- 4 7 1 4 から 9 9 9 9 まで の 数字
日 を 表す 、 1 から 3 1 まで の 数字
月 を 表す 、 1 january から 1 2 december まで の 数字
指定 し た グレゴリウス 日 を ユリウス 積算 日 に なおし た 結果 を 返し ます
グレゴリウス 日 を ユリウス 積算 日 に 変換 する
デコード する データ の 最大 長
デコード する データ
デコード さ れ た 文字列 、 あるい は エラー が 発生 し た 場合 に false を 返し ます
gzip 圧縮 さ れ た 文字列 を デコード する
収縮 さ せる データ
定数 zlib _encoding _* のいずれ か
圧縮 レベル
収縮 さ れ た 文字 列 、 もしく は エラー の 場合 false
文字列 を deflate 圧縮 する
圧縮 レベル を 指定 し ます
エンコード する データ を 指定 し ます
エンコーディングモード を 指定 し ます
エンコード さ れ た 文字 列 、 もしく は エラー 発生 時 に false
gzip 圧縮 さ れ た 文字列 を 作成 する
gz ファイルポインタ は 、 有効 な ファイルポインタ で あり 、 かつ 、 gzopen により オープン でき た ファイル を 指し て いる 必要 が あり ます
gz ファイルポインタ が eof を 指す 、 もしく は エラー が 発生 し た 場合 true 、 そう で なけれ ば false を 返し ます
gz ファイルポインタ が eof かどう か 調べる
ファイル 名 を 指定 し ます
もし include _path に ある ファイル も 検索 し たい 場合 、 この オプションパラメータ に 1 を 設定 する こと が でき ます
ファイル を 含む 配列 で 、 要素毎 に 1 行ずつ 含ん で い ます
gz ファイル 全体 を 配列 に 読み込む
gz ファイルポインタ を 指定 し ます
非 圧縮 の 文字列 、 もしく は eof gzeof とは 異 なる の 場合 に false を 返し ます
gz ファイル へ の ポインタ から 文字 を 得る
取得 する データ 長 を 指定 し ます
gz ファイルポインタ を 指定 し ます
非 圧縮 の 文字列 、 もしく は エラー 時 に false
ファイルポインタ から 1 行 を 得る
デコード する 最大 データ 長 を 指定 し ます
gzdeflate により 圧縮 さ れ た データ を 指定 し ます
オリジナル の 無圧 縮 な データ 、 もしく は エラー 時 に false
deflate 圧縮 さ れ た 文字列 を 解凍 する
ファイル 名 を 指定 し ます
この オプションパラメータ を 1 に する こと により 、 include _path に ある ファイル も 検索 する こと が でき ます
オープン し た ファイル へ の ファイルポインタ を 返し ます
gz ファイル を 開く
gz ファイルポインタ を 指定 し ます
gz から 読み込ん で 解凍 さ れ 、 入力 に 渡さ れ た 文字数
gz ファイル へ の ポインタ から 残り の データ 全部 を 出力 する
読み込む バイト 数 を 指定 し ます
gz ファイルポインタ を 指定 し ます
読み込ま れ た データ
バイナリ 対応 の gz ファイル 読み込み
gz ファイルポインタ を 指定 し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
gz ファイルポインタ の 示す 位置 を 元 に 戻す
書き込む 文字 列 を 指定 し ます
書き込む 解凍 さ れ た バイト 数 を 指定 し ます
gz ファイルポインタ を 指定 し ます
与え られ た gz ファイルストリーム に 書き込ま れ た 解凍 さ れ た バイト 数 を 返し ます
バイナリセーフ な gz ファイル 書き込み
コンパイラ の 実行 を 中止 する
ヘッダ を 送信 する 前 に コール する 関数
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ヘッダ 用 の 関数 を 登録 する
出力 を 開始 し た 行番 号
オプション 引数 の file と line が セット さ れ て いる 場合 、 php の ソースファイル 名 と 出力 が 開始 さ れ た 行番 号 が 、 それぞれ file と line に 格納 さ れ ます
headers _sent は 、 http ヘッダ が まだ 送信 さ れ て い ない 場合 に false 、 そう で ない で ない 場合 に true を 返し ます
ヘッダ が 既 に 送信 さ れ て いる かど う か を 調べる
この オプション の パラメータ は 、 出力 さ れる 行毎 の 最大 文字 数 を 返し ます
ヘブライ 語 の 入力 文字列
物理 表記 の 文字列 を 返し ます
論理 表記 の ヘブライ 語 を 物理 表記 に 変換 する
変換 し たい 1 6 進文 字列
hex _string を 1 0 進 で 表し た 値 を 返し ます
1 6 進数 を 1 0 進数 に 変換 する
この パラメータ を true に する と 、 この 関数 は ハイライト さ れ た コード を 返し ます
ハイライト 表示 する php ファイル へ の パス
return が true の 場合 は 、 ハイライト さ れ た コード を 文字 列 として 返し 、 表示 し ませ ん
ファイル の 構文 ハイライト 表示
オプション の 引数
入力 文字列
以下 の フラグ の ビットマスク による 組み合わせ で 、 クォート の 扱い や ドキュメント の 形式 を 指定 し ます
デコード さ れ た 文字列 を 返し ます
html エンティティ を 適切 な 文字 に 変換 する
arg _separator
もし 数値 インデックス が 基底 と なる 配列 に 使用 さ れ たり numeric _prefix が 指定 さ れ た 場合 、 基底 と なる 配列 の 要素 に対する 数値 インデックス の 前 に これ が 追加 さ れ ます
プロパティ を 含む 配列 もしく は オブジェクト
デフォルト は php _query _rfc 1 7 3 8 です
url エンコード さ れ た 文字列 を 返し ます
url エンコード さ れ た クエリ 文字 列 を 生成 する
属性 の 名前
属性 の 値
hw _api _attribute の インスタンス を 返し ます
hw _api _attribute クラス の インスタンス を 作成 する
ホスト 名
ポート 番号 を 渡さ なかっ た 場合 は 、 4 1 8 が 用い られ ます
hw _api の インスタンス を 返し ます
hw _api クラス の オブジェクト を 返す
追加 する データ
ibase _blob _create で オープン し た blob ハンドル
生成 さ れ た blob に データ を 追加 する
ibase _blob _create で オープン し た blob ハンドル
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
blob の 生成 を 取り消す
ibase _blob _open で オープン し た blob ハンドル
返さ れる データ の サイズ
blob から 最大 len バイト を 返し ます
オープン し た blob から len バイト 分 の データ を 取得 する
interbase リンク id
blob の id
blob について の 情報 を 含む 配列 を 返し ます
blob の 長さ と 他 の 便利 な 情報 を 返す
interbase リンク id
blob の id
後 で ibase _blob _get ととも に 使用 する blob ハンドル を 返し ます
データ の 一部 を 取得 する ため に blob を オープン する
ibase _connect が 返す interbase リンク id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
interbase データベース へ の 接続 を 閉じる
引数 なし で コール さ れ た 場合 、 この 関数 は デフォルトリンク の デフォルト の トランザクション を コミット し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
トランザクション を 閉じ ず に コミット する
引数 なし で コール さ れ た 場合 、 この 関数 は デフォルトリンク の デフォルト の トランザクション を コミット し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
トランザクション を コミット する
interbase リンク id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
データベース を 削除 する
エラーコード を 表す 整数 、 あるい は エラー が 発生 し なかっ た 場合 は false を 返し ます
エラーコード を 返す
interbase 結果 id
fetch _flag は 、 定数 ibase _text および ibase _unixtime を 論理 和 で 指定 し ます
取得 し た 行 に 対応 する 配列 を 返し ます
interbase データベース から 1 行分 の 結果 を 取得 する
interbase 結果 id
フィールド の オフセット
配列 を 返し ます
フィールド に関する 情報 を 得る
ibase _prepare で 準備 し た クエリ
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
プリペアドクエリ により 確保 さ れ た メモリ を 解放 する
ibase _query あるい は ibase _execute で 作成 し た 結果 セット
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
結果 セット を 解放 する
割り当てる 名前
interbase 結果 セット
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
結果 セット に 名前 を 割り 当てる
interbase 結果 id
フィールド の 数 を 整数 値 で 返し ます
結果 セット に おける フィールド 数 を 得る
引数 なし で コール さ れ た 場合 、 この 関数 は デフォルトリンク の デフォルト の トランザクション を ロールバック し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
トランザクション を 閉じ ず に ロールバック する
引数 なし で コール さ れ た 場合 、 この 関数 は デフォルトリンク の デフォルト の トランザクション を ロールバック し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
トランザクション を ロールバック する
イベント の 名前
コールバック は 、 データベース から 特定 の イベント が 送信 さ れ た 場合 に 、 イベント 名 と リンクリソース を 引数 として コール さ れ ます
最大 で 1 5 の イベント を 指定 でき ます
返さ れる 値 は イベント の リソース です
イベント が 発生 し た 際 に コール さ れる コールバック 関数 を 登録 する
interbase リンク id
trans _args は 、 以下 の ibase _read 、 ibase _write 、 ibase _committed 、 ibase _consistency 、 ibase _concurrency 、 ibase _rec _version 、 ibase _rec _no _version 、 ibase _wait および ibase _nowait の 組み合わせ と なり ます
トランザクションハンドル 、 あるい は エラー 時 に false を 返し ます
トランザクション を 開始 する
エンコード さ れ た ヘッダ を 表す 文字列
オプション の charset パラメータ は 、 結果 の 文字 セット を 指定 し ます
mode は 、 iconv _mime _decode _headers が 不正 な 形式 の mime ヘッダフィールド に 遭遇 し た 場合 の 振る 舞い を 定義 し ます
成功 し た 場合 は 連想 配列 を 返し ます
複数 の mime ヘッダフィールド を 一度 に デコード する
mode は 、 iconv _mime _decode が 不正 な 形式 の mime ヘッダフィールド に 遭遇 し た 場合 の 振る 舞い を 定義 し ます
エンコード さ れ た ヘッダ を 表す 文字列
オプション の charset パラメータ は 、 結果 の 文字 セット を 指定 し ます
成功 し た 場合 は デコード さ れ た mime フィールド を 、 デコード 中 に エラー が 発生 し た 場合 は false を 返し ます
mime ヘッダフィールド を デコード する
文字 セット
type に は 以下 の 値 の どれ か を 指定 でき ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
文字 エンコーディング 変換 用 の 設定 を 行なう
start が 負 で ない 場合 、 iconv _substr は str の start 番目 の 文字 （ ゼロ から 数え て ） から 切り出し ます
charset が 指定 さ れ なかっ た 場合 、 文字 セット は ini 設定 iconv
元 の 文字列
length が 指定 さ れ 、 かつ 正 で ある 場合 、 返 さ れる 文字 列 は start から 数え て 最大 length 文字 数分 と なり ます string の 長さ に 依存 し ます
文字列 str の 、 offset と length で 指定 さ れ た 一部 を 返し ます
文字列 の 一部 を 切り出す
入力 文字 セット
出力 文字 セット
変換 する 文字列
変換 さ れ た 文字 列 、 失敗 し た 場合 に false を 返し ます
文字列 を 指定 し た 文字 エンコーディング に 変換 する
id 3v 2 フレーム
フレーム の 長い 名前 、 あるい は エラー 時 に false を 返し ます
id 3v 2 フレーム の 長い 名前 を 取得 する
id 3 タグ に 格納 さ れ て いる すべ て の ジャンル を 含む 配列 を 返し ます
使用 可能 な ジャンル の 一覧 を 取得 する
mp 3 ファイル へ の パス
mp 3 ファイル が バージョン 1
title や artist といっ た キー を 含む 連想 配列 を 返し ます
id 3 タグ に 含ま れる すべ て の 情報 を 取得 する
mp 3 ファイル へ の パス
mp 3 ファイル 内 の id3 タグ の バージョン を 返し ます
id 3 タグ の バージョン を 取得 する
mp 3 ファイル に は バージョン 1
mp 3 ファイル へ の パス
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
既存 の id3 タグ を 削除 する
mp 3 ファイル に は バージョン 1
タグ の キー と 値 を 含む 連想 配列
mp 3 ファイル へ の パス
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
id 3 タグ に 格納 さ れ て いる 情報 を 更新 する
変換 オプション - idna _ で はじまる 定数 idna _error _* 定数 を 除く の 組み合わせ です
idna 2 0 0 3 の 場合 は intl _idna _variant _ 2 0 0 3 、 あるい は uts # 4 6 の 場合 は intl _idna _variant _uts 4 6
変換 する ドメイン 名 php 5 で は 、 utf - 8 に エンコード さ れ て いる 必要 が あり ます
この パラメータ を 使う の は 、 variant が intl _idna _variant _uts 4 6 の 場合 だけ です
idna の ascii 形式 で エンコード さ れ た ドメイン 名
ドメイン 名 を idna の ascii 形式 に 変換 する
変換 オプション - idna _ で はじまる 定数 idna _error _* 定数 を 除く の 組み合わせ です
この パラメータ を 使う の は 、 variant が intl _idna _variant _uts 4 6 の 場合 だけ です
idna の ascii 方式 で エンコード さ れ た 、 変換 対象 の ドメイン 名
idna 2 0 0 3 の 場合 は intl _idna _variant _ 2 0 0 3 、 あるい は uts # 4 6 の 場合 は intl _idna _variant _uts 4 6
unicode の ドメイン 名
idna の ascii 方式 で エンコード さ れ た ドメイン 名 を unicode に 変換 する
ifx _query また は ifx _prepare により 返さ れる 有効 な 結果 id です
行 の 数 を 整数 値 で 返し ます
クエリ で 変更 さ れ た 行 の 数 を 得る
モード & quot ; 0 & quot ; は 、blob を メモリー に 保存 する こと を 意味 し 、 モード & quot ; 1 & quot ; は 、blob を ファイル に 保存 する こと を 意味 し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
全て の select クエリ に関する デフォルト の blob モード を 設定 する
リンク id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
informix 接続 を 閉じる
ユーザー 名 を 表す 文字列
パスワード を 表す 文字列
データベース 名 を 表す 文字列
成功 時 に 接続 id を 、 エラー 時 に false を 返し ます
informix サーバー へ の 接続 を オープン する
blob オブジェクト の id
新規 の blob オブジェクト id を 返し ます
指定 し た blob オブジェクト を 二重化 する
内容 と なる 文字
新しい 文字 オブジェクト の id 、 あるい は エラー 時 に false を 返し ます
文字 オブジェクト を 作成 する
指定 する と 、 指定 し た コード に 対応 する エラーメッセージ を 返し ます
エラーメッセージ を 文字列 で 返し ます
直近 の informix コール の エラーメッセージ を 返す
ifx _query また は ifx _prepare select 型 の クエリ のみ !) により 返さ れ た 有効 な 結果 id です
オプション の パラメータ で 、& quot ; スクロール & quot ; カーソル で & quot ; 取得 &quot ; 操作 を 行う ため の もの です
取得 さ れ た 行 に 対応 する 連想 配列 を 返し ます
行 を 連想 配列 として 取得 する
result _id は 、 ifx _query また は ifx _prepare select 型 の クエリ のみ !) により 返さ れ た 有効 な 結果 id です
result _id の クエリ について 、 フィールド 名 を キー と し 、 sql フィールドプロパティ を データ と し た 連想 配列 を 返し ます
sql フィールドプロパティ の リスト
blob オブジェクト id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
blob オブジェクト を 削除 する
文字 オブジェクト id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
文字 オブジェクト を 削除 する
result _id は 、 ifx _query また は ifx _prepare select 型 の クエリ のみ !) により 返さ れ た 有効 な 結果 id です
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
クエリ に関する リソース を 解放 する
blob オブジェクト id
blob の 内容 を 表す 文字 列 、 あるい は エラー 時 に false を 返し ます
blob オブジェクト の 内容 を 返す
result _id は 、 ifx _query また は ifx _prepare select 型 の クエリ のみ !) により 返さ れ た 有効 な 結果 id です
連想 配列 を 返し ます
クエリ 実行 後 、 sqlca
result _id is a valid resultid returned by ifx _query or ifx _prepare select type queries only !)
この オプション 引数 は 、& lt ;table &gt ; タグ の オプション と する 文字 列 です
取得 さ れ た 行 の 数 、 あるい は エラー の 場合 に false を 返し ます
クエリ 結果 の 全行 を html テーブル に フォーマット する
result _id は 、 ifx _query また は ifx _prepare select 型 の クエリ のみ !) により 返さ れ た 有効 な 結果 id です
result _id に関する クエリ 結果 の カラム 数 、 あるい は エラー の 場合 に false を 返し ます
クエリ の カラム 数 を 返す
result _id は 、 ifx _query また は ifx _prepare select 型 の クエリ のみ !) により 返さ れ た 有効 な 結果 id です
取得 し た 行 の 数 、 あるい は エラー 時 に false を 返し ます
クエリ から 既 に 取得 さ れ た 行 の 数 を 数える
オプション の パラメータ で 、 その カーソル を & quot ; スクロール & quot ; また は & quot ; ホールド & quot ; カーソル と する こと が でき ます
クエリ 文字列
リンク id
もし 、 クエリ に おい て blob byte また は text カラム が ある 場合 、 対応 する & quot ;blob id &quot ; を 有する blobidarray パラメータ を 追加 する こと が 可能 です
後 で ifx _do で 使用 する ため の 結果 id 、 あるい は エラー 時 に false を 返し ます
sql 文 を 実行 用 に 準備 する
モード & quot ; 0 & quot ; は 、blob を 返し 、& quot ; 1 & quot ; は 、 テキスト の 内容 を 有する varchar を 返し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
デフォルト の テキストモード を 設定 する
新規 データ の 文字列
blob オブジェクト id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
blob オブジェクト の 内容 を 更新 する
新規 データ の 文字列
文字 オブジェクト id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
文字 オブジェクト の 内容 を 更新 する
既存 の slob の id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
slob オブジェクト を 削除 する
既存 の slob の id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
slob オブジェクト を 削除 する
ifx _lo _rdonly 、 ifx _lo _wronly 、 ifx _lo _append 、 ifx _lo _rdwr 、 ifx _lo _buffer 、 ifx _lo _nobuffer の 組み合わせ
既存 の slob の id
新しい slob オブジェクト の id 、 あるい は エラー 時 に false を 返し ます
slob オブジェクト を オープン する
既存 の slob の id
シーク 位置 を 表す 整数 値 、 あるい は エラー 時 に false を 返し ます
現在 の ファイル また は シーク 位置 を 返す
書き込む 内容 を 表す 文字列
既存 の slob の id
書き込ん だ バイト 数 を 表す 整数 値 、 あるい は エラー 時 に false を 返し ます
slob オブジェクト に 文字列 を 書き こむ
指定 する と 、 この 関数 は ini 項目 ignore _user _abort に value の 値 を 設定 し ます
以前 の 設定 を 表す integer 値 を 返し ます
クライアント の 接続 が 切断 さ れ た 際 に スクリプト の 実行 を 終了 する かど う か を 設定 する
ルートディレクトリ へ の パス
サーバー の インスタンス 番号 を 返し ます
指定 し た パス の インスタンス 番号 を 返す
imagetype _xxx 定数 のい ずれ かひ とつ
拡張子 の 前 に ドット を つける かどう か
指定 し た 型 に 対応 する 拡張子 を 文字列 で 返し ます
画像 形式 から ファイル の 拡張子 を 取得 する
描画 する 文字
始点 の y 座標
latin 2 エンコーディング の 組み込み の フォント の 場合 は 1 2 3 4 5 のいずれ か 数字 が 大き なほう が 、 より 大きい フォント に 対応 し ます 、 あるい は imageloadfont で 登録 し た フォント の 識別子 のい ずれ か
imagecolorallocate で 作成 し た 色 id
始点 の x 座標
imagecreatetruecolor のよう な 画像 作成 関数 が 返す 画像 リソース
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
垂直 に 文字 を 描画 する
赤 コンポーネント の 値
0 から 1 2 7 まで の 値
緑 コンポーネント の 値
imagecreatetruecolor のよう な 画像 作成 関数 が 返す 画像 リソース
青 コンポーネント の 値
色 id 、 あるい は 作成 に 失敗 し た 場合 に false を 返し ます
画像 で 使用 する 色 を 透過 度 を 指定 し て 作成 する
点 の y 座標
imagecreatetruecolor のよう な 画像 作成 関数 が 返す 画像 リソース
点 の x 座標
色 の インデックス を 返し ます
ピクセル の 色 の インデックス を 取得 する
赤 コンポーネント の 値
緑 コンポーネント の 値
imagecreatetruecolor のよう な 画像 作成 関数 が 返す 画像 リソース
青 コンポーネント の 値
画像 パレット 内 で 、 指定 し た 色 にいちばん 近い 色 の インデックス を 返し ます
指定 し た 色 に 最も 近い 色 の インデックス を 取得 する
赤 コンポーネント の 値
0 から 1 2 7 まで の 値
緑 コンポーネント の 値
imagecreatetruecolor のよう な 画像 作成 関数 が 返す 画像 リソース
青 コンポーネント の 値
画像 パレット 内 で 、 指定 し た 色 にいちばん 近い 色 の インデックス を 返し ます
指定 し た 色 + アルファ 値 に 最も 近い 色 の インデックス を 取得 する
赤 コンポーネント の 値
緑 コンポーネント の 値
imagecreatetruecolor のよう な 画像 作成 関数 が 返す 画像 リソース
青 コンポーネント の 値
指定 し た 色 に 最も 近い 色合 い 、 白 、 黒 を 有する 色 の インデックス を 返し ます
色合い 、 白 、 黒 を 有する 色 の インデックス を 得る
imagecreatetruecolor のよう な 画像 作成 関数 が 返す 画像 リソース
色 id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
イメージ の 色 リソース を 開放 する
赤 コンポーネント の 値
緑 コンポーネント の 値
imagecreatetruecolor のよう な 画像 作成 関数 が 返す 画像 リソース
青 コンポーネント の 値
指定 し た 色 の 、 パレット 内 で の インデックス を 返し ます
指定 し た 色 の インデックス を 取得 する
赤 コンポーネント の 値
0 から 1 2 7 まで の 値
緑 コンポーネント の 値
imagecreatetruecolor のよう な 画像 作成 関数 が 返す 画像 リソース
青 コンポーネント の 値
イメージ の パレット に おける 、 指定 し た 色 + アルファ 値 の インデックス を 返し ます
指定 し た 色 + アルファ 値 の インデックス を 取得 する
赤 コンポーネント の 値
0 から 1 2 7 まで の 値
緑 コンポーネント の 値
imagecreatetruecolor のよう な 画像 作成 関数 が 返す 画像 リソース
青 コンポーネント の 値
色インデックス を 返し ます
指定 し た 色 + アルファ 値 また は 最も 近い 色 の インデックス を 取得 する
パレット の インデックス
アルファコンポーネント の 値
赤 コンポーネント の 値
緑 コンポーネント の 値
imagecreatetruecolor のよう な 画像 作成 関数 が 返す 画像 リソース
青 コンポーネント の 値
指定 し た パレットインデックス の 色 を 設定 する
imagecolorallocate で 指定 し た 色 id
imagecreatetruecolor のよう な 画像 作成 関数 が 返す 画像 リソース
新しい 透明 色 の id 指定 し なかっ た 場合 は 現在 設定 さ れ て いる id を 返し ます
透明色 を 定義 する
3x 3 の 配列
畳み込み 結果 の 除数
imagecreatetruecolor のよう な 画像 作成 関数 が 返す 画像 リソース
色 オフセット
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
div および offset の 係数 を 使用 し 、 3x 3 の 畳み込み 配列 を 適用 する
作成元 の x 座標
コピー 元 の 幅
作成元 の y 座標
コピー 元 の 高さ
gd 2 画像 へ の パス
成功 し た 場合 に 画像 リソース id 、 エラー 時 に false を 返し ます
gd 2 ファイル また は url の 指定 し た 部分 から 新規 イメージ を 生成 する
jpeg 画像 へ の パス
成功 し た 場合 に 画像 リソース id 、 エラー 時 に false を 返し ます
新しい 画像 を ファイル あるい は url から 作成 する
png 画像 へ の パス
成功 し た 場合 に 画像 リソース id 、 エラー 時 に false を 返し ます
新しい 画像 を ファイル あるい は url から 作成 する
wbmp 画像 へ の パス
成功 し た 場合 に 画像 リソース id 、 エラー 時 に false を 返し ます
新しい 画像 を ファイル あるい は url から 作成 する
webp 画像 へ の パス
成功 し た 場合 に 画像 リソース id 、 エラー 時 に false を 返し ます
新しい 画像 を ファイル あるい は url から 作成 する
xbm 画像 へ の パス
成功 し た 場合 に 画像 リソース id 、 エラー 時 に false を 返し ます
新しい 画像 を ファイル あるい は url から 作成 する
xpm 画像 へ の パス
成功 し た 場合 に 画像 リソース id 、 エラー 時 に false を 返し ます
新しい 画像 を ファイル あるい は url から 作成 する
画像 の 高さ
画像 の 幅
成功 し た 場合 に 画像 リソース id 、 エラー 時 に false を 返し ます
truecolor イメージ を 新規 に 作成 する
塗りつぶし 色
左上 の x 座標
左上 の y 座標 0
右下 の x 座標
右下 の y 座標
imagecreatetruecolor のよう な 画像 作成 関数 が 返す 画像 リソース
常 に true を 返し ます
破線 を 描画 する
imagecreatetruecolor のよう な 画像 作成 関数 が 返す 画像 リソース
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
画像 を 破棄 する
楕円 の 高さ
楕円 の 色 を 、 imagecolorallocate で 作成 し た 画像 id で 指定 し ます
中心 の x 座標
中心 の y 座標
imagecreatetruecolor のよう な 画像 作成 関数 が 返す 画像 リソース
楕円 の 幅
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
楕円 を 描画 する
開始 位置 の y 座標
塗りつぶし 色
imagecreatetruecolor のよう な 画像 作成 関数 が 返す 画像 リソース
開始 位置 の x 座標
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
塗り潰す
多角形 の 頂点 の 座標 x および y を 含む 配列
imagecreatetruecolor のよう な 画像 作成 関数 が 返す 画像 リソース
頂点 の 総数
imagecolorallocate で 作成 し た 色 id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
塗りつぶし た 多角 形 を 描画 する
終了 位置 の x 座標
塗りつぶし 色
終了 位置 の y 座標
開始 位置 の x 座標
開始 位置 の y 座標
imagecreatetruecolor のよう な 画像 作成 関数 が 返す 画像 リソース
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
塗りつぶし た 矩形 を 描画 する
img _filter _brightness : 輝度 レベル
img _filter _colorize : 青 コンポーネント の 値
filtertype は 、 以下 のい ずれ か です
img _filter _colorize : 緑 コンポーネント の 値
imagecreatetruecolor のよう な 画像 作成 関数 が 返す 画像 リソース
img _filter _colorize : アルファチャネル
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
画像 に フィルタ を 適用 する
latin 2 エンコーディング の 組み込み の フォント の 場合 は 1 2 3 4 5 のいずれ か 数字 が 大き なほう が 、 より 大きい フォント に 対応 し ます 、 あるい は imageloadfont で 登録 し た フォント の 識別子 のい ずれ か
フォント の 高さ を ピクセル で 返し ます
フォント の 高さ を 取得 する
truetype フォント の ファイル 名 url も 可
text を 取得 する 角度
extrainfo の 配列 の インデックス キー 型 意味 linespacing float 描画 時 の 行間 を 定義 し ます
取得 し たい 文字列
フォントサイズ
imageftbbox は 8 つの 要素 から なる 配列 を 返し ます
freetype 2 による フォント を 用い た テキスト を 囲む箱 を 取得 する
ファイル の 保存 先 の パス
imagecreatetruecolor のよう な 画像 作成 関数 が 返す 画像 リソース
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
gd イメージ を ブラウザ また は ファイル に 出力 する
ファイル の 保存 先 の パス
imagecreatetruecolor のよう な 画像 作成 関数 が 返す 画像 リソース
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
画像 を ブラウザ あるい は ファイル に 出力 する
成功 し た 場合 に 画像 リソース の id 、 失敗 し た 場合 に false を 返し ます
画面 全体 を キャプチャ する
hwnd ウィンドウ id
アプリケーション の クライアント 領域 を 含める かどう か
成功 し た 場合 に 画像 リソース の id 、 失敗 し た 場合 に false を 返し ます
ウィンドウ を キャプチャ する
imagecreatetruecolor のよう な 画像 作成 関数 が 返す 画像 リソース
image が truecolor の 場合 に true 、 それ 以外 の 場合 に false を 返し ます
画像 が truecolor かどう か 調べる
フォントファイル 形式 は 現在 は バイナリ で 、 アーキクチャ に 依存 し ます
フォント id を 返し ます
新しい フォント を 読み込む
ファイル の 保存 先 の パス
imagecreatetruecolor のよう な 画像 作成 関数 が 返す 画像 リソース
圧縮 レベル
png ファイル の 大きさ を 小さく し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
png イメージ を ブラウザ また は ファイル に 出力 する
imagecreatetruecolor のよう な 画像 作成 関数 が 返す 画像 リソース
多角形 の 頂点 から なる php の 配列 で 、 次 のよう に なり ます
頂点 の 総数
imagecolorallocate で 作成 し た 色 id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
多角形 を 描画 する
imagepsloadfont が 返す フォントリソース
この ファイル の 正しい フォーマット は 、 t 1libs の ドキュメント に 記述 さ れ て い ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
フォント の 文字 エンコードベクトル を 変更 する
imagepsloadfont が 返す フォントリソース
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
postscript type 1 フォント 用 メモリ を 解放 する
postscript フォントファイル へ の パス
全 て 正常 に 処理 さ れ た 場合 、 有効 な フォント id が 返さ れ 、 後 で 使用 する こと が でき ます
ファイル から postscript type 1 フォント を ロード する
imagecreatetruecolor のよう な 画像 作成 関数 が 返す 画像 リソース
左上 の x 座標
右下 の x 座標
imagecolorallocate で 作成 し た 色 id
右下 の y 座標
左上 の y 座標
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
矩形 を 描画 する
アルファチャネル を 保存 する か 否か
imagecreatetruecolor のよう な 画像 作成 関数 が 返す 画像 リソース
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
png 画像 を 保存 する 際 に （ 単一色 の 透過 設定 で は ない ） 完全 な アルファチャネル 情報 を 保存 する フラグ を 設定 する
imagecreatetruecolor のよう な 画像 作成 関数 が 返す 画像 リソース
補間 方法
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
補間 方法 を 設定 する
latin 2 エンコーディング の 組み込み の フォント の 場合 は 1 2 3 4 5 のいずれ か 数字 が 大き なほう が 、 より 大きい フォント に 対応 し ます 、 あるい は imageloadfont で 登録 し た フォント の 識別子 のい ずれ か
imagecolorallocate で 作成 し た 色 id
左上隅 の y 座標
書き出す 文字列
imagecreatetruecolor のよう な 画像 作成 関数 が 返す 画像 リソース
左上隅 の x 座標
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
文字列 を 水平 に 描画 する
左下隅 の x 座標
latin 2 エンコーディング の 組み込み の フォント の 場合 は 1 2 3 4 5 のいずれ か 数字 が 大き なほう が 、 より 大きい フォント に 対応 し ます 、 あるい は imageloadfont で 登録 し た フォント の 識別子 のい ずれ か
imagecolorallocate で 作成 し た 色 id
書き出す 文字列
左下隅 の y 座標
imagecreatetruecolor のよう な 画像 作成 関数 が 返す 画像 リソース
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
文字列 を 垂直 に 描画 する
imagecreatetruecolor のよう な 画像 作成 関数 が 返す 画像 リソース
image の 高さ 、 あるい は エラー 時 に false を 返し ます
画像 の 高さ を 取得 する
imagecreatetruecolor のよう な 画像 作成 関数 が 返す 画像 リソース
イメージ に ディザー を かける こと を 指定 し ます
パレット に 保持 さ れる 最大 の 色数 を 設定 し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
truecolor イメージ を パレットイメージ に 変換 する
測定 する text の 角度 度単 位
truetype フォントファイル の ファイル 名 url
測定 する 文字列
フォントサイズ
imagettfbbox は 、 テキスト の bounding box を 作成 する ため の 4 点 を 表現 する 8 個 の 要素 から なる 配列 を 返し ます
typetype フォント を 使用 し た テキスト の bounding box を 生成 する
ファイル の 保存 先 の パス
imagecreatetruecolor のよう な 画像 作成 関数 が 返す 画像 リソース
この パラメータ で 、 前景 の 色 を 指定 でき ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
画像 を ブラウザ あるい は ファイル に 出力 する
ファイル の 保存 先 の パス
imagecreatetruecolor のよう な 画像 作成 関数 が 返す 画像 リソース
この パラメータ で 、 前景 の 色 を 指定 でき ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
xbm 画像 を ブラウザ あるい は ファイル に 出力 する
メッセージ 番号
オプション の options は ビットマスク で あり 、 以下 の 要素 の 組み合わせ と なり ます
imap _open が 返す imap ストリーム
指定 し た メッセージ の 本文 を 文字列 で 返し ます
メッセージ 本文 を 読む
メッセージ 番号
imap _open が 返す imap ストリーム
読み込む body セクション
オブジェクト の 情報 を 返し ます
指定 し た メッセージ の 指定 し た body セクション の 構造 を 読み込む
imap _open が 返す imap ストリーム
以下 の プロパティ を もつ オブジェクト の 情報 を 返し ます
現在 の メールボックス を チェック する
オプション options は ビットマスク で あり 、 以下 の 組み合わせ と なり ます
imap _open が 返す imap ストリーム
メッセージ 番号 の シーケンス
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
メッセージ の フラグ を クリア する
imap _open が 返す imap ストリーム
メールボックス 名
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
新しい メールボックス を 作る
メッセージ 番号
imap _open が 返す imap ストリーム
ft _uid を 指定 する と 、 引数 msg _number を uid として 処理 する こと を 関数 に 指示 でき ます
returns true
現在 の メールボックス から 削除 する メッセージ に 印 を 付ける
この 関数 は 、 最後 に imap _errors コール を 行っ て から 、 また は その ページ の 処理 を 開始 し て から 発生 し た 全て の imap エラーメッセージ の 配列 を 返し ます
発生 し たすべ て の imap エラー を 返す
imap _open が 返す imap ストリーム
true を 返し ます
削除用 に マーク さ れ たすべて の メッセージ を 削除 する
メッセージ 番号
パート 番号
imap _open が 返す imap ストリーム
ビットマスク で あり 、 以下 の 組合 わせ と なり ます
指定 さ れ た メッセージ 本文 中 の 特定 の セクション を テキスト 文字 列 で 返し ます
メッセージ 本文 中 の 特定 の セクション を 取り出す
メッセージ 番号
imap _open が 返す imap ストリーム
オプション の パラメータ で 、 ft _uid のみ が 指定 可能 です
オブジェクト を 返し ます
特定 の メッセージ の 構造 を 読み込む
imap _open が 返す imap ストリーム
破棄 し たい キャッシュ を 指定 し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
imap キャッシュ を クリア する
imap _open が 返す imap ストリーム
quota _root は 、 通常 user
指定 し た メールボックス の limit と usage を キー と し た 整数 値 を 配列 として 返し ます
クオータレベル の 設定 、 メールボックス 毎 の 使用 状況 を 取得 する
imap _open が 返す imap ストリーム
メールボックス 名
&quot ;folder &quot ; =& gt ; & quot ;acl &quot ; 形式 の 連想 配列 を 返し ます
与え られ た メールボックス の acl を 取得 する
ref は 、 通常 は imap _open で 指定 し た サーバー 情報 です
imap _open が 返す imap ストリーム
検索 を 開始 する メールボックス の 階層 を 指定 し ます
メールボックス 情報 を 有する オブジェクト の 配列 を 返し ます
購読 中 の 全 メールボックス の 一覧 を 取得 する
imap _open が 返す imap ストリーム
ヘッダ 情報 で フォーマット さ れ た 文字 列 の 配列 を 返し ます
メールボックス 内 の すべ て の メッセージ の ヘッダ を 返す
現在 の ページ に 生じ た 直近 の imap エラーメッセージ の 全文 を 返し ます
ページリクエスト 時 に 生じ た 直近 の imap エラー を 返す
imap _open が 返す imap ストリーム
通常 、 ref は imap _open で 述べ られ て いる サーバー 定義 です
検索 を 開始 する メールボックス の 階層 を 指定 し ます
メールボックス の 名前 を 含む 配列 を 返し ます
メールボックス の リスト を 読み込む
imap _open が 返す imap ストリーム
通常 、 ref は imap _open で 述べ られ て いる サーバー 定義 です
検索 する 文字列
検索 を 開始 する メールボックス の 階層 を 指定 し ます
content を テキスト に 持つ メールボックス の 名前 を 配列 で 返し ます
指定 し た テキスト に マッチ する メールボックス の 一覧 を 返す
本文 の 配列
ヘッダフィールド の 連想 配列
mime メッセージ を 返し ます
指定 し た エンベロープ および ボディセクション に 基づい て mime メッセージ を 作成 する
imap _open が 返す imap ストリーム
メールボックス 名
options は ビットマスク で あり 、 以下 の 組み合わせ です
msglist は 、 & raquo ;& nbsp ;rfc 2 0 6 0 に 記述 さ れ た よう に ただ の メッセージ 番号 で は なく 、 範囲 を 示し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
指定 さ れ た メッセージ を メールボックス に コピー する
imap _open が 返す imap ストリーム
options は ビットマスク で あり 、 ひとつ の オプション を とり ます
メールボックス 名
msglist は 、 & raquo ;& nbsp ;rfc 2 0 6 0 に 記述 さ れ た よう に ただ の メッセージ 番号 で は なく 、 範囲 を 示し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
指定 さ れ た メッセージ を メールボックス に 移動 する
受信 者
リターンパス を 指定 する ため に rpath パラメータ を 使用 し て くだ さい
bcc で 指定 し た 受信 者 は mail を 受信 し ます が 、 ヘッダ から は 除外 さ れ ます
メール の 本文
メール の 件名
メール に 設定 する 追加 ヘッダ 文字列
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
e -mail メッセージ を 送信 する
imap _open が 返す imap ストリーム
以下 の プロパティ を 有する オブジェクト を 返し ます
現在 の メールボックス に関する 情報 を 得る
imap _open が 返す imap ストリーム
メッセージ の uid
指定 し た uid の メッセージ 番号 を 返し ます
指定 し た uid の メッセージ 番号 を 返す
imap _open が 返す imap ストリーム
現在 の メールボックス の メッセージ 数 を 返し ます
現在 の メールボックス の メッセージ 数 を 取得 する
imap _open が 返す imap ストリーム
現在 の メールボックス に ある 新しい メッセージ の 数 を 返し ます
現在 の メールボックス に ある 新規 メッセージ 数 を 取得 する
メールボックス 名 mailbox は 、 サーバー 名 の 部分 と 使用 する サーバー に おける メールボックス へ の パス から 構成 さ れ ます
接続 試行 の 最大 数
username の パスワード
接続 パラメータ
options は ビットマスク で あり 、 以下 の 組み合わせ と なり ます
ユーザー 名
成功 し た 場合 は imap ストリーム を 、 失敗 し た 場合 は false を 返し ます
メールボックス へ の imap ストリーム を オープン する
imap _open が 返す imap ストリーム
ストリーム が まだ 有効 で あれ ば true を 、 そう で なけれ ば false を 返し ます
imap ストリーム が アクティブ か どう か を 調べる
quoted -printable 文字列
8 ビット 文字 列 を 返し ます
quoted -printable 文字列 を 8 ビット 文字 列 に 変換 する
デフォルト の ホスト 名
アドレス を 含む 文字列
オブジェクト の 配列 を 返し ます
アドレス 文字 列 を 解釈 し ます
パース さ れ た ヘッダデータ
デフォルト の ホスト 名
imap _header が 返す オブジェクト と 似た もの を 返し ます
文字列 から メールヘッダ を 解釈 する
メッセージ 番号
パート 番号
imap _open が 返す imap ストリーム
保存先 ファイル へ の パス を 表す 文字 列 、 あるい は fopen が 返す ファイル 記述子
ビットマスク で あり 、 以下 の 組合 わせ と なり ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
指定 し た 本文部 を ファイル に 保存 する
imap _open が 返す imap ストリーム
文字列 の 検索 の 際 に 使う mime 文字 セット
空白 で 区切 られ た 文字列 で 、 以下 の キーワード が 使用 可能 です
options に 指定 できる 値 は se _uid です
メッセージ 番号 あるい は uid の 配列 を 返し ます
指定 し た 検索 条件 に マッチ する メッセージ を 配列 として 返す
権限 を 付与 する ユーザー
imap _open が 返す imap ストリーム
メールボックス 名
その ユーザー に 付与 する 権限
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
指定 し た メールボックス の acl を 設定 する
imap _open が 返す imap ストリーム
これ を 1 に する と 、 逆順 に ソート し ます
options は ビットマスク で 、 以下 の 組み合わせ と なり ます
criteria は 、 次 のどれ か とし ます ひとつ のみ
文字列 の 検索 の 際 に 使う mime 文字 セット
imap 2 フォーマット の 検索 条件 文字列
指定 し た パラメータ で ソート し た メッセージ 番号 の 配列 を 返し ます
メッセージヘッダ の 配列 を ソート する
imap _open が 返す imap ストリーム
メールボックス 名
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
メールボックス を 購読 する
imap _open が 返す imap ストリーム
imap _thread は 、 references で スレッド 化 し た メッセージ の ツリー を 含む 連想 配列 を 返し ます
スレッド 化 し た メッセージ の ツリー を 返す
imap _open が 返す imap ストリーム
メールボックス 名
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
メールボックス の 購読 を やめる
修正版 utf - 7 エンコーディング の 文字列
text と 同じ 内容 の 文字 を iso - 8 8 5 9 - 1 で エンコード し た 文字列 を 返し ます
修正版 utf - 7 エンコード さ れ た 文字列 を デコード する
iso - 8 8 5 9 - 1 文字列
data を 修正 版 utf - 7 で エンコード し た 文字列 を 返し ます
iso - 8 8 5 9 - 1 文字列 を 修正 版 utf - 7 テキスト に 変換 する
連結 し たい 文字 列 の 配列
デフォルト は 空文 字列 です
すべて の 配列 要素 の 順序 を 変え ず に 、 各要 素間 に glue 文字列 を はさん で 1 つの 文字 列 に して 返し ます
配列 要素 を 文字列 により 連結 する
types パラメータ を 使用 する と 、 インポート する リクエスト 変数 の 種類 を 指定 可能 です
変数 名 の 接頭 辞 として 使用 さ れ 、 グローバルスコープ に インポート さ れる 全て の 変数 名 の 前 に 付加 さ れ ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
get / post / cookie 変数 を グローバルスコープ に インポート する
接続 リンク id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ingres データベース 接続 を 閉じる
接続 リンク id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
トランザクション を コミット する
データベース 名
ingres の ユーザー 名
ingres _connect の オプション オプション 名 型 説明 例 date _century _boundary integer 2 桁 で 指定 し た 年 を 、 今世紀 と 判断 する か 来世 紀 と 判断 する か の 閾値
username の パスワード
成功時 に ingres リンクリソース 、 失敗 し た 場合 に false を 返し ます
ingres データベース へ の 接続 を オープン する
クエリ 結果 id
アクティブ な カーソル の 名前 を 含む 文字 列 を 返し ます
指定 し た 結果 リソース の カーソル 名 を 取得 する
接続 リンク id
直近 の エラー 番号 を 整数 値 で 返し ます
直近 に 発生 し た ingres エラー 番号 を 取得 する
接続 リンク id
直近 の エラー の 内容 を 文字列 で 返し ます
直近 に 発生 し た エラー の エラーメッセージ を 取得 する
接続 リンク id
直近 の sqlstate を 文字列 で 返し ます
直近 に 発生 し た sqlstate エラーコード を 取得 する
接続 リンク id
パース する 文字列
エスケープ し た データ を 含む 文字 列 を 返し ます
クエリ で 使う ため に 特殊 文字 を エスケープ する
クエリ 結果 id
この クエリ で 使う パラメータ の 値 の 配列
パラメータ に 渡し た 値 の 型 を 表す 文字列
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
プリペアドクエリ を 実行 する
クエリ 結果 id
result _type に は 、 数値 添字 の 場合 に ingres _num 、 連想 配列 の 場合 に ingres _assoc 、 両方 の 場合 に ingres _both デフォルト を 指定 可能 です
取得 し た レコード 行 に対応 する 配列 を 返し ます
1 行分 の 結果 を 配列 に 取得 する
クエリ 結果 id
取得 し た 行 に 対応 する 連想 配列 を 返し ます
1 行分 の 結果 を 連想 配列 に 取得 する
クエリ 結果 id
オプション の 引数 result _type は 定数 で あり 、 次 の 値 の どれ かと なり ます : ingres _assoc ingres _num ingres _both
取得 し た レコード 行 を オブジェクト として 返し ます
1 行分 の 結果 を オブジェクト として 取得 する
クエリ 結果 id
取得 し た レコード 行 を 有する 配列 を 返し ます
1 行分 の 結果 を 数値 添字 配列 として 取得 する
クエリ 結果 id
index は 、 長さ を 取得 し たい カラム の 番号 です
フィールド の 長さ を 返し ます
フィールド 長 を 得る
クエリ 結果 id
index は 、 null が 設定 可能 か どう か を 取得 し たい フィールド です
ingres _field _nullable は 、 フィールド に null が 設定 可能 な 場合 に true 、 設定 でき ない 場合 に false を 返し ます
フィールド に null 値 を 設定 可能 か どう か 調べる
クエリ 結果 id
index は 、 精度 を 取得 し たい フィールド です
フィールド の 精度 を 返し ます
フィールド の 精度 を 得る
クエリ 結果 id
index は 、 スケール を 取得 し たい フィールド です
フィールド の スケール を 返し ます
フィールド の スケール を 得る
クエリ 結果 id
index は 、 型 を 取得 し たい フィールド です
ingres _field _type は クエリ 結果 の フィールド 型 、 失敗 し た 場合 に false を 返し ます
クエリ 結果 に おい て フィールド の 型 を 得る
接続 リンク id
ingres _next _error は 、 取得 できる エラー が まだ 残っ て いる 場合 に true を 返し ます
次 の ingres エラー を 取得 する
クエリ 結果 id
フィールド の 数 を 返し ます
直近 の クエリ により 返さ れ た フィールド の 数 を 得る
クエリ 結果 id
delete insert update クエリ の 場合 、 ingres _num _rows は 、 その クエリ により 作用 さ れ た 行 レコード の 数 を 返し ます
クエリ が 変更 し たり 返し たり し た レコード の 数 を 取得 する
データベース 名
渡せる オプション の 一覧 は ingres _connect を 参照く ださい
ingres の ユーザー 名
username の パスワード
成功 し た 際 に ingres リンクリソース 、 失敗 し た 場合 に false を 返し ます
ingres データベース へ の 持続 的 接続 を オープン する
接続 リンク id
ingres の ドキュメント ingres sql reference guide を 参照く ださい に 書か れ た 正しい 形式 の sql クエリ
ingres _prepare は クエリ の 結果 id を 返し ます
後 で 実行 する ため の クエリ を 準備 する
接続 リンク id
クエリ で 使用 する パラメータ の 値 の 配列
渡さ れ た パラメータ の 値 の 型 を 含む 文字列
有効 な sql クエリ ingres ドキュメント に ある ingres sql リファレンスガイド を 参照く ださい
ingres _query は 、 成功 し た 場合 に クエリ 結果 id 、 それ 以外 の 場合 に false を 返し ます
ingres に sql クエリ を 送信 する
オプション 名 と その 値 の ペア の 配列
接続 リンク id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
環境 を 設定 し て 出力 オプション を 制御 する
詳細 な 設定 を 取得 する か 、 あるい は 各 設定 の 現在 の 値 のみ を 取得 する か
オプション で 指定 する 拡張 モジュール 名
ディレクティブ 名 を キー と する 連想 配列 を 返し ます
すべて の 設定 オプション を 得る
全て の オプション が ini _set を 使用 し て 変更 する こと が 可能 なわけ で は あり ませ ん
オプション の 新しい 値
成功 し た 場合 に 元 の 値 、 失敗 し た 場合 に false を 返し ます
設定 オプション の 値 を 設定 する
inotify _init が 返す リソース
監視 する イベント
監視 対象 の ファイル あるい は ディレクトリ
返り値 は 、( inotify インスタンス 内 で 一意 な 監視 記述子 です
初期 化済 み の inotify インスタンス に 監視 対象 を 追加 する
ストリームリソース 、 あるい は エラー 時 に false を 返し ます
inotify インスタンス を 初期化 する
inotify _init が 返す リソース
inotify イベント の 配列 、 を 返し ます
inotify インスタンス から イベント を 読み込む
デフォルト で _ _ autoload を コール する かどう か
インターフェイス 名
interface _name で 与え られ た インターフェイス が 宣言 さ れ て いれ ば true を 返し ます
インターフェイス が 宣言 さ れ て いる かど う か を 確認 する
icu の エラーコード
エラーコード 定数 と 同じ 名前 の 文字列 を 返し ます
指定 し た エラーコード に 対応 する 名前 を 取得 する
直近 の api 関数 の コール が 返す エラーコード を 返し ます
直近 の エラーコード を 取得 する
直近 の api 関数 の コール で 発生 し た エラー の 説明 を 返し ます
直近 の エラー の 説明 を 取得 する
変換 の ため の 基数 注意 : base が 0 の 場合 は 、 var の フォーマット に 基づい て 利用 する 基数 を 決め ます
整数 に 変換 する スカラー 値
成功 時 は var の 整数 値 、 失敗 時 は 0
変数 の 整数 として の 値 を 取得 する
標準 形式 の アドレス
長整 数値 、 あるい は ip _address が 不正 な 形式 の 場合 に false を 返し ます
ドット 表記 の ipv 4 ip アドレス を 、 長整 数 表現 に 変換 する
評価 する 変数
var が 配列型 の 場合 true 、 そう で ない 場合 false を 返し ます
変数 が 配列 か どう か を 検査 する
評価 する 変数
var が boolean で ある 場合 に true 、 それ 以外 の 場合 に false を 返し ます
変数 が boolean で ある か を 調べる
チェック する 値
true の 場合 、 この 関数 は 単 に name が 関数 また は メソッド で ある かど う か だけ を 調べ ます
&quot ; 呼び出し名 &quot ; を 受け取り ます
var が コール 可能 な 場合 に true 、 それ 以外 の 場合 に false を 返し ます
引数 が 、 関数 として コール 可能 な 構造 で ある かど う か を 調べる
ファイル へ の パス
ファイル が 存在 し て 、 かつ それ が ディレクトリ で あれ ば true 、 それ 以外 の 場合 は false を 返し ます
ファイル が ディレクトリ か どう か を 調べる
ファイル へ の パス
ファイル が 存在 し 、 かつ それ が 実行 可能 な 場合 に true 、 エラー 時 に false を 返し ます
ファイル が 実行 可能 か どう か を 調べる
ファイル へ の パス
ファイル が 存在 し 、 かつ それ が 通常 の ファイル で ある 場合 に true 、 それ 以外 の 場合 に false を 返し ます
通常 ファイル か どう か を 調べる
調べる 値
val が 無限 大 で ある 場合 に true 、 そう で ない 場合 に false を 返し ます
値 が 無限 大 で ある かど う か を 判定 する
調べる 値
val が & # 0 3 9 ; 非数 値 not a number & # 0 3 9 ; の 場合 に true 、 そう で ない 場合 に false を 返し ます
値 が 数値 で ない か どう か を 判定 する
評価 する 変数
もし var が object 型 の 場合 true 、 そう で ない 場合 は false を 返し ます
変数 が オブジェクト か どう か を 検査 する
ファイル へ の パス
filename で 指定 し た ファイル あるい は ディレクトリ が 存在 し 、 それが 読み込み 可能 で あれ ば true 、 それ 以外 の 場合 に false を 返し ます
ファイル が 存在 し 、 読み込み 可能 で ある かど う か を 知る
評価 する 変数
var が resource の 場合 に true 、 それ 以外 の 場合 に false を 返し ます
変数 が リソース か どう か を 調べる
検査 する オブジェクト
エラー 時 に true 、 それ 以外 の 場合 に false を 返し ます
soap コール が 失敗 し た かどう か を 調べる
評価 する 変数
var の 型 が string で ある 場合 に true 、 それ 以外 の 場合 に false を 返し ます
変数 の 型 が 文字 列 か どう か を 調べる
調べ たい ファイル 名
filename が 存在 し て 書き込み 可能 な 場合 に true を 返し ます
ファイル が 書き込み 可能 か どう か を 調べる
別 の 変数
調べ たい 変数
var が 存在 し て null 以外 の 値 を とれ ば true 、 そう で なけれ ば false を 返し ます
変数 が セット さ れ て いる こと 、 そして null で ない こと を 検査 する
すべて の 要素 に対し て コール し たい コールバック 関数
順次 処理 し たい クラス
コールバック 関数 に 渡す 引数
イテレータ の 要素 数 を 返し ます
ユーザー 関数 を イテレータ の すべ て の 要素 で コール する
カウント し たい イテレータ
iterator の 要素 数 を 返し ます
イテレータ に ある 要素 を カウント する
イテレータ の 要素 の キー を インデックス として 使用 する かどう か
コピー し たい イテレータ
iterator の 要素 を 含む 配列 を 返し ます
イテレータ を 配列 に コピー する
暦 の 曜日 モード モード 意味 0 デフォルト 整数 で 曜日 番号 0 = sunday 1 = monday 等 を 返し ます
ユリウス 積算 日 を 表す 整数 値
グレゴリウス 暦 の 曜日 を 表す 数値 あるい は 文字列 を 返し ます
曜日 を 返す
ユリウス 積算 日 を 表す 整数 値
フランス 革命 暦 の 日付 を & quot ;月 / 日 / 年 &quot ; 形式 の 文字 列 で 返し ます
ユリウス 積算 日 を フランス 革命 暦 共和暦 に 変換 する
ユリウス 積算 日 を 表す 整数 値
グレゴリウス 暦 の 日付 を & quot ;月 / 日 / 年 &quot ; 形式 の 文字 列 で 返し ます
ユリウス 積算 日 を グレゴリウス 日 に 変換 する
パラメータ hebrew が true に 設定 さ れ て いる 場合 、 ヘブライ 語 の 文字 列形 式 で の 出力 の ため に fl が 使用 さ れ ます
使用 可能 な フォーマット は cal _jewish _add _alafim _geresh 、 cal _jewish _add _alafim および cal _jewish _add _gereshayim です
ユリウス 積算 日 を 表す 整数 値
ユダヤ 暦 の 日付 を & quot ;月 / 日 / 年 &quot ; 形式 の 文字 列 で 返し ます
ユリウス 積算 日 を ユダヤ 暦 に 変換 する
ユリウス 積算 日 を 表す 整数 値
ユリウス 暦 の 日付 を & quot ;月 / 日 / 年 &quot ; 形式 の 文字 列 で 返し ます
ユリウス 積算 日 を ユリウス 暦 に 変換 する
2 4 4 0 5 8 8 から 2 4 6 5 3 4 2 まで の ユリウス 積算 日
指定 し た ユリウス 積算 日 の 開始 時 の unix タイムスタンプ を 返し ます
ユリウス 歴 を unix タイムスタンプ に 変換 する
変換後 の wbmp ファイル へ の パス
変換後 の 画像 の 高さ
変換後 の 画像 の 幅
jpeg ファイル へ の パス
閾値
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
jpeg イメージファイル から wbmp イメージファイル に 変換 する
json デコードオプション の ビットマスク です
デコード 対象 と なる json 文字列
true の 場合 、 返さ れる オブジェクト は 連想 配列 形式 に なり ます
ユーザー 指定 の 再帰 の 深さ
json で エンコード さ れ た データ を 、 適切 な php の 型 として 返し ます
json 文字列 を デコード する
json _hex _quot json _hex _tag json _hex _amp json _hex _apos json _numeric _check json _pretty _print json _unescaped _slashes json _force _object json _preserve _zero _fraction json _unescaped _unicode json _partial _output _on _error から なる ビットマスク
最大 の 深さ を 設定 し ます
エンコード する 値
成功 し た 場合 に 、 json エンコード さ れ た 文字列 を 返し ます
値 を json 形式 に して 返す
年 を 表す 、- 4 7 1 3 から 9 9 9 9 まで の 数値
月 を 表す 、 1 for january から 1 2 for december まで の 数値
日 を 表す 、 1 から 3 1 まで の 数値
指定 し た ユリウス 暦 の 日付 に 対応 する ユリウス 積算 日 を 返し ます
ユリウス 暦 を ユリウス 積算 日 に 変換 する
プリンシパル
新しい パスワード
kadm 5 ハンドル
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
プリンシパル の パスワード を 変更 する
kadm 5 ハンドル
削除 する プリンシパル
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
kerberos プリンシパル を 削除 する
kadm 5 ハンドル
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
kerberos データベース に対する すべ て の 変更 を 取り消す
kadm 5 ハンドル
成功 し た 場合 は ポリシー の 配列 、 失敗 し た 場合 に false を 返し ます
kerberos データベース から 、 すべて の ポリシー を 取得 する
kadm 5 ハンドル
成功 し た 場合 は プリンシパル の 配列 、 失敗 し た 場合 に false を 返し ます
kerberos データベース から 、 すべて の プリンシパル を 取得 する
サーバー
プリンシパル
password を 省略 し たり null を 指定 し たり する と 、 ランダム な キー を 生成 し ます
この 接続 の 認証 領域 を 定義 し ます
成功 し た 場合 は kadm 5 ハンドル 、 失敗 し た 場合 に false を 返し ます
kadm 5 ライブラリ へ の 接続 を オープン し 、 必要 な ステータス 情報 を 初期化 する
プリンシパル
kadm 5 ハンドル
オプション の パラメータ を 、 配列 options で 指定 する こと が でき ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
kerberos プリンシパル を 、 指定 し た パラメータ で 変更 する
配列
key 関数 は 、 内部 ポインタ が 現在指 し て いる 配列 要素 の キー を 返し ます
配列 から キー を 取り出す
入力 の 配列
オプション の パラメータ sort _flags により ソート の 動作 を 修正 可能 です
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
配列 を キー で 逆順 に ソート する
入力 の 配列
オプション の パラメータ sort _flags により ソート の 動作 を 修正 可能 です
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
配列 を キー で ソート する
入力 文字列
変換後 の 文字列 を 返し ます
文字列 の 最初 の 文字 を 小文字 に する
( 0 1 の 範囲 の 疑似 乱数 を 、 浮動 小数 点数 で 返し ます
複合線 形合 同法
グループ 名 あるい は グループ 番号
シンボリックリンク へ の パス
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
シンボリックリンク の グループ 所有 権 を 変更 する
ユーザー 名 あるい は ユーザー 番号
ファイル へ の パス
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
シンボリックリンク の 所有 者 を 変更 する
ldap _connect が 返す ldap リンク id
その エントリ に関する 情報 を 表す 配列
ldap エンティティ の 識別 名
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ldap ディレクトリ に エントリ を 付加 する
ldap _connect が 返す ldap リンク id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ldap ディレクトリ に バインド する
サーバー から 送 られる opaque structure
ldap _connect が 返す ldap リンク id
取得 する エントリ 数 の 予測
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ldap ページネーションクッキー を 取得 する
ldap _connect が 返す ldap リンク id
内部 の ldap 結果
結果 の エントリ 数 を 返し ます
検索 結果 の エントリ 数 を 数える
ldap エンティティ の 識別 名
ユーザー に わかり やすい 形式 の 名前 を 返し ます
dn を ユーザー に 分かり やすい 名前 の フォーマット に 変換 する
エラー 番号
エラーメッセージ を 表す 文字 列 を 返し ます
ldap の エラー 番号 を エラーメッセージ 文字 列 に 変換 する
ldap _connect が 返す ldap リンク id
この リンク に関する 直近 の ldap コマンド の ldap エラー 番号 を 返し ます
直近 の ldap コマンド の ldap エラー 番号 を 返す
ldap _connect が 返す ldap リンク id
エラーメッセージ 文字 列 を 返し ます
直近 の ldap コマンド の ldap エラーメッセージ を 返す
ldap エンティティ の 識別 名
rdn が 値 のみ を 返す の か 、 あるい は 、 属性 を 同時 に 返す の か を 指定 する ため に 使用 し ます
すべて の dn 要素 を 配列 で 返し ます
dn を 構成 要素 ごと に 分割 する
ldap _connect が 返す ldap リンク id
成功 時 に 最初 の エントリ に関する 結果 エントリ id 、 エラー の 場合 に false を 返し ます
最初 の 結果 id を 返す
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
結果 メモリ を 開放 する
ldap _connect が 返す ldap リンク id
成功 時 に 完全 な 結果 情報 を 多次 元 配列 で 返し ます
全て の 結果 エントリ を 得る
ldap _connect が 返す ldap リンク id
成功 時 に 属性 の 値 を 配列 で 返し 、 エラー 時 に false を 返し ます
結果 エントリ から 全 て の バイナリ 値 を 得る
ldap _connect が 返す ldap リンク id
成功 し た 場合 、 指定 し た 属性 に関する 値 を 配列 を 返し ます
結果 エントリ から 全 て の 値 を 得る
ldap _connect が 返す ldap リンク id
ldap エンティティ の 識別 名
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
現在 の 属性 に 属性 を 追加 する
ldap _connect が 返す ldap リンク id
ldap エンティティ の 識別 名
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
現在 の 属性 から 属性 を 削除 する
ldap _connect が 返す ldap リンク id
ldap エンティティ の 識別 名
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
属性 を 新規 の 値 に 置換 する
ldap _connect が 返す ldap リンク id
ldap エンティティ の 識別 名
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ldap エントリ を 修正 する
ポインタ の 内部 状態 を 、 この パラメータ で 管理 し ます
ldap _connect が 返す ldap リンク id
成功 し た 場合 、 エントリ に おける 次 の 属性 を 返し ます
結果 に おける 次 の 属性 を 得る
ldap _connect が 返す ldap リンク id
ldap _first _entry により エントリ が 読み 始め られ た 結果 に おい て 次 の エントリ に関する エントリid を 返し ます
次 の 結果 エントリ を 得る
ldap _list あるい は ldap _search が 返す ldap 結果 リソース
リクエスト 内 に マッチ する dn が あっ た 場合 に 、 それ を 格納 する 変数 へ の 参照
結果 に 含ま れる すべ て の 照会 文字 列 の 配列 を 格納 する 変数 へ の 参照
ldap _connect が 返す ldap リンク id
結果 に 含ま れる ldap エラーコード を 格納 する 変数 へ の 参照
結果 に 含ま れる ldap エラーメッセージ を 格納 する 変数 へ の 参照
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
結果 から 情報 を 展開 する
ldap _connect が 返す ldap リンク id
新しい 親 エントリ
新しい rdn
true の 場合 は 古い rdn 値 を 削除 し ます
ldap エンティティ の 識別 名
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
エントリ 名 を 修正 する
ソート の キー として 使う 属性
ldap _connect が 返す ldap リンク id
ldap _search が 返す 検索 結果 id
ldap 結果 エントリ を ソート する
libxml エラーハンドラ を クリア する
エラー が バッファ に ある 場合 に libxmlerror オブジェクト 、 それ 以外 の 場合 に false を 返し ます
libxml から 直近 の エラー を 取得 する
三つ の 引数 を とる callable
デフォルト の 外部 エンティティローダー を 変更 する
ストリームコンテキストリソース stream _context _create で 作成
次 の libxml ドキュメント の 読込 ／ 書き こみ の ため に ストリームコンテキスト を 設定 する
ユーザー による エラー 処理 を 有効 true また は 無効 false にする
この 関数 は 、 use _errors の 前 の 値 を 返し ます
libxml エラー を 無効 に し 、 ユーザー が 必要 に 応じ て エラー 情報 を 取得 できる よう に する
リンク の 対象
リンク の 名前
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ハードリンク を 作成 する
リンク へ の パス
linkinfo は 、 lstat システムコール で 返さ れ た unix c 言語 の stat 構造体 の st _dev フィールド を 返し ます
リンク に関する 情報 を 取得 する
localeconv は 、 setlocale で 設定 さ れ た 現在 の ロケール に 基づき データ を 返し ます
数値 に関する フォーマット 情報 を 得る
処理 する 引数
底 を 1 0 と する arg の 対数 を 返し ます
底 が 1 0 の 対数
処理 する 引数
log 1 + number を 返し ます
値 が ゼロ に 近い 時 に でも 精度 を 保つ 方法 で 計算 し た log 1 + number を 返す
ファイル あるい は シンボリックリンク へ の パス
lstat が 返す 配列 の 内容 について は stat の マニュアル を ご覧く ださい
ファイル あるい は シンボリックリンク の 情報 を 取得 する
入力 文字列
character _mask パラメータ により 、 削除 する 文字 を 指定 する こと も 可能 です
この 関数 は 文字列 の 最初 から 空白 文字 を 取り除き 、 取り除か れ た 文字列 を 返し ます
文字列 の 最初 から 空白 もしく は その 他 の 文字 を 取り除く
圧縮 する データ
圧縮 さ れ た データ を 返し ます
lzf 圧縮 を 行う
圧縮 さ れ た データ
伸長 し た データ を 返し ます
lzf 圧縮 を 伸長 する
lzf が 速度 に 最適 化 さ れ て いる 場合 に 1 、 圧縮 率 に 最適 化 さ れ て いる 場合 に 0 を 返し ます
lzf 拡張 モジュール の 最適 化 指定 を 取得 する
送信 する メール の 表題
パラメータ additional _parameters は 、 追加 の フラグ を コマンドラインオプション として メール 送信 プログラム に 渡す際 に 使用 可能 です
メール の 受信 者
メールヘッダ の 最後 に 挿入 さ れる 文字列
送信 する メッセージ
メール 送信 が 受け 入れ られ た 場合 に true 、 それ 以外 の 場合 に false を 返し ます
メール を 送信 する
mailparse _msg _create で 作成 し た mime リソース
ファイル 名 あるい は 有効 な ストリームリソース
展開 さ れ た セクション に 渡さ れる コールバック 関数 、 あるい は null を 指定 する と 、 この 関数 は 展開 し た セクション を 返し ます
callbackfunc が null で ない 場合 は 、 成功時 に true を 返し ます
メッセージセクション を 展開 / デコード する
メッセージ を 保持 する ファイル へ の パス
構造 を 表す mime リソース 、 あるい は エラー 時 に false を 返し ます
ファイル を パース する
有効 な mime リソース
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
データ を パース し 、 バッファ に 追加 する
有効 な ファイルハンドル
エンコード し た データ を 書き込む ファイルハンドル
mbstring モジュール が サポート する 文字 エンコーディング のい ずれ か
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ソースファイルポインタ から ストリームデータ を 取得 し 、 エンコーディング を 適用 し 、 出力 ファイルポインタ に 書き込む
有効 な ファイルポインタ
ファイル 名 の 情報 を 含む 連想 配列 の 配列 を 返し ます
ファイルポインタ から データ を スキャン し 、 uuencode さ れ た ファイル を 展開 する
任意 の 比較 可能 な 値
任意 の 比較 可能 な 値
値 を 含む 配列
任意 の 比較 可能 な 値
max は 、 パラメータ として 渡し た 値 の 中 で 、 標準 の 比較 ルール に 従っ て 最大 に なる もの を 返し ます
最大値 を 返す
直近 の maxdb _connect の コール の エラーコード を 返し ます
直近 の 接続 コール の エラーコード を 返す
デバッグ 操作 を 行う
maxdb クライアントライブラリ の バージョン を 表す 文字 列 を 返し ます
maxdb クライアント の バージョン を 文字列 で 返す
maxdb クライアントライブラリ の バージョン を 表す 数値 を 、 以下 の フォーマット で 返し ます
maxdb クライアント の 情報 を 取得 する
false を 返し ます
multi _query の 、 次 の 結果 を 準備 する
直近 の エラー について の sqlstate エラーコード を 含む 文字 列 を 返し ます
事前 の ステートメント の 捜査 から の sqlstate エラー を 返す
クライアントライブラリ が スレッドセーフ で ある 場合 に true 、 それ 以外 の 場合 に false を 返し ます
スレッドセーフ で ある かど う か を 返す
調べる バイトストリーム
期待 する エンコーディング
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
文字列 が 、 指定 し た エンコーディング で 有効 なもの かど う か を 調べる
encoding パラメータ に は 文字 エンコーディング を 指定 し ます
変換 さ れる 文字列
変換 モード
mode で 指定 さ れ た 方法 で string に対し て ケースフォルディング を 行っ た 結果 を 返し ます
文字列 に対し て ケースフォルディング を 行う
変換 前 の 文字 エンコーディング 名 を 指定 し ます
変換 する 文字列
str の 変換 後 の 文字 エンコーディング
変換後 の 文字列 を 返し ます
文字 エンコーディング を 変換 する
変換 オプション
encoding パラメータ に は 文字 エンコーディング を 指定 し ます
変換 さ れる 文字列
変換後 の 文字列 を 返し ます
カナ を & quot ; 全角 か な &quot ;、 & quot ; 半角 か な &quot ; 等 に 変換 する
デコード する 文字列
内部 文字 エンコーディング で デコード さ れ た 文字列 を 返し ます
mime ヘッダフィールド の 文字列 を デコード する
encoding パラメータ に は 文字 エンコーディング を 指定 し ます
convmap は 変換 する コード 領域 を 指定 する 配列 です
デコード する 文字列
変換 さ れ た 文字列 を 返し ます
html 数値 エンティティ を 文字 に デコード する
encoding _list は 、 配列 また は カンマ 区切り の 文字 エンコーディング の リスト です
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
文字 エンコーディング 検出 順序 を 設定 あるい は 取得 する
convmap は 、 変換 する コード 領域 を 指定 する 配列 です
encoding パラメータ に は 文字 エンコーディング を 指定 し ます
エンコード する 文字列
変換後 の 文字列 を 返し ます
文字 を html 数値 エンティティ に エンコード する
正規 表現 パターン
評価 する 文字列
マルチバイト 文字 列 が 正規 表現 に 一致 する か 調べる
検索 パターン
検索 オプション
指定 し た マルチバイト 文字 列 が 正規 表現 に 一致 する 部分 の 位置 と 長さ を 返す
検索 パターン
検索 オプション
指定 し た マルチバイト 文字 列 が 正規 表現 に 一致 する 部分 を 取得 する
検索 パターン
検索 オプション
指定 し た マルチバイト 文字 列 が 正規 表現 に 一致 する か 調べる
encoding は 、 http 入力 文字 エンコーディング 変換 、 http 出力 文字 エンコーディング 変換 および mbstring モジュール の 文字 列関 数 に おい て デフォルト の 文字 エンコーディング として 使用 さ れ ます
encoding が 設定 さ れ た 場合 、 成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
内部 文字 エンコーディング を 設定 あるい は 取得 する
e -mail メッセージ の エンコーディング として 使用 し ます
language が 設定 さ れ 、 language が 有効 な 場合 、 true が 返さ れ ます
現在 の 言語 を 設定 あるい は 取得 する
数 値添 字 の 配列 を 返し ます
サポート する すべ て の エンコーディング の 配列 を 返す
出力 バッファ の 中身
出力 バッファ の 状態
変換後 の 文字列 を 返し ます
出力 バッファ 内 で 文字 エンコーディング を 変換 する コールバック 関数
url エンコード さ れ た データ
デコード さ れ 、 文字 エンコーディング 変換 さ れ た 文字 列 が 含ま れ ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
get / post / cookie データ を パース し 、 グローバル 変数 を 設定 する
調べる エンコーディング
文字 エンコーディング encoding 用 の mime charset 文字列 を 返し ます
mime 文字 設定 を 文字列 で 得る
メール の 本文
additional _parameter は 、 mta へ 渡す コマンドライン 引数 です
送信先 の メールアドレス
メール の 件名
メールヘッダ の 最後 に 挿入 さ れる 文字列
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
エンコード 変換 を 行っ て メール を 送信 する
取り出し の 対象 と なる 文字列
encoding パラメータ に は 文字 エンコーディング を 指定 し ます
バイト 単位 で の 長さ
start が 非負 で ある 場合 に 返さ れる 文字 列 は 、 string の start バイト 目以降 の 文字 列 と なり ます ゼロ から 数え ます
mb _strcut は 、 start および length パラメータ で 指定 し た str の 一部 を 返し ます
文字列 の 一部 を 得る
丸める 幅
丸め た 後 に その 文字 列 の 最後 に 追加 さ れる 文字列
encoding パラメータ に は 文字 エンコーディング を 指定 し ます
丸め たい 文字列
開始 位置 の オフセット
丸め られ た 文字列 を 返し ます
指定 し た 幅 で 文字列 を 丸める
使用 する 文字 エンコーディング 名
needle が 最初 に 現れる 位置 を 見つける 文字列
haystack の 中 で 探す 文字列
haystack の 中 で 、 検索 を 開始 する 位置
needle が haystack の 中 で 最初 に 現れる 位置 を 返し ます
大文字 小文字 を 区別 せ ず 、 文字列 の 中 で 指定 し た 文字 列 が 最初 に 現れる 位置 を 探す
使用 する 文字 エンコーディング 名
needle が 最初 に 現れる 位置 を 見つける 文字列
haystack の 中 で 探す 文字列
この 関数 が haystack のど の 部分 を 返す の か を 指定 し ます
haystack の 部分 文字 列 を 返し ます
大文字 小文字 を 区別 せ ず 、 文字列 の 中 で 指定 し た 文字 列 が 最初 に 現れる 位置 を 探す
encoding パラメータ に は 文字 エンコーディング を 指定 し ます
長さ を 調べ たい 文字列
文字 エンコーディング encoding の 文字列 str の 文字数 を 返し ます
文字列 の 長さ を 得る
検索 オフセット
haystack の 中 から 探す 文字列
調べ たい 文字列
encoding パラメータ に は 文字 エンコーディング を 指定 し ます
文字列 haystack の 中 で needle が 最初 に 現れる 位置 を 数字 で 返し ます
文字列 の 中 に 指定 し た 文字 列 が 最初 に 現れる 位置 を 見つける
needle が 最後 に 現れる 位置 を 探す 文字列
haystack の 中 で 探す 文字列
使用 する 文字 エンコーディング の 名前
この 関数 が haystack のど の 部分 を 返す の か を 指定 し ます
haystack の 部分 文字 列 を 返し ます
別 の 文字 列 の 中 で 、 ある 文字 が 最後 に 現れる 場所 を 見つける
needle が 最後 に 現れる 位置 を 探す 文字列
haystack の 中 で 探す 文字列
使用 する 文字 エンコーディング の 名前
この 関数 が haystack のど の 部分 を 返す の か を 指定 し ます
haystack の 部分 文字 列 を 返し ます
大文字 小文字 を 区別 せ ず 、 別 の 文字 列 の 中 で ある 文字 が 最後 に 現れる 場所 を 探す
使用 する 文字 エンコーディング 名
haystack の 中 で 、 検索 を 開始 する 位置
needle が 最後 に 現れる 位置 を 見つける 文字列
haystack の 中 で 探す 文字列
needle が haystack の 中 で 最後 に 現れる 位置 を 返し ます
大文字 小文字 を 区別 せ ず 、 文字列 の 中 で 指定 し た 文字 列 が 最後 に 現れる 位置 を 探す
haystack の 中 で 見つけ たい 文字列
指定 する と 、 文字 列中 の 任意 の 文字 位置 から 検索 を 開始 する こと が でき ます
encoding パラメータ に は 文字 エンコーディング を 指定 し ます
needle が 最後 に 登場 する 場所 を 調べ たい 文字列
文字列 haystack の 中 で needle が 最後 に 現れる 位置 を 数字 で 返し ます
文字列 の 中 に 指定 し た 文字 列 が 最後 に 現れる 位置 を 見つける
使用 する 文字 エンコーディング 名
needle が 最初 に 現れる 位置 を 見つける 文字列
haystack の 中 で 探す 文字列
この 関数 が haystack のど の 部分 を 返す の か を 指定 し ます
haystack の 部分 文字 列 を 返し ます
文字列 の 中 で 、 指定 し た 文字 列 が 最初 に 現れる 位置 を 見つける
大文字 に 変換 し たい 文字列
encoding パラメータ に は 文字 エンコーディング を 指定 し ます
str のすべて の アルファベット を 大文字 に し た もの を 返し ます
文字列 を 大文字 に する
encoding パラメータ に は 文字 エンコーディング を 指定 し ます
幅 を 取得 し たい 文字列
文字列 str の 幅 を 返し ます
文字列 の 幅 を 返す
見つける 文字列
調べ たい 文字列
encoding パラメータ に は 文字 エンコーディング を 指定 し ます
文字列 haystack の 中 で の 部分 文字 列 needle の 出現 回数 を 返し ます
部分 文字 列 の 出現 回数 を 数える
str の 中 から 取り出す 最大 文字 数
encoding パラメータ に は 文字 エンコーディング を 指定 し ます
部分 文字 列 を 取り出し たい 文字列
start が 非負 で ある 場合 に 返さ れる 文字 列 は 、 string の start バイト 目以降 の 文字 列 と なり ます ゼロ から 数え ます
mb _substr は 、 start および length パラメータ で 指定 し た str の 一部 を 返し ます
文字列 の 一部 を 得る
この データ が 、 指定 し た cipher および mode で 復号 さ れ ます
mcrypt _ 暗号 名 定数 のい ずれ か 、 あるい は アルゴリズム 名 を あらわす 文字列
データ を 暗号 化 し た 際 の キー
cbc cfb ofb モード および stream モード の いくつか の アルゴリズム の 初期化 の 際 に 使用 さ れ ます
定数 mcrypt _mode _ モード 名 、 あるい は 文字列 & quot ;ecb &quot ; & quot ;cbc &quot ; & quot ;cfb &quot ; & quot ;ofb &quot ; & quot ;nofb &quot ; & quot ;stream &quot ; のいずれ か
復号 さ れ た データ を 文字列 で 返し ます
指定 し た パラメータ で 暗号 化 さ れ た テキスト を 復号 する
暗号 化記 述子
オープン し た アルゴリズム の 名前 を 文字列 で 返し ます
オープン さ れ た アルゴリズム の 名前 を 返す
暗号 化記 述子
この 関数 は 、 暗号 化記 述子 で 指定 し た アルゴリズム の iv の 大きさ を バイト 単位 で 返し ます
オープン さ れ た アルゴリズム の iv の 大きさ を 返す
暗号 化記 述子
その アルゴリズム で サポート さ れる 最大 キー 長 を バイト 単位 で 返し ます
オープン さ れ た モード で サポート さ れる 最大 キー 長 を 返す
暗号 化記 述子
名前 を 表す 文字 列 を 返し ます
オープン さ れ た モード の 名前 を 返す
暗号 化記 述子
アルゴリズム が ブロックアルゴリズム で ある 場合 に true 、 ストリームアルゴリズム で ある 場合 に false を 返し ます
オープン さ れ た モード の 暗号 が ブロックアルゴリズム で ある かど う か を 調べる
mcrypt _ 暗号 名 定数 のい ずれ か 、 あるい は アルゴリズム 名 を あらわす 文字列
データ を 暗号 化 する 際 の キー
cbc cfb ofb モード および stream モード の いくつか の アルゴリズム の 初期化 の 際 に 使用 さ れ ます
指定 し た cipher および mode で 暗号 化 する データ
定数 mcrypt _mode _ モード 名 、 あるい は 文字列 & quot ;ecb &quot ; & quot ;cbc &quot ; & quot ;cfb &quot ; & quot ;ofb &quot ; & quot ;nofb &quot ; & quot ;stream &quot ; のいずれ か
暗号化 さ れ た データ を 文字列 で 返し ます
指定 し た パラメータ で プレーンテキスト を 暗号 化 する
暗号 化記 述子
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
暗号化 モジュール を 終了 する
iv は 通常 その アルゴリズム の ブロック 長 と 同じ 大き さ です が 、 mcrypt _enc _get _iv _size を コール する こと により 、 その 大きさ を 得る 必要 が あり ます
暗号 化記 述子
キー の 最大 長 は 、 mcrypt _enc _get _key _size を コール し た 際 に 得 られる キー 長 で あり 、 この 値より 小さ な 値 は 全 て 有効 です
この 関数 は 、 エラー 時 に 負 の 値 を 返し ます
暗号化 に 必要 な 全 て の バッファ を 初期化 する
mcrypt _ 暗号 名 定数 のい ずれ か 、 あるい は アルゴリズム 名 を あらわす 文字列
定数 mcrypt _mode _ モード 名 、 あるい は 文字列 & quot ;ecb &quot ; & quot ;cbc &quot ; & quot ;cfb &quot ; & quot ;ofb &quot ; & quot ;nofb &quot ; & quot ;stream &quot ; のいずれ か
初 期化 ベクトル iv の 大きさ を バイト 数 で 返し ます
指定 し た 暗号 / モード の 組み合わせ に 属する iv の 大きさ を 返す
すべて の アルゴリズム が 存在 する ディレクトリ を 指定 し ます
サポート する すべ て の アルゴリズム を 配列 で 返し ます
サポート さ れる 全て の 暗号 を 配列 として 取得 する
オプション の パラメータ で 、 システム 上 で の モードモジュール の 位置 を 指定 する こと が 可能 です
アルゴリズム 名
指定 し た アルゴリズム で サポート さ れる ブロック 長 を バイト 単位 で 返し ます
指定 し た アルゴリズム の ブロック 長 を 返す
オプション の パラメータ で 、 システム 上 で の モードモジュール の 位置 を 指定 する こと が 可能 です
アルゴリズム 名
この 関数 は 、 指定 し た アルゴリズム で サポート さ れる 最大 キー 長 を バイト 単位 で 返し ます
オープン さ れ た モード で サポート さ れる 最大 キー 長 を 返す
オプション の パラメータ lib _dir により 、 システム 上 で の algorithm モジュール の 位置 を 指定 する こと が 可能 です
調べ たい アルゴリズム
この 関数 は 、 指定 し た アルゴリズム が ブロックアルゴリズム の 場合 に true 、 ストリームアルゴリズム の 場合 に false を 返し ます
指定 し た アルゴリズム が ブロックアルゴリズム で ある か を 調べる
暗号化 モジュール の 位置 を 指定 する 際 に は mode _directory を 使い ます
mcrypt _ 暗号 名 定数 のい ずれ か 、 あるい は アルゴリズム 名 を あらわす 文字列
暗号化 モジュール の 位置 を 指定 する 際 に は algorithm _directory を 使い ます
定数 mcrypt _mode _ モード 名 、 あるい は 文字列 & quot ;ecb &quot ; & quot ;cbc &quot ; & quot ;cfb &quot ; & quot ;ofb &quot ; & quot ;nofb &quot ; & quot ;stream &quot ; のいずれ か
通常 は 暗号 化記 述子 を 返し ます
使用 する アルゴリズム および モード の モジュール を オープン する
mcrypt _ 暗号 名 定数 のい ずれ か 、 あるい は アルゴリズム 名 を あらわす 文字列
オプション の パラメータ lib _dir により 、 システム 上 で の algorithm モジュール の 位置 を 指定 する こと が 可能 です
この 関数 は 、 セルフテスト が 成功 し た 場合 true 、 失敗 し た 場合 に false を 返し ます
指定 し た モジュール の セルフテスト を 実行 する
これ を true に 設定 する と 、 システム が 割り当て た 実際 の メモリ の 大きさ を 取得 し ます
メモリ の 最大 値 を バイト 数 で 返し ます
php によって 割り 当て られ た メモリ の 最大 値 を 返す
これ を true に 設定 する と 、 システム が 割り当て た 実際 の メモリ の 大きさ 未使用 の ページ も 含む もの を 取得 し ます
メモリ の 量 を バイト 単位 で 返し ます
php に 割り 当て られ た メモリ の 量 を 返す
この パラメータ は 、 返さ れる metaphone キー の 長さ を 最大 phonemes 文字 まで に 制限 し ます
入力 文字列
metaphone キー を 文字列 で 返し ます
文字列 の metaphone キー を 計算 する
メソッド の 名前
オブジェクト の インスタンス 、 あるい は クラス 名
method _name で 指定 し た メソッド が 指定 し た object におい て 定義 さ れ て いる 場合 に true 、 そう で ない 場合 に false を 返し ます
クラスメソッド が 存在 する かど う か を 確認 する
利用 可能 な ハッシュ id の 最大 値 を 返し ます
利用 可能 な ハッシュ id の 最大 値 を 得る
ハッシュ id
サイズ を バイト 数 で 返し ます
指定 し た ハッシュ の ブロックサイズ を 得る
ハッシュ id
ハッシュ の 名前 を 返し ます
指定 し た ハッシュ の 名前 を 得る
ユーザー が 指定 し た パスワード
キー の 長さ を バイト 数 で 指定 し ます
キー の 作成 に 使用 する ハッシュ id
異 なっ た キー を 生成 する ため 、 キー を 生成 する たび に 、 十分 に ランダム な 異 なる 値と なる 必要 が あり ます
生成 さ れ た キー を 表す 文字 列 、 あるい は エラー 時 に false を 返し ます
キー を 生成 する
ユーザー が 入力 し た 文字列
ハッシュ id
指定 し た 場合 は 、 この 関数 は 結果 の hmac を 返し ます
結果 の ハッシュ あるい は ダイジェスト とも 言い ます あるい は hmac を 表す 文字 列 を 返し ます
ハッシュ 値 を 計算 する
true を 指定 する と 、 microtime は 文字列 で は なく float を 返す よう に なり ます
デフォルト で は 、 microtime は & quot ;msec sec &quot ; 形式 の 文字列 を 返し ます
現在 の unix タイムスタンプ を マイクロ 秒 まで 返す
調べる ファイル へ の パス
content type を mime 形式 で 返し ます
ファイル の mime content -type を 検出 する
閾値
三次元 の 閾値 を 設定 する
新しい 圧縮 レベル
swf 出力 の 圧縮 を 設定 する
使用 する swf の バージョン
swf の バージョン を 設定 する
注意 : コンテキスト の サポート は 、 php 5
モード は 0 7 7 7 が デフォルト です
ディレクトリ の パス
pathname で 、 入れ 子構 造 の ディレクトリ の 作成 を 許可 し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ディレクトリ を 作る
この パラメータ は サマータイム dst の 時に 1 に セット さ れ 、 そう で ない 時 に 0 、 サマータイム で ある かどう か が 不明 で ある 場合 に - 1 に セット さ れ ます
hour 時 0 分 から 数え た 「分 」
minute 分 0 秒 から 数え た 「秒 」
前 年末 から 数え た 月数
年
month 、 day と year で 決まる 日付 の 0 時 から 数え た 「時 」
前月 末 から 数え た 日数
mktime は 与え られ た 引数 の unix タイムスタンプ を 返し ます
日付 を unix の タイムスタンプ として 取得 する
compcode の 原因 を 表す コード
完了 コード
接続 ハンドル
mqseries mqbegin
compcode の 原因 を 表す コード
完了 コード
オブジェクトハンドル
接続 ハンドル
mqseries mqclose
キューマネージャ 名
compcode の 原因 を 表す コード
完了 コード
接続 ハンドル
mqseries mqconn
キューマネージャ 名
compcode の 原因 を 表す コード
完了 コード
関数 の 動作 を 制御 する オプション
接続 ハンドル
mqseries mqconnx
compcode の 原因 を 表す コード
完了 コード
接続 ハンドル
mqseries mqdisc
完了 コード
compcode の 原因 を 表す コード
オブジェクト 記述子 mqod
オブジェクトハンドル
接続 ハンドル
関数 の 動作 を 制御 する オプション
mqseries mqopen
接続 ハンドル
完了 コード
compcode の 原因 を 表す コード
オブジェクト 記述子 mqod
メッセージ 記述子 mqmd
put メッセージ の オプション mqpmo
mqseries mqput 1
compcode の 原因 を 表す コード
原因 コード の メッセージ を 文字列 で 返し ます
結果 コード mqrc に対応 する エラーメッセージ を 返す
検索 する 名前
name という 名前 の 変数 を 有する 全 て の セッション を 値と する 連想 配列 を 返し ます
セッション の 一覧 を 変数 を 使用 し て 取得 する
メッセージキュー の 数値 id
キュー の パーミッション
リソースハンドル を 返し ます
メッセージキュー を 作成 また は それ に アタッチ する
設定 し たい 値 を 、 data 配列 に 設定 し ます
メッセージキュー の リソースハンドル
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
メッセージキューデータ 構造 体 の 情報 を 設定 する
メッセージキュー の リソースハンドル
返り値 は 配列 で 、 その キー と 値 は 以下 の よう な 意味 を もち ます
メッセージキューデータ 構造 体 の 情報 を 返す
評価 さ れ た 結果 リソース
成功 し た 場合 に は 変更 さ れ た 行 の 数 、 エラー 時 に false を 返し ます
変更 さ れ た 行 の 数 を 返す
msql 接続
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
msql 接続 を 閉じる
ホスト 名 に は ポート 番号 を 含める こと も 可能 です
成功 し た 場合 に は 正 の msql リンク id を 、 エラー 時 に は false を 返し ます
msql 接続 を 開く
msql 接続
msql データベース 名
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
msql データベース を 作成 する
sql クエリ
msql 接続
msql データベース の 名前
成功 し た 場合 に は 正 の msql リンク id を 、 エラー 時 に は false を 返し ます
msql クエリ を 送信 する
直近 の エラーメッセージ を 返し ます
最後 の msql コール に関する エラーメッセージ を 返す
以下 の 定数 msql _assoc 、 msql _num 、 および msql _both のうち のい ずれ か
評価 さ れ た 結果 リソース
取得 し た 行 に 対応 する 配列 を 返し ます
結果 の 行 を 配列 として 取得 する
評価 さ れ た 結果 リソース
フィールドオフセット
フィールド 情報 を 含む オブジェクト を 返し ます
フィールド 情報 を 得る
評価 さ れ た 結果 リソース
得 た 行 に 対応 する プロパティ を 有する オブジェクト を 返し ます
結果 の 行 を オブジェクト として 取得 する
数値 フィールドオフセット
評価 さ れ た 結果 リソース
指定 し た キー の フィールドフラグ を 含む 文字 列 を 返し ます
フィールド の フラグ を 取得 する
数値 フィールドオフセット
評価 さ れ た 結果 リソース
フィールド の 名前 を 返し ます
結果 に おける 指定 し た フィールド の 名前 を 取得 する
数値 フィールドオフセット
評価 さ れ た 結果 リソース
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
フィールドオフセット を 設定 する
数値 フィールドオフセット
評価 さ れ た 結果 リソース
成功 し た 場合 は テーブル の 名前 、 失敗 し た 場合 に false を 返し ます
フィールド の テーブル 名 を 取得 する
評価 さ れ た 結果 リソース
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
結果 保持 用 メモリ を 開放 する
msql 接続
結果 セット を 返し ます
サーバー 上 の msql データベース の リスト を 返す
msql 接続
テーブル の 名前
データベース の 名前
結果 セット を 返し ます
結果 フィールド の リスト を 得る
評価 さ れ た 結果 リソース
結果 セット に おける 行 の 数 を 返し ます
結果 に おける 行 の 数 を 得る
msql 接続
sql クエリ
成功 し た 場合 に は 正 の msql リンク id を 、 エラー 時 に は false を 返し ます
msql クエリ を 送信 する
msql 接続
データベース 名
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
msql データベース を 選択 する
mssql パラメータ として バインド する php 変数
mssql _init で 取得 し た ステートメントリソース
パラメータ 名 を 表す 文字列
sqltext sqlvarchar sqlchar sqlint 1 sqlint 2 sqlint 4 sqlbit sqlflt 4 sqlflt 8 sqlfltn のいずれ か
パラメータ が null かどう か
値 が output パラメータ で ある かどう か
char / varchar 値 で 使用 し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ストアドプロシージャ また は リモートストアドプロシージャ へ パラメータ を 追加 する
mssql _connect が 返す ms sql リンク id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ms sql server へ の 接続 を 閉じる
パスワード
同じ 引数 で mssql _connect が 再度 コール さ れ た 場合 、 新規 の リンク は 作成 さ れ ず 、 代わり に 既 に オープン さ れ た リンク id が 返さ れ ます
ユーザー 名
ms sql サーバー
成功時 に ms sql リンク id 、 エラー 発生 時 に false を 返し ます
ms sql サーバー 接続 を オープン する
処理 対象 と なる 結果 リソース
新しい 結果 ポインタ の 行番 号
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
内部行 ポインタ を 移動 する
結果 を スキップ する かどう か
mssql _init で 取得 し た ステートメントハンドル
ms sql サーバーデータベース で ストアドプロシージャ を 実行 する
処理 対象 と なる 結果 リソース
取得 する 配列 の 形式
取得 さ れ た 行 に 対応 する 配列 、 行 が もう ない 場合 に false を 返し ます
連想 配列 ・ 数値 添字 配列 ・ あるい は その 両方 で 結果 の 行 を 取得 する
処理 対象 と なる 結果 リソース
返さ れ た バッチ 内 の 行番 号 を 返し ます
レコード の 次 の バッチ を 返す
処理 対象 と なる 結果 リソース
フィールドオフセット
フィールド 情報 を 含む オブジェクト を 返し ます
フィールド 情報 を 取得 する
処理 対象 と なる 結果 リソース
取得 さ れ た 行 に 対応 する プロパティ を 有する オブジェクト 、 また は もう 行 が ない 場合 に false を 返し ます
オブジェクト として 行 を 取得 する
処理 対象 と なる 結果 リソース
取得 さ れ た 行 に 対応 する 配列 、 また は 行 が もう ない 場合 に false を 返し ます
配列 として 行 を 取得 する
フィールドオフセット
処理 対象 と なる 結果 リソース
成功 し た 場合 は 指定 し た フィールドインデックス の 名前 、 失敗 し た 場合 に false を 返し ます
フィールド 名 を 得る
処理 対象 と なる 結果 リソース
フィールドオフセット
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
指定 し た フィールドオフセット に 移動 する
フィールドオフセット
処理 対象 と なる 結果 リソース
成功 し た 場合 は 指定 し た フィールドインデックス の 型 、 失敗 し た 場合 に false を 返し ます
フィールド 型 を 得る
処理 対象 と なる 結果 リソース
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
結果 保持 用 メモリ を 解放 する
mssql _init で 取得 し た ステートメントリソース
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ステートメント の メモリ を 開放 する
サーバー から の 直近 の エラーメッセージ 、 あるい は mssql で エラー が 発生 し て い ない 場合 は 空 の 文字列 を 返し ます
サーバー の 直近 の メッセージ を 返す
ストアドプロシージャ 名
mssql _connect が 返す ms sql リンク id
&quot ;statement &quot ; リソース の id を 返し ます
ストアドプロシージャ また は リモート の ストアドプロシージャ を 初期化 する
新しい エラー 深刻 度
最小 の エラー 深刻 度 を 設定 する
新しい メッセージ 深刻 度
最小 の メッセージ 深刻 度 を 設定 する
処理 対象 と なる 結果 リソース
フィールド の 数 を 整数 値 で 返し ます
結果 の フィールド 数 を 得る
処理 対象 と なる 結果 リソース
行 の 数 を 整数 値 で 返し ます
結果 の 行数 を 得る
パスワード
同じ 引数 で mssql _pconnect が 再度 コール さ れ た 場合 、 新規 の リンク は 作成 さ れ ず 、 代わり に 既 に オープン さ れ た リンク id が 返さ れ ます
ユーザー 名
ms sql サーバー
成功 時 に 正 の ms sql 持続 的 リンク id 、 エラー 時 に false を 返し ます
持続 的 ms sql 接続 を オープン する
mssql _connect あるい は mssql _pconnect が 返す ms sql リンク id
sql クエリ
バッファ に まとめる レコード の 数
成功時 に ms sql 結果 id 、 結果 が 返さ れ なかっ た 場合 に true 、 エラー 時 に false を 返し ます
ms sql クエリ を 送る
フィールドオフセット 、 フィールド 名 また は テーブル 名
処理 対象 と なる 結果 リソース
行番号
指定 し た セル の 内容 を 返し ます
結果 データ を 得る
mssql _connect あるい は mssql _pconnect が 返す ms sql リンク id
直近 の 書き込み クエリ によっ て 変更 さ れ た レコード 数 を 返し ます
クエリ によっ て 変更 さ れ た レコード 数 を 返す
mssql _connect あるい は mssql _pconnect が 返す ms sql リンク id
the database name
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ms sql データベース を 選択 する
オプション で 指定 する シード 値
改良 型乱 数生 成器 に シード を 指定 する
mysql 接続
カレント の 接続 から 、 デフォルト の 文字 セット 名 を 返し ます
文字 セット 名 を 返す
mysql サーバー
パスワード
同じ 引数 で 2 回 mysql _connect を コール し た 場合 、 2 回目 は 新規 の リンク が 確立 さ れる の で は なく 、 代わり にす でに オープン さ れ た リンク の リンク id が 返さ れ ます
ユーザー 名
パラメータ client _flags は 、 以下 の 定数 の 組み合わせ です ： 1 2 8 load data local の 処理 を 有効 に する 、 mysql _client _ssl 、 mysql _client _compress 、 mysql _client _ignore _space また は mysql _client _interactive
成功 し た 場合 に mysql リンク id を 、 失敗 し た 場合 に false を 返し ます
mysql サーバー へ の 接続 を オープン する
結果 セット 内 の インデックス
mysql _list _dbs を コール し て 得 られ た 結果 ポインタ
フィールド 名
成功 し た 場合 に データベース 名 を 、 失敗 し た 場合 に false を 返し ます
mysql _list _dbs の コール 結果 から データベース 名 を 取得 する
mysql クエリー
選択 する データベース 名
mysql 接続
クエリー の 結果 を 指す mysql 結果 リソース を 正 の 値 で 返し ます
データベース を 選択 し 、 そこ で クエリー を 実行 する
削除 する データベース の 名前
mysql 接続
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
mysql データベース を 破棄 削除 する
mysql 接続
直近 の mysql 関数 から の エラー 番号 を 返し ます
直近 の mysql 処理 から エラーメッセージ の エラー 番号 を 返す
mysql 接続
直近 の mysql 関数 から の エラー 文字 列 を 返し ます
直近 に 実行 さ れ た mysql 操作 の エラーメッセージ を 返す
エスケープ さ れる 文字列
エスケープ さ れ た 文字列 を 返し ます
mysql _query で 使用 する ため に 文字列 を エスケープ する
取得 する 配列 の 形式 です
評価 さ れ た 結果 リソース
取得 し た 行 を あらわす 文字 列 の 配列 を 返し ます
連想 配列 、 添字 配列 、 また は その 両方 として 結果 の 行 を 取得 する
評価 さ れ た 結果 リソース
取得 し た 行 に 対応 する 文字 列 の 連想 配列 を 返し ます
連想 配列 として 結果 の 行 を 取得 する
インスタンス 化 し 、 プロパティ を 設定 し て 返す クラス の 名前
class _name オブジェクト の コンストラクタ に 渡す オプション の パラメータ の 配列
評価 さ れ た 結果 リソース
取得 さ れ た 行 を 表す 文字 列 プロパティ を 有する オブジェクト object を 返し ます
結果 の 行 を オブジェクト として 取得 する
評価 さ れ た 結果 リソース
取得 さ れ た 行 に 対応 する 文字 列 の 配列 を 返し ます
結果 を 添字 配列 として 取得 する
数値 フィールドオフセット
評価 さ れ た 結果 リソース
結果 について の フラグ を 文字列 で 返し ます
結果 に おい て 指定 し た フィールド の フラグ を 取得 する
数値 フィールドオフセット
評価 さ れ た 結果 リソース
成功 し た 場合 に は 指定 し た フィールド の 長さ 、 失敗 し た 場合 に false を 返し ます
指定 し た フィールド の 長さ を 返す
数値 フィールドオフセット
評価 さ れ た 結果 リソース
成功 し た 場合 に 指定 し た フィールド の 名前 を 、 失敗 し た 場合 に false を 返し ます
結果 に おい て 指定 し た フィールド 名 を 取得 する
数値 フィールドオフセット
評価 さ れ た 結果 リソース
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
結果 ポインタ を 指定 し た フィールドオフセット に セット する
数値 フィールドオフセット
評価 さ れ た 結果 リソース
成功 し た 場合 に テーブル の 名前 を 返し ます
指定 し た フィールド が 含ま れる テーブル の 名前 を 取得 する
数値 フィールドオフセット
評価 さ れ た 結果 リソース
返さ れる フィールド 型 は & quot ;int &quot ; & quot ;real &quot ; & quot ;string &quot ; & quot ;blob &quot ; そして その 他 & raquo ;& nbsp ;mysql ドキュメント で 詳細 が 規定 さ れ て いる 型 の うち の ひとつ に なり ます
結果 に おい て 指定 し た フィールド の 型 を 取得 する
評価 さ れ た 結果 リソース
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
結果 保持 用 メモリ を 開放 する
mysql クライアント の バージョン を 返し ます
mysql クライアント 情報 を 取得 する
mysql 接続
使用 さ れ て いる mysql 接続 の 型 を 表す 文字 列 を 返し ます
mysql ホスト 情報 を 取得 する
mysql 接続
成功 し た 場合 に 文について の 情報 、 失敗 し た 場合 に false を 返し ます
直近 の クエリ について の 情報 を 得る
mysql 接続
直近 の クエリ により auto _increment カラム 用 に 生成 さ れ た id を 返し ます
直近 の クエリ で 生成 さ れ た id を 得る
mysql 接続
成功 し た 場合 に 結果 ポインタ resource を 、 失敗 し た 場合 に false を 返し ます
mysql サーバー 上 で 利用 可能 な データベース の リスト を 得る
評価 さ れ た 結果 リソース
成功 し た 場合 に 結果 セット の 行 の 数 、 失敗 し た 場合 に false を 返し ます
結果 に おける 行 の 数 を 得る
mysql サーバー
パスワード
ユーザー 名
パラメータ client _flags は 、 以下 の 定数 の 組み合わせ です ： 1 2 8 load data local の 処理 を 有効 に する 、 mysql _client _ssl 、 mysql _client _compress 、 mysql _client _ignore _space また は mysql _client _interactive
成功 し た 場合 に mysql 持続 的 リンク id を 、 失敗 し た 場合 に false を 返し ます
mysql サーバー へ の 持続 的 な 接続 を オープン する
mysql 接続
mysql サーバー と の 接続 が 有効 な 場合 に true そう で ない 場合 に false を 返し ます
サーバー と の 接続 状況 を 調べ 、 接続 さ れ て い ない 場合 は 再接 続 する
エスケープ さ れる 文字列
mysql 接続
成功 し た 場合 に エスケープ 後 の 文字 列 、 失敗 し た 場合 に false を 返し ます
sql 文中 で 用いる 文字 列 の 特殊 文字 を エスケープ する
結果 から 取得 する 行 の 番号
評価 さ れ た 結果 リソース
取得 し たい フィールド 名 また は フィールド の オフセット
成功 し た 場合 に mysql 結果 セット の ひとつ の セル の 内容 、 失敗 し た 場合 に false を 返し ます
結果 データ を 得る
選択 する データベース 名
mysql 接続
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
mysql データベース を 選択 する
有効 な 文字 セット 名
mysql 接続
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
クライアント の 文字 セット を 設定 する
mysql 接続
稼働 時間 、 スレッド 、 クエリ 、 オープン さ れ て いる テーブル 、 フラッシュ さ れ た テーブル 、 そして 1 秒あ たり の クエリ 数 を 文字列 で 返し ます
現在 の システム の 状態 を 取得 する
整数 の インデックス （行 / テーブル 番号 ）
mysql _list _tables から 返さ れる 結果 ポインタ resource
成功 し た 場合 に テーブル 名 、 失敗 し た 場合 に false を 返し ます
フィールド の テーブル 名 を 得る
実行 する sql クエリ
mysql 接続
select show describe あるい は explain で は 、 mysql _unbuffered _query は 成功 し た 場合 に resource 、 エラー 時 に false を 返し ます
mysql に sql クエリ を 送信 する が 、 結果 に対し て の フェッチ や バッファリング は 行わ ない
成功 し た 場合 に 空 の 配列 、 それ 以外 の 場合 に false を 返し ます
クライアント の zval キャッシュ の 統計 情報 を 返す
perl 互換 の 正規 表現 形式 の パターン
mysql サーバー へ の ハンドル
クエリー を mysql に 送る とき に 使う コールバック
memcached の インスタンス で 、 mysql memcache daemon プラグイン に 接続 さ せる もの
関連 づけ 、 あるい は その 解除 が 成功 し た 場合 に true 、 エラー が 発生 し た 場合 に false を 返し ます
mysql の 接続 を memcache の 接続 と 関連 づける
入力 の 配列
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
大文字 小文字 を 区別 し ない &quot ; 自然順 &quot ; アルゴリズム を 用い て 配列 を ソート する
プログラマ が 色定 義 を 変更 できる 場合 に true 、 それ 以外 の 場合 に false を 返し ます
端末 の 色 を 変更 可能 か どう か 確認 する
青 コンポーネント の 値 へ の 参照
赤 コンポーネント の 値 へ の 参照
情報 を 取得 し たい 色 の 番号
緑 コンポーネント の 値 へ の 参照
関数 が 成功 し た 場合 は - 1 、 ncurses や 端末 の 色機 能 の 初期 化 が でき て い ない 場合 は 0 を 返し ます
色 の rgb 値 を 取得 する
端末 が カラー 表示 機能 を 持っ て いる 場合 に true 、 持っ て い ない 場合 に false を 返し ます
カラー 端末 か どう か 確認 する
色ペア の 背景 色
色ペア の 前景 色
定義 し たい 色ペア の 番号
関数 が 成功 し た 場合 は - 1 、 ncurses や 端末 の 色機 能 の 初期 化 が でき て い ない 場合 は 0 を 返し ます
色ペア を 定義 する
ncurses を 初期化 する
色ペア の 背景 色 へ の 参照
色ペア の 前景 色 へ の 参照
情報 を 取得 し たい 色ペア の 番号
関数 が 成功 し た 場合 は - 1 、 ncurses や 端末 の 色機 能 の 初期 化 が でき て い ない 場合 は 0 を 返し ます
色ペア の 前景 色 と 背景 色 を 取得 する
成功 し た 場合 に 0 、 色テーブル の 割り 当て に 失敗 し た 場合 や ncurses が 初期化 さ れ て い ない 場合 に - 1 を 返し ます
色機能 を 初期化 する
ビープ 音 を 端末 に 送信 する
作成 し た ボタン を 含む グリッド を 返し ます
作成 し た ボタン を 含む グリッド を 返す
ボタン に 表示 する テキスト
ボタン の x 座標
ボタン の y 座標
作成 し た ボタンコンポーネント へ の リソースリンク 、 あるい は エラー 時 に false を 返し ます
新しい ボタン を 作成 する
チェックボックス の 値 を 表す 文字 を 返し ます
チェックボックスリソース の 値 を 取得 する
チェックボックスリソース を 設定 する
新しい アイテム を チェックボックスツリー に 追加 する
チェックボックスツリーアイテムリソース を 返し ます
チェックボックスツリー の アイテム を 探す
現在 の 選択 さ れ て いる チェックボックスツリーアイテム を 返し ます
チェックボックスツリー の 選択 さ れ て いる アイテム を 返す
成功 し た 場合 に 1 、 失敗 し た 場合 に 0 を 返し ます
newt インターフェイス を 終了 する
フォーム に 追加 する コンポーネント の 配列
コンポーネント を 追加 する フォーム
フォーム に 複数 の コンポーネント を 追加 する
フォームコンポーネント を 実行 し た 後 の 情報 を 返す ため に 使用 する 配列
フォームコンポーネント
フォーム を 実行 する
フォーム に 関連 付け られる 垂直 スクロールバー
ヘルプ 文字列
さまざまな フラグ
作成 さ れ た フォームコンポーネント の リソースリンク 、 あるい は エラー 時 に false を 返し ます
フォーム を 作成 する
現在 の ヘルプ 行 を スタック の 内容 で 置き 換える
新しい ヘルプメッセージ
現在 の ヘルプ 行 を スタック に 保存 し 、 新しい 行 を 表示 する
画面 の 変更 さ れ た 部分 を 更新 する
newt _suspend を コール し た 後 に newt インターフェイス の 使用 を 再開 する
フォームコンポーネント
フォーム の 実行 を 停止 さ せ た コンポーネント を 返し ます
フォーム を 実行 する
コールバック 関数 に 渡さ れる データ
ひとつ の 引数 data を 受け 取る コールバック 関数
ユーザー が サスペンドキー を 押し た 際 に 起動 する コールバック 関数 を 設定 する
キー が 押さ れる まで 結果 を 返さ ない
対象 と なる 配列
内部 配列 ポインタ が 指す 場所 の 次 の 場所 の 値 を 返し ます
内部 配列 ポインタ を 進める
複数 形 の メッセージ id
数 件数 など
単数 形 の メッセージ id
msgid 1 および msgid 2 で 表さ れる メッセージ の 、 数 n に対応 する 複数 形 を 返し ます
gettext の 複数 形版
item は 要素 の 整数 値 、 もしく は 要素 の 定数 名 です
要素 を 文字列 で 返し ます
言語 および ロケール 情報 を 検索 する
リクエストパラメータ の 配列
httpメソッド
エンコード する uri
sbs を 返し ます
sbs を 生成 する
出力 バッファ を クリア 消去 する
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
出力用 バッファ を クリア 消去 し 、 出力 の バッファリング を オフ に する
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
出力用 バッファ を フラッシュ 送信 し 、 出力 の バッファリング を オフ に する
出力 バッファ の 内容 を 返し た 後 で 出力 の バッファリング を 終了 し ます
現在 の バッファ の 内容 を 取得 し 、 出力 バッファ を 削除 する
出力用 バッファ の 内容 を 返し ます
出力用 バッファ の 内容 を 返す
出力 バッファ を 返し ます
出力 バッファ を フラッシュ し 、 その 内容 を 文字 列 として 返し た 後 で 出力 バッファリング を 終了 する
出力 バッファ の 内容 の 長さ を バイト 単位 で 返し ます
出力 バッファ の 長さ を 返す
出力 バッファリングハンドラ の ネストレベル を 返し ます
出力 バッファリング 機構 の ネストレベル を 返す
この ハンドラ の 返り値 について の 情報 は ob _start を 参照く ださい
出力 バッファハンドラ として 文字 エンコーディング を 変換 する
これ は 、 使用 中 の 出力 ハンドラ を （もし 存在 すれ ば ） 配列 で 返し ます
使用 中 の 出力 ハンドラ の 一覧 を 取得 する
オプション の 引数 output _callback 関数 を 指定 する こと が 可能 です
flags は ビットマスク で 、 出力 バッファ 上 で どん な 操作 が できる のか を 制御 し ます
定数 php _output _handler _* の ビットマスク
オプション の パラメータ chunk _size が 渡さ れ た 場合 、 バッファ の 長さ が chunk _size バイト を 超える たび に 、 出力 の 後 で バッファ が フラッシュ さ れ ます
出力 バッファ の 内容
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
出力 の バッファリング を 有効 に する
バッファ
バッファ の モード
修正 し た バッファ を 返し ます
バッファ を 修正 する ため の ob _start コールバック 関数
有効 な oci 8 ステートメント 識別子
bv _name に 関連 づける php の 変数
コロン を 先頭 につけ た バインド 変数 プレースホルダ を ステートメント 内 で 使い ます
oracle が データ を 扱う とき の データ 型
バインド 時 の 最大 長
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
oracle プレースホルダ に php 変数 を バインド する
oci ステートメント
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
カーソル から の 読み込み を キャンセル する
文字列 として バージョン 番号 を 返し ます
oracle クライアント ・ライブラリ の バージョン を 返す
oci _connect 、 oci _pconnect あるい は oci _new _connect が 返す oracle 接続 id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
oracle と の 接続 を 閉じる
クエリ で 使用 する カラム 名
返さ れる カラム の 値 を 格納 する php 変数
返さ れる データ の 型
oci _parse で 作成 し て oci _execute で 実行 し た 有効 な oci 8 ステートメント id 、 あるい は ref cursor ステートメント id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
php の 変数 を 、 クエリ で 取得 する カラム に 関連 づける
オプション の 二 番目 の パラメータ は 、 次 の 定数 のい ずれ かと なり ます
有効 な oci ステートメント id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
文 を 実行 する
返さ れ た 行 を 格納 する 変数
パラメータ flags は 、 配列 の 構造 を あらわし 、 また 連想 配列 を 使う か どう か も あらわし ます
読み込む 行数
oci _parse で 作成 し て oci _execute で 実行 し た 有効 な oci 8 ステートメント id 、 あるい は ref cursor ステートメント id
結果 を 取得 する 際 に 無視 する 行数 デフォルト の 値 は 0 で 、 最初 の 行 から 開始 さ れ ます
output の 行数 を 返し ます
クエリ から の 複数 の 行 を 二次 元配 列 に 取得 する
oci _parse で 作成 し て oci _execute で 実行 し た 有効 な oci 8 ステートメント id 、 あるい は ref cursor ステートメント id
オプション の 第 2 引数 は 、 次 の 定数 の 組み合わせ が 可能 です
連想 配列 や 数値 添字 配列 を 返し ます
クエリ の 次 の 行 を 連想 配列 あるい は 数値 添字 配列 で 返す
oci _parse で 作成 し て oci _execute で 実行 し た 有効 な oci 8 ステートメント id 、 あるい は ref cursor ステートメント id
オブジェクト を 返し ます
クエリ の 次 の 行 を オブジェクト として 返す
oci _parse で 作成 し て oci _execute で 実行 し た 有効 な oci 8 ステートメント id 、 あるい は ref cursor ステートメント id
数 値添 字配 列 を 返し ます
クエリ の 次 の 行 を 配列 で 返す
oci _parse で 作成 し て oci _execute で 実行 し た 有効 な oci 8 ステートメント id 、 あるい は ref cursor ステートメント id
成功 し た 場合 に true 、 statement にもう 行 が ない 場合 に false を 返し ます
クエリ の 次 の 行 を 内部 バッファ に 取得 する
( 1 から 始まる フィールド 番号 、 また は フィールド 名
有効 な oci ステートメント id
field が null の 場合 に true 、 それ 以外 の 場合 に false を 返し ます
フェッチ し た フィールド が null で ある かど う か を 確認 する
フィールド 番号 1 から 始まる あるい は 名前 のい ずれ か
有効 な oci ステートメント id
名前 を 表す 文字 列 、 あるい は エラー 時 に false を 返し ます
文 から の フィールド 名 を 返す
フィールド 番号 1 から 始まる あるい は 名前 のい ずれ か
有効 な oci ステートメント id
精度 を 表す 整数 値 、 あるい は エラー 時 に false を 返し ます
フィールド の 精度 を 問い合わせる
フィールド 番号 1 から 始まる あるい は 名前 のい ずれ か
有効 な oci ステートメント id
桁数 を 表す 整数 値 、 あるい は エラー 時 に false を 返し ます
フィールド の 桁数 を 問い合わせる
フィールド 番号 1 から 始まる あるい は 名前 のい ずれ か
有効 な oci ステートメント id
oracle の データ 型 を 表す 数値 、 あるい は エラー 時 に false を 返し ます
oracle における フィールド の 型 を 問い合わせる
有効 な oci ステートメント id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
文や カーソル に 関連 付け られ た 全て の リソース を 解放 する
これ を false に する と デバッグ 出力 を オフ に し 、 true に する と オン に なり ます
内部 デバッグ 用 の 出力 を 有効 また は 無効 に する
lob の id
lob の id
これら の オブジェクト が 等しい 場合 true を 返し 、 そう で なけれ ば false を 返し ます
2 つの lob / file ロケータ の 等価 性 を 比較 する
oci _connect あるい は oci _pconnect が 返す oracle 接続 id
型 を 作成 し た スキーマ を 指定 し なけれ ば なり ませ ん
有効 な 型名 大文字
新しい ocicollection オブジェクト 、 あるい は エラー 時 に false を 返し ます
新しい コレクションオブジェクト を 割り 当てる
接続先 の oracle インスタンス
oracle クライアントライブラリ が 使う 文字 セット を 指定 し ます
この パラメータ は php 5 pecl oci 8 1
username の パスワード
oracle の ユーザー 名
接続 id 、 あるい は エラー 時 に false を 返し ます
一意 な 接続 を 使っ て oracle サーバー へ 接続 する
有効 な oci ステートメント id
カラム の 数 を 表す 整数 値 、 あるい は エラー 時 に false を 返し ます
ある 文 に おける 結果 の カラム 数 を 返す
oci _connect 、 oci _pconnect あるい は oci _new _connect が 返す oracle 接続 id
sql あるい は pl / sql ステートメント
成功 し た 場合 に ステートメントハンドル 、 あるい は エラー 時 に false を 返し ます
実行 の ため に oracle の 文 を パース する
oci _connect あるい は oci _pconnect が 返す oracle 接続 id
設定 し たい 、 新しい パスワード
データベース 名
旧 パスワード
oracle の ユーザー 名
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
oracle ユーザー の パスワード を 変更 する
接続先 の oracle インスタンス
oracle クライアントライブラリ が 使う 文字 セット を 指定 し ます
この パラメータ は php 5 pecl oci 8 1
username の パスワード
oracle の ユーザー 名
接続 id 、 あるい は エラー 時 に false を 返し ます
持続 的 接続 を 使用 し て oracle データベース に 接続 する
カラム 番号 1 から 始まる また は カラム 名 大文字 のどちらか を 使用 可能 です
抽象型 rowid lob file を 除き 、 全て を 文字 列 として 返し ます
フェッチ し た 行 から フィールド の 値 を 取得 する
バージョン 情報 を 表す 文字 列 、 あるい は エラー 時 に false を 返し ます
oracle データベース の バージョン を 返す
oci _connect 、 oci _pconnect あるい は oci _new _connect が 返す oracle 接続 id
ユーザー が 選ん だ 、 長さ が 最高 6 4 バイト の 文字列
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
クライアント 情報 を 設定 する
sql コマンド & quot ; create edition & quot ; であらかじめ 作成 さ れ た オラクル ・ データベース ・ エディション 名
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
データベース ・ エディション を 設定 し ます
oci _parse が 返す 、 有効 な oci 8 ステートメント id
ステートメント statement の 種類 を 次 のい ずれ か の 値 で 返し ます
ステートメント の 種類 を 返す
onoff が true の 場合 は 自動 コミット が 可能 で あり 、 false の 場合 は 自動 コミット が 使用 不可 と なっ て い ます
odbc 接続 id
onoff パラメータ を 指定 し ない 場合 、 この 関数 は 、 connection _id に関する 自動 コミット の 状態 を 返し ます
自動 コミット の 動作 を オン また は オフ に する
odbc 接続 id
odbc 接続 を 閉じる
結果 id
カーソル 名 を 文字列 で 返し ます
カーソル 名 を 得る
odbc 接続 id
fetch _type は 次 の ふたつ の 定数 sql _fetch _first sql _fetch _next のうち の どちらか です
エラー 時 に は false 、 成功時 に は 配列 を 返し ます
現在 の 接続 について の 情報 を 返す
この パラメータ は 現在 使用 し て いませ ん
odbc 接続 id
sql 文
sql コマンド の 実行 に 成功 し た 場合 に は 、 odbc 結果 id を 返し ます
sql 文 を 準備 し 、 実行 する
プリペアドステートメント の 中 の プレースホルダ が 、 parameter _array 内 の パラメータ で 順 に 置き 換え られ ます
odbc _prepare で 取得 し た 結果 id リソース
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
プリペアドステートメント を 実行 する
odbc _exec の 結果 リソース
ど の 行番 号 を 取得 する のか を 任意 で 指定 する
取得 し た 行 に 対応 する 配列 を 返し ます
連想 配列 として 結果 の 行 を 取得 する
結果 リソース
結果 の 配列
行番号
結果 に おける カラム 番号 を 返し ます
一行ぶん の 結果 を 配列 に 取り込む
結果 id
row _number が 指定 さ れ ない 場合 、 odbc _fetch _row は 、 結果 セット に おける 次 の 行 を 取り込も う と 試み ます
行 が あっ た 場合 に は true 、 それ 以外 の 場合 に false を 返し ます
行 を 取り込む
結果 id
フィールド 名
フィールド 番号 、 あるい は エラー 時 に false を 返し ます
カラム 番号 を 返す
結果 id
フィールド 番号
フィールド 番号 、 あるい は エラー 時 に false を 返し ます
フィールド の 精度 を 得る
結果 id
フィールド 番号
フィールド の 型 を 表す 文字 列 、 あるい は エラー 時 に false を 返し ます
フィールド の データ 型 を 返す
結果 id
常 に true を 返し ます
結果 を 保持 する リソース を 開放 する
データ 型
odbc 接続 id
odbc 結果 id また は 失敗 し た 場合 に false を 返し ます
データソース が サポート する データ 型 について の 情報 を 取得 する
結果 id
php に 返さ れる バイト 数 は 、 パラメータ length により 制御 さ れ ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
long カラム を 処理 する
odbc _exec が 返す 結果 id
フィールド 数 、 あるい は エラー 時 に - 1 を 返し ます
結果 の カラム 数 を 返す
修飾子
odbc 接続 id
所有 者
名前
情報 を 含む odbc 結果 id を 返し ます
指定 し た データソース に 保存 さ れ て いる プロシージャ の リスト を 取得 する
結果 id
テーブル の フォーマット 指定
成功 の 場合 に 結果 の 行数 、 エラー の 場合 に false を 返し ます
html テーブル として 結果 を 出力 する
odbc 接続 id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
トランザクション を ロールバック する
odbc 接続 id
所有 者
unique 属性
テーブル 名
修飾子
正確 さ
odbc 結果 id を 返し ます
テーブル に関する 統計 情報 を 取得 する
table _type が 空 の 文字列 で は ない 場合 、 検索 する 型 に ついて カンマ で 区切っ た 値 の リスト を 指定 する 必要 が あり ます
修飾子
odbc 接続 id
所有 者
名前
情報 を 含ん で いる odbc 結果 id を 返し ます
指定 し た データソース に 保存 さ れ た テーブル の 名前 の リスト を 取得 する
コンパイル し たい php スクリプト へ の パス
file を 正常 に コンパイル し た とき に true を 返し ます
php スクリプト を 、 実行 せ ずに コンパイル し て キャッシュ する
情報 の 配列 を 返し ます
キャッシュ について の 構成 情報 を 取得
スクリプト 固有 の 状態 の 情報 を 含む
情報 の 配列 を 返し ます
キャッシュ について の ステータス 情報 を 取得
出力 ファイル へ の パス
オプション の パラメータ notext を 設定 する と 、 出力 内容 の 冗長 性 が 変化 し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
csr を ファイル に エクスポート する
オプション の パラメータ notext を 設定 する と 、 出力 内容 の 冗長 性 が 変化 し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
csr を 文字 列 として エクスポート する
証明書 で 使用 さ れる 識別 名
デフォルト で は 、 システム の openssl
privkey に は 、 事前 に openssl _pkey _new （ あるい は その 他 の openssl _pkey 系 の 関数 ） で 作成 し た 秘密 鍵 を 設定 し ます
extraattribs は 、 csr に関する 追加 の 設定 情報 を 設定 する ため に 使用 し ます
csr を 返し ます
csr を 作成 する
返さ れる array に ダイジェスト の エイリアス を 含める べき 場合 、 true に 設定 し ます
利用 可能 な ダイジェスト ・メソッド の array
利用 可能 な ダイジェスト ・メソッド を 取得
成功 し た 場合 に 、 ここに pkcs # 1 2 が 保存 さ れ ます
使用 できる 値 の 一覧 は キー / 証明 書 パラメータ を 参照く ださい
pkcs # 1 2 ファイル の ロック を 解除 する ため の パスワード
pkcs # 1 2 ファイル の プライベートキーコンポーネント
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
pkcs # 1 2 互換 の 証明 書保存 ファイル を 変数 に エクスポート する
成功 し た 場合 に 、 ここに 認証 ストアデータ が 格納 さ れ ます
pkcs # 1 2 ファイル の ロック を 解除 する ため の パスワード
認証 ストア の 内容
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
pkcs # 1 2 認証 ストア を パース し て 配列 形式 に する
headers は 、 暗号化 さ れ た 後 に データ の 前 に 付加 さ れる ヘッダ の 配列 です
暗号 定数 のうち の 一つ
flags は オプション として 使用 可能 で あり 、 エンコード 処理 を 変更 する ため に 指定 し ます
x
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
s / mime メッセージ を 暗号 化 する
headers は 、 ヘッダ の 配列 です
flags を 出力 を 変更 する ため に 使用 する こと が 可能 です
extracerts に は 、 サイン に 含める ため の 他 の 一連 の 証明 書 を 記述 し た ファイル 名 を 指定 し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
s / mime メッセージ に サイン する
cainfo が 指定 さ れ た 場合 、 検証 処理 で 使用 する ため に 認証 済み の ca 証明 書 に関する 情報 を 保持 する 必要 が あり ます
メッセージ へ の パス
outfilename を 指定 する 場合 、 メッセージ に 署名 し た 人 の 証明 書 が pem 形式 で 保存 さ れ た ファイル の 名前 を この 変数 に 指定 する 必要 が あり ます
ファイル 名 ととも に content を 指定 する と 、 検証 し た データ が ここ に 格納 さ れ ます
flags により 署名 の 検証 方法 を 指定 する こと が 可能 です
extracerts が 指定 さ れ た 場合 、 これ は 未認 証 の ca として 一連 の 証明 書 を 使用 する ため の ファイル の 名前 と なり ます
署名 が 検証 さ れ た 場合 は true 、 正しく ない 場合 メッセージ が 改暫 さ れ たか 署名 に 用い られ た 証明 書 が 無効 は false 、 エラー の 場合 に - 1 を 返し ます
s / mime で サイン さ れ た メッセージ の 署名 を 検証 する
オプション で passphrase を 使用 し て キー を 保護 する こと が 可能 です
出力 ファイル へ の パス
configargs により openssl 設定 ファイル の 設定 を 追加 し たり 上書き し たり する こと で 、 エクスポート 処理 の 詳細 設定 が 可能 です
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
エクスポート 可能 な 形式 で 、 キー を ファイル に 取得 する
オプション で passphrase を 使用 し て キー を 保護 する こと が 可能 です
configargs により openssl 設定 ファイル の 設定 を 追加 し たり 上書き し たり する こと で 、 エクスポート 処理 の 詳細 設定 が 可能 です
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
エクスポート 可能 な 形式 で 、 キー を 文字列 に 取得 する
キー を 保持 する リソース
秘密鍵 を 開放 する
key は 以下 のい ずれ か です
指定 さ れ た キー が （ パスフレーズ を 用い て ） 暗号 化 さ れ て いる 場合 は 、 オプション の パラメータ passphrase を 使用 する 必要 が あり ます
成功 し た 場合 に 正 の キーリソース id 、 エラー 時 に false を 返し ます
秘密鍵 を 取得 する
padding に は 、 openssl _pkcs 1 _ padding 、 openssl _sslv 2 3 _ padding 、 openssl _pkcs 1 _ oaep _padding 、 openssl _no _padding が 指定 可能 です
key は 、 データ の 暗号 化 に 使用 し た もの に対応 する 秘密 鍵 で ある 必要 が あり ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
秘密鍵 で データ を 復号 する
padding に は openssl _pkcs 1 _ padding あるい は openssl _no _padding が 指定 可能 です
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
秘密鍵 で データ を 暗号 化 する
公開鍵
暗号化 し た 結果 が ここ に 格納 さ れ ます
padding に は openssl _pkcs 1 _ padding 、 openssl _sslv 2 3 _ padding 、 openssl _pkcs 1 _ oaep _padding 、 openssl _no _padding が 指定 可能 です
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
公開鍵 で データ を 暗号 化 する
これ を 渡し て おく と 、 使っ た アルゴリズム が 暗号 学的 に 強い もの で ある かど う か を 表す boolean 値 が 格納 さ れ ます
希望 する バイト 長
成功 し た 場合 は 指定 し た バイト 長 の string を 返し ます
疑似 乱数 の バイト 文字 列 を 生成 する
暗号化 し た キー の 配列
シール 済み の データ
シール する データ
公開鍵 リソース id の 配列
暗号化 の 手法
成功時 に シール 暗号 化 さ れ た データ の 長 さ 、 エラー 時 に false を 返し ます
データ を シール 暗号 化 する
成功 し た 場合 、 署名 が signature に 格納 さ れ ます
resource - openssl _get _privatekey が 返す鍵
署名 し たい データ の 文字列
int - いずれ か の 署名 アルゴリズム
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
署名 を 生成 する
証明書
秘密鍵
key が cert に対応 する 秘密 鍵 の 場合 に true 、 それ 以外 の 場合 に false を 返し ます
秘密鍵 が 証明 書 に 対応 する か を 確認 する
指定 し た 場合 は 、 これ が 証明 書 を 含む pem エンコード さ れ た ファイル の 名前 に なり ます
cainfo は 、 証明書 の 認証 で 説明 し た よう な 信頼 できる ca ファイル / ディレクトリ の 配列 です
調べ たい 証明 書
証明書 が 意図 し た 目的 に 使用 可能 で ある 場合 に true 、 使用 でき ない 場合 に false 、 エラー の 場合 に - 1 を 返し ます
証明書 が 特定 の 目的 に 使用 可能 か どう か 確認 する
shortnames は 、 配列 中 で の データ の 添字 付け の 方法 を 設定 し ます
返さ れる データ の 構造 について は （わざ と ）まだ 文書化 し て いませ ん
x 5 0 9 証明 書 を パース し 、 配列 として 情報 を 返す
成功 し た 場合 に リソース id 、 失敗 し た 場合 に false を 返し ます
x
文字
ascii 値 を 返し ます
文字 の ascii 値 を 返す
関数 へ の 引数 を カンマ 区切り の 文字 列 で 指定 し ます
上書き する 関数
関数 の 新しい コード
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
組み込み の 関数 を 上書き する
フォーマット 文字 列 は 、 フォーマットコード の 後 に オプション の 反復 指定 用引 数 が 続く 形式 と なっ て い ます
バイナリ 文字 列 を 含む データ を 返し ます
データ を バイナリ 文字列 に パック する
process _sections パラメータ に true を 設定 する と 、 セクション 名 と 設定 が 含ま れ た 多次 元 の 配列 を 得る こと が でき ます
ini _scanner _normal デフォルト あるい は ini _scanner _raw
パース し たい ini ファイル の ファイル 名
成功 し た 場合 に 設定 を 連想 配列 形式 で 返し ます
設定 ファイル を パース する
パース し たい ini ファイル の 内容
ini _scanner _normal デフォルト あるい は ini _scanner _raw
process _sections を true に 設定 する と 、 セクション 名 と 設定 を 含む 多次 元 配列 を 返し ます
成功 し た 場合 に 設定 を 連想 配列 形式 で 返し ます
設定 文字列 を パース する
2 番目 の 引数 arr が 指定 さ れ た 場合 、 変数 は 、 代わり に 配列 の 要素 として この 変数 に 保存 さ れ ます
入力 文字列
文字列 を 処理 し 、 変数 に 代入 する
パース する url
完全 に おかし な 形式 の url について は 、 parse _url は false を 返し ます
url を 解釈 し 、 その 構成 要素 を 返す
引数 return _var が 存在 する 場合 、 unix コマンド の ステータス が この 変数 に 書か れ ます
実行 する コマンド
外部 プログラム を 実行 し 、 未整 形 の 出力 を 表示 する
password _hash が 作っ た ハッシュ
三つ の 要素 を 持つ 連想 配列 を 返し ます
指定 し た ハッシュ に関する 情報 を 返す
ユーザー の パスワード
パスワード の ハッシュ に 使う アルゴリズム を 表す パスワードアルゴリズム 定数
オプション を 含む 連想 配列
ハッシュ し た パスワード を 返し ます
パスワードハッシュ を 作る
パスワード の ハッシュ に 使う アルゴリズム を 表す パスワードアルゴリズム 定数
password _hash が 作っ た ハッシュ
オプション を 含む 連想 配列
指定 し た algo と options に マッチ する ため に ハッシュ の 再計 算 が 必要 な 場合 は true 、 それ 以外 の 場合 は false を 返し ます
指定 し た ハッシュ が オプション に マッチ する かど う か を 調べる
ユーザー の パスワード
password _hash が 作っ た ハッシュ
パスワード と ハッシュ が マッチ する 場合 に true 、 それ 以外 の 場合 に false を 返し ます
パスワード が ハッシュ に マッチ する かど う か を 調べる
ファイルポインタ は 有効 なもの で なけれ ば なら ず 、 また popen で 正常 に オープン さ れ た もの で ある 必要 が あり ます
実行 し て い た プロセス の 終了 ステータス を 返し ます
プロセス の ファイルポインタ を クローズ する
待機 する 秒数
それ まで に 予定 さ れ て い た アラーム の 予定 時刻 まで の 秒数 を 返し ます
シグナル を 送信 する アラーム を 設定 する
envs は 、 プログラム に 渡す 環境 変数 の 配列 です
args は 、 プログラム に 渡す 引数 文字 列 の 配列 です
path は 、 バイナリ 実行 ファイル へ の パス か 、 あるい は 有効 な 実行 ファイル を 指す shebang 例 : #! / usr / local / bin / perl が 一行目 に 存在 する スクリプト へ の パス で ある 必要 が あり ます
エラー 時 に false を 返し 、 成功 時 に は 何 も 返し ませ ん
現在 の プロセス 空間 で 指定 し た プログラム を 実行 する
成功時 に 、子プロセス の pid が 親 プロセス の 実行 スレッド に 返さ れ 、 子 プロセス の 実行 スレッド に は 0 が 返さ れ ます
現在 実行 中 の プロセス を フォーク する
指定 し なかっ た 場合 は 、 現在 の プロセス の pid を 使用 し ます
prio _pgrp 、 prio _user あるい は prio _process のいずれ か
pcntl _getpriority は プロセス の 優先 度 を 返し ます
プロセス の 優先 度 を 取得 する
指定 し ない 場合 は 、 現在 の プロセス の pid を 使用 し ます
prio _pgrp 、 prio _user あるい は prio _process のいずれ か です
priority は 一般 的 に は - 2 0 から 2 0 まで の 値 です
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
プロセス の 優先 度 を 変更 する
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ペンディングシグナル 用 の ハンドラ を コール する
処理 する シグナル
シグナルハンドラ
シグナル 番号
再 起動 の システムコール に 対応 する かど う か を 設定 し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
シグナルハンドラ を 設定 する
タイムアウト の 秒数
タイムアウト の ナノ 秒数
待つ シグナル の 配列
シグナル について の 情報 を 含む 配列 が siginfo に 設定 さ れ ます
成功 し た 場合 に pcntl _sigtimedwait は シグナル 番号 を 返し ます
タイムアウト つき で シグナル を 待つ
パラメータ status は 、 pcntl _waitpid が 正常 に コール さ れ た 際 に 得 られ ます
リターンコード を 表す 整数 値 を 返し ます
終了 し た 子 プロセス の リターンコード を 返す
パラメータ status は 、 pcntl _waitpid が 正常 に コール さ れ た 際 に 得 られ ます
子 プロセス の ステータスコード が 終了 に 成功 し た 場合 に true 、 それ 以外 の 場合 に false を 返し ます
ステータスコード が 正常 終了 を 表し て いる かど う か を 調べる
パラメータ status は 、 pcntl _waitpid が 正常 に コール さ れ た 際 に 得 られ ます
捕捉 さ れ なかっ た シグナル の せい で 子 プロセス が 終了 し た 場合 に true 、 それ 以外 の 場合 に false を 返し ます
ステータスコード が シグナル による 終了 を 表し て いる かど う か を 調べる
パラメータ status は 、 pcntl _waitpid が 正常 に コール さ れ た 際 に 得 られ ます
リターン を 生じ た 子 プロセス が 現在 停止 し て いる 場合 に true 、 それ 以外 の 場合 に false を 返し ます
子 プロセス が 現在 停止 し て いる かど う か を 調べる
パラメータ status は 、 pcntl _waitpid が 正常 に コール さ れ た 際 に 得 られ ます
シグナル 番号 を 表す 整数 値 を 返し ます
子 プロセス を 終了 さ せ た シグナル を 返す
構造体 要素 やその 他 の 内容 を アクティブ に する
現在 の ページ に 起動 用注 記 を 追加 する [ 古い 関数 ]
移動先 を 作成 する
新しい テーブル 、 あるい は 既存 の テーブル に セル を 追加 する
textflow を 作成 する か 、 既存 の textflow に テキスト を 追加 する
現在 の ページ に サムネイル を 追加 する
現在 の ページ に web リンク を 追加 する [ 古い 関数 ]
時計 回り に 円弧 を 描く
新しい pdf ファイル を 作成 する
構造体 要素 ある い は その 他 の 内容 を オープン する
レイヤー を 開始 する
新規 ページ を 開始 する
新規 ページ を 開始 する [ 古い 関数 ]
テンプレート 定義 を 開始 する
テンプレート 定義 を 開始 する [ 古い 関数 ]
現在 の パス に 切り取る
画像 を 閉じる
ページハンドル を 閉じる
pdf ドキュメント 入力 を 閉じる [ 古い 関数 ]
pdf ドキュメント を 閉じる [ 古い 関数 ]
パス を 閉じ 、 パス に 沿っ て 線 を 描く
現在 の パス を 閉じる
行列 を ctm に 追加 する
3d ビュー を 作成 する
オブジェクト や イベント に対する アクション を 作成 する
矩形 の 注記 を 作成 する
ブックマーク を 作成 する
textflow オブジェクト を 作成 する
ベジエ 曲線 を 描く
レイヤー 定義 を 作成 する
pdflib 仮想 ファイル を 削除 する
textflow オブジェクト を 削除 する
pdflib オブジェクト を 削除 する
グリフ 名 や unicode 値 を 追加 する
pdf ファイル を 閉じる
type 3 フォント 定義 を 終了 する
構造体 要素 やその 他 の 内容 を 閉じる
すべて の アクティブ な レイヤー を 無効 に する
ページ を 終了 する
パターン を 終了 する
テンプレート を 終了 する
現在 の パス を 終了 する
画像 ブロック を さまざまな データ で 塗り つぶす
pdf ブロック を さまざまな データ で 塗り つぶす
後 で 使用 する フォント を 準備 する [ 古い 関数 ]
インポート し た pdf ページ を 配置 する
テーブル を ページ に 配置 する
textflow を 矩形 領域 に 配置 する
pdf 出力 バッファ を 取得 する
エラーテキスト を 取得 する
エラー 番号 を 取得 する
メジャーバージョン 番号 を 取得 する [ 古い 関数 ]
マイナーバージョン 番号 を 取得 する [ 古い 関数 ]
文字列 パラメータ を 取得 する
pdi 文字列 パラメータ を 取得 する [ 古い 関数 ]
数 値型 の pdi パラメータ を 取得 する [ 古い 関数 ]
読み込ま れ た フォント について の 詳細 情報 を 問い合わせる
テーブル の 情報 を 取得 する
textflow の 状態 を 問い合わせる
テキスト の 行 の フォーマット を 行い 、 メトリクス を 問い合わせる
描画 状態 を リセット する
3d モデル を 読み込む
フォント を 検索 し 、 準備 する
icc プロファイル を 検索 し 、 準備 する
スポット 色 を 作成 する
現在 の 位置 を 設定 する
pdflib オブジェクト を 作成 する
raw ccitt イメージ を オープン する [ 古い 関数 ]
pdf ファイル を 作成 する [ 古い 関数 ]
ファイル から イメージ を 読み込む [ 古い 関数 ]
pdi ドキュメント を 準備 する
ページ を 準備 する
stream 、 fstream あるい は string 型 の pcos パス の 内容 を 取得 する
name 、 string あるい は boolean 型 の pcos パス の 値 を 取得 する
イメージ を ページ 上 に 置く [ 古い 関数 ]
インポート さ れ た pdf ドキュメント を 処理 する
矩形 を 描く
描画 状態 を 復元 する
ページ を 再開 する
座標系 を 回転 する
描画 状態 を 保存 する
スケール を 設定 する
注記 の 周り の 境界 の 破線 形式 を 設定 する [ 古い 関数 ]
注記 の 周り の 境界 の 形式 を 設定 する [ 古い 関数 ]
文字列 パラメータ を 設定 する
テキスト の 位置 を 設定 する
破線 パターン を 設定 する
平面度 を 設定 する
塗りつぶし 色 を グレー に 設定 する [ 古い 関数 ]
色 を グレー に 設定 する [ 古い 関数 ]
linecap パラメータ を 設定 する
linejoin パラメータ を 設定 する
線幅 を 設定 する
miter limit を 設定 する
描画 rgb 色 を 設定 する [ 古い 関数 ]
シェーディング で 領域 を 塗り つぶす
指定 し た 位置 に テキスト を 出力 する
座標系 を 歪ませる
テキスト の 幅 を 返す
ページ を 停止 する
文字列 を utf - 1 6 から utf - 8 に 変換 する
文字列 を utf - 3 2 から utf - 1 6 に 変換 する
持続 的 な internet また は unix ドメインソケット 接続 を オープン する
pg _query pg _query _params あるい は pg _execute から 返さ れる postgresql の クエリ 結果 リソース
クエリ によっ て 変更 さ れ た 行 の 数 を 返し ます
変更 さ れ た レコード タプル の 数 を 返す
postgresql データベース 接続 リソース
クライアント の エンコーディング を 返し ます
クライアント の エンコーディング を 取得 する
postgresql データベース 接続 リソース
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
postgresql 接続 を クローズ する
pgsql _connect _force _new が 渡さ れ た 場合 は 、 たとえ connection _string が 既存 の 接続 と まっ たく 同 一 で あっ ても 新しい 接続 を オープン し ます
すべ て デフォルト の パラメータ を 使用 する 場合 に は connection _string を 空に する こと が 可能 です
成功 し た 場合 に postgresql の 接続 リソース 、 失敗 し た 場合 に false を 返し ます
postgresql 接続 を オープン する
postgresql データベース の 接続 リソース
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
接続 を リセット 再接 続 する
postgresql データベース の 接続 リソース
pgsql _connection _ok あるい は pgsql _connection _bad
接続 ステータス を 取得 する
変換 さ れる データ
postgresql データベース の 接続 リソース
pgsql _conv _ignore _default pgsql _conv _force _null あるい は pgsql _conv _ignore _not _null の 組み合わせ
変換 対象 と なる テーブル の 名前
変換 さ れ た 値 の 配列 を 返し ます
連想 配列 の 値 を 、 sql 文 として 実行 可能 な 形式 に 変換 する
rows の 中 で 、 sql の null をど の よう に 表現 する か
table _name に コピー する データ の 配列
postgresql データベース の 接続 リソース
rows の 要素 内 で 、 各 フィールド に 対応 する 値 を 区切る 文字
rows を コピー する テーブル の 名前
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
配列 から テーブル に 挿入 する
rows の 中 で 、 sql の null をど の よう に 表現 する か
データ を rows に コピー する テーブル の 名前
postgresql データベース の 接続 リソース
rows の 要素 内 で 、 各 フィールド に 対応 する 値 を 区切る 文字
copy さ れ た データ が 1 行ご と に ひとつ の 要素 と なっ て いる 配列 を 返し ます
配列 に テーブル を コピー する
その キー が table _name テーブル の フィールド 名 、 値 が 削除 し たい フィールド の 値 と なっ て いる 配列
pgsql _conv _force _null 、 pgsql _dml _no _conv 、 pgsql _dml _escape 、 pgsql _dml _exec 、 pgsql _dml _async あるい は pgsql _dml _string を 組み合わせ た 数
postgresql データベース の 接続 リソース
行 を 削除 する テーブル の 名前
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
レコード を 削除 する
postgresql データベース 接続 リソース
bytea 型 の カラム に 挿入 する テキスト また は バイナリデータ を 含む 文字列
エスケープ さ れ た データ を 文字列 で 返し ます
bytea フィールド に 挿入 する ため に 文字列 を エスケープ する
結果 リソース から 取得 する カラム の 番号
pg _query pg _query _params あるい は pg _execute から 返さ れる postgresql の クエリ 結果 リソース
結果 カラム の 全て の 値 を 配列 で 返し ます
指定 し た カラム の 全て の 行 を 配列 として 取得 する
result _type は 、 返り値 の 形式 を 制御 する オプション の パラメータ です
pg _query pg _query _params あるい は pg _execute から 返さ れる postgresql の クエリ 結果 リソース
取得 する 行番 号
0 から 始まる 数値 添字 の 配列 か 連想 配列 （ フィールド 名 を キー と する ）、 あるい は その 両方 を 返し ます
行 を 配列 として 取得 する
pg _query pg _query _params あるい は pg _execute から 返さ れる postgresql の クエリ 結果 リソース
取得 する 行番 号
個々 の 値 を 文字 列 として 格納 し た 配列 を 返し ます
数 値添 字 の 配列 として 行 を 得る
取得 する 結果 の 行番 号
pg _query pg _query _params あるい は pg _execute から 返さ れる postgresql の クエリ 結果 リソース
（ 0 から 始まる ） フィールド 番号 を 表す 数値 、 あるい は フィールド 名 を 表す 文字列
指定 し た 行 の フィールド が sql の null だっ た 場合 に 1 、 そう で ない 場合 に 0 を 返し ます
フィールド が sql の null かどう か 調べる
pg _query pg _query _params あるい は pg _execute から 返さ れる postgresql の クエリ 結果 リソース
結果 の 行番 号
フィールド の 表示 さ れる 長さ を 返し ます
表示 さ れる 長さ を 返す
0 から 始まる フィールド 番号
pg _query 、 pg _query _params あるい は pg _execute その 他 も 含む から 返さ れ た 、 postgresql クエリ 結果 リソース
デフォルト で は 、 フィールド が 属 する テーブル の 名前 が 返さ れ ます
成功 し た 場合 に フィールド の テーブル 名 あるい は oid 、 あるい は 失敗 し た 場合 に false を 返し ます
tables フィールド の 名前 あるい は oid を 返す
pg _query pg _query _params あるい は pg _execute から 返さ れる postgresql の クエリ 結果 リソース
フィールド 番号
フィールド の 型 に 対応 する oid を 返し ます
フィールド 番号 に 対応 する 型 id （oid ） を 返す
pg _query pg _query _params あるい は pg _execute から 返さ れる postgresql の クエリ 結果 リソース
フィールド 番号
フィールド 型 の 名前 を 文字列 で 返し ます
フィールド 番号 に 対応 する 型名 を 返す
pg _query pg _query _params あるい は pg _execute から 返さ れる postgresql の クエリ 結果 リソース
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
メモリ を 開放 する
result _type は 、 返り値 の 形式 を 制御 する オプション の パラメータ です
postgresql データベース の 接続 リソース
notify メッセージ 名 と バックエンド の pid を 含む 配列 を 返し ます
sql notify メッセージ を 取得 する
postgresql データベース の 接続 リソース
バックエンド の データベース の プロセス id
バックエンド の プロセス id を 得る
postgresql データベース 接続 リソース
connection が 接続 し て いる ホスト の 名前 を 文字列 で 返し ます
接続 に 関連 する ホスト 名 を 返す
pgsql _conv _opts 、 pgsql _dml _no _conv 、 pgsql _dml _escape 、 pgsql _dml _exec 、 pgsql _dml _async あるい は pgsql _dml _string を 組み合わせ た 数
テーブル table _name の フィールド 名 を キー に 、 挿入 する 内容 を 値に もつ 配列
postgresql データベース の 接続 リソース
行 を 挿入 する テーブル の 名前
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
テーブル に 配列 を 挿入 する
postgresql データベース 接続 リソース
指定 し た connection の 直近 の エラーメッセージ を 含む 文字 列 を 返し ます
特定 の 接続 から 直近 の エラーメッセージ 文字 列 を 取得 する
postgresql データベース の 接続 リソース
指定 さ れ た connection の 直近 の 通知 を 文字列 で 返し ます
postgresql サーバー から の 直近 の 通知 メッセージ を 返す
pg _query pg _query _params あるい は pg _execute から 返さ れる postgresql の クエリ 結果 リソース
指定 さ れ た connection で 、 直近 に 挿入 さ れ た 行 に 割り当て られ た oid を 文字列 で 返し ます
直近 の 行 の オブジェクト id を 返す
postgresql large object lob resource returned by pg _lo _open
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ラージオブジェクト を クローズ する
object _id が 指定 さ れる と 、 この 関数 は 指定 さ れ た id の ラージオブジェクト を 作成 しよ う とし ます
postgresql データベース 接続 リソース
ラージオブジェクト の oid を 返し ます
ラージオブジェクト を 生成 する
postgresql データベース 接続 リソース
ラージオブジェクト を クライアント の ファイルシステム に 書き込む際 の フルパス と ファイル 名
データベース 内 の ラージオブジェクト の oid
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ラージオブジェクト を ファイル に エクスポート する
object _id が 指定 さ れる と 、 この 関数 は 指定 さ れ た id の ラージオブジェクト を 作成 しよ う とし ます
postgresql データベース 接続 リソース
クライアント の ファイルシステム から ラージオブジェクト 用 データ を 読み込む 際 の フルパス と ファイル 名
作成 さ れ た ラージオブジェクト の oid を 返し ます
ファイル から ラージオブジェクト を インポート する
読み込み 専用 の & quot ;r &quot ;、 書き込み 専用 の & quot ;w &quot ;、 読み書き 可能 な & quot ;rw &quot ; のいずれ か
postgresql データベース 接続 リソース
データベース 内 の ラージオブジェクト の oid
ラージオブジェクト の リソース を 返し ます
ラージオブジェクト を オープン する
pg _lo _open によって 返さ れ た postgresql ラージオブジェクト lob リソース
読み込ん だ バイト 数 を 返し ます
ラージオブジェクト 全体 を 読み込み ブラウザ に 直接 送信 する
pg _lo _open によって 返さ れ た postgresql ラージオブジェクト lob リソース
返す データ の 最大 バイト 数 （ オプション ）
ラージオブジェクト から len バイト の データ を 文字列 で 返し ます
ラージオブジェクト を 読み込む
pg _lo _open が 返す postgresql の ラージオブジェクト lob リソース
シーク する バイト 数
定数 pgsql _seek _set （ オブジェクト の 先頭 から シーク する ）、 pgsql _seek _cur （ カレント の 位置 から シーク する ）、 あるい は pgsql _seek _end （ オブジェクト の 最後 から シーク する ） の 中 の ひとつ
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ラージオブジェクト の 位置 を シーク する
postgresql データベース 接続 リソース
データベース 内 の ラージオブジェクト の oid
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ラージオブジェクト を 削除 する
pg _lo _open によって 返さ れ た postgresql ラージオブジェクト lob リソース
ラージオブジェクト に 書き込む データ
書き込む データ の 最大 バイト 数 （ オプション ）
ラージオブジェクト に 書き込ん だ バイト 数 を 返し ます
ラージオブジェクト を 書く
拡張 メタデータ を 返す かど う か を 表す フラグ
postgresql データベース の 接続 リソース
テーブル の 名前
テーブル 定義 の 配列 を 返し ます
テーブル から メタデータ を 取得 する
pg _query pg _query _params あるい は pg _execute から 返さ れる postgresql の クエリ 結果 リソース
結果 の フィールド （ カラム ） 数 を 返し ます
フィールド 数 を 返す
postgresql データベース 接続 リソース
connection の オプション を 文字列 で 返し ます
接続 に 関連 する オプション を 取得 する
postgresql データベース 接続 リソース
指定 可能 な param _name に は 以下 が 含ま れ ます
パラメータ の 値 を 文字列 で 返し ます
サーバー の パラメータ 設定 を 検索 する
postgresql データベース 接続 リソース
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
データベース 接続 を 調べる
postgresql データベース 接続 リソース
connection が 指し て いる データベース の ポート 番号 を 含む int を 返し ます
接続 に 関連 する ポート 番号 を 返す
postgresql データベース 接続 リソース
プリペアドステートメント につける 名前
パラメータ 化 し た sql 文
成功 し た 場合 に クエリ 結果 リソース 、 失敗 し た 場合 に false を 返し ます
指定 し た パラメータ で プリペアドステートメント を 作成 する リクエスト を 送信 し 、 その 完了 を 待つ
postgresql データベース 接続 リソース
実行 する 1 つまた は 複数 の sql 文
成功 し た 場合 に クエリ 結果 リソース 、 失敗 し た 場合 に false を 返し ます
クエリ を 実行 する
以下 の fieldcode が 使用 可能 です
実行 し た ステートメント の クエリ 結果 リソース
エラーフィールド の 内容 を 文字列 で 返し ます
エラー 報告 の 各 フィールド を 返す
pg _query pg _query _params あるい は pg _execute から 返さ れる postgresql の クエリ 結果 リソース
文字列 を 返し ます
結果 に 関連 する エラーメッセージ を 取得 する
結果 リソース 内 で 、 内部 オフセット を 移動 さ せる 行
pg _query pg _query _params あるい は pg _execute から 返さ れる postgresql の クエリ 結果 リソース
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
結果 リソース の 内部 行 オフセット を 設定 する
pgsql _conv _force _null 、 pgsql _dml _no _conv 、 pgsql _dml _escape 、 pgsql _dml _exec 、 pgsql _dml _async あるい は pgsql _dml _string の 組み合わせ
テーブル table _name の フィールド 名 を キー に 、 そして 取得 対象 と なる 行 に マッチ する データ を 値に もつ 配列
postgresql データベース の 接続 リソース
行 を 選択 する テーブル の 名前
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
レコード を 選択 する
postgresql データベース 接続 リソース
実行 する プリペアドステートメント の 名前
プリペアドステートメント 中 の $ 1 、$ 2 など の プレースホルダ を 置き換える パラメータ の 配列
成功 し た 場合 に true 、 失敗 し た 場合 に false を 返し ます
指定 し た パラメータ で プリペアドステートメント を 実行 する リクエスト を 送信 し 、 その 結果 を 待た ない
postgresql データベース 接続 リソース
プリペアドステートメント につける 名前
パラメータ 化 し た sql 文
成功 し た 場合 に true 、 失敗 し た 場合 に false を 返し ます
指定 し た パラメータ で プリペアドステートメント を 作成 する リクエスト を 送信 し 、 その 結果 を 待た ない
プリペアドステートメント 中 の $ 1 、$ 2 など の プレースホルダ を 置き換える パラメータ の 配列
パラメータ 化 し た sql 文
postgresql データベース の 接続 リソース
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
コマンド と パラメータ を 分割 し て サーバー に 送信 し 、 その 結果 を 待た ない
postgresql データベース 接続 リソース
実行 する ひとつまた は 複数 の sql 文
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
非 同期 クエリ を 送信 する
postgresql データベース 接続 リソース
クライアントエンコーディング
成功 し た 場合 に 0 、 エラー 時 に - 1 を 返し ます
クライアント の エンコーディング を 設定 する
postgresql データベース の 接続 リソース
pgsql _transaction _idle （ アイドル 状態 ）、 pgsql _transaction _active （ コマンド の 実行 中 ）、 pgsql _transaction _intrans （ 正常 な トランザクション 内 で アイドル 状態 ）、 あるい は pgsql _transaction _inerror （ 失敗 し た トランザクション 内 で アイドル 状態 ） のいずれか を 返し ます
サーバー 上 で 実行 中 の トランザクション の 状態 を 返す
postgresql データベース 接続 リソース
connection の デバッグ tty を 文字列 で 返し ます
接続 に関する tty 名 を 返す
postgresql データベース 接続 リソース
always returns true
postgresql 接続 の トレース を 無効 に する
テーブル table _name の フィールド 名 を キー に 、 そして マッチ し た 対象 を 更新 する データ を 値に もつ 配列
pgsql _conv _force _null 、 pgsql _dml _no _conv 、 pgsql _dml _escape 、 pgsql _dml _exec 、 pgsql _dml _async あるい は pgsql _dml _string の 組み合わせ
行 を 更新 する テーブル の 名前
postgresql データベース の 接続 リソース
テーブル table _name の フィールド 名 を キー に 、 そして 取得 対象 と なる 行 に マッチ する データ を 値に もつ 配列
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
テーブル を 更新 する
postgresql データベース 接続 リソース
client protocol および server の キー と その 値 を 持つ 配列 を 返し ます （ 有効 な 場合 ）
クライアント ・ プロトコル ・ サーバー の バージョン を 配列 で 返す
調べる ファイル の 名前
error _message パラメータ が 指定 さ れ た 場合 、 文法 チェック の 際 に 生成 さ れ た エラーメッセージ が ここ に 格納 さ れ ます
文法 チェック が 成功 し た 場合 に true 、 チェック が 失敗 し たり file _name が オープン でき なかっ た 場合 に false を 返し ます
指定 し た ファイル の 文法 チェック （ と 実行 ） を 行う
読み込ま れ て いる php
読み込ま れ た php
成功 する と 、
追加 の ini ディレクトリ に ある
phpe 9 5 6 8 f 3 4 - d 4 2 8 - 1 1 d 2 - a 7 6 9 - 0 0 aa 0 0 1 acf 4 2 を 返し ます
ロゴ の guid を 取得 する
php ファイル へ の パス
成功 し た 場合 に 処理 済み の ソースコード 、 失敗 し た 場合 に 空 の 文字列 を 返し ます
コメント と 空白 文字 を 取り除い た ソース を 返す
mode は 、 どの よう な 情報 を 返す の か を 一文字 で 指定 し ます : &# 0 3 9 ; a &# 0 3 9 ; : デフォルト です
説明 を 文字列 で 返し ます
php が 稼動 し て いる オペレーティングシステム に関する 情報 を 返す
以下 に ある constants ビット 値 を ひとつまた は 複数 個 を 加算 し て 、 オプション の what 引数 に 渡す こと によっ て 出力 を カスタマイズ でき ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
php の 設定 情報 を 出力 する
オプション で 指定 する 拡張 モジュール 名
オプション の extension パラメータ が 指定 さ れ て いる 場合 、 phpversion はその 拡張 モジュール の バージョン を 返し ます
現在 の php バージョン を 取得 する
posix _f _ok 、 posix _r _ok 、 posix _w _ok および posix _x _ok のうち の ひとつ あるい は 複数 から なる マスク
調べる ファイル の 名前
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ファイル の アクセス 権限 を 判断 する
処理 に 成功 し た 場合 は 、 現在 制御 し て いる 端末 の パス 名 を 表す 文字 列 を 返し ます
制御 する 端末 の パス 名 を 得る
実効 グループ id を 表す 整数 値 を 返し ます
現在 の プロセス の 有効 な グループ id を 返す
ユーザー id を 表す 整数 値 を 返し ます
現在 の プロセス の 有効 な ユーザー id を 返す
実際 の グループ id を 表す 整数 値 を 返し ます
現在 の プロセス の 実際 の グループ id を 返す
グループ の 名前
以下 の 要素 を 持つ 配列 を 返し ます
指定 し た 名前 の グループ に関する 情報 を 返す
現在 の プロセス の グループセット について 、 グループ id を 表す 整数 値 を 含む 配列 を 返し ます
現在 の プロセス の グループセット を 返す
ユーザー の ログイン 名 を 文字列 で 返し ます
ログイン 名 を 返す
プロセス id
id を 表す 整数 値 を 返し ます
ジョブ 制御 の プロセスグループ id を 得る
id を 表す 整数 値 を 返し ます
現在 の プロセス の グループ id を 返す
id を 表す 整数 値 を 返し ます
親 プロセス の id を 返す
英数 字 で 表し た ユーザー 名
成功 し た 場合 は 次 の 要素 を 持つ 配列 、 それ 以外 の 場合 は false を 返し ます
指定 し た 名前 の ユーザー に関する 情報 を 返す
ユーザー id
返さ れる 連想 配列 の 要素 は 次 の よう に なり ます
指定 id の ユーザー に関する 情報 を 返す
各 リソース に関する 制限 値 を 含む 連想 配列 を 返し ます
システムリソース 制限 に関する 情報 を 返す
プロセス id
id を 表す 整数 値 を 返し ます
プロセス の 現在 の sid を 得る
id を 表す 整数 値 を 返し ます
現在 の プロセス の 実際 の ユーザー id を 返す
ファイル 記述子
fd が オープン さ れ て おり 、 かつ 端末 に 接続 さ れ て いる 場合 に true 、 それ 以外 の 場合 に false を 返し ます
ファイル 記述子 が 対話 型端 末 で ある かど う か を 定義 する
pcntl シグナル 定数 のいずれ か
プロセス id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
プロセス に シグナル を 送信 する
fifo ファイル へ の パス
2 番目 の パラメータ mode は 、 8 進表 記 例 : 0 6 4 4 で 指定 する 必要 が あり ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
fifo スペシャルファイル 名前 付き パイプ を 作成 する
作成 する ファイル
この パラメータ は 、 ファイル 型 以下 の 定数 posix _s _ifreg 、 posix _s _ifchr 、 posix _s _ifblk 、 posix _s _ififo あるい は posix _s _ifsock のうち の ひとつ および パーミッション の 論理 和 で 構成 さ れ ます
メジャーデバイスカーネル id s _ifchr あるい は s _ifblk を 使用 し て いる 場合 に 渡す 必要 が あり ます
マイナーデバイスカーネル id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
スペシャルファイル あるい は 通常 の ファイル を 作成 する posix
ユーザー id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
現在 の プロセス の 実効 uid を 設定 する
グループ id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
現在 の プロセス の gid を 設定 する
ソフトリミット 、 単位 は 、 リソース 制限 が 必要 と する 任意 の 単位 です
設定 さ れる リミット に 対応 する リソースリミット 定数 です
ハードリミット 、 単位 は 、 リソース 制限 が 必要 と する 任意 の 単位 です
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
システムリソース 制限 を 設定
ユーザー id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
現在 の プロセス の uid を 設定 する
posix _get _last _error が 返す posix エラー 番号
エラーメッセージ を 表す 文字 列 を 返し ます
指定 し た エラー 番号 に 対応 する システム の エラーメッセージ を 取得 する
現在 の プロセス の cpu 使用 状況 に関する 情報 を 表す 文字 列 を 連想 配列 として 返し ます
プロセス 時間 を 得る
ファイル 記述子
成功 し た 場合 に fd の 絶対 パス を 表す 文字 列 、 失敗 し た 場合 に false を 返し ます
端末 の デバイス 名 を 調べる
システム に関する 情報 を 文字 列 の 連想 配列 として 返し ます
システム 名 を 得る
subject が 配列 の 場合 は 配列 を 、 それ 以外 の 場合 は 文字列 を 返し ます
正規 表現 による 検索 と 置換 を 行う
flags に は 以下 の フラグ を 指定 でき ます
検索 する パターン を 表す 文字列
通常 、 検索 は 対象 文字 列 の 先頭 から 開始 さ れ ます
matches を 指定 し た 場合 、 検索 結果 が 代入 さ れ ます
入力 文字列
この フラグ を 設定 し た 場合 、 各 マッチ に 対応 する 文字 列 の オフセット も 返さ れ ます
preg _match は 、 pattern が 指定 し た subject に マッチ し た 場合 に 1 を 返し ます
正規 表現 による マッチング を 行う
オプション の delimiter を 指定 する と 、 ここで 指定 し た 文字 も エスケープ さ れ ます
入力 文字列
クォート さ れ た エスケープ し た 文字列 を 返し ます
正規 表現 文字 を クオート する
この コールバック 関数 は 、 検索 対象 文字 列 で マッチ し た 要素 の 配列 が 指定 さ れ て コール さ れ ます
subject 文字列 に おける 各 パターン の 最大 置換 回数
指定 し た 場合 は 、 置換 を 行っ た 回数 が ここ に 格納 さ れ ます
検索 する パターン
文字列 あるい は 文字列 の 配列 で 、 検索 および 置換 の 対象 と なる 文字 列 を 指定 し ます
preg _replace _callback は 、 subject が 配列 の 場合 に は 配列 を 、 それ 以外 の 場合 は 文字列 を 返し ます
正規 表現 検索 を 行い 、 コールバック 関数 を 使用 し て 置換 を 行う
検索 ・ 置換 対象 と なる 文字 列 もしく は 文字列 の 配列 subject が 配列 の 場合 、 検索 と 置換 は subject の 各要 素 に対し て 行わ れ 、 返り値も 配列 と なり ます
この 引数 が 指定 さ れる と 、 置換 回数 が 渡さ れ ます
置換 を 行う 文字 列 もしく は 文字列 の 配列
subject 文字列 に おい て 、 各 パターン による 置換 を 行う 最大 回数
検索 を 行う パターン
preg _replace は 、 subject 引数 が 配列 の 場合 は 配列 を 、 その 他 の 場合 は 文字列 を 返し ます
正規 表現 検索 および 置換 を 行う
この フラグ を 設定 する と 、 文字 列分 割用 の パターン 中 の カッコ による サブパターン で キャプチャ さ れ た 値 も 同時 に 返さ れ ます
これ を 指定 し た 場合 、 最大 limit 個 の 部分 文字 列 を 返し ます
flags は 、 次 の フラグ を 組み合わ せ た もの と する （ ビット 和演 算子 | で 組み合わせる ） こと が 可能 です
この フラグ を 設定 し た 場合 、 各 マッチ に 対応 する 文字 列 の オフセット も 返さ れ ます
検索 する パターン を 表す 文字列
この フラグ を 設定 する と 、 空文 字列 で ない もの だけ が preg _split により 返さ れ ます
入力 文字列
pattern に マッチ し た 境界 で 分割 し た subject の 部分 文字 列 の 配列 を 返し ます
正規 表現 で 文字列 を 分割 する
print _r の 結果 を 取得 し たい 場合 に は return 引数 を 使い ます
表示 し たい 式
string 、 integer float を 指定 し た 場合 は その 値 が 出力 さ れ ます
指定 し た 変数 に関する 情報 を 解り やすく 出力 する
入力 データ
常 に 1 を 返し ます
文字列 を 出力 する
閉じ られる proc _open リソース
実行 し て い た プロセス の 終了 状態 を 返し ます
proc _open で 開か れ た プロセス を 閉じ 、 その プロセス の 終了 コード を 返す
変更 する 優先 度 の 増加 値
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
現在 の プロセス の 優先 度 を 変更 する
確認 する クラス 名 、 もしく は クラス の オブジェクト を 指定 し ます
プロパティ 名 を 指定 し ます
プロパティ が 存在 し て いる 場合 は true 、 存在 し て い ない 場合 に false 、 エラー 時 に は null を 返し ます
オブジェクト もしく は クラス に プロパティ が 存在 する かど う か を 調べる
ブックマーク の 表示 に 使用 する テキスト
open が ゼロ で ない 場合 、 ブックマーク は pdf ビューア 上 で 開い た 形 で 表示 さ れ ます
ps _new が 返す 、 postscript ファイル の リソース id
新しい ブックマーク の 親と なる 、 事前 に この 関数 で 作成 さ れ た ブックマーク
返り値 は ブックマーク へ の 参照 です
現在 の ページ に ブックマーク を 追加 する
リンク が クリック さ れ た 際 に 開始 する プログラム の パス
左下角 の x 座標
右上角 の x 座標
ps _new が 返す 、 postscript ファイル の リソース id
左下角 の y 座標
右上角 の y 座標
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ファイル を 実行 する ため の リンク を 追加 する
dest は 、 ドキュメント が どの よう に 表示 さ れる か を 指定 し ます
左下角 の x 座標
右上角 の x 座標
リンク が クリック さ れ た 際 に 開始 する ページ
左下角 の y 座標
右上角 の y 座標
ps _new が 返す 、 postscript ファイル の リソース id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
同 一 ドキュメント 内 の ページ へ の リンク を 追加 する
円 の 中心 の x 座標
終了 位置 の 角度 を 度単 位 で 指定
円 の 半径
円 の 中心 の y 座標
ps _new が 返す 、 postscript ファイル の リソース id
開始 位置 の 角度 を 度単 位 で 指定
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
反時 計回り に 円弧 を 描く
円 の 中心 の x 座標
終了 位置 の 角度 を 度単 位 で 指定
円 の 半径
円 の 中心 の y 座標
ps _new が 返す 、 postscript ファイル の リソース id
開始 位置 の 角度 を 度単 位 で 指定
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
時計 回り に 円弧 を 描く
ピクセル 単位 の ページ の 高さ 例 : a 4 の 場合 は 8 4 2
ピクセル 単位 の ページ の 幅 例 : a 4 の 場合 は 5 9 6
ps _new が 返す 、 postscript ファイル の リソース id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
新しい ページ を 開始 する
パターン を 水平 方向 に 並べる 際 の ピクセル 単位 の 間隔
ピクセル 単位 の パターン の 高さ
ピクセル 単位 の パターン の 幅
ps _new が 返す 、 postscript ファイル の リソース id
1 あるい は 2 で なけれ ば なり ませ ん
パターン を 垂直 方向 に 並べる 際 の ピクセル 単位 の 間隔
パターン の id を 返し ます
新しい パターン を 開始 する
ps _new が 返す 、 postscript ファイル の リソース id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
現在 の パス を 描画 範囲 として 指定 する
ps _open _image あるい は ps _open _image _file が 返す 、 画像 の リソース id
ps _new が 返す 、 postscript ファイル の リソース id
画像 を 閉じ 、 メモリ を 開放 する
ps _new が 返す 、 postscript ファイル の リソース id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
パス を 閉じる
最初 の 制御 点 の x 座標
3 番目 の 制御 点 の y 座標
最初 の 制御 点 の y 座標
ps _new が 返す 、 postscript ファイル の リソース id
2 番目 の 制御 点 の y 座標
2 番目 の 制御 点 の x 座標
3 番目 の 制御 点 の x 座標
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
曲線 を 描く
ps _new が 返す 、 postscript ファイル の リソース id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ページ を 終了 する
ps _new が 返す 、 postscript ファイル の リソース id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
パターン を 終了 する
ps _new が 返す 、 postscript ファイル の リソース id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
テンプレート を 終了 する
ps _new が 返す 、 postscript ファイル の リソース id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
現在 の パス を 塗り つぶす
直線 の 終了 地点 の x 座標
ps _new が 返す 、 postscript ファイル の リソース id
直線 の 終了 地点 の y 座標
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
直線 を 描く
ps _new が 返す 、 postscript ファイル の リソース id
スポット 色 の 名前 、 例え ば pantone 5 5 6 5
成功 し た 場合 に スポット 色 の id を 、 失敗 し た 場合 に ゼロ を 返し ます
スポット 色 を 作成 する
移動 する 位置 の y 座標
ps _new が 返す 、 postscript ファイル の リソース id
移動 する 位置 の x 座標
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
現在 位置 を 設定 する
成功 し た 場合 に postscript ドキュメント の リソース を 、 失敗 し た 場合 に false を 返し ます
新しい postscript ドキュメントオブジェクト を 作成 する
postscript ファイル の 名前
ps _new が 返す 、 postscript ファイル の リソース id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
出力用 の ファイル を 開く
画像 データ を 含む ファイル の 名前
使用 さ れませ ん
使用 さ れませ ん
ps _new が 返す 、 postscript ファイル の リソース id
画像 の 形式
成功 し た 場合 に 画像 の id を 、 失敗 し た 場合 に ゼロ を 返し ます
ファイル から 画像 を 開く
画像 の 拡大 率
画像 の 左下角 の y 座標
ps _open _image あるい は ps _open _image _file が 返す 、 画像 の リソース id
ps _new が 返す 、 postscript ファイル の リソース id
画像 の 左下角 の x 座標
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
画像 を ページ に 配置 する
矩形 の 左下角 の y 座標
画像 の 幅
矩形 の 左下角 の x 座標
ps _new が 返す 、 postscript ファイル の リソース id
画像 の 高さ
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
矩形 を 描く
回転 角度 を 度単 位 で 指定 し ます
ps _new が 返す 、 postscript ファイル の リソース id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
回転 の 程度 を 設定 する
ps _new が 返す 、 postscript ファイル の リソース id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
現在 の コンテキスト を 保存 する
設定 する 情報 フィールド の 名前
ps _new が 返す 、 postscript ファイル の リソース id
情報 フィールド の 値
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ドキュメント の 情報 を 設定 する
ps _new が 返す 、 postscript ファイル の リソース id
パラメータ の 値
使用 できる 名称 について は ps _get _parameter を 参照く ださい
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
パラメータ を 設定 する
新しい テキスト 位置 の y 座標
ps _new が 返す 、 postscript ファイル の リソース id
新しい テキスト 位置 の x 座標
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
テキスト の 出力 位置 を 設定 する
テキスト を どの よう に 見せる か
name は 以下 の うち の ひとつ です
行間 を ピクセル で 指定 する
単語 の 間隔 を 空白 文字 に対する 比率 で 設定 する
出力 テキスト の x 座標
ps _new が 返す 、 postscript ファイル の リソース id
出力 テキスト の y 座標
パラメータ の 値
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
値 を 設定 する
colorspace の 値 によっ て 、 blue 成分 rgb の 場合 、 yellow 成分 cmyk の 場合 のいずれ かと なり ます
colorspace が cmyk の 場合 に のみ 設定 さ れ 、 black 成分 の 値 を 指定 し ます
type は both 、 fill 、 あるい は fillstroke のいずれ か です
colorspace は gray 、 rgb 、 cmyk 、 spot 、 pattern のいずれ か です
colorspace の 値 によっ て 、 green 成分 rgb の 場合 、 magenta 成分 cmyk の 場合 のいずれ かと なり ます
colorspace の 値 によっ て 、 red 成分 rgb の 場合 、 cyan 成分 cmyk の 場合 、 グレースケール gray の 場合 、 スポット 色 の id あるい は パターン の id のいずれ かと なり ます
ps _new が 返す 、 postscript ファイル の リソース id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
色 を 設定 する
破線 と 破線 の 間隔 の 長さ
破線 の 長さ
ps _new が 返す 、 postscript ファイル の リソース id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
破線 の 形状 を 設定 する
フォント の サイズ
ps _new が 返す 、 postscript ファイル の リソース id
ps _findfont が 返す 、 フォント id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
以降 の 出力 で 用いる フォント を 設定 する
値 は 0 （ 白 ） から 1 （ 黒 ） まで の 間 で なけれ ば なり ませ ん
ps _new が 返す 、 postscript ファイル の リソース id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
グレー 値 を 設定 する
線端 の 形式
ps _new が 返す 、 postscript ファイル の リソース id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
線端 の 形状 を 設定 する
ps _new が 返す 、 postscript ファイル の リソース id
線 の 幅 ポイント 数
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
線幅 を 設定 する
出力 する テキスト
ps _new が 返す 、 postscript ファイル の リソース id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
テキスト を 出力 する
フォント の サイズ
使用 する フォント の id
ps _new が 返す 、 postscript ファイル の リソース id
幅 を 計算 する テキスト
文字列 の 幅 を ポイント 数 で 返し ます
文字列 の 幅 を 取得 する
ord は 、 フォントエンコーディングベクタ の 中 で の グリフ の 位置 です
使用 する フォント の id
ps _new が 返す 、 postscript ファイル の リソース id
指定 さ れ た フォント の グリフ 名 を 返し ます
グリフ 名 を 取得 する
フォント の サイズ
ord は 、 フォントエンコーディングベクタ の 中 で の グリフ の 位置 です
使用 する フォント の id
ps _new が 返す 、 postscript ファイル の リソース id
グリフ の 幅 を ポイント 数 で 返し ます
グリフ の 幅 を 取得 する
ps _new が 返す 、 postscript ファイル の リソース id
フォントエンコーディングベクタ の 中 で の グリフ の 位置
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
グリフ を 出力 する
変換後 の 座標 系 の 原点 の y 座標
ps _new が 返す 、 postscript ファイル の リソース id
変換後 の 座標 系 の 原点 の x 座標
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
座標 変換 を 設定 する
個人 の 単語 リスト
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
個人 の 単語 リスト を 保持 する ファイル を 設定 する
この ファイル は php の 実行 ユーザー たとえ ば nobody が 書き込み 可能 で ある 必要 が あり ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
置換 候補 を 保持 する ファイル を 設定 する
連続 し た 単語 を 複合 語 として 扱う 場合 な true 、 それ 以外 の 場合 は false
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
複合語 を 有効 な 単語 の 組み合わ せ として 考慮 する
パラメータ spelling は 、 英語 の よう に 複数 の スペル が ある 言語 に関し て スペル の 指定 を 行う もの です
パラメータ jargon は 、 同じ language および spelling パラメータ を 有する 2 つの 異 なる 単語 リスト を 区別 する ため の 追加 情報 を 有し て い ます
パラメータ mode は 、 スペルチェッカ の 動作 モード です
パラメータ encoding は 、 単語 の エンコーディング として 予想 さ れる もの です
パラメータ language は 、 2 文字 の iso 6 3 9 言語 コード と オプション で ダッシュ また は アンダースコア の 後 に 2 文字 の iso 3 1 6 6 国 コード から なる 言語 コード です
成功 し た 場合 に ディレクトリリンク 識別子 、 失敗 し た 場合 に false を 返し ます
新規 辞書 を ロード する
&quot ;foo =bar &quot ; 形式 の 設定
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
環境 変数 の 値 を 設定 する
fopen が 返す ファイルハンドル
fielddesc は 、 各 フィールド の 設定 を 保持 する 配列 です
px _new が 返す paradox データベース の リソース id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
新しい paradox データベース を 作成 する
date で 使用 する の と 同じ 形式 の 文字 列 フォーマット
px _field _date 型 の paradox データベースフィールド に 格納 さ れる 値
px _new が 返す paradox データベース の リソース id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
日付 を 文字列 に 変換 する
px _new が 返す paradox データベース の リソース id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
paradox データベース の リソース を 削除 する
入力 データ を データベース に 保存 する 際 の エンコーディング
出力用 の エンコーディング
データベースヘッダ に 格納 さ れる テーブル 名
name は 、 以下 のい ずれ か です
px _new が 返す paradox データベース の リソース id
パラメータ の 値 、 失敗 し た 場合 に false を 返し ます
パラメータ を 取得 する
返さ れる 配列 の キー を 小文字 また は 大文字 に 変換 する ため に 、 オプション の mode に px _keytolower あるい は px _keytoupper を 指定 する こと が でき ます
px _new が 返す 、 paradox データベース の リソース id
データベースファイル の スキーマ を 連想 配列 で 返し ます
データベーススキーマ を 返す
name は 以下 のい ずれ か です
px _new が 返す 、 paradox データベース の リソース id
プライマリキー の 数
パラメータ の 値 、 失敗 し た 場合 に false を 返し ます
値 を 取得 する
px _retrieve _record など が 返す 、 フィールド 値 を 含む 連想 配列 あるい は 数値 添字 配列
px _new が 返す paradox データベース の リソース id
失敗 し た 場合 に は false 、 成功 し た 場合 に は レコード 数 を 返し ます
paradox データベース に レコード を 挿入 する
失敗 し た 場合 は false を 返し ます
新しい paradox オブジェクト を 作成 する
px _new が 返す paradox データベース の リソース id
データベースファイル 内 の レコード の 数 を 返し ます
データベース 内 の レコード の 数 を 返す
px _new が 返す 、 paradox データベース の リソース id
file は 、 実際 の データベースファイル を パラメータ に 指定 し て fopen を コール し た とき の 返り 値 です
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
paradox データベース を オープン する
例え ば px _retrieve _record が 返す よう な 形式 で の フィールド 値 を 含む 、 連想 配列 あるい は 数値 添字 配列
この オプションパラメータ で 、 データベース 内 の 現在 の 位置 以降 の レコード 番号 を 指定 し ます
px _new が 返す paradox データベース の リソース id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
paradox データベース に レコード を 保存 する
ファイル の 名前
px _new が 返す paradox データベース の リソース id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
blob を 読み込む ファイル 名 を 設定 する
出力用 の エンコーディング
入力 データ を データベース に 保存 する 際 の エンコーディング
設定 し たい パラメータ の 内容 に 応じ て 、 name に は 以下 のい ずれ か を 指定 し ます
px _new が 返す 、 paradox データベース の リソース id
データベースヘッダ に 格納 さ れる テーブル 名
パラメータ に 設定 する 値
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
パラメータ を 設定 する
出力用 の エンコーディング
px _new が 返す paradox データベース の リソース id
エンコーディング が 設定 さ れ て い ない 場合 は false を 返し ます
文字 フィールド の エンコーディング を 設定 する 非推奨
name は 以下 のい ずれ か です
px _new が 返す 、 paradox データベース の リソース id
プライマリキー の 数
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
値 を 設定 する
paradox データベース の リソース id
date で 使用 する の と 同じ 形式 の 文字 列 フォーマット
paradox データベースフィールド に 保存 さ れ た 、 px _field _time 型 あるい は px _field _timestamp 型 の 値
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
タイムスタンプ を 文字列 に 変換 する
px _retrieve _record が 返す フィールド 値 を 含む 連想 配列
レコード 番号 は 人為 的 な 番号 で 、 レコード が データベース に 格納 さ れ た 順番 を 表し ます
px _new が 返す 、 paradox データベース の リソース id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
paradox データベース の レコード を 更新 する
入力 文字列
エンコード さ れ た 文字列 を 返し ます
8 ビット 文字列 を quoted -printable 文字列 に 変換 する
入力 文字列
メタ 文字 を クォート し た 文字列 を 返し ます
メタ 文字 を クォート する
結果 が 返っ て こなかっ た 場合 に 最大 何回 まで リクエスト を 繰り返す か を max _tries に 指定 し ます
port は 、 サーバー と の 接続 に 使用 する udp ポート を 指定 し ます
secret パラメータ に は 、 サーバーホスト に 対する 共有 秘密 鍵 が 渡さ れ ます
timeout パラメータ に は 、 サーバー から 応答 を 受信 する 際 の タイムアウト を 秒単 位 で 指定 し ます
hostname は サーバー の ホスト を fqdn あるい は ドット 区切り の ip アドレス 形式 で 指定 し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
サーバー を 追加 する
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
すべて の リソース を 開放 する
設定 ファイル へ の パス を 、 引数 として radius _config に渡し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
指定 し た 設定 ファイル を ライブラリ に 読み込ませる
radius _access _request あるい は radius _accounting _request のいずれ か
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
課金 あるい は 認証 の リクエスト を 作成 する
復元 し た 文字列 、 あるい は エラー 時 に は false を 返し ます
データ を 復元 する
属性 の 型 、 ベンダ および データ を 含む 連想 配列 か 、 エラー 時 に は false を 返し ます
ベンダ 固有 の 属性 を 取得 する
属性 の 型
ipv 4 アドレス を 表す 文字列
radius リソース
属性 の オプション の ビットマスク
属性 の タグ
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ip アドレス 属性 を 設定 する
属性 の 型
属性 の オプション の ビットマスク
radius リソース
属性 の 値
属性 の タグ
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
バイナリ 属性 を 設定 する
属性 の 型
属性 の オプション の ビットマスク
radius リソース
属性 の 値
属性 の タグ
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
整数 属性 を 設定 する
属性 の 型
属性 の オプション の ビットマスク
radius リソース
属性 の 値
属性 の タグ
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
文字列 属性 を 設定 する
属性 の 型
radius リソース
文字列 形式 の ipv 4 アドレス
属性 の オプション の ビットマスク
属性 の タグ
ベンダー id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ベンダー 固有 の ip アドレス 属性 を 設定 する
属性 の 型
属性 の 値
radius リソース
属性 の オプション の ビットマスク
属性 の タグ
ベンダー id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ベンダー 固有 の バイナリ 属性 を 設定 する
属性 の 型
属性 の 値
radius リソース
属性 の オプション の ビットマスク
属性 の タグ
ベンダー id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ベンダー 固有 の 整数 属性 を 設定 する
属性 の 型
属性 の 値
radius リソース
属性 の オプション の ビットマスク
属性 の タグ
ベンダー id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ベンダー 固有 の 文字 列属 性 を 設定 する
リクエスト 認証子 を 文字列 で 返し ます
リクエスト 認証子 を 返す
失敗 し た radius 関数 から の エラーメッセージ を 文字列 で 返し ます
エラーメッセージ を 返す
シーケンス の 最初 の 値
値 が end に 達する まで シーケンス が 続き ます
step が 指定 さ れ て いる 場合 、 それ は 要素 毎 の 増加 数 と なり ます
start から end まで の 整数 の 配列 を 返し ます
ある 範囲 の 整数 を 有する 配列 を 作成 する
エンコード する url
- _
rfc 3 9 8 6 に 基づき url エンコード を 行う
opendir が 事前 に オープン し た ディレクトリハンドル リソース
成功 し た 場合 に エントリ 名 、 失敗 し た 場合 に false を 返し ます
ディレクトリハンドル から エントリ を 読み込む
オプション の 2 番目 の 引数 を 使用 し て 、 これ に true を 設定 する こと により 、 include _path の ファイル の 検索 も 行う こと が でき ます
コンテキストストリームリソース
読み込も う と する ファイル の 名前
ファイル から 読み込ん だ バイト 数 を 返し ます
ファイル を 出力 する
ファイル 名 を 指定 し ます
include _path に ある ファイル も 検索 し たい 場合 、 この オプションパラメータ を 1 に 設定 し て くだ さい
ファイル から 読み込ん だ 解凍 さ れ た データ の バイト 数 を 返し ます
gz ファイル を 出力 する
確認 メッセージ
callback 関数 が 受け 取る パラメータ は ひとつ で 、 ユーザー から 返さ れ た 入力 です
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
readline コールバックインターフェイス と 端末 を 初期化 し 、 プロンプト を 表示 し て 結果 を すぐ に 返す
インストール さ れ た コールバック が 削除 でき た 場合 に true 、 削除 する ハンドラ が 見つ から なかっ た 場合 に false を 返し ます
インストール さ れ た ハンドラ を 削除 し 、 端末 の 設定 を もと に 戻す
文字 を 読み込み 、 改行 を 受け 取る と readline コールバックインターフェイス に 通知 する
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ヒストリ を クリア する
指定 し た 場合 は 、 これ が その 設定 の 新しい 値 と なり ます
変数 の 名前
パラメータ を 指定 し ない で コール し た 場合 、 この 関数 は readline が 使用 する すべて の 設定 の 値 を 配列 で 返し ます
種々 の readline の 内部 変数 を 取得 / 設定 する
コマンドラインヒストリ 全体 の 配列 を 返し ます
ヒストリ を 一覧 表示 する
カーソル が 新しい 行 に 移動 し た こと を readline に 通知 する
コマンドヒストリ を 含む ファイル へ の パス
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ヒストリ を 読み込む
画面 を 再描 画 する
保存 する ファイル へ の パス
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ヒストリ を 書き こむ
ユーザー に 示す 確認 文字 列 を 指定 し ます
ユーザー から 取得 し た 文字列 を 一つ だけ 返し ます
一行読 み 込む
シンボリックリンク の パス
シンボリックリンク ・パス の 内容 を 返し ます
シンボリックリンク 先 を 返す
出力 として 使用 する ローカルファイルハンドルリソース
入力 として 使用 する ローカルファイルハンドルリソース
変換 指令 の 型
応じる こと が でき ない 場合 に false 、 それ 以外 の 場合 に true を 返し ます
コード 変換 指令 に 基づき ファイル から ファイル に コード 変換 する
変換 指令 の 型
変換 する 文字列
変換後 の 文字 列 、 また は 変換 指令 を 実行 でき ない 場合 に false を 返し ます
コード 変換 指令 に 基づき 文字 列 の コード を 変換 する
シャットダウン 関数 に パラメータ を 渡す に は 、 ここ で 追加 の パラメータ を 渡し ます
登録 する コールバック
シャットダウン 時 に 実行 する 関数 を 登録 する
も と の 関数 名
関数 original _name の 新しい 名前
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
グローバル の 関数 テーブル で 関数 名 を 変更 する
注意 : 変更 前 の 名前
注意 : コンテキスト の サポート は 、 php 5
変更後 の 名前
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ファイル を リネーム する
ファイルポインタ は 有効 なもの で なけれ ば なら ず 、 また fopen で 正常 に オープン さ れ た ファイル を 指し て いる 必要 が あり ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ファイルポインタ の 位置 を 先頭 に 戻す
丸める 値
オプション で 指定 する 、 丸める 桁数
次 の 定数 のい ずれ か を 使っ て 、 丸め の モード を 指定 し ます
丸め た 値 を 返し ます
浮動 小数 点数 を 丸める
rpm _open で オープン し た ファイルポインタリソース
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
rpm ファイル を 閉じる
rpm _open で オープン し た ファイルポインタリソース
rpm ヘッダ から 取得 する タグ の 番号
関数 に 渡し た tagnum の 値 により 、 返り値 の 型 は いろいろ な 形式 に なりえ ます
rpm ファイル から ヘッダタグ を 取得 する
入力 の 配列
オプション の パラメータ sort _flags により ソート の 動作 を 修正 可能 です
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
配列 を 逆順 に ソート する
入力 文字列
character _mask パラメータ により 、 削除 する 文字 を 指定 する こと も 可能 です
変更後 の 文字列 を 返し ます
文字列 の 最後 から 空白 もしく は その 他 の 文字 を 取り除く
関数 や クラス の 定義 を 読み込む ファイル 名
runkit _import _* 系 の 定数 の 論理 和
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ファイル から 関数 や クラス の 定義 を 読み込み 、 必要 に 応じ て 書き 換える
php コード を 含む 、 チェック 対象 の ファイル
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
指定 し た ファイル の php 文法 を チェック する
チェック 対象 の php コード
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
指定 し た php コード の 文法 を チェック する
ひとつ の パラメータ を 受け 取る 関数 の 名前
出力 の 処理 を 設定 する runkit _sandbox クラス の インスタンス
前 に 定義 さ れ て い た 出力 ハンドラコールバック の 名前 を 返し ます
サンドボックス 内 で の 出力 を 取得 ・ 処理 する ため の 関数 を 指定 する
調べる ディレクトリ
context パラメータ の 説明 について は 、 マニュアル の ストリーム を 参照く ださい
デフォルト で は 、 ソート 順 は アルファベット 昇順 です
成功 し た 場合 に ファイル 名 の 配列 、 失敗 し た 場合 に false を 返し ます
指定 さ れ た パス の ファイル と ディレクトリ の リスト を 取得 する
リクエスト の 終了 時 に 自動 的 に セマフォ を 開放 する かど う か を 指定 し ます
同 時に セマフォ を 得る こと が 可能 な プロセス 数 を max _acquire に セット し ます
セマフォ の パーミッション
成功 し た 場合 に 正 の セマフォ id 、 エラー 時 に は false を 返し ます
セマフォ id を 得る
sem _get が 返す セマフォリソースハンドル
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
セマフォ を 解放 する
sem _get が 返す セマフォリソース id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
セマフォ を 削除 する
シリアル 化 する 値
value の 保存 可能 な バイトストリーム 表現 を 含む 文字 列 を 返し ます
値 の 保存 可能 な 表現 を 生成 する
session 配列 の 変更 を 破棄 し て セッション を 終了 し ます
new _cache _expire が 指定 さ れ た 場合 、 現在 の キャッシュ の 有効 期限 は 、 new _cache _expire で 置換 さ れ ます
session
現在 の キャッシュ の 有効 期限 を 返す
現在 の セッションクッキー の 情報 を 配列 として 返し ます
セッションクッキー の パラメータ を 得る
id が 指定 さ れ た 場合 、 現在 の セッション id を 置換 し ます
session _id は 現在 の セッション の セッション id を 返し ます
現在 の セッション id を 取得 また は 設定 する
変数 名
session _is _registered は 、 name という 名前 の グローバル 変数 が 現在 の セッション に 登録 さ れ て いる 場合 に true 、 それ 以外 の 場合 に false を 返し ます
変数 が セッション に 登録 さ れ て いる かど う か を 調べる
module が 指定 さ れ た 場合 、 その モジュール を 代わり に 使用 し ます
現在 の セッションモジュール の 名前 を 返し ます
現在 の セッションモジュール を 取得 また は 設定 する
セッション の 名前 を 参照 し ます
現在 の セッション の 名前 を 返し ます
現在 の セッション 名 を 取得 また は 設定 する
true に 設定 する と 、 各 エラー の エラーメッセージ も 返さ れ ます
エラー の 数 を 配列 で 返し ます
エラー の 数 および 直近 の エラーメッセージ を 返す
関連付け られ た 古い セッション を 削除 する かどう か
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
現在 の セッションid を 新しく 生成 し た もの と 置き 換える
セッション の シャットダウン 関数
session 配列 を 元 の 値 で 再初 期化 し ます
クッキー が 動作 する ドメイン 上 の パス
true の 場合 は 、 php で セッションクッキー を 設定 する 際 に httponly フラグ の 送信 を 試み ます
true の 場合 は 、 セキュア な 接続 の 場合 に のみ クッキー を 送信 し ます
クッキー の ドメイン
セッションクッキー の 有効 期限
セッションクッキーパラメータ を 設定 する
オプション の 連想 配列 を 指定 する こと が でき ます
この 関数 は 、 セッション が 正常 に 開始 し た 場合 に true 、 それ 以外 の 場合 に false を 返し ます
新しい セッション を 開始 、 あるい は 既存 の セッション を 再開 する
変数 名
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
現在 の セッション から 変数 の 登録 を 削除 する
全て の セッション 変数 を 開放 する
セッションデータ を 書き込ん で セッション を 終了 する
キャッチ さ れ ない 例外 が 発生 し た 際 に コール さ れる 関数 の 名前
前 に 定義 さ れ た 例外 ハンドラ の 名前 、 また は エラー 発生 時 に null を 返し ます
ユーザー 定義 の 例外 ハンドラ 関数 を 設定 する
include _path の 新しい 値
成功 し た 場合 に 元 の include _path の 値 、 失敗 し た 場合 に false を 返し ます
include _path 設定 オプション を セット する
false は オフ 、 true は オン を 表し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
magic _quotes _runtime の 現在 アクティブ な 設定 を セット する
最大 実行 時間 を 表す 秒数
成功 し た 場合 に true 、 失敗 し た 場合 に false を 返し ます
実行 時間 の 最大 値 を 制限 する
クッキー の 有効 期限
サーバー 上 で の 、 クッキー を 有効 と し たい パス & # 0 3 9 ; / &# 0 3 9 ; を セット する と 、 クッキー は domain 配下 の 全て で 有効 と なり ます
true を 設定 する と 、 http を通し て のみ クッキー に アクセス できる よう に なり ます
クッキー の 値
クッキー の 名前
クッキー が 有効 な サブ ドメイン
クライアント から の セキュア な https 接続 の 場合 に のみ クッキー が 送信 さ れる よう に し ます
もし も この 関数 を コール する 前 に 何らか の 出力 が ある 場合 に は 、 setcookie は 失敗 し false を 返し ます
クッキー を 送信 する
プロセス の タイトル として 使用 する タイトル
プロセス の タイトル を 設定
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
値 を url エンコード せ ず に クッキー を 送信 する
type の 値 は 以下 の 命令 のい ずれ か です
変換 する 変数
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
変数 の 型 を セット する
メモリ の サイズ
オプション の パーミッション 設定
共有 メモリセグメント id を 表す 数値
共有 メモリセグメント の id を 返し ます
共有 メモリセグメント を 作成 また は オープン する
shm _attach が 返す 共有 メモリリソースハンドル
shm _detach は 、 常 に true を 返し ます
共有 メモリセグメント へ の 接続 を 閉じる
共有 メモリセグメント
変数 の キー
指定 し た キー の 変数 を 返し ます
共有 メモリ から 変数 を 返す
変数 の キー
shm _attach で 取得 し た 共有 メモリセグメント
エントリ が 存在 する 場合 に true 、 それ 以外 の 場合 に false を 返し ます
特定 の エントリ が 存在 する かど う か を 調べる
変数 の キー
変数
shm _attach が 返す 共有 メモリリソースハンドル
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
共有 メモリ の 変数 を 挿入 また は 更新 する
変数 の キー
shm _attach が 返す 共有 メモリ id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
共有 メモリ から 変数 を 削除 する
shmop _open が 作成 し た 共有 メモリブロック の 識別子
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
共有 メモリブロック を 削除 する
フラグ に 設定 できる 内容 は 、 次 の とおり です
作成 し たい 共有 メモリブロック の 大きさ を バイト 数 で 指定 し ます
共有 メモリセグメント に 設定 し たい 許可 属性 で 、 ファイル に関する 許可 属性 と 同様 なもの です
共有 メモリブロック の システム id で あり 、 1 0 進数 また は 1 6 進数 で 指定 する こと が 可能 です
成功 し た 場合 は 、 shmop _open は 作成 し た 共有 メモリセグメント に アクセス する ため に 使用 する id を 返し ます
共有 メモリブロック を 作成 また は オープン する
読み込む バイト 数
読み込み を 開始 する 位置
shmop _open が 作成 し た 共有 メモリブロック の 識別子
データ を 返し ます
共有 メモリブロック から データ を 読み込む
shmop _open が 作成 し た 共有 メモリブロック の 識別子
共有 メモリブロック が 占有 する バイト 数 を 表す 整数 を 返し ます
共有 メモリブロック の 大きさ を 得る
dom 要素 ノード
この オプションパラメータ を 使用 する と 、 simplexml _import _dom は 指定 し た クラス の オブジェクト を 返し ます
simplexmlelement を 返し ます
dom ノード から simplexmlelement オブジェクト を 取得 する
ns が プレフィックス で ある 場合 に true 、 uri で ある 場合 に false
整形式 xml 文字列
php 5
名前 空間 プレフィックス あるい は uri
この オプション の パラメータ を 使用 し て 、 simplexml _load _file が 指定 さ れ た クラス の オブジェクト を 返す よう に し ます
simplexmlelement クラス の オブジェクト を 返し ます
xml 文字列 を オブジェクト に 代入 する
ラジアン で 表し た 値
arg の サイン を 返し ます
正弦 （ サイン ）
処理 する 引数
arg の ハイパボリックサイン を 返し ます
双曲 線正 弦 （ ハイパボリックサイン ）
quick _print が オン の 場合 に true 、 それ 以外 の 場合 に false を 返し ます
ucd ライブラリ の quick _print の 現在 の 設定 値 を 取得 する
oid _format の 値 による oid
oid の 出力 形式 を 設定 する
最初 の タイムアウト まで の マイクロ 秒数
タイムアウト 発生 時 の 再試 行回 数
リードコミュニティ
snmp エージェント
snmp オブジェクト
成功 し た 場合 に snmp オブジェクト の 値 、 エラー 時 に false を 返し ます
snmp オブジェクト を 取得 する
snmp エージェント サーバー の ホスト 名
リードコミュニティ
タイムアウト 発生 時 の 再試 行回 数
最初 の タイムアウト まで の マイクロ 秒数
前 に ある snmp オブジェクト id
成功 し た 場合 に snmp オブジェクト id とその 値 の 連想 配列
指定 し たすべて の オブジェクト と その オブジェクト id を 返す
タイムアウト 発生 時 の 再試 行回 数
新しい 値
ライトコミュニティ
the mib defines the type of each object id
snmp エージェント サーバー の ホスト 名
最初 の タイムアウト まで の マイクロ 秒数
snmp オブジェクト id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
snmp オブジェクト の 値 を 設定 する
null の 場合 は object _id は snmp オブジェクトツリー の ルート と なり 、 ツリー 配下 の すべ て の オブジェクト を 配列 で 返し ます
タイムアウト 発生 時 の 再試 行回 数
リードコミュニティ
最初 の タイムアウト まで の マイクロ 秒数
snmp エージェント サーバー
object _id を ルート と する すべ て の snmp オブジェクト の 値 の 配列 、 あるい は エラー 時 に false を 返し ます
すべて の snmp オブジェクト を エージェント から 取得 する
リードコミュニティ
snmp エージェント
最初 の タイムアウト まで の マイクロ 秒数
snmp オブジェクト
タイムアウト が 発生 し た とき の 再試 行 の 回数
成功 し た 場合 に snmp オブジェクト の 値 、 失敗 し た 場合 に false を 返し ます
snmp オブジェクト を 取得 する
タイムアウト 発生 時 の 再試 行回 数
snmp エージェント サーバー の ホスト 名
リードコミュニティ
前 に ある snmp オブジェクト の id
最初 の タイムアウト まで の マイクロ 秒数
成功 し た 場合 に snmp オブジェクト の 値 、 エラー 時 に false を 返し ます
指定 し た オブジェクト id に 続く snmp オブジェクト を 取得 する
タイムアウト 発生 時 の 再試 行回 数
新しい 値
ライトコミュニティ
the mib defines the type of each object id
snmp エージェント サーバー の ホスト 名
最初 の タイムアウト まで の マイクロ 秒数
snmp オブジェクト id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
snmp オブジェクト の 値 を 設定 する
リードコミュニティ
タイムアウト 発生 時 の 再試 行回 数
snmp エージェント
最初 の タイムアウト まで の マイクロ 秒数
null の 場合 は 、 object _id が snmp オブジェクトツリー の ルート として 解釈 さ れ 、 ツリー の 配下 の すべ て の オブジェクト を 配列 として 返し ます
object _id から の snmp オブジェクト の 値 の 配列 を ルート として 返し ます
ネットワークエンティティ に関する 情報 ツリー を 検索 する
socket _create で 作成 し た 有効 な ソケット 記述子
ソケット の 種類 が af _inet の 場合 、 address は ドット で 4 つに 区切 られ た 表記 （ 例 : 1 2 7
パラメータ port は af _inet ソケット に バインド する 場合 に のみ 使用 さ れ 、 接続 する リモートホスト の ポート を 指定 し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ソケット に 名前 を バインド する
backlog パラメータ は 、 接続 の 順番 待ち の キュー を どれ だけ の 長さ まで 保持 する か を 定義 し ます
すべて の インターフェイス で 待ち受ける ポート
socket _create _listen は 、 成功 し た 場合 に 新規 ソケットリソース を 、 エラー 時 に false を 返し ます
接続 を 受け つける ため に ポート に ソケット を オープン する
2 つの ソケットリソース が 格納 さ れる 配列 へ の 参照
type で は 、 ソケット が 使用 する 通信 の 形式 を 選択 し ます
protocol は 、 指定 し た domain の 中 の 特定 の プロトコル を 指定 し ます
domain は 、 ソケット で 使用 する プロトコル の 種類 を 指定 し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
区別 でき ない ソケット の 組 を 作成 し 、 配列 に 保存 する
type パラメータ は 、 ソケット が 利用 する 通信 方式 を 指定 し ます
パラメータ domain に は 、 ソケット が 利用 する プロトコルファミリー を 指定 し ます
protocol は 、 ソケット 上 の 通信 で 使わ れる domain で 指定 さ れ た ファミリー に 属する プロトコル を 指定 し ます
socket _create は 、 成功時 に ソケットリソース 、 失敗 時 に false を 返し ます
ソケット （ 通信 時 の 終端 ） を 作成 する
指定 さ れ た ソケット の 型 が af _inet あるい は af _inet 6 で あっ た 場合 、 socket _getpeername は ピア （ リモート ） の ip アドレス を 適切 な 書式 （例 : 1 2 7
socket _create あるい は socket _accept で 作成 し た ソケットリソース
指定 し た 場合 は 、 address に関連付ける ポート を 保持 し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
指定 し た ソケット の リモート 側 に 問い合わせ 、 その 型 に 応じ て ホスト / ポート 、 あるい は unix ファイルシステム の パス を 返す
インポート する ストリームリソース
false を 返し ます
ストリーム を インポート する
socket _create あるい は socket _accept で 作成 し た ソケットリソース
読み込ま れる 最大 バイト 長 は 、 length パラメータ で 指定 し ます
オプション の パラメータ type は 、 名前 の ある 定数 です
socket _read は 、 成功 時 に 文字 列 として データ を 返し 、 エラー 時 リモートホスト が 接続 を クローズ し た 場合 を 含み ます に false を 返し ます
ソケット から 最大 バイト 長 まで 読み こむ
受信 し た データ が 、 buf で 指定 し た 変数 に 格納 さ れ ます
socket は 、 事前 に socket _create で 作成 し た ソケットリソース で なけれ ば なり ませ ん
flags の 値 は 、 次 の フラグ を 論理 or | 演算子 で 組み合わ せ た もの と なり ます
最大 len バイト まで を リモートホスト から 取得 し ます
socket _recv は 、 受信 し た バイト 数 を 返し ます
接続 し た ソケット から データ を 受信 する
tv _sec および tv _usec は 、 ともに タイムアウト を 指定 する パラメータ です
配列 except に 挙げ られ た ソケット で は 、 例外 を 監視 し ます
配列 write に 挙げ られ た ソケット で は 、 書き込み が ブロック さ れ て い ない か どう か を 監視 し ます
成功 し た 場合 は 、 socket _select は 配列 内 で 変化 の あっ た ソケットリソース の 数 を 返し ます
与え られ た ソケット の 配列 に対し 、 指定 し た 有効 時間 で select システムコール を 実行 する
リモートホスト に 送信 する データ を 含む バッファ
buf から リモートホスト に 送信 する バイト 数
flags の 値 は 、 以下 の フラグ の 任意 の 組み合わせ を 論理 or 演算子 | で 連結 し た もの と なり ます
socket _create あるい は socket _accept が 作成 し た ソケットリソース
socket _send は 、 送信 し た バイト 数 あるい は エラー 時 に false を 返し ます
接続 し た ソケット に データ を 送信 する
リモートホスト の ip アドレス
buf から len バイト 分 の データ が 送信 さ れ ます
socket _create で 作成 し た ソケットリソース
port は 、 データ の 送信 先 と なる リモートホスト の ポート 番号 です
送信 する データ が 、 buf から 取り出さ れ ます
flags の 値 は 、 以下 の フラグ の 任意 の 組み合わせ を 論理 or 演算子 | で 連結 し た もの と なり ます
socket _sendto は 、 リモートホスト に 送信 し た バイト 数 を 返し ます
接続 し て いる かどう か によら ず ソケット に メッセージ を 送信 する
socket _create あるい は socket _accept で 作成 し た ソケットリソース
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ソケットリソース を 非 ブロックモード に 設定 する
使用 可能 な ソケットオプション は socket _get _option 関数 と 同じ です
socket _create あるい は socket _accept で 作成 し た ソケットリソース
level パラメータ は 、 オプション の プロトコルレベル を 指定 し ます
オプション の 値
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ソケット の オプション を 設定 する
how の 値 は 以下 の うち の ひとつ です
socket _create で 作成 し た ソケットリソース
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
受信 、 送信 、 また は 送受 信用 の ソケット を シャットダウン する
ソケット の エラー 番号
errno パラメータ に 対応 する エラーメッセージ を 返し ます
ソケットエラー の 内容 を 文字 列 として 返す
書き込ま れる バッファ
オプション の パラメータ length で 、 ソケット に 書き込む バイト 数 を 指定 する こと が 可能 です
ソケット へ の 書き込み に 成功 し た データ の バイト 数 を 返し ます
ソケット に 書き込む
入力 の 配列
オプション の 2 番目 の パラメータ sort _flags は 、 以下 の 値 により ソート の 動作 を 修正 する ため に 使用 する こと が 可能 です
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
配列 を ソート する
入力 文字列
soundex キー を 文字列 で 返し ます
文字列 の soundex キー を 計算 する
引数 なし で コール し た 場合 は 、 現在 の 拡張子 一覧 を カンマ 区切り で 返し ます
spl _autoload の デフォルト 拡張子 の 一覧 を カンマ 区切り 形式 で 返し ます
spl _autoload 用 の デフォルト の 拡張子 を 登録 し 、 それ を 返す
すべて の 登録 済み _ _ autoload 関数 を 配列 で 返し ます
すべて の 登録 済み _ _ autoload 関数 を 返す
登録 を 解除 し たい autoload 関数
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
指定 し た 関数 の 、_ _ autoload の 実装 として の 登録 を 解除 する
デフォルト で は 、 クラス 名 を 小文字 に して
インスタンス を 作成 する 小文字 の クラス 名 および 名前 空間 名
_ _autoload の デフォルト 実装
現在 利用 可能 な spl クラス を 配列 で 返し ます
利用 可能 な spl クラス を 返す
何らか の オブジェクト
現在 存在 する 各 オブジェクト に 固有 で 、 同 一 オブジェクト に対し て は 常 に 同じ値と なる 文字 列 を 返し ます
指定 し た オブジェクト の ハッシュ id を 返す
大文字 小文字 を 区別 する 正規 表現
入力 文字列
limit が 指定 さ れ た 場合 、 返さ れる 配列 に は 最大 limit の 要素 が 含ま れ ます
文字列 の 配列 を 返し ます
正規 表現 により 文字 列 を 分割 し 、 配列 に 格納 する
入力 文字列
limit が 指定 さ れ た 場合 、 返さ れる 配列 に は 最大 limit の 要素 が 含ま れ ます
大文字 小文字 を 区別 し ない 正規 表現
文字列 の 配列 を 返し ます
大文字 小文字 を 区別 し ない 正規 表現 により 文字 列 を 分割 し 、 配列 に 格納 する
入力 文字列
大文字 小文字 を 区別 せ ず string に マッチ する 、 有効 な 正規 表現 式 を 返し ます
大文字 小文字 を 区別 し ない マッチング の ため の 正規 表現 を 作成 する
sqlite データベースリソース
オープン さ れ た sqlite データベース を 閉じる
使用 する エラーコード
error _code に対応 する 可読 形式 の 説明 を 文字列 で 返し ます
エラーコード の 説明 を 返す
クォート し たい 文字列
sqlite の sql 文 で 使用 できる 形式 に エスケープ し た 文字列 を 返し ます
クエリパラメータ 用 に 文字列 を エスケープ する
ファイル の モード
参照 として 渡さ れ 、 エラー が 発生 し た 場合 に データベース が オープン でき なかっ た 原因 を 説明 する 記述 的 な エラーメッセージ を 保持 する ため に 設定 さ れ ます
sqlite データベース の ファイル 名
成功時 に sqlitedatabase オブジェクト 、 失敗 時 に null を 返し ます
sqlite データベース を オープン し 、 sqlitedatabse オブジェクト を 返す
sqlite 結果 リソース
result ハンドル にまだ レコード が ある 場合 true を 返し ます
まだ レコード が ある か ない か を 返す
ライブラリ の エンコーディング を 返し ます
リンク さ れ て いる sqlite ライブラリ の エンコーディング を 返す
ライブラリ の バージョン を 文字列 で 返し ます
リンク さ れ て いる sqlite ライブラリ の バージョン を 返す
sqlsrv _query あるい は sqlsrv _prepare が 返す ステートメントリソース
引数 row に sqlsrv _scroll _absolute また は sqlsrv _scroll _relative を 指定 する 際 に 、 この 引数 で 取得 する 列 を 指定 し ます
スクロール 可能 な カーソル を 用い た 結果 セット から 、 取得 する 列 を 指定 し ます
返り値 の 型 を 指定 し ます
成功 時 に 配列 を 返し ます
行 を 配列 として 返す
処理 する 引数
arg の 平方根 を 返し ます
平方根
オプション で 指定 する シード 値
乱数 ジェネレータ を 初期化 する
ssh 接続 リンク id
リモート の ユーザー 名
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ssh の 認証 を 、 ssh agent を 使っ て 行う
ssh 2 _ connect の コール によっ て 取得 し た ssh 接続 リンク id
リモート の ユーザー 名
username の パスワード
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ssh 上 で プレーン な パスワード を 使用 し た 認証 を 行う
ssh 2 _ connect の コール によっ て 取得 し た ssh 接続 リンク id
もし 、 privkeyfile が 暗号 化 さ れ て いる そう ある べき です 場合 、 パスフレーズ も 引数 に 渡す 必要 が あり ます
公開鍵 ファイル
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
公開鍵 を 使用 し た 認証 を 行う
methods は 以下 に 示さ れ た 4つ の パラメータ を 持つ 連想 配列 です
成功 し た 場合 に リソース 、 エラー 時 に false を 返し ます
ssh サーバー に 接続 する
env に は 、 対象 と なる 環境 で 設定 する 名前 / 値 の ペア を 連想 配列 で 渡し ます
仮想 端末 の 幅
width _height _type は 、 ssh 2 _ term _unit _chars あるい は ssh 2 _ term _unit _pixels のいずれ か です
ssh 2 _ connect の コール によっ て 取得 し た ssh 接続 リンク id
仮想 端末 の 高さ
成功時 に ストリーム を 返し 、 失敗 し た 場合 に false を 返し ます
リモートサーバー 上 で コマンド を 実行 する
ssh 2 _ connect の コール によっ て 取得 し た ssh 接続 リンク id
ネゴシエート さ れ た メソッド の リスト を 返す
他 のすべて の ssh 2 _ publickey _* メソッド で 使用 する 、 ssh 2 公開鍵 サブシステム リソース を 返し ます
公開鍵 サブシステム を 初期化 する
公開鍵 サブシステム の リソース
鍵 を 、 数値 添字 の 配列 で 返し ます
現在 認証 済み の 公開鍵 の 一覧 を 表示 する
リモートファイル へ の パス
ssh 2 _ connect の コール によっ て 取得 し た ssh 接続 リンク id
ローカルファイル へ の パス
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
scp 経由 で ファイル を 要求 する
ssh 2 sftp リソース
ファイル の パーミッション
ファイル へ の パス
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ファイル の モード を 変更 する
ssh 2 _ sftp で オープン し た ssh 2 sftp リソース
シンボリックリンク へ の パス
シンボリックリンク link の ターゲット を 返し ます
シンボリックリンク の ターゲット を 返す
ssh 2 _ sftp で オープン し た ssh 2 sftp リソース
実際 の パス を 表す 文字 列 を 返し ます
指定 さ れ た パス 文字 列 の 実パス を 解決 する
ssh 2 _ sftp で オープン し た ssh 2 sftp リソース
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ディレクトリ を 削除 する
ssh 2 _ sftp で オープン し た ssh 2 sftp リソース
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ファイル を 削除 する
ssh 2 _ connect の コール によっ て 取得 し た ssh 接続 リンク id
この メソッド は 全て の 他 の ssh 2 _ sftp _* や ssh 2
sftp サブシステム を 初期化 する
仮想 端末 の 高さ
仮想 端末 の 幅
width _height _type は ssh 2 _ term _unit _chars あるい は ssh 2 _ term _unit _pixels のいずれ か です
term _type は 対象 システム の / etc / termcap に 記載 さ れ た エントリ の 一つ に 相当 し ます
env に は 、 対象 の 環境 に 設定 する 名前 / 値 の 組 の 連想 配列 を 渡す こと が でき ます
ssh 2 _ connect の コール によっ て 取得 し た ssh 接続 リンク id
対話式 の シェル を 要求 する
ファイル へ の パス
ファイル に関する 情報 を 取得 する
パース する 文字列
フィールド 区切り 文字 1 文字 のみ
エスケープ 文字 1 文字 のみ
フィールド 囲み 文字 1 文字 のみ
読み込ん だ フィールド の 内容 を 配列 で 返し ます
csv 文字列 を パース し て 配列 に 格納 する
オプション の 引数 pad _type に は 、 str _pad _right str _pad _left str _pad _both を 指定 可能 です
注意 : 必要 と さ れる 埋める 文字 数 が pad _string の 長さ で 均等 に 分割 でき ない 場合 、 pad _string は 切り 捨 て られ ます
pad _length の 値が 負 、 また は 入力 文字 列 の 長 さ 以下 で ある 場合 、 埋める 操作 は 行わ れ ませ ん
入力 文字列
埋め た 後 の 文字列 を 返し ます
文字列 を 固定 長 の 他 の 文字 列 で 埋める
繰り返す 文字列
input を 繰り返す 回数
繰り返し た 文字列 を 返し ます
文字列 を 反復 する
見つかっ た search を 置き 換える 値
探し たい 値
指定 し た 場合 は 、 マッチ し て 置換 が 行わ れ た 箇所 の 個数 が ここ に 格納 さ れ ます
検索 ・ 置換 の 対象 と なる 文字 列 あるい は 配列
この 関数 は 、 置換 後 の 文字 列 あるい は 配列 を 返し ます
検索 文字列 に 一致 し たすべて の 文字列 を 置換 する
入力 文字列
指定 し た 文字列 を rot 1 3 変換 し た 結果 を 返し ます
文字列 に rot 1 3 変換 を 行う
& # 0 3 9 ; 単語 &# 0 3 9 ; とみなさ れる 文字 に 追加 する 文字 の リスト
この 関数 の 戻り値 を 設定 し ます
文字列
選択 し た format に 応じ て 、 配列 あるい は 整数 を 返し ます
文字列 に 使用 さ れ て いる 単語 について の 情報 を 返す
subject の 中 で 調べ 始める 位置
調べ たい 文字列
許可 し ない 文字 を すべ て 含む 文字列
subject の 中 で の 調べる セグメント の 長さ
subject の 中 で 、 mask の 文字 を まっ たく 含ま ない 最初 の セグメント の 長さ を 返し ます
マスク に マッチ し ない 最初 の セグメント の 長さ を 返す
bucket オブジェクト
brigade は bucket brigade を 指す リソース で 、 ここ に は ひとつ あるい は 複数 の bucket オブジェクト が 含ま れ ます
bucket を brigade の 先頭 に 追加 する
次 の よう な 形式 の 連想 配列 から なる 連想 配列 で なく て は なり ませ ん
$arr [& # 0 3 9 ; parameter &# 0 3 9 ;] = $ value 形式 の 連想 配列 で なく て ば なり ませ ん
ストリームコンテキストリソース を 返し ます
ストリームコンテキスト を 作成 する
ストリームリソース あるい は コンテキスト リソース
すべて の コンテキストオプション および パラメータ を 含む 連想 配列 を 返し ます
コンテキスト の パラメータ を 取得 する
フィルタ 名
対象 と なる ストリーム
この フィルタ は 、 指定 さ れ た params と 共に 、 リスト の 末尾 に 追加 さ れ 、 ストリーム に対する 操作 の 中 で 最後 に 呼び出さ れ ます
成功 し た 場合 に リソース 、 失敗 し た 場合 に false を 返し ます
ストリーム に フィルタ を 付加 する
フィルタ 名
対象 と なる ストリーム
この フィルタ は 、 指定 さ れ た params と 共に 、 リスト の 先頭 に 追加 さ れ 、 ストリーム に対する 操作 の 中 で 最初 に 呼び出さ れ ます
成功 し た 場合 に リソース 、 失敗 し た 場合 に false を 返し ます
フィルタ を ストリーム に 付加 する
削除 する ストリームフィルタ
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ストリーム から フィルタ を 取り除く
ストリームリソース （例 : fopen の 返す 値 ）
読み込み を 開始 する 前 に 移動 する 位置
読み込む 最大 バイト 数
文字列 を 返し ます
残り の ストリーム を 文字列 に 読み込む
ストリーム は fopen か 、 fsockopen か 、 pfsockopen で 作成 さ れ たい ずれ の もの も 指定 でき ます
結果 の 配列 は 次 の よう な 項目 を 含み ます
ヘッダー あるい は メタデータ を ストリーム また は ファイルポインタ から 取得 する
スクリプト を 走ら せ て いる システム 上 で 使う こと の できる すべ て の ストリーム ラッパー の 名前 を 配列 の 形 で 返し ます
登録 さ れ て いる ストリーム の ラッパー の リスト を 取得 する
調べ たい ストリームリソース あるい は url
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ローカルストリーム か どう か を 調べる
stream _notify _* 通知 定数 の ひとつ
利用 可能 な 場合 は bytes _max の 値 が 格納 さ れ ます
利用 可能 な 場合 は bytes _transferred の 値 が 格納 さ れ ます
イベント について 説明 する コード が 存在 する 場合 に 渡さ れ ます
stream _notify _severity _* 通知 定数 の ひとつ
イベント について 説明 する メッセージ が 存在 する 場合 に 渡さ れ ます
notification コンテキストパラメータ 用 の コールバック 関数
write 配列 に 列挙 さ れ た ストリーム に対し て は 、 ブロック し ない で 書き込み が できる かどう か の 監視 が 行わ れ ます
tv _sec と tv _usec は 、 一体 と なっ て 、 timeout パラメータ を 表現 し ます
tv _sec の 説明 を 参照く ださい
except 配列 に 列挙 さ れ た ストリーム に対し て は 、 重大 な 例外 （& quot ; 帯域 外 の &quot ;） データ が 発生 し た かどう か の 監視 が 行わ れ ます
成功 し た 場合 stream _select は 、 変更 さ れ た 配列 に 何個 の ストリームリソース が 格納 さ れ たか を 示す数 を 返し ます
select システムコール と 同等 の 操作 を 、 ストリーム の 配列 に対し て tv _sec と tv _usec で 指定 さ れ た タイムアウト 時間 を もっ て 行う
ストリーム
mode が false の 時 、 ストリーム は 非 ブロックモード に 切り 替え られ 、 true の 場合 は 、 ブロックモード に 切り 替え られ ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ストリーム の ブロックモード を 有効 に する / 解除 する
ファイルポインタ
バッファ の バイト 数
成功時 に 0 を 、 要求 通り に 設定 でき なかっ た 場合 は それ 以外 の 値 を 返し ます
指定 し た ストリーム の ファイル 読み込み バッファリング を 有効 に する
設定 し たい タイムアウト の マイクロ 秒数 部分
設定 し たい タイムアウト の 秒数 部分
対象 と なる ストリーム
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ストリーム に タイムアウト を 設定 する
ファイルポインタ
バッファ の バイト 数
成功時 に 0 を 、 要求 通り に 設定 でき なかっ た 場合 は それ 以外 の 値 を 返し ます
指定 さ れ た ストリーム の ファイル 書き込み バッファリング を 有効 に する
接続元 の クライアント の 名前 アドレス が 含ま れ て い て 、 選択 し た トランスポート で 有効 で あっ た 場合 に 、 それ を 設定 し ます
接続 元 から の 接続 を 受け 付ける サーバーソケット
デフォルト の ソケット 接続 待ち タイムアウト を 上書き し ます
受け付け た ソケット 接続 へ の ストリーム を 返し ます
stream _socket _server で 作ら れ た ソケット の 接続 を 受け 入れる
stream _context _create で 作成 し た 有効 な コンテキストリソース
接続 する ソケット の アドレス
接続 設定 フラグ の 任意 の 組み合わせ を 指定 できる ビットフィールド です
接続 に 失敗 し た 場合 に システムレベル の エラー 番号 が 設定 さ れ ます
connect システムコール が タイムアウト と なる まで の 秒数
接続 に 失敗 し た 場合 に システムレベル の エラーメッセージ が 設定 さ れ ます
成功 し た 場合 に 、 fgets fgetss fwrite fclose feof といっ た 、 ファイル 関数 と 共に 使う こと の できる ストリームリソース を 返し ます
インターネットドメイン また は unix ドメイン の ソケット 接続 を 開く
使用 する プロトコル
使用 する プロトコルファミリー
使用 する 接続 の 型
成功 し た 場合 に 2 つの ソケットリソース の 配列 、 失敗 し た 場合 に false を 返し ます
接続 さ れ た 、 区別 でき ない ソケットストリーム の 組 を 作成 する
socket から 受信 する バイト 数
flags は 以下 の 値 の 組み合わせ です
リモートソケット
address が 指定 さ れ た 場合 、 そこに は リモートソケット の アドレス が 保存 さ れ ます
読み込ん だ データ を 文字列 で 返し ます
接続 さ れ て いる かどう か に かかわら ず 、 ソケット から の データ を 受信 する
送り たい データ
address で 別 の アドレス が 指定 さ れ て い ない 限り 、 ソケットストリーム が 作成 さ れ た 際 の アドレス を 使用 し ます
data を 送信 する ソケット
flags は 以下 の 値 の 組み合わせ です
結果 コード を 整数 値 で 返し ます
接続 さ れ て いる かどう か に かかわら ず 、 ソケット に データ を 送信 する
errno の 説明 を 参照く ださい
ソケット 作成 フラグ の 任意 の 組み合わせ を 指定 できる ビットフィールド です
オプション の errno と errstr パラメータ が 存在 する とき は 、 そこに システムレベル の socket 、 bind および listen の コール に おい て 発生 し た 実際 の システムレベル の エラー を 返し ます
作成 し た ストリーム 、 あるい は エラー 時 に false を 返し ます
インターネットドメイン また は unix ドメイン の サーバーソケット を 作成 する
オープン し て いる ストリーム たとえ ば stream _socket _client で オープン し た もの など
以下 の 定数 のい ずれ か
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
全 二重 接続 を 終了 する
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
url ラッパー の 登録 を 解除 する
入力 文字列
オプション の 2 番目 の 引数 により 、 取り除か ない タグ を 指定 でき ます
タグ を 除去 し た 文字列 を 返し ます
文字列 から html および php タグ を 取り除く
元 に 戻し たい 文字列
元 に 戻し た 文字列 を 返し ます
addcslashes で クォート さ れ た 文字列 を アンクォート する
入力 文字列
バックスラッシュ が 取り除か れ た 文字列 を 返し ます \& # 0 3 9 ; が & # 0 3 9 ; に なる など
クォート さ れ た 文字 列 の クォート 部分 を 取り除く
次 の 文字列
最初 の 文字列
他 の 文字 列比 較関 数 と 同様 に 、 この 関数 は 、 str 1 が str 2 より 小さい 場合 に & lt ; 0 、 str 1 が str 2 より 大きい 場合 に & gt ; 0 、 等しい 場合 に 0 を 返し ます
&quot ; 自然順 &quot ; アルゴリズム により 大文 字小 文字 を 区別 し ない 文字 列比 較 を 行う
この パラメータ は 大文字 小文字 を 区別 し ます
char _list を 探す 文字列
見つかっ た 文字 から 始まる 文字 列 、 あるい は 見つ から なかっ た 場合 に false を 返し ます
文字列 の 中 から 任意 の 文字 を 探す
needle が 文字列 で ない 場合 は 、 それ を 整数 に 変換 し 、 その 番号 に 対応 する 文字 として 扱い ます
検索 を 行う 文字列
指定 する と 、 文字 列内 で の 検索 開始 位置 が その 位置 に なり ます
needle が 見つかっ た 位置 を 、 haystack 文字列 の 先頭 offset の 値と は 無関係 から の 相対 位置 で 返し ます
文字 列内 の 部分 文字 列 が 最初 に 現れる 場所 を 見つける
date で 使用 さ れ て いる フォーマット （ 例 : strftime で 使用 さ れ て い た もの と 同じ ）
パース する 文字 列 （例 : strftime の 返り 値 ）
成功 し た 場合 は 配列 、 失敗 し た 場合 に false を 返し ます
strftime が 生成 し た 日付 / 時刻 を パース する
指定 する と 、 文字列 の 開始 位置 から この 文字 数 だけ 進ん だ ところ で 検索 を 中止 し ます
needle が 文字列 で ない 場合 は 、 それ を 整数 に 変換 し 、 その 番号 に 対応 する 文字 として 扱い ます
検索 を 行う 文字列
needle が 見つかっ た 位置 を 、 haystack 文字列 の 先頭 offset の 値と は 無関係 から の 相対 位置 で 返し ます
文字 列中 に 、 ある 部分 文字 列 が 最後 に 現れる 場所 を 探す
許可 する 文字 の 一覧
調べ たい 文字列
subject 内 で 調べる 部分 の 長さ
subject の 中 で 調べ 始める 位置
subject の 中 で 、 全 て mask の 中 の 文字 から なる 最初 の セグメント の 長さ を 返し ます
指定 し た マスク 内 に 含まれる 文字 から なる 文字 列 の 最初 の セグメント の 長さ を 探す
より 小さい 文字列 トークン に 分割 する 文字列
str を 分割 する 際 に 使用 する 区切り 文字
文字列 トークン を 返し ます
文字列 を トークン に 分割 する
入力 文字列
大文字 に し た 文字列 を 返し ます
文字列 を 大文字 に する
比較 する 長さ
比較 し たい 二 番 目 の 文字列
比較 を 開始 する 位置
比較 し たい 最初 の 文字列
case _insensitivity が true の 場合 、 大文字 小文字 を 区別 せ ず に 比較 し ます
main _str の offset 以降 が str より 小さい 場合 に 負の 数 、 str より 大きい 場合 に 正の 数 、 等しい 場合 に 0 を 返し ます
指定 し た 位置 から 指定 し た 長さ の 2 つの 文字 列 について 、 バイナリ 対応 で 比較 する
検索 対象 の 文字列
開始 位置 の オフセット
検索 する 副文 字列
指定 し た オフセット 以降 に 副文 字列 で 検索 する 最大 長
この 関数 は 整数 を 返し ます
副 文字 列 の 出現 回数 を 数える
正 の 値 を 指定 し た 場合 、 string の 置換 さ れる 部分 の 長さ を 表し ます
入力 文字列
置換 する 文字列
start が 正 の 場合 、 置換 は string で start 番目 の 文字 から 始まり ます
結果 の 文字列 を 返し ます
文字列 の 一部 を 置換 する
true の 場合 は 、 すで に バージョン 管理 下 に おか れ て いる ディレクトリ の 中身 も 調べ 、 もし バージョン 管理 さ れ て い ない ファイル が あれ ば それ も 追加 し ます
アイテム が ディレクトリ で ある 場合 、 その 中身 を 再帰 的 に 追加 する かど う か を 指定 し ます
追加 し たい アイテム の パス
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
作業 ディレクトリ 内 の アイテム の 追加 を 予約 する
キー の 名前
key の 値 を 文字列 で 返し ます
認証 パラメータ を 取得 する
その パラメータ に 指定 する 値
キー の 名前
認証 パラメータ を 設定 する
リポジトリ の url
リビジョン 番号
svn blame 情報 を 配列 で 返し ます
ファイル の svn blame を 取得 する
取得 し たい リビジョン 番号 を 表す 整数 値
リポジトリ 内 の アイテム へ の パス を 表す url 文字列
成功 し た 場合 に アイテム の 内容 を 表す 文字 列 、 失敗 し た 場合 に false を 返し ます
リポジトリ 内 の ファイル の 内容 を 返す
チェックアウト 先 ディレクトリ の ローカルパス
svn _non _recursive および svn _ignore _externals の 任意 の 組み合わせ
チェックアウト し たい リビジョン 番号 を 表す 整数 値
チェックアウト し たい リポジトリ 内 の ディレクトリ を 表す url 文字列
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
リポジトリ から 作業 コピー を チェックアウト する
バージョン 番号 を 表す 文字 列 を 返し ます
svn クライアントライブラリ の バージョン を 返す
コミット 時 に 使用 する ログメッセージ
配列 targets に ディレクトリ が 指定 さ れ た 場合 の 再帰 コミット を 無効 に する フラグ
コミット する ローカルパス や ファイル の 配列
以下 の よう な 形式 の 配列 を 返し ます
変更 内容 を 、 ローカル の 作業 コピー から リポジトリ に 送信 する
削除 し たい アイテム へ の パス
true の 場合 は 、 ファイル が ローカル で 変更 さ れ て いて も 削除 し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
作業 コピー あるい は リポジトリ から アイテム を 削除 する
もう ひとつ の パス
もう ひとつ の パス の リビジョン 番号
最初 の パス
最初 の パス の リビジョン 番号
ふたつ の ストリーム の 内容 を 含む 配列 の リスト を 返し ます
ふたつ の パス の 差分 を 再帰 的 に 取得 する
現在 の リポジトリ へ の パス
true の 場合 は 、 コミット し て い ない ファイル を 作業 コピー から エクスポート し ます
新しい リポジトリ へ の パス
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
svn ディレクトリ の 内容 を エクスポート する
履歴 を 取得 し たい アイテム の リポジトリ url
取得 し たい ログ の 数
ログ を 取得 し たい 最初 の リビジョン 番号
svn _omit _messages 、 svn _discover _changed _paths および svn _stop _on _copy の 任意 の 組み合わせ
ログ を 取得 し たい 最後 の リビジョン 番号
成功 し た 場合 は 、 この 関数 は 次 の よう な 構造 の 配列 を 返し ます
指定 し た リポジトリ url の コミットログメッセージ を 返す
作業 コピー あるい は リポジトリ へ の パス
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
作業 コピー あるい は リポジトリ 内 に ディレクトリ を 作成 する
再帰 的 に 処理 する かど う か を 表す オプション の パラメータ
作業 コピー へ の パス
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
作業 コピー へ の 変更 を 取り消す
アップデート する リビジョン 番号
ディレクトリ を 再帰 処理 する かどう か
ローカル の 作業 コピー へ の パス
成功 し た 場合 に 新しい リビジョン 番号 、 失敗 し た 場合 に false を 返し ます
作業 コピー を アップデート する
リンク id を 省略 し た 場合 は 、 最後 に オープン し た リンク を 使用 し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
sybase 接続 を 閉じる
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
内部行 ポインタ を 移動 する
retry _count の 値 - 1 永遠 に 再試行 し ます （ デフォルト ）
デッドロック の 再試 行回 数 を 設定 する
フィールドオフセット が 指定 さ れ ない 場合 、 sybase _fetch _field によりまだ 取り込ま れ て い ない 次 の フィールド が 取り込ま れ ます
フィールド 情報 を 含む オブジェクト を 返し ます
結果 から フィールド 情報 を 取得 する
返さ れれる オブジェクト の 型 を 指定 する に は 、 2 番目 の パラメータ object を 使用 し ます
取り込ま れ た 行 に対する プロパティ を 有する オブジェクト を 返し ます
行 を オブジェクト として 取り込む
取り込ま れ た 行 に 対応 する 配列 を 返し ます
行 を 配列 として 取得 する
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
フィールドオフセット を 設定 する
メッセージ を 文字列 で 返し ます
サーバー から 直近 の メッセージ を 返す
クライアント の severity の 最小値 を 設定 する
エラー の severity の 最小値 を 設定 する
サーバー の severity の 最小値 を 設定 する
フィールド の 数 を 返し ます
結果 に おける フィールド の 数 を 取得 する
リンク id が 指定 さ れ ない 場合 、 最後 に オープン さ れ た リンク が 指定 さ れ た と 仮定 さ れ ます
成功 時 に 正 の sybase 結果 id を 、 エラー 時 に false を 返し ます
sybase クエリ を 送信 する
引数 field は 、 フィールド の オフセット 、 フィールド 名 、 また は テーブル 名
sybase _result は 、 sybase 結果 セット から セル の 内容 を 返し ます
結果 データ を 取得 する
ハンドラ は 、 以下 の 5 つの 引数 を この 順 に 受け取り ます
リンクid を 省略 し た 場合 は 、 最後 に 開い た リンク を 使い ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
サーバー で メッセージ が 発生 し た 際 に コール さ れる ハンドラ を 指定 する
結果 セット を メモリ 中 に 読み込む 必要 が ない こと を 指示 する ため 、 オプション の store _result に false を 指定 する こと が 可能 です
成功 時 に 正 の sybase 結果 id 、 エラー 時 に false を 返し ます
sybase クエリ を 送信 し 、 ブロック し ない
残り の 引数 は 送信 する メッセージ です
priority は 、 容易 さ facility と レベル level の 組み合わせ です
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
システムログ の メッセージ を 生成 する
引数 return _var が 存在 する 場合 、 実行 し た コマンド の 返す ステータス が この 変数 に 書か れ ます
実行 する コマンド
成功 時 は コマンド 出力 の 最後 の 行 を 返し 、 失敗 時 は false を 返し ます
外部 プログラム を 実行 し 、 出力 を 表示 する
変換 に 成功 し た とき に ture を 返し ます
文字列 を 汚染 さ せる
処理 する 引数
arg の ハイパボリックタンジェント を 返し ます
双曲 線正 接 （ ハイパボリックタンジェント ）
テンポラリファイル を 作成 し たい ディレクトリ
作成 さ れる テンポラリファイル の プレフィックス
新しい テンポラリファイル 名 パス を 含む を 返し 、 失敗 し た 場合 に は false を 返し ます
一意 な ファイル 名 を 生成 する
新しい メッセージドメイン
成功 する と 、 この 関数 は ドメイン を 変更 し た 後 に 現在 の メッセージドメイン を 返し ます
デフォルトドメイン を 設定 する
tidy オブジェクト
警告 の 数 を 返し ます
指定 し た ドキュメント について 発生 し た tidy アクセシビリティ 警告 の 数 を 返す
tidy オブジェクト
エラー の 数 を 返し ます
指定 し た ドキュメント について 発生 し た tidy 設定 エラー の 数 を 返す
tidy オブジェクト
エラー の 数 を 返し ます
指定 し た ドキュメント について 発生 し た tidy エラー の 数 を 返す
tidy オブジェクト
修正 さ れ た html を 文字列 で 返し ます
パース さ れ た tidy マークアップ を 表す 文字 列 を 返す
指定 し た エンコーディング で ascii コード の tidy 設定 ファイル を ロード する
encoding は 入出 力 ドキュメント の エンコーディング を 設定 し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
マークアップ を パース する 際 の 入力 ／ 出力 エンコーディング を 設定 する
tidy オプション の 値
tidy オプション の 名前
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
指定 し た tidy ドキュメント について の 設定 を 更新 する
十 億 より も 小さい 非負 の 整数 で ある 必要 が あり ます
非負 の 整数 で ある 必要 が あり ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
秒および ナノ 秒単 位 で 実行 を 遅延 する
文字列 を 返し ます
timezonedb の バージョン を 取得 する
ファイル の ハンドル を 返し ます
テンポラリファイル を 作成 する
パース する php ソース
以下 の フラグ が 使え ます
トークン id の 配列 を 返し ます
指定 し た ソース を php トークン に 分割 する
トークン の 値
token に対応 する シンボル 名 を 返し ます
指定 し た php トークン の シンボル 名 を 取得 する
ホワイトスペース を 取り除く string
character _mask パラメータ により 、 削除 する 文字 を 指定 する こと も 可能 です
ホワイトスペース を 取り除い た 文字列
文字列 の 先頭 および 末尾 に ある ホワイトスペース を 取り除く
入力 の 配列
ユーザー 定義 の 比較 関数 の 例 について は 、 usort および uksort を 参照く ださい
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ユーザー 定義 の 比較 関数 で 配列 を ソート し 、 連想 インデックス を 保持 する
オプション の delimiters で 、 単語 の 区切り 文字 を 指定 し ます
入力 文字列
変更後 の 文字列 を 返し ます
文字列 の 各単 語 の 最初 の 文字 を 大文字 に する
udm _alloc _agent から 返さ れ た 、 エージェント へ の リンク
現在 の パラメータ の 値 を 定義 し ます
パラメータ を 定義 し 、 制限 を 示し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
種々 の 検索 の 制約 を 設定 する
databases の 各要 素 に は データベース の url を 指定 し ます
成功 し た 場合 に リソースリンク id 、 失敗 し た 場合 に false を 返し ます
mnogosearch セッション を 割り 当てる
dbmode - 単語 の 記憶 用 sql データベース モード を 選択 可能 です
dbaddr - url 形式 の データベース 名
成功 し た 場合 に mnogosearch エージェント id 、 失敗 し た 場合 に false を 返し ます
mnogosearch セッション を 確保 する
udm _api _version は 、 mnogosearch api バージョン 番号 を 返し ます
mnogosearch api バージョン を 取得 する
事前 の > udm _alloc _agent の コール により 返さ れ た エージェント id
カテゴリツリー に おける 現在 の category と 同 レベル の カテゴリ の 一覧 を 配列 で 返し ます
現在 の カテゴリ と 同じ レベル の カテゴリ を 全 て 取得 する
事前 の > udm _alloc _agent の コール により 返さ れ た エージェント へ の リンク
returns true
mnogosearch 検索 に関する 全て の 制約 を クリア する
udm _alloc _agent への コール から 返さ れる エージェント id へ の リンク
mnogosearch エラー 番号 を 返し ます
mnogosearch エラー 番号 を 取得 する
udm _alloc _agent から 返さ れ た エージェント id へ の リンク
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
mnogosearch セッション を 開放 する
udm _alloc _agent により 得 られる エージェントリンク id
udm _free _ispell _data は 、 常 に true を 返し ます
ispell データ 用 に 確保 さ れ た メモリ を 解放 する
udm _find から 返さ れ た 結果 id へ の リンク
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
mnogosearch 結果 を 開放 する
udm _alloc _agent の コール により 取得 し た 、 エージェント id へ の リンク
ドキュメント の 数 を 返し ます
データベース 内 の ドキュメント の 総数 を 得る
入力 文字列
事前 の > udm _alloc _agent の コール により 返さ れ た エージェント へ の リンク
3 2 ビット の ハッシュ 値 を 返し ます
指定 し た 文字列 の hash 3 2 チェックサム を 返す
以下 の パラメータ および それら の 値 が 利用 可能 です
udm _alloc _agent の コール により 取得 し た 、 エージェント の リンク id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
mnogosearch エージェント の セッションパラメータ を 設定 する
これ が 有用 な の は 、 たとえ ば 複数 ホスト で 同時 に id を 生成 する よう な 場合 です
true に する と 、 uniqid は 返り値 の 最後 に さらに 別 の エントロピー を 線形合 同法 を 使用 し て 追加 し ます
一意 な 識別子 を 文字列 で 返し ます
一意 な id を 生成 する
変換 し たい unix タイムスタンプ
ユリウス 積算 日 を 表す 整数 値 を 返し ます
unix タイムスタンプ を ユリウス 歴 に 変換 する
ファイル へ の パス
注意 : コンテキスト の サポート は 、 php 5
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ファイル を 削除 する
書式 コード の 説明 は pack を 参照く ださい
パック さ れ た データ
バイナリ 文字 列 を 切り出し た 要素 を 含む 連想 配列 を 返し ます
バイナリ 文字 列 から データ を 切り出す
プロパティー の 連想 配列
メソッド の 連想 配列
クラス 、 インターフェース および トレイト の 名前 の 配列
合法 な クラス 名
エントリ ・ タイプ
クラス を 構成
継承 する クラス の 名前
拡張 する クラス の 名前
実行 時 に クラス を 拡張
関数 名
クラス 名
zend _acc _ フラグ の 有効 な セット 、 フラグ を 読み取る zend _acc _fetch
設定 の 場合 、 古い フラグ を 返し ます
関数 また は クラス の フラグ を 取得 また は 設定
関数 の 修飾子
関数 の クロージャ
関数 名
新規 関数 を 受け 取る クラス の 名前
実行 時 に 関数 を 作成
実行 時 に インターフェイス を 実装
有効 な オペコード
vm の オペコード を オーバーロード
定数 を 含む クラス の 名前
定数 の 新しい 値
定数 名
定数 を 再定 義
関数 を 含む クラス の 名前
既存 の 関数 名
関数 の 新しい 名前
実行 時 に 関数 名 を 変更
関数 名
リストア する 関数 を 含む クラス の 名前
前 に バックアップ し た 関数 を リストア
既存 の 定数 名
constant を 含む クラス の 名前
定数 を 未定 義化
エンコード する 文字列
- _
文字列 を url エンコード する
true に 設定 する と 、 エラー の 詳細 を クライアント に 送信 し ます
元 の 値 を 返し ます
soap エラーハンドラ を 使用 する かど う か を 設定 する
入力 の 配列
比較 関数 は 、 最初 の 引数 と 二番目 の 引数 の 比較 結果 を 返し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ユーザー 定義 の 比較 関数 を 使用 し て 、 配列 を 値 で ソート する
variant
val の 絶対 値 を 返し ます
variant の 絶対 値 を 返す
右 オペランド
左 オペランド
結果 を 返し ます
2 つの variant 値 を 「 加算 」 し 、 結果 を 返す
右 オペランド
左 オペランド
variant の and 規則 left right 結果 true true true true false false true null null false true false false false false false null false null true null null false false null null null
2 つの variant の 論理 積 を 計算 し 、 結果 を 返す
type は 、 定数 vt _xxx の 中 の ひとつ で なけれ ば なり ませ ん
variant
vt _date variant を 返し ます
variant を 、 別 の 型 の 新しい variant に 変換 する
文字列 の 比較 に 使用 する 有効 な ロケール 識別子 です これ は 文字列 の 比較 に 影響 し ます
右 オペランド
flags は 、 以下 の ひとつ あるい は 複数 の 値 を or で 組み合わ せ た もの で 、 文字列 の 比較 に 影響 し ます
左 オペランド
以下 のい ずれ か を 返し ます
2 つの variant を 比較 する
unix タイムスタンプ
vt _date 型 の variant を 返し ます
unix タイムスタンプ を 、 日付 形式 の variant で 返す
variant
unix タイムスタンプ を 返し ます
日付 / 時刻 の variant 値 を unix タイムスタンプ に 変換 する
右 オペランド
左 オペランド
2 つの variant の 除算 結果 を 返す
右 オペランド
左 オペランド
left の 各 ビット が right の 対応 する ビット に 等しい 場合 に true を 、 それ 以外 の 場合 に false を 返し ます
2 つの variant の ビット 値 が 等しい か どう か を 調べる
variant
variant が 負 の 数 の 場合 、 variant の 値以上 の 最初 の 整数 値 を 返し ます
variant の 整数 部 を 返す
variant オブジェクト
この 関数 は 、 variant の 型 を 表す 整数 値 を 返し ます
variant オブジェクト の 型 を 返す
右 オペランド
左 オペランド
variants を 整数 に 変換 し 、 除算 の 結果 を 返す
右 オペランド
左 オペランド
variant implication テーブル left right 結果 true true true true false true true null true false true true false false true false null true null true true null false null null null null
2 つの variant の ビット implication を 行う
variant
variant が 負 の 数 の 場合 、 variant の 値以上 の 最初 の 整数 値 を 返し ます
variant の 整数 部 を 返す
variant
論理 否定 演算 の 結果 を 返し ます
variant の 論理 否定 演算 を 行う
variant
variant を 「その 場 で 」 別 の 型 に 変換 する
右 オペランド
左 オペランド
左 の variant から 右 の variant を 引き 、 その 結果 を 返す
右 オペランド
左 オペランド
variant の xor 規則 left right 結果 true true false true false true false true true false false false null null null
2 つの variant の 排他 的 論理 和 を 計算 する
virtual コマンド が 実行 さ れる ファイル
成功 時 は virtual コマンド の 実行 、 失敗 時 は false を 返し ます
apache サブリクエスト を 実行 する
format について の 説明 は sprintf を 参照く ださい
出力 さ れ た 文字 列 の 長さ を 返し ます
フォーマット さ れ た 文字列 を 出力 する
wddx パケット
デシリアライズ し た 値 を 返し ます
wddx パケット を デシリアライズ する
wddx _packet _start が 返す wddx パケット
wddx パケット を 含む 文字 列 を 返し ます
指定 し た id の wddx パケット を 終了 する
変数 名 を 表す 文字 列 、 あるい は 配列
wddx パケット 、 あるい は エラー 時 に false を 返し ます
変数 を wddx パケット に シリアライズ する
マシン 名
サービス の 短い 名前
成功 し た 場合 に win 3 2 _ no _error を 返し ます
中断 し た サービス を 再開 する
制御 コード 定数 を 返し ます
サービス に 送信 さ れ た 直近 の 制御 メッセージ を 返す
マシン 名
サービス の 短い 名前
成功 し た 場合 に win 3 2 _ no _error を 返し ます
サービス を 中断 する
失敗 し た 場合 は 、 false を 返し ます
メモリ 使用 量 の 統計 情報 を 取得 する
統計 情報 を 取得 する プロセス の id
失敗 し た 場合 は 、 false を 返し ます
プロセス の 統計 情報 を 取得 する
オプション の マシン 名
サービス の 短い 名前
成功 し た 場合 に 以下 の 情報 を 含む 配列 を 返し ます
サービス の 状態 を 問い合わせる
the checkpoint value the service increments periodically to report its progress during a lengthy start stop pause or continue operation
以下 の ステータスコード の うち の ひとつ
成功 し た 場合 に true を 返し ます
サービス の 状態 を 更新 する
オプション の マシン 名
サービス の 短い 名前
成功 し た 場合 に win 3 2 _ no _error を 返し ます
サービス を 停止 する
返さ れる 配列 に 、 opcode キャッシュ の 概要 に 加え て 個々 の キャッシュエントリ の 情報 を 含める かどう か
opcode キャッシュ について の メタデータ の 配列 を 返し ます
opcode キャッシュ に キャッシュ さ れ た ファイル について の 情報 を 取得 する
opcode キャッシュ の メモリ 使用 状況 について の メタデータ の 配列 を 返し ます
opcode キャッシュ の メモリ 使用 状況 について の 情報 を 取得 する
リフレッシュ し たい ファイル 名 の 配列
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
キャッシュ さ れ た ファイル の キャッシュエントリ を リフレッシュ する
ファイルパス 解決 キャッシュ について の メタデータ の 配列 を 返し ます
ファイルパス 解決 キャッシュ について の 情報 を 取得 する
返さ れる 配列 に 、 セッションキャッシュ の 概要 に 加え て 個々 の キャッシュエントリ の 情報 を 含める かどう か
セッションキャッシュ について の メタデータ の 配列 を 返し ます
セッションキャッシュ に キャッシュ さ れ た ファイル について の 情報 を 取得 する
セッションキャッシュ の メモリ 使用 状況 について の メタデータ の 配列 を 返し ます
セッションキャッシュ の メモリ 使用 状況 について の 情報 を 取得 する
変数 を 格納 する とき に 、 この 名前 の キー を 使い ます
変数 の キャッシュ 内 で の 生存 時間 を 秒単 位 で 指定 し ます
格納 し たい 変数 の 値
キー と 値 の 連想 配列
key が 配列 の とき の 返り値 は 、 次 の よう に なり ます
変数 が 既 に キャッシュ に 存在 し ない 場合 に のみ 変数 を ユーザーキャッシュ に 追加 する
key に 関連 づけ られ た 変数 の 減少幅
変数 を キャッシュ に 格納 する とき に 使っ た キー の 名前
成功 し た 場合 に true 、 失敗 し た 場合 に false が 設定 さ れ ます
キー に 関連 づけ られ た 値 を 減少 さ せる
変数 を キャッシュ に 格納 する とき に 使っ た キー の 名前
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
変数 を ユーザーキャッシュ から 削除 する
変数 を キャッシュ に 格納 する とき に 使っ た キー の 名前
指定 し た キー の 変数 が 存在 する 場合 に true 、 それ 以外 の 場合 に false を 返し ます
変数 が ユーザーキャッシュ に 存在 する かど う か を 調べる
変数 を キャッシュ に 格納 する とき に 使っ た キー の 名前
成功 し た 場合 に true 、 失敗 し た 場合 に false が 設定 さ れ ます
key に 関連 づけ られ た 変数 の 増加 幅
キー に 関連 づけ られ た 値 を 増加 さ せる
ユーザーキャッシュ 内 の エントリ の キー
返さ れる 配列 に 、 ユーザーキャッシュ の 概要 に 加え て 個々 の キャッシュエントリ の 情報 を 含める かどう か
ユーザーキャッシュ について の メタデータ の 配列 を 返し ます
ユーザーキャッシュ に キャッシュ さ れ た ファイル について の 情報 を 取得 する
ユーザーキャッシュ の メモリ 使用 状況 について の メタデータ の 配列 を 返し ます
ユーザーキャッシュ の メモリ 使用 状況 について の 情報 を 取得 する
cut を true に 設定 する と 、 文字列 は 常 に 指定 し た width で ラップ さ れ ます
入力 文字列
オプション の パラメータ break を 用い て 行 を 分割 し ます
文字列 を 分割 する とき の 文字数
受け取っ た 文字列 を 指定 し た 長さ で 分割 し た もの を 返し ます
指定 し た 文字 数 で 文字列 を 分割 する
属性 の 名前
属性 を 取得 する ファイル
サポート さ れる xattr の フラグ xattr _dontfollow シンボリックリンク の リンク 先 を たどら ず 、 リンク その もの を 操作 し ます
値 を 含む 文字 列 、 あるい は 属性 が 存在 し ない 場合 に は false を 返し ます
拡張 属性 を 取得 する
サポート さ れる xattr の フラグ xattr _dontfollow シンボリックリンク の リンク 先 を たどら ず 、 リンク その もの を 操作 し ます
ファイル の パス
この 関数 は 、 拡張 属性 の 名前 を 配列 で 返し ます
拡張 属性 の 一覧 を 取得 する
属性 を 削除 する ファイル
削除 する 属性 の 名前
サポート さ れる xattr の フラグ xattr _dontfollow シンボリックリンク の リンク 先 を たどら ず 、 リンク その もの を 操作 し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
拡張 属性 を 削除 する
拡張 属性 の 名前
サポート さ れる xattr の フラグ xattr _create 拡張 属性 が 既 に 存在 する 場合 、 関数 は 失敗 し ます
属性 の 値
属性 を 設定 する ファイル
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
拡張 属性 を 設定 する
調べる ファイル の パス
サポート さ れる xattr の フラグ xattr _dontfollow シンボリックリンク の リンク 先 を たどら ず 、 リンク その もの を 操作 し ます
ファイルシステム が 拡張 属性 を サポート し て いる かど う か を 調べる
xdiff _string _bdiff 関数 あるい は xdiff _string _rabdiff 関数 で 作成 し た バイナリパッチファイル へ の パス
作成 さ れる ファイル の サイズ を 返し ます
バイナリ diff を 適用 し て 作成 する ファイル の サイズ を 読み込む
2 番目 の ファイル へ の パス
結果 の パッチファイル へ の パス
最初 の ファイル へ の パス
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
2 つの ファイル の バイナリ diff を 作成 する
2 番目 の ファイル へ の パス
結果 の パッチファイル へ の パス
最初 の ファイル へ の パス
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
xiff _file _bdiff の エイリアス
diff の 結果 の 前後 に 含める 行 の 数 を 指定 し ます
この パラメータ を true に する と 、 結果 の ファイル が 最小 に なり ます 長い 時間 が かかり ます
2 番目 の ファイル へ の パス
結果 の パッチファイル へ の パス
最初 の ファイル へ の パス
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
2 つの ファイル の unified diff を 作成 する
2 番目 の ファイル へ の パス
結果 の ファイル へ の パス
3 番目 の ファイル へ の パス
最初 の ファイル へ の パス
成功 し た 場合 に true 、 もし 拒否 さ れ た 部分 が ある 場合 に は その 文字 列 、 内部 エラー が 発生 し た 場合 に false を 返し ます
3 つの ファイル を ひとつ に 統合 する
元 の ファイル
バイナリ の パッチファイル
結果 の ファイル へ の パス
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
xdiff _file _bpatch の エイリアス
unified 形式 の パッチファイル
xdiff _patch _normal （ デフォルト
元 の ファイル
結果 の ファイル へ の パス
内部 エラー が 発生 し た 場合 に false を 返し ます
ファイル に unified diff 形式 の パッチ を 適用 する
2 番目 の ファイル へ の パス
結果 の パッチファイル へ の パス
最初 の ファイル へ の パス
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
2 つの ファイル の バイナリ diff を 、rabin の polynomial fingerprinting アルゴリズム で 作成 する
diff の 結果 の 前後 に 含める 行 の 数 を 指定 し ます
データ を 含む 最初 の 文字列
データ を 含む 2 番目 の 文字列
この パラメータ を true に する と 、 結果 の ファイル が 最小 に なり ます 非常 に 時間 が かかり ます
成功 し た 場合 は その 結果 の diff 、 内部 エラー が 発生 し た 場合 に false を 返し ます
2 つの 文字列 の unified diff を 作成 する
unified 形式 の パッチ 文字列
flags は xdiff _patch _normal デフォルト
元 の 文字列
これ を 指定 する と 、 パッチ を 拒否 さ れ た 部分 が ここ に 保存 さ れ ます
パッチ 適用 後 の 文字列 、 あるい は エラー 時 に false を 返し ます
文字列 に unified diff 形式 の パッチ を 適用 する
実行 結果 の xhprof データ を 配列 で 返し ます
xhprof プロファイラ を 終了 する
xhprof の サンプルデータ の 配列 を 返し ます
xhprof サンプルプロファイラ を 終了 する
カラム 番号 を 得る xml パーサ へ の リファレンス
この 関数 は 、 parser が 有効 な パーサ で ない 場合 に false を 返し ます
xml パーサ の カレント の カラム 番号 を 取得 する
行番号 を 得る xml パーサ へ の リファレンス
この 関数 は 、 parser が 有効 な パーサ で ない 場合 に false 、 それ 以外 の 場合 に データバッファ の 中 で 現在 パーサ が 処理 中 の 行番 号 を 返し ます
xml パーサ の カレント の 行番 号 を 得る
エラーコード を 得る xml パーサ へ の リファレンス
この 関数 は 、 parser が 有効 な パーサ を 参照 し て い ない 場合 に false を 返し ます
xml パーサ の エラーコード を 得る
xml データ の 値 を 含む 配列
xml パーサ へ の 参照
$values 内 の 適切 な 値 の 場所 を さす ポインタ の 配列
xml データ を 含む 文字列
xml _parse _into _struct は 失敗 し た 場合 に 0 、 成功 し た 場合 に 1 を 返し ます
配列 構造体 に xml データ を 処理 する
使用 する xml パーサ へ の リファレンス
処理 する データ
true が 設定 さ れ た 場合 、 data は この 処理 の 間 に 送られ た 最後 の データ という こと に なり ます
成功 し た 場合 に 1 、 失敗 し た 場合 に 0 を 返し ます
xml ドキュメント の 処理 を 開始 する
php 4 で は 、 オプション の encoding で 入出 力 の エンコーディング を 指定 し ます
新しい xml パーサ の リソースハンドル を 返し ます
xml パーサ を 作成 する
取得 する オプション
オプション を 取得 する xml パーサ へ の リファレンス
この 関数 は 、 parser が 有効 な パーサ を 参照 し ない か 、 option が 不正 な 形式 の 場合 に false を 返し ます 同時に e _warning を 生成 し ます
xml パーサ から オプション を 得る
オプション を 設定 する xml パーサ へ の リファレンス
その オプション の 新しい 設定 値
設定 する オプション
この 関数 は 、 parser が 有効 な パーサ を 参照 し ない か 、 オプション が 設定 出来 なかっ た 場合 に false を 返し ます
xml パーサ の オプション を 設定 する
最初 の パラメータ で ある parser は 、 ハンドラ を コール し た xml パーサ へ の リファレンス です
handler は 、 parser に関し て xml _parse が コール さ れ た 際 に 必要 な 関数 の 名前 を 有する 文字 列 です
2 番目 の パラメータ で ある data は 、 文字 データ を 有し て い ます
デフォルト の ハンドラ 関数 を 設定 する xml パーサ へ の 参照
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
デフォルト の ハンドラ を 設定 する
最初 の パラメータ で ある parser は 、 ハンドラ を コール する xml パーサ へ の リファレンス です
2 番目 の パラメータ で ある name は 、 この ハンドラ が コール さ れ た 要素 の 名前 を 有し て い ます
start _element _handler という 名前 の 関数 は 、 次 の 3 つの パラメータ を とる 必要 が あり ます
開始 要素 および 終了 要素 の ハンドラ 関数 を 設定 する xml パーサ へ の 参照
第 3 の パラメータ で ある attribs は 、 その 要素 の 全 属性 に関する 連想 配列 です
end _element _handler という 名前 の 関数 は 、 2 つ の パラメータ を とる 必要 が あり ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
開始 要素 および 終了 要素 の ハンドラ を 設定 する
xml パーサ へ の 参照
xml オブジェクト 内 の 名前 空間 を 参照 する 際 に 使う 文字列
handler に は 、 関数 名 を 文字列 で 指定 し ます
最初 の パラメータ parser は 、 ハンドラ を コール し た xml パーサ へ の 参照 です
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
名前 空間 終了 ハンドラ を 設定 する
5 番目 の パラメータ publicid は 、 エンティティ 宣言 で 指定 さ れ た パブリック id また は 指定 さ れ ない 場合 は 空 の 文字列 です
外部 エンティティリファレンスハンドラ 関数 を 設定 する xml パーサ へ の 参照
handler は 、 parser に関し て xml _parse が コール さ れ た 際 に 必要 な 関数 の 名前 を 有する 文字 列 です
4 番目 の パラメータ 、 systemid は エンティティ 宣言 で 指定 さ れ た システム id です
最初 の パラメータ 、 parser は ハンドラ を コール する xml パーサ へ の リファレンス です
これ は 外部 エンティティ の システム id systemid を 有し て い ます
2 番目 の パラメータ 、 open _entity _names は 、 エンティティ の 処理 を 行う ため に オープン さ れ た エンティティ の 名前 の スペース 区切り の リスト です 参照 さ れる エンティティ の 名前 を 含み ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
外部 エンティティリファレンスハンドラ を 設定 する
外部 表記 用宣 言 の パブリック id
最初 の パラメータ 、 parser は ハンドラ を コール する xml パーサ へ の リファレンス です
handler は 、 parser に関し て xml _parse が コール さ れ た 際 に 必要 な 関数 の 名前 を 有する 文字 列 です
外部 表記 用宣 言 の システム id
表記 法宣 言 ハンドラ 関数 を 設定 する xml パーサ へ の 参照
外部 エンティティ の システム id systemid を 取得 する 際 の 基本 と なり ます
これ は 、 前記 の 表記 用 フォーマット に 示す よう に 表記 法 の 名前 です
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
表記 法宣 言 ハンドラ を 設定 する
オブジェクト 内部 で 使う xml パーサ へ の 参照
xml パーサ を 使う オブジェクト
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
オブジェクト 内部 で xml パーサ を 使用 する
xml パーサ へ の 参照
名前 空間 の uri
xml オブジェクト 内 の 名前 空間 を 参照 する 際 に 使う 文字列
handler に は 、 関数 名 を 文字列 で 指定 し ます
最初 の パラメータ parser は 、 ハンドラ を コール し た xml パーサ へ の 参照 です
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
名前 空間 開始 ハンドラ を 設定 する
handler は 、 parser に関し て xml _parse が コール さ れ た 際 に 必要 な 関数 の 名前 を 有する 文字 列 です
外部 エンティティ の システム id
外部 エンティティ の システム id systemid を 取得 する 際 の 基本 と なり ます
処理 さ れ ない エンティティ 宣言 用 ハンドラ 関数 を 設定 する xml パーサ へ の 参照
最初 の パラメータ 、 parser は ハンドラ を コール する xml パーサ へ の リファレンス です
この エンティティ の 表記 法 の 名前 xml _set _notation _decl _handler を 参照く ださい
宣言 しよ う と する エンティティ の 名前
外部 エンティティ の パブリック id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
処理 さ れ ない エンティティ 宣言 用 ハンドラ を 設定 する
型 を 設定 する 値
& # 0 3 9 ; base 6 4 &# 0 3 9 ; あるい は & # 0 3 9 ; datetime &# 0 3 9 ;
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
php 文字 列型 用 に xmlrpc 型 、 base 6 4 また は datetime を 設定 する
出力 時 の 文字 エンコーディング
エンコード し たい データ
出力 時 の 改行 形式
ファイル へ の パス
yaml ノード の 発行 用 の コンテンツハンドラ
成功 し た 場合 に true を 返し ます
yaml 形式 に し た 値 を ファイル に 送る
出力 時 の 文字 エンコーディング
エンコード し たい データ
出力 時 の 改行 形式
yaml ノード の 発行 用 の コンテンツハンドラ
成功 し た 場合 に yaml 形式 の 文字列 を 返し ます
yaml 形式 に し た 値 を 返す
ストリーム から 取り出す ドキュメント - 1 はすべて の ドキュメント 、 0 は 最初 の ドキュメント 、
ファイル へ の パス
yaml ノード の コンテンツハンドラ
ndocs を 渡す と 、 ストリーム 内 で 見つかっ た ドキュメント の 数 が そこ に 格納 さ れ ます
適切 な php の 型 に 変換 し た 結果 を 返し ます
ファイル から の yaml ストリーム を パース する
yaz _connect が 返す 接続 リソース
エラー の 詳細 情報 を 文字列 で 返し ます
詳細 な エラー 情報 を 返す
yaz _connect が 返す 接続 リソース
設定 の 配列
ccl パーサ を 設定 する
yaz _connect が 返す 接続 リソース
関数 が 成功 し た 場合 、 キー rpn に 有効 な rpn クエリ を 含む 配列 と なり ます
ccl find クエリ
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ccl パーサ を 起動 する
yaz _connect が 返す 接続 リソース
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
yaz 接続 を クローズ する
yaz _connect が 返す 接続 リソース
ひとつ あるい は 複数 の データベース を 表す 文字列
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
セッション 内 の データベース を 指定 する
yaz _connect が 返す 接続 リソース
id で 表さ れる 直近 の リクエスト の サーバー に関する エラーメッセージ を 返し ます
エラー の 内容 を 返す
yaz _connect が 返す 接続 リソース
拡張 サービス の オプション に 加え て パッケージ 固有 の オプション を 指定 する 配列
拡張 サービス の 形式 を 表す 文字列
拡張 サービス の リクエスト を 準備 する
yaz _connect が 返す 接続 リソース
オプション の 名前
指定 し た オプション の 値 を 返し ます
接続 に関する オプション の 値 を 返す
yaz _connect が 返す 接続 リソース
詳細 な 検索 結果 情報 の 配列
直近 の 検索 に関する ヒット 数 を 返し ます
直近 の 検索 に関する ヒット 数 を 返す
取得 する 最初 の レコード の 位置 を 指定 し ます
yaz _connect が 返す 接続 リソース
取得 する レコード の 数 を 指定 し ます
取得 する レコード の 範囲 を 指定 する
レコード は 、 その 本来 の フォーマット の ままで 返さ れ ます
yaz _connect が 返す 接続 リソース
レコード の 位置
レコード は 、 可能 なら ば xml 文字 列 として 返さ れ ます
レコード の 該当 位置 に 関連 する データベース の 名前 を 文字列 で 返し ます
レコード は 、 単純 な 形式 の 文字 列 で 返さ れ ます
type は 、 返さ れる レコード の 型 を 指定 し ます
レコード の 構文 が 文字列 で 返さ れ ます
レコード は 、 grs - 1 の 構造 を 反映 し た 配列 で 返さ れ ます
位置 pos の レコード を 返し ます
レコード を 返す
指定 さ れ た 場合 、 この 配列 に スキャン 時 の 応答 から 得 られ た 追加 情報 が 代入 さ れ ます
yaz _connect が 返す 接続 リソース
配列 0
スキャンリクエスト の 結果 を 返す
yaz _connect が 返す 接続 リソース
オプション の パラメータ で 、 スキャンリクエスト の 動作 を 制御 する 追加 情報 を 指定 し ます
スキャン を 開始 する 項目 の 位置
現 時点 で は rpn 型 のみ が サポート さ れ て い ます
スキャン の 準備 を する
rpn クエリ は 、 z 3 9
yaz _connect が 返す 接続 リソース
クエリ の 型 を 表し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
検索 を 準備 する
オプション の 新しい 値
yaz _connect が 返す 接続 リソース
文字列 あるい は 配列 です
接続 に関する ひとつ あるい は 複数 の オプション を 設定 する
降順 ソート
yaz _connect が 返す 接続 リソース
昇順 ソート
大文字 小文字 を 区別 する ソート
大文字 小文字 を 区別 し ない ソート
field 1 flags 1 field 2 flags 2 の よう な 形式 の 文字列
ソート 条件 を 設定 する
yaz _connect が 返す 接続 リソース
ドット 記法 の （ 1
取得 用 に 適当 な レコード 構文 を 指定 する
nis ドメイン 名
nis マップ
すべて の マップエントリ を 配列 で 返し ます
マップ 全体 を 含む 配列 を 返す
エラー 定数 yperr _xxx のいずれか を 返し ます
前 の 操作 の エラーコード を 返す
nis ドメイン 名
nis マップ
最初 の キー / 値 の 組 を 表す 配列 、 あるい は エラー 時 に false を 返し ます
指定 し た マップ から 最初 の キー / 値 の 組 を 返す
ノード の デフォルトドメイン また は false を 返し ます
マシン の デフォルト nis ドメイン を 取得 する
nis ドメイン 名
nis マップ
指定 し た マップ の マスタ nis サーバー の マシン 名 を 返す
nis ドメイン 名
キー は 正確 で なけれ ば なり ませ ん
nis マップ
値 、 あるい は エラー 時 に false を 返し ます
検索 し た 行 を 返す
マップ の 呼出 番号 、 あるい は エラー 時 に false を 返し ます
マップ の 呼出 番号 を 返す
zend engine の バージョン 番号 を 文字列 で 返し ます
現在 の zend engine の バージョン を 取得 する
事前 に zip _open で オープン さ れ た zip ファイル
zip ファイルアーカイブ を 閉じる
zip _entry _open により オープン さ れ た ディレクトリ の エントリ
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ディレクトリエントリ を 閉じる
zip _read により 返さ れ た ディレクトリ の エントリ
圧縮 方法
ディレクトリエントリ の 圧縮 方法 を 取得 する
zip _read により 返さ れ た ディレクトリ の エントリ
ディレクトリエントリ の サイズ
ディレクトリエントリ の 実際 の ファイルサイズ を 取得 する
zip _open により 返さ れ た 有効 な リソースハンドル
fopen の マニュアル で 指定 さ れ た モード の どれ か 注意 : 現在 、 mode は 無視 さ れ 、 常 に & quot ;rb &quot ; となり ます
zip _read により 返さ れ た ディレクトリエントリ
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
読込み 用 に ディレクトリエントリ を オープン する
zip _read により 返さ れ た ディレクトリエントリ
返す バイト 数
読み込ん だ データ を 返し ます
オープン さ れ た ディレクトリエントリ から 読み込む
オープン する zip アーカイブ の ファイル 名
後 で zip _read および zip _close で 使用 さ れる リソースハンドル 、 また は 、 filename が 存在 し ない 場合 やその 他 の エラー が 発生 し た 場合 は エラー の 番号 を 返し ます
zip ファイルアーカイブ を オープン する
zip _open で オープン 済み の zip ファイル
後 で zip _entry _
zip ファイルアーカイブ の 中 の 次 の エントリ を 読み込む
指定 し た 符号 化方 式 で データ を 圧縮 する
返さ れる 値 は gzip deflate もしく は false です
出力 圧縮 に 使用 さ れ た コーディング の 種類 を 返す
gender \gender クラス の 定数 で 表さ れる 国 id
成功 し た 場合 は 、 短い 国名 と 完全 な 国名 の 配列 を 返し ます
国 を 表す テキスト を 取得 する
調べ たい 名前
gender クラス の 定数 で 表さ れる 国 id
性別 を 返し ます
性別 を 取得 する
gender クラス の 定数 で 指定 する 国 id
調べる 名前
似 て いる 名前 の 配列 を 返し ます
似 た 名前 を 取得 する
yield し た キー を 返し ます
yield し た キー を 取得 する
イテレータ を 巻き戻す
ジェネレータ に スロー する 例外
yield し た 値 を 返し ます
例外 を ジェネレータ に スロー する
オプション の フラグ
ディレクトリ へ の パス
glob を 使う ディレクトリ を 作成 する
返さ れ た ディレクトリ や ファイル の 数 を integer で 返し ます
ディレクトリ や ファイル の 数 を 取得 する
ノイズ の 形式
gmagick オブジェクト に ノイズ を 追加 し て 返し ます
ランダム な ノイズ を 画像 に 追加 する
テキスト の 左端 の 水平 オフセット を あらわす ピクセル 数
テキスト を 書き出す 角度
テキスト 描画 設定 を 含む gmagickdraw オブジェクト
テキスト の ベースライン の 垂直 オフセット を あらわす ピクセル 数
描画 する テキスト
gmagick オブジェクト に 注記 を 加え て 返し ます
画像 に テキスト による 注記 を 加える
標準 偏差
にじみ の 半径
にじませ た gmagick オブジェクト を 返し ます
blur にじみ フィルタ を 画像 に 追加 する
枠線 の 色 を 含む gmagickpixel オブジェクト あるい は 文字列
枠線 の 幅
枠線 の 高さ
枠線 を 定義 し た gmagick オブジェクト を 返し ます
画像 の 周り を 枠線 で 囲む
ガウス 分布 の 半径
ガウス 分布 の 標準 偏差 ピクセル 単位
木炭画 を シミュレート し た gmagick オブジェクト を 返し ます
木炭画 を シミュレート する
切り取る 範囲 の y 座標
切り取る 範囲 の 高さ
切り取る 範囲 の 幅
切り取る 範囲 の x 座標
切り取っ た 後 の gmagick オブジェクト を 返し ます
画像 の 一部 を 取り除き 、 切り 詰める
追加 する コメント
コメント を 追加 し た gmagick オブジェクト を 返し ます
コメント を 画像 に 追加 する
読み込み たい 画像 へ の パス 、 あるい は 複数 の パス の 配列
成功 し た 場合 に 新しい gmagick オブジェクト を 返し ます
gmagick の コンストラクタ
サムネイル の 高さ
サムネイル の 幅
切り取っ た gmagick オブジェクト を 返し ます
切り取っ て サムネイル を 作成 する
画像間 の 特定 の ピクセル の 差 を 返す
スペックルノイズ を 軽減 し た gmagick オブジェクト を 返し ます
画像内 の スペックルノイズ を 軽減 する
成功 し た 場合 に true を 返し ます
gmagick オブジェクト を 破棄 する
画像 を レンダリング する 描画 操作
描か れ た gmagick オブジェクト を 返し ます
現在 の 画像 上 の gmagickdraw オブジェクト を レンダリング する
効果 の シグマ
効果 の 半径
エンボス 処理 し た gmagick オブジェクト を 返し ます
グレースケール 画像 に 三次 元効 果 を 施し て 返す
品質 を 向上 し た gmagick オブジェクト を 返し ます
ノイジー な 画像 の 品質 を 向上 さ せる
均等化 し た gmagick オブジェクト を 返し ます
画像 ヒストグラム を 均等 化 する
垂直 反転 し た gmagick オブジェクト を 返し ます
垂直 方向 に 反転 し た 画像 を 作成 する
水平 反転 し た gmagick オブジェクト を 返し ます
水平 方向 に 反転 し た 画像 を 作成 する
枠 の 幅
外側 の 影 の 幅
マット 色 を 表す gmagickpixel オブジェクト あるい は 浮動 小数 点数
枠 の 高さ
内側 の 影 の 幅
枠線 を つけ た gmagick オブジェクト を 返し ます
三次元 の 枠線 を シミュレート する
成功 し た 場合 に 文字列 を 返し ます
画像 シーケンス に 関連 付け られ た ファイル 名 を 取得 する
画像 の 前景 色 を 返す
画像 チャネル の 深度 を 返し ます
特定 の 画像 チャネル の 深度 を 返す
色空間 を 返し ます
画像 の 色空間 を 取得 する
画像 に 関連 付け られ て いる 合成 演算子 を 返し ます
画像 の 合成 演算子 を 返す
画像 の 遅延 を 返し ます
画像 の 遅延 を 取得 する
画像 の 配置 方法 を 返し ます
画像 の 配置 方法 を 取得 する
&quot ;min &quot ; および & quot ;max &quot ; という キー を 持つ 連想 配列 を 返し ます
画像 の 極値 を 取得 する
画像 の ファイル 名 を 文字列 で 返し ます
シーケンス 内 の 特定 の 画像 の ファイル 名 を 返す
成功 し た 場合 は 画像 の フォーマット を 文字列 で 返し ます
シーケンス 内 の 特定 の 画像 の フォーマット を 返す
成功 し た 場合 に ガンマ を 返し ます
画像 の ガンマ を 取得 する
画像 の 高さ を ピクセル 数 で 返し ます
画像 の 高さ を 返す
画像 の ヒストグラム を gmagickpixel オブジェクト の 配列 で 返し ます
画像 の ヒストグラム を 取得 する
現在 アクティブ な 画像 の インデックス を 返し ます
現在 アクティブ な 画像 の インデックス を 取得 する
成功 し た 場合 に 画像 の インターレース 手法 を 返し ます
画像 の インターレース 手法 を 取得 する
画像 の 反復 を 表す 整数 値 を 返し ます
画像 の 反復 を 取得 する
画像 が マットチャネル を 持っ て いる 場合 に true 、 そう で ない 場合 に false を 返し ます
画像 が マットチャネル を 持っ て いる かど う か を 調べる
赤 が 一番 強い 点 を & quot ;x &quot ; および & quot ;y &quot ; という キー を 持つ 配列 で 返し ます
赤 が 一番 強い 点 を 返す
画像 の レンダリング 方向 を 返し ます
画像 の レンダリング 方向 を 取得 する
画像 の シーン を 返し ます
画像 の シーン を 取得 する
その ファイル の sha - 2 5 6 ハッシュ を 文字列 で 返し ます
sha - 2 5 6 メッセージダイジェスト を 生成 する
画像 の 型 を 返し ます
画像 の 型 を 取得 する
色度 が 白い点 を 返し ます
色度 が 白い点 を 返す
graphicsmagick パッケージ 名 を 文字列 で 返し ます
graphicsmagick パッケージ 名 を 返す
gmagick quantum depth を 文字列 で 返し ます
gmagick quantum depth を 取得 する
graphicsmagick api の バージョン を 文字 列 と 数値 で 返し ます
graphicsmagick api の バージョン を 返す
リスト 内 で 逆方 向 に ひとつ 進ん だ とき にまだ オブジェクト が 画像 を 保持 し て いれ ば true 、 し て い なけれ ば false を 返し ます
オブジェクト が 前 の 画像 を 保持 し て いる かど う か を 調べる
追加 する ラベル
ラベル を 追加 し た gmagick オブジェクト を 返し ます
ラベル を 画像 に 追加 する
拡大 し た gmagick オブジェクト を 返し ます
画像 を 二倍 に 比例 拡大 する
ゼロ 以外 の 整数 値 を 設定 し て 、 マップ し た 画像 を ディザリング し ます
参照 する 画像
gmagick オブジェクト を 返し ます
画像 の 色 を 、 参照 画像 の 中 の 最も 近い色 に 置き 換える
近傍 ピクセル の 半径
デジタルフィルタ を 適用 する
画像 の 色相 - 1 0 0 から + 1 0 0
画像 の 彩度 - 1 0 0 から + 1 0 0
画像 の 明度 - 1 0 0 から + 1 0 0
明度 、 彩度 、 色相 を 制御 する
近傍円 の 半径
油絵 を シミュレート する
成功 し た 場合 に gmagick オブジェクト を 返し ます
オブジェクト 内 の 前 の 画像 に 移動 する
プロファイル
追加 あるい は 削除 する プロファイル の 名前
画像 の プロファイル を 追加 あるい は 削除 する
通常 は 、 この 整数 値 は 0 か 1 に なり ます
ゼロ 以外 の 値 で 、 元 画像 と 量子 化 し た 画像 の 違い を 計測 し ます
この 色空間 の 中 で 色数 を 減ら す
色数
ゼロ 以外 の 値 を 元 の 画像 と の 間 の 違い に 分配 し 、 対応 する 減色 アルゴリズム を 近傍 ピクセル と の ヒルベルト 曲線 に 沿っ た もの に し ます
参照 画像 内 の 色 を 解析 する
通常 は 、 この 整数 値 は 0 か 1 に なり ます
ゼロ 以外 の 値 で 、 元 画像 と 量子 化 し た 画像 の 違い を 計測 し ます
この 色空間 の 中 で 色数 を 減ら す
色数
ゼロ 以外 の 値 を 元 の 画像 と の 間 の 違い に 分配 し 、 対応 する 減色 アルゴリズム を 近傍 ピクセル と の ヒルベルト 曲線 に 沿っ た もの に し ます
画像 シーケンス 内 の 色 を 解析 する
成功 し た 場合 に gmagick オブジェクト を 返し ます
設定 し た フォント を 返す
パターン を 含む 文字 列 へ の ポインタ を 指定 し ます
成功 し た 場合 に gmagick オブジェクト を 返し ます
gmagick が サポート する フォーマット を 返す
x 座標
明るく する 範囲 の 幅
明るく する 範囲 の 高さ
ゼロ 以外 の 値 を 指定 する と 三次元 の 引き上げ 効果 、 ゼロ の 場合 は 引き下げ 効果
y 座標
三次元 の ボタン 風 の 効果 を シミュレート する
画像 ファイル 名
ファイル から 画像 を 読み込む
画像 ファイル 名
ファイル から 画像 を 読み込む
画像 の 内容
画像 ファイル 名
バイナリ 文字 列 から 画像 を 読み込む
ファイルディスクリプタ
オープン し て いる ファイルハンドル から 画像 を 読み込む
画像 リスト から 画像 を 削除 する
返す プロファイル の 名前
聖子 し た 場合 に gmagick オブジェクト を 返し ます
指定 し た 名前 の 画像 プロファイル を 削除 し て 返す
新しい 画像 の x 方向 の 解像 度
新しい 画像 の y 方向 の 解像 度
blur 要素
利用 する フィルタ
画像 を 指定 し た 解像 度 に リサンプリング する
画像 の 高さ
画像 の 幅
blur 要素
利用 する フィルタ
画像 の サイズ を 変更 する
背景色
画像 を 回転 さ せる 度数
成功 し た 場合 に gmagick オブジェクト を 返し ます
画像 を 回転 する
変更後 の 画像 の 幅
変更後 の 画像 の 高さ
成功 し た 場合 に gmagick オブジェクト を 返し ます
画像 の サイズ を 変更 する
ど の チャネル を 取り出す か
成功 し た 場合 に gmagick オブジェクト を 返し ます
画像 から チャネル を 分離 する
画像 ファイル 名
成功 し た 場合 に gmagick オブジェクト を 返し ます
画像 を 読み 書き する 前 に ファイル 名 を 設定 する
画像 の 背景 色
成功 し た 場合 に gmagick オブジェクト を 返し ます
画像 の 背景 色 を 設定 する
青 が 一番 強い 点 の y 座標
青 が 一番 強い 点 の x 座標
成功 し た 場合 に gmagick オブジェクト を 返し ます
青 が 一番 強い 点 を 設定 する
画像 の 前景 色
成功 し た 場合 に gmagick オブジェクト を 返し ます
画像 の 前景 色 を 設定 する
抽出 する チャネル
深度 を 表す ビット 数
成功 し た 場合 に gmagick オブジェクト を 返し ます
特定 の 画像 チャネル の 深度 を 設定 する
画像 の 色空間
成功 し た 場合 に gmagick オブジェクト を 返し ます
画像 の 色空間 を 設定 する
画像 の 合成 演算子
成功 し た 場合 に gmagick オブジェクト を 返し ます
画像 の 合成 演算子 を 設定 する
画像 の 遅延 を 1 / 1 0 0 秒単 位 で 指定 し ます
成功 し た 場合 に gmagick オブジェクト を 返し ます
画像 の 遅延 を 設定 する
画像 ファイル 名
成功 し た 場合 に gmagick オブジェクト を 返し ます
シーケンス 内 の 特定 の 画像 の ファイル 名 を 設定 する
シーン 番号
成功 し た 場合 に gmagick オブジェクト を 返し ます
画像 リスト 内 で の イテレータ の 位置 を 、 index パラメータ で 指定 し た 場所 に 設定 する
画像 の インターレース 手法
成功 し た 場合 に gmagick オブジェクト を 返し ます
画像 の インターレース 手法 を 設定 する
画像 の 遅延 を 1 / 1 0 0 秒単 位 で 指定 し ます
成功 し た 場合 に gmagick オブジェクト を 返し ます
画像 の 反復 を 設定 する
プロファイル
追加 あるい は 削除 する プロファイル の 名前
成功 し た 場合 に gmagick オブジェクト を 返し ます
指定 し た 名前 の 画像 プロファイル を gmagick オブジェクト に 追加 する
画像 の レンダリング 方向
成功 し た 場合 に gmagick オブジェクト を 返し ます
画像 の レンダリング 方向 を 設定 する
x 方向 の 解像 度
y 方向 の 解像 度
成功 し た 場合 に gmagick オブジェクト を 返し ます
画像 の 解像 度 を 設定 する
画像 の シーン 番号
成功 し た 場合 に gmagick オブジェクト を 返し ます
画像 の シーン を 設定 する
画像 の 型
成功 し た 場合 に gmagick オブジェクト を 返し ます
画像 の 型 を 設定 する
画像 の 解像 度 の 単位
成功 し た 場合 に gmagick オブジェクト を 返し ます
画像 の 解像 度 の 単位 を 設定 する
白い点 の x 座標
白い点 の y 座標
成功 し た 場合 に gmagick オブジェクト を 返し ます
画像 の 色度 が 白い点 を 設定 する
各色 コンポーネント の サンプリング 係数 を 表す double 型 の 値 の 配列 rgb 順
成功 し た 場合 に gmagick オブジェクト を 返し ます
画像 の サンプリング 係数 を 設定 する
ソラリゼーション の 効き 具合 を 指定 し ます
成功 し た 場合 に gmagick オブジェクト を 返し ます
画像 に ソラリゼーション 効果 を 適用 する
成功 し た 場合 に gmagick オブジェクト を 返し ます
画像 から すべ て の プロパティ や コメント を 除去 する
渦巻 効果 の 程度
成功 し た 場合 に gmagick オブジェクト を 返し ます
画像 の 中心 から 、 ピクセル を 渦巻 状 に する
デフォルト で は 、 対象 の 色 は 特定 の ピクセル の 色 とまっ たく 同じ で なけれ ば なり ませ ん
gmagick オブジェクト を 返し ます
画像 の 輪郭 を 削除 する
画像 ファイル 名
画像 を 指定 し た ファイル 名 で 書き出す
画像 ファイル 名
gmagick オブジェクト を 返し ます
画像 を 指定 し た ファイル 名 で 書き出す
描画 する テキスト
テキスト の 左端 の x 座標
テキスト の ベースライン の y 座標
成功 し た 場合 に gmagickdraw オブジェクト を 返し ます
画像 の 上 に テキスト を 描画 する
座標 の 配列
成功 し た 場合 に gmagickdraw オブジェクト を 返し ます
ベジエ 曲線 を 描く
原点 の y 座標
終了 角度
開始 角度
x 方向 の 半径
原点 の x 座標
y 方向 の 半径
成功 し た 場合 に gmagickdraw オブジェクト を 返し ます
楕円 を 画像 上 に 描く
塗りつぶし の 色や テクスチャ に 使う 不透 明度 を 返し ます
描画 に 使う 不透 明度 を 返す
現在 の gmagickdraw オブジェクト に 関連 づけ られ た フォント の サイズ を 返し ます
フォント の ポイント 数 を 返す
成功 し た 場合 に 整数 値 を 返し ます
フォント の ウェイト を 返す
オブジェクト の 輪郭 の 描画 に 使う 色 を 返す
不透 明度 を 表す 浮動 小数 点数 値 を 返し ます
オブジェクト の 輪郭 の 不透 明度 を 返す
decoration _ 定数 のい ずれ か を 返し ます
テキスト の デコレーション を 返す
座標 の 配列
成功 し た 場合 に gmagickdraw オブジェクト を 返し ます
多角形 を 描く
座標 の 配列
成功 し た 場合 に gmagickdraw オブジェクト を 返し ます
ポリライン を 描く
二番目 の x 座標
二番目 の y 座標
最初 の y 座標
最初 の x 座標
成功 し た 場合 に gmagickdraw オブジェクト を 返し ます
矩形 を 描く
垂直方向 の 倍率
水平方向 の 倍率
成功 し た 場合 に gmagickdraw オブジェクト を 返し ます
倍率 を 調整 する
塗りつぶし に 使う 色 を 表す gmagickpixel オブジェクト
成功 し た 場合 に gmagickdraw オブジェクト を 返し ます
オブジェクト の 塗り つぶし に 使う 色 を 設定 する
塗りつぶし の 不透 明度
成功 し た 場合 に gmagickdraw オブジェクト を 返し ます
不透 明度 を 設定 する
フォント 名
成功 し た 場合 に gmagickdraw オブジェクト を 返し ます
テキスト の アノテーション で 使う フォント の 完全 な 名前 を 設定 する
テキスト の ポイント 数
成功 し た 場合 に gmagickdraw オブジェクト を 返し ます
テキスト の アノテーション で 使う フォント の ポイント 数 を 設定 する
フォントスタイル normalstyle italicstyle obliquestyle anystyle
成功 し た 場合 に gmagickdraw オブジェクト を 返し ます
テキスト の アノテーション で 使う フォント の スタイル を 設定 する
フォント の ウェイト 1 0 0 - 9 0 0 の 範囲 が 有効
成功 し た 場合 に gmagickdraw オブジェクト を 返し ます
フォント の ウェイト を 設定 する
輪郭 の 色 を 表す gmagickpixel オブジェクト
成功 し た 場合 に gmagickdraw オブジェクト を 返し ます
オブジェクト の 輪郭 の 描画 に 使う 色 を 設定 する
不透 明度
成功 し た 場合 に gmagickdraw オブジェクト を 返し ます
オブジェクト の 輪郭 の 不透 明度 を 設定 する
線 の 幅
成功 し た 場合 に gmagickdraw オブジェクト を 返し ます
オブジェクト の 輪郭 の 描画 に 使う 線 の 幅 を 設定 する
テキスト の エンコーディング を 表す 文字列
成功 し た 場合 に gmagickdraw オブジェクト を 返し ます
テキスト の コードセット を 設定 する
オプション で 指定 する 色文 字列
成功 し た 場合 に gmagickpixel オブジェクト を 返し ます
gmagickpixel の コンストラクタ
true に する と 、 返り値 を 文字列 で は なく 配列 に し ます
色 の 値 を 正規 化 し ます
各 チャネル の 値 を 配列 で 返し ます
色 を 返す
成功 し た 場合 に 色 カウント を 整数 値 で 返し ます
この 色 の 色 カウント を 返す
調べ たい チャネル
チャネル の 値 を 、 正規 化 し た 浮動 小数 点数 値 で 返し ます
指定 し た 色 チャネル の 正規 化 し た 値 を 取得 する
枠線 の 幅
破線 の 形式
破線 の 形式
成功 し た 場合 に true を 返し ます
アノテーション の 枠 の 形式 を 設定 する
アイコン の 形式
成功 し た 場合 に true を 返し ます
アノテーション の アイコン の 形式 を 設定 する
true は 、 アノテーション が 最初 から 開い て 表示 さ れ て いる こと を 意味 し ます
成功 し た 場合 に true を 返し ます
アノテーション の 初期 状態 を 設定 する
成功 し た 場合 に true を 返し ます
ページ の 表示 を 、 ウィンドウ に あわせる よう 設定 する
成功 し た 場合 に true を 返し ます
ページ の 表示 を 、 ページ の バウンディングボックス を ウィンドウ に あわせる よう 設定 する
ページ の 左端 の 座標
ページ の 上端 の 座標
ページ の 下端 の 座標
ページ の 右端 の 座標
成功 し た 場合 に true を 返し ます
ページ の 表示 を 、 指定 し た 矩形 に あわせる よう 設定 する
ページ の 左端 の 位置
成功 し た 場合 に true を 返し ます
ページ の 表示 を 、 ウィンドウ の 高さ に あわせる よう 設定 する
拡大率
ページ の 上端 の 位置
ページ の 左端 の 位置
成功 し た 場合 に true を 返し ます
ページ の 表示 を 設定 する
新しい harudoc の インスタンス を 作成 する
ドキュメント が 現在 使用 し て いる haruencoder 、 あるい は エンコーダ が まだ 設定 さ れ て い ない 場合 に false を 返し ます
ドキュメント が 現在 使用 し て いる haruencoder を 取得 する
成功 し た 場合 に harupage の インスタンス 、 現在 の ページ が 設定 さ れ て い ない 場合 に false を 返し ます
ドキュメント の 現在 の ページ を 返す
エンコーディング 名
指定 し た エンコーディング の haruencoder の インスタンス を 返し ます
指定 し た エンコーディング の haruencoder の インスタンス を 取得 する
使用 する エンコーディング
フォント の 名前
指定 し た fontname および encoding の harufont の インスタンス を 返し ます
harufont の インスタンス を 取得 する
属性 の 型
指定 し た ドキュメント 属性 の 文字 列値 を 返し ます
指定 し た ドキュメント 属性 の 現在 の 値 を 取得 する
現在 ドキュメント に 設定 さ れ て いる ページレイアウト を 返し ます
現在 の ページレイアウト を 取得 する
有効 な harupage の インスタンス
新しい harupage の インスタンス を 返し ます
指定 し た ページ の 直前 に 新しい ページ を 挿入 する
有効 な jpeg 画像 ファイル
新しい haruimage の インスタンス を 返し ます
jpeg 画像 を 読み込む
データ を 即時 に 読み込ま ない
png 画像 ファイル の ファイル 名
haruimage の インスタンス を 返し ます
png 画像 を 読み込み 、 haruimage の インスタンス を 返す
コレクションファイル 内 で の フォント の インデックス
true を 指定 する と 、 フォント の グリフデータ を pdf ファイル に 埋め込み ます
truetype コレクションファイル
成功時 に 、 読み込ん だ フォント の 名前 を 返し ます
ttc ファイル から 指定 し た インデックス の フォント を 読み込む
true を 指定 する と 、 フォント の グリフデータ を pdf ファイル に 埋め込み ます
読み込む ttf ファイル
成功時 に 、 読み込ん だ フォント の 名前 を 返し ます
ttf フォントファイル を 読み込む
オプション で 指定 する 、 pfa / pfb ファイル へ の パス
afm ファイル へ の パス
成功時 に 、 読み込ん だ フォント の 名前 を 返し ます
type 1 フォント を 読み込む
成功 し た 場合 に true を 返し ます
ドキュメントデータ を 出力 バッファ に 書き出す
パラメータ bytes で 、 読み込む バイト 数 を 指定 し ます
一時ストリーム の データ を 返し ます
データ を 一時 ストリーム から 読み込む
成功 し た 場合 に true を 返し ます
一時ストリーム を 巻き戻す
ドキュメント を 保存 する ファイル 名
成功 し た 場合 に true を 返し ます
ドキュメント を 指定 し た ファイル に 保存 する
使用 する エンコーディング の 名前
成功 し た 場合 に true を 返し ます
ドキュメント の 現在 の エンコーダ を 設定 する
有効 な harudestination の インスタンス
成功 し た 場合 に true を 返し ます
ドキュメント を 開い た とき にど の ページ を 表示 する か を 定義 する
以下 の 値 を 使用 でき ます
成功 し た 場合 に true を 返し ます
ページ を どの よう に 表示 する か を 設定 する
以下 の 値 を 使用 でき ます
成功 し た 場合 に true を 返し ます
ドキュメント を どの よう に 表示 する か を 設定 する
pages オブジェクト が 保持 できる ページ 数
成功 し た 場合 に true を 返し ます
ページ 群単 位 の ページ 数 を 設定 する
これら の フラグ を 組み合わせ た 値と なり ます
成功 し た 場合 に true を 返し ます
ドキュメント の 使用 権限 を 設定 する
成功 し た 場合 に true を 返し ます
簡体 字中 国語 エンコーディング を 有効 に する
成功 し た 場合 に true を 返し ます
組み込み の 繁体 字中 国語 フォント を 有効 に する
成功 し た 場合 に true を 返し ます
組み込み の 日本語 フォント を 有効 に する
成功 し た 場合 に true を 返し ます
韓国 / 朝鮮語 エンコーディング を 有効 に する
成功 し た 場合 に true を 返し ます
組み込み の 韓国 / 朝鮮語 フォント を 有効 に する
テキスト 内 の 位置
テキスト
テキスト 内 の 指定 し た 位置 の バイト の 型 を 返し ます
テキスト 内 の バイト の 型 を 取得 する
エンコーダ の 型 を 返し ます
エンコーダ の 型 を 取得 する
大文字 の ベースライン から の 距離 を 返し ます
大文字 の ベースライン から の 距離 を 取得 する
フォント の 垂直 descent ベースライン の 下側 の 高さ を 返し ます
フォント の 垂直 descent を 取得 する
フォントエンコーディング の 名前 を 返し ます
エンコーディング 名 を 取得 する
フォント の 名前 を 返し ます
フォント 名 を 取得 する
調べ たい テキスト
指定 し た テキスト について 、 テキスト 全体 の 幅 、 文字数 、 単語 数 および 空白 の 数 を 返し ます
テキスト 全体 の 幅 、 文字数 、 単語 数 および 空白 の 数 を 取得 する
文字 の コード
フォント の 文字 の 幅 を 返し ます
フォント の 文字 の 幅 を 取得 する
小文字 の ベースライン から の 距離 を 返し ます
小文字 の ベースライン から の 距離 を 取得 する
画像 の 各色 コンポーネント で 使用 する ビット 数 を 返し ます
画像 の 各色 コンポーネント で 使用 する ビット 数 を 取得 する
画像 の 色空間 の 名前 を 返し ます
色空間 の 名前 を 取得 する
画像 の 高さ を 返し ます
画像 の 高さ を 取得 する
二つ の 要素 width および height を 持つ 配列 を 返し ます
画像 の 大きさ を 取得 する
画像 の 幅 を 返し ます
画像 の 幅 を 取得 する
赤 の 最小値
青 の 最小値
緑 の 最大 値
青 の 最大 値
赤 の 最大 値
緑 の 最小値
成功 し た 場合 に true を 返し ます
画像 の 色 マスク を 設定 する
true は 開い た 状態 、 false は 閉じ た 状態
成功 し た 場合 に true を 返し ます
アウトライン の 初期 状態 を 設定 する
成功 し た 場合 に true を 返し ます
テキストオブジェクト を 開始 し 、 テキスト の 現在 位置 を 0 0 に 設定 する
円 の 半径
中心 の 垂直 座標
中心 の 水平 座標
成功 し た 場合 に true を 返し ます
現在 の パス に 円 を 追加 する
成功 し た 場合 に true を 返し ます
現在 の 位置 から パス の 開始 位置 に 直線 を 追加 する
成功 し た 場合 に true を 返し ます
現在 の ページ の 変換 行列 と 指定 し た 行列 を 連結 する
オプション で 指定 する haruencoder の インスタンス
アノテーション の 範囲 を 表す 4 つの 座標 の 配列
表示 する テキスト
新しい haruannotation の インスタンス を 返し ます
新しい haruannotation の インスタンス を 作成 する
ベジエ 曲線 の 制御 点
ベジエ 曲線 の 制御 点
現在 位置 は ここ に 移動 し ます
ベジエ 曲線 の 制御 点
ベジエ 曲線 の 制御 点
成功 し た 場合 に true を 返し ます
ベジエ 曲線 を 現在 の パス に 追加 する
ベジエ 曲線 の 制御 点
ベジエ 曲線 の 制御 点
現在 位置 は ここ に 移動 し ます
成功 し た 場合 に true を 返し ます
ベジエ 曲線 を 現在 の パス に 追加 する
ベジエ 曲線 の 制御 点
ベジエ 曲線 の 制御 点
現在 位置 は ここ に 移動 し ます
成功 し た 場合 に true を 返し ます
ベジエ 曲線 を 現在 の パス に 追加 する
画像 を 表示 する 範囲 の 左端
画像 を 表示 する 範囲 の 下端
有効 な haruimage の インスタンス
画像 の 範囲 の 高さ
画像 の 範囲 の 幅
成功 し た 場合 に true を 返し ます
画像 を ページ に 表示 する
中心 の 垂直 座標
中心 の 水平 座標
楕円 の y 方向 の 半径
楕円 の x 方向 の 半径
成功 し た 場合 に true を 返し ます
楕円 を 現在 の パス に 追加 する
成功 し た 場合 に true を 返し ます
塗りつぶし や 描画 を 行わ ず に 現在 の パスオブジェクト を 終了 する
成功 し た 場合 に true を 返し ます
現在 の テキストオブジェクト を 終了 する
成功 し た 場合 に true を 返し ます
奇偶 規則 を 使用 し て 現在 の パス を 塗り つぶす
オプション の パラメータ です
成功 し た 場合 に true を 返し ます
ノンゼロワインディング 規則 を 使用 し て 現在 の パス を 塗り つぶす
現在 の 文字 間隔 を 返し ます
現在 の 文字 間隔 を 取得 する
現在 の 塗り つぶし 色 を 、 4 つの 要素 & quot ;c &quot ; & quot ;m &quot ; & quot ;y &quot ; および & quot ;k &quot ; から なる 配列 で 返し ます
現在 の 塗り つぶし 色 を 取得 する
現在 の 描画 色 を 、 4 つの 要素 & quot ;c &quot ; & quot ;m &quot ; & quot ;y &quot ; および & quot ;k &quot ; から なる 配列 で 返し ます
現在 の 描画 色 を 取得 する
現在 の フォント の サイズ を 返し ます
現在 の フォント の サイズ を 取得 する
パス の 描画 用 に 使用 する 現在 位置 を 、 二つ の 要素 & quot ;x &quot ; と & quot ;y &quot ; から なる 配列 で 返し ます
パス の 描画 用 の 現在 の 位置 を 取得 する
テキスト の 印字 用 に 使用 する 現在 位置 を 、 二つ の 要素 & quot ;x &quot ; と & quot ;y &quot ; から なる 配列 で 返し ます
テキスト の 印字 用 の 現在 の 位置 を 取得 する
現在 の 破線 の パターン を 、 二つ の 要素 & quot ;pattern &quot ; と & quot ;phase &quot ; から なる 配列 で 返し ます
現在 の 破線 の パターン を 取得 する
現在 の 塗り つぶし の 色空間 を 返し ます
現在 の 塗り つぶし の 色空間 を 取得 する
ページ の 平坦 度 を 返し ます
ページ の 平坦 度 を 取得 する
現在 の グラフィックスモード を 返し ます
現在 の グラフィックスモード を 取得 する
現在 の 塗り つぶし 色 を 返し ます
現在 の 塗り つぶし 色 を 取得 する
現在 の 塗り つぶし 色 を 返し ます
現在 の 描画 色 を 取得 する
ページ の 高さ を 返し ます
ページ の 高さ を 取得 する
現在 の 水平 方向 の 拡大 率 を 返し ます
現在 の 水平 方向 の 拡大 率 を 取得 する
現在 の パス の 終端 の 形式 を 返し ます
現在 の パス の 終端 の 形式 を 取得 する
現在 の パス の 角 の 形式 を 返し ます
現在 の パス の 角 の 形式 を 取得 する
マイターリミット の 値 を 返し ます
マイターリミット の 値 を 取得 する
現在 の 塗り つぶし 色 を 、 三つ の 要素 & quot ;r &quot ;、 & quot ;g &quot ; および & quot ;b &quot ; から なる 配列 で 返し ます
現在 の 塗り つぶし 色 を 取得 する
現在 の 描画 色 を 返し ます
現在 の 描画 色 を 取得 する
現在 の 行間 隔 の 値 を 返し ます
現在 の 行間 隔 の 値 を 取得 する
現在 の テキストライズ の 値 を 返し ます
現在 の テキストライズ の 値 を 取得 する
調べ たい テキスト
現在 の フォントサイズ 、 文字 エンコーディング および 単語 間隔 を 使用 し て テキスト の 幅 を 返し ます
現在 の フォントサイズ 、 文字 エンコーディング および 単語 間隔 を 使用 し て テキスト の 幅 を 取得 する
その ページ の 現在 の 変換 行列 を 、 & quot ;a &quot ;、 & quot ;b &quot ;、 & quot ;c &quot ;、 & quot ;d &quot ;、 & quot ;x &quot ; および & quot ;y &quot ; の 6 つの 要素 から なる 配列 で 返し ます
その ページ の 現在 の 変換 行列 を 取得 する
現在 の 単語 間隔 の 値 を 返し ます
現在 の 単語 間隔 の 値 を 取得 する
成功 し た 場合 に true を 返し ます
現在 位置 から 指定 し た 位置 まで 直線 を 描画 する
この パラメータ を true に 設定 する と 、 ワードラップ 処理 を & quot ; エミュレート & quot ; します
行 の 長さ
調べ たい テキスト
指定 し た 幅 の 一行 中 に 配置 できる 文字 の バイト 長 を 返し ます
指定 し た 幅 の 一行 中 に 配置 できる 文字 の バイト 長 を 計算 する
指定 し た テキスト 位置 の オフセット
true の 場合 は 、 テキスト の リーディング が - y と なり ます
指定 し た テキスト 位置 の オフセット
成功 し た 場合 に true を 返し ます
テキスト の 位置 を 、 指定 し た オフセット に 移動 する
新しい 開始 位置 の 座標
新しい 開始 位置 の 座標
成功 し た 場合 に true を 返し ます
新しい 描画 パス の 開始 位置 を 設定 する
成功 し た 場合 に true を 返し ます
テキスト の 位置 を 次 の 行 の 行頭 に 移動 する
矩形 の 高さ
矩形 の 下端
矩形 の 幅
矩形 の 左端
成功 し た 場合 に true を 返し ます
現在 の パス に 矩形 を 追加 する
その ページ の 新しい 文字 間隔
成功 し た 場合 に true を 返し ます
ページ の 文字 間隔 を 設定 する
成功 し た 場合 に true を 返し ます
ページ の 塗り つぶし 色 を 設定 する
最大 8 要素 から なる 配列
パターン を どこ から 開始 する か
成功 し た 場合 に true を 返し ます
ページ の 破線 パターン を 設定 する
その ページ に 定義 する 平坦 度
成功 し た 場合 に true を 返し ます
ページ の 平坦 度 を 設定 する
有効 な harufont の インスタンス
フォント の サイズ
成功 し た 場合 に true を 返し ます
ページ の フォント および フォントサイズ を 設定 する
0 から 1 まで の グレイ 値
成功 し た 場合 に true を 返し ます
ページ の 塗り つぶし 色 を 設定 する
その ページ に 定義 する 高さ
成功 し た 場合 に true を 返し ます
ページ の 高さ を 設定 する
ページ 上 で テキスト を 表示 する 際 の 水平 方向 の 拡大 率
成功 し た 場合 に true を 返し ます
ページ の 横方 向 の 拡大 率 を 設定 する
その ページ に 定義 する 線幅
成功 し た 場合 に true を 返し ます
ページ の 線幅 を 設定 する
ページ の マイターリミット の 現在 値 に 定義 する 値
成功 し た 場合 に true を 返し ます
ページ の マイターリミット の 現在 値 を 設定 する
成功 し た 場合 に true を 返し ます
ページ の 塗り つぶし 色 を 設定 する
次 のい ずれ か の 値 で なけれ ば なり ませ ん
次 のい ずれ か の 値 で なけれ ば なり ませ ん
成功 し た 場合 に true を 返し ます
ページ の サイズ および 方向 を 設定 する
ページ 移動 処理 を 行う 秒数
以下 のい ずれ か の 値 で なけれ ば なり ませ ん
ページ の 表示 時間 を 表す 秒数
成功 し た 場合 に true を 返し ます
ページ の 移動 方式 を 設定 する
高さ の 乗数
テキスト の 垂直 方向 の 位置
テキスト の 水平 方向 の 位置
幅 の 乗数
垂直方向 の 傾き ラジアン
水平方向 の 傾き ラジアン
成功 し た 場合 に true を 返し ます
その ページ の 現在 の テキスト 変換 行列 を 設定 する
以下 のい ずれ か の 値 で なけれ ば なり ませ ん
成功 し た 場合 に true を 返し ます
その ページ の 現在 の テキスト の レンダリングモード を 設定 する
現在 の テキストライズ に 設定 する 値
成功 し た 場合 に true を 返し ます
現在 の テキストライズ の 値 を 設定 する
ページ の 幅 に 設定 する 値
成功 し た 場合 に true を 返し ます
ページ の 幅 を 設定 する
ページ の 単語 間隔 に 設定 する 値
成功 し た 場合 に true を 返し ます
ページ の 単語 間隔 を 設定 する
true の 場合 は 現在 の パス を 閉じ ます
成功 し た 場合 に true を 返し ます
現在 の パス を 描画 する
成功 し た 場合 に true を 返し ます
テキスト を 指定 し た 位置 に 表示 する
テキスト の 範囲 の 下端
テキスト の 範囲 の 右端
テキスト の 範囲 の 左端
テキスト の 配置
テキスト の 範囲 の 上端
表示 さ せ たい テキスト
成功 し た 場合 に true を 返し ます
指定 し た 領域 内 に テキスト を 表示 する
ガウス 分布 の 半径
その モード で 有効 な チャネル 定数 を 指定 し ます
ガウス 分布 の 標準 偏差 ピクセル 単位
成功 し た 場合 に true を 返し ます
順応 し て 画像 を シャープ に する
周辺 の 幅
周辺 の 高さ
平均 オフセット
成功 し た 場合 に true を 返し ます
輝度 の 範囲 に も とづい て 各 ピクセル の 閾値 を 選択 する
元 の imagick オブジェクト
成功 し た 場合 に true を 返し ます
新しい 画像 を imagick オブジェクト の 画像 リスト に 追加 する
テキスト 描画 設定 を 含む imagickdraw オブジェクト
テキスト を 書き出す 角度
テキスト の 左端 の 水平 オフセット を あらわす ピクセル 数
テキスト の ベースライン の 垂直 オフセット を あらわす ピクセル 数
描画 する テキスト
成功 し た 場合 に true を 返し ます
画像 に テキスト による 注記 を 加える
画像 を 垂直 方向 に 積む か どう か
成功 し た 場合 に imagick インスタンス を 返し ます
画像群 を 追加 する
成功 し た 場合 に imagick インスタンス を 返し ます
画像群 を 平均 化 する
標準 偏差
チャネル 定数
にじみ の 半径
成功 し た 場合 に true を 返し ます
blur にじみ フィルタ を 画像 に 追加 する
枠線 の 高さ
枠線 の 幅
枠線 の 色 を 含む imagickpixel オブジェクト あるい は 文字列
成功 し た 場合 に true を 返し ます
画像 の 周り を 枠線 で 囲む
ガウス 分布 の 半径
ガウス 分布 の 標準 偏差 ピクセル 単位
成功 し た 場合 に true を 返し ます
木炭画 を シミュレート する
切り取る 範囲 の y 座標
切り取る 範囲 の 高さ
切り取る 範囲 の 幅
切り取る 範囲 の x 座標
成功 し た 場合 に true を 返し ます
画像 の 一部 を 取り除き 、 切り 詰める
成功 し た 場合 に true を 返し ます
imagick オブジェクト に 関連 付け られ たすべて の リソース を クリア する
成功 し た 場合 に true を 返し ます
8bim プロファイル の 最初 の パス に そっ て 切り 取る
色ルックアップテーブル を 含む imagick オブジェクト
チャネルタイプ 定数
成功 し た 場合 に true を 返し ます
画像 の 色 を 置き 換える
成功 し た 場合 に 新規 imagick オブジェクト を 返し ます
複数 の 画像 を 合成 する
塗りつぶし 色 を 表す imagickpixel オブジェクト
枠線 の 色 を 表す imagickpixel オブジェクト
fuzz の 量
開始 位置 の x 座標
開始 位置 の y 座標
成功 し た 場合 に true を 返し ます
対象 に マッチ する 任意 の 点 の 色 の 値 を 変更 する
不透 明度 を 表す imagickpixel オブジェクト あるい は 文字列
色 を 表す imagickpixel オブジェクト あるい は 文字列
成功 し た 場合 に true を 返し ます
塗りつぶし 色 と 画像 を 混合 する
レイヤメソッド 定数 のいずれ か
成功 し た 場合 に true を 返し ます
複数 の 画像 の 中 で 最大 の 境界 範囲 を 返す
メトリック 定数 を 指定 し ます
比較 し たい 画像
成功 し た 場合 に true を 返し ます
ある 画像 を 再構 築 さ れ た 画像 と 比較 する
読み込み たい 画像 へ の パス 、 あるい は 複数 の パス の 配列
成功 し た 場合 に 新しい imagick オブジェクト を 返し ます
imagick の コンストラクタ
シャープ 値
成功 し た 場合 に true を 返し ます
画像 の コントラスト を 変更 する
抽出 する 領域 の 左上 の x 座標
抽出 する 高さ
抽出 する 領域 の 左上 の y 座標
抽出 する 幅
成功 し た 場合 に true を 返し ます
画像 の 一部 を 抽出 する
サムネイル の 高さ
サムネイル の 幅
成功 し た 場合 に true を 返し ます
切り取っ て サムネイル を 作成 する
成功 し た 場合 に 自分 自身 を 返し ます
現在 の imagick オブジェクト へ の 参照 を 返す
カラーマップ を 移動 さ せる 量
成功 し た 場合 に true を 返し ます
画像 の カラーマップ を 移動 する
パスフレーズ
成功 し た 場合 に true を 返し ます
画像 を 復号 する
削除 し たい アーチファクト の 名前
成功 し た 場合 に true を 返し ます
画像 の アーチファクト を 削除 する
成功 し た 場合 に true を 返し ます
imagick オブジェクト を 破棄 する
x サーバー の 名前
成功 し た 場合 に true を 返し ます
画像 を 表示 する
元 画像 の サイズ を 変更 する
歪め 方式 の 引数
画像 の 歪め 方式
成功 し た 場合 に true を 返し ます
さまざまな 方式 で 画像 を 歪める
画像 を レンダリング する 描画 操作
成功 し た 場合 に true を 返し ます
現在 の 画像 上 の imagickdraw オブジェクト を レンダリング する
効果 の シグマ
効果 の 半径
成功 し た 場合 に true を 返し ます
グレースケール 画像 に 三次 元効 果 を 施し て 返す
パスフレーズ
成功 し た 場合 に true を 返し ます
画像 を 暗号 化 する
成功 し た 場合 に true を 返し ます
ノイジー な 画像 の 品質 を 向上 さ せる
成功 し た 場合 に true を 返し ます
画像 ヒストグラム を 均等 化 する
チャネルモード に 対応 し た チャネル 定数 を 指定 し ます
評価 演算子
演算子 の 値
成功 し た 場合 に true を 返し ます
式 を 画像 に 適用 する
成功 し た 場合 に true を 返し ます
画像 シーケンス を マージ する
成功 し た 場合 に true を 返し ます
垂直 方向 に 反転 し た 画像 を 作成 する
成功 し た 場合 に true を 返し ます
水平 方向 に 反転 し た 画像 を 作成 する
関数 定数 の 一覧 を 参照く ださい
この 関数 に 渡す 引数 の 配列
成功 し た 場合 に true を 返し ます
画像 に 関数 を 適用 する
式
チャネルモード に 対応 し た チャネル 定数 を 指定 し ます
成功 し た 場合 に true を 返し ます
式 を 画像 の 各 ピクセル に 適用 する
チャネルモード に 対応 し た チャネル 定数 を 指定 し ます
ガウス 演算 の 標準 偏差
ガウス 演算 の 半径
成功 し た 場合 に true を 返し ます
画像 を ぼかす
成功 し た 場合 に 文字列 を 返し ます
画像 シーケンス に 関連 付け られ た ファイル 名 を 取得 する
画像 フォーマット を 返し ます
imagick オブジェクト の フォーマット を 取得 する
gravity プロパティ を 返し ます
gravity を 取得 する
imagemagick の ホームページ へ の リンク を 返し ます
imagemagick の ホーム url を 返す
現在 の 画像 シーケンス を 使用 し た 新しい imagick オブジェクト を 返し ます
新しい imagick オブジェクト を 返す
現在 の アルファチャネル 値 を 表す 定数 を 返し ます
画像 の アルファチャネル を 取得 する
画像 の 背景 色 を 設定 し た imagickpixel を 返し ます
画像 の 背景 色 を 返す
画像 を 含む 文字 列 を 返し ます
画像 シーケンス を blob で 返す
&quot ;x &quot ; 座標 および & quot ;y &quot ; 座標 を 含む 配列 を 返し ます
青 が 一番 強い 点 を 返す
成功 し た 場合 に true を 返し ます
画像 の 前景 色 を 返す
比較 する imagick オブジェクト
チャネルモード に 対応 し た チャネル 定数 を 指定 し ます
メトリック 型定 数 のいずれ か
成功 し た 場合 に true を 返し ます
画像 の チャネル を 再構 築 し た 画像 と 比較 する
チャネルモード に 対応 し た チャネル 定数 を 指定 し ます
成功 し た 場合 に true を 返し ます
ひとつ あるい は 複数 の 画像 チャネル の 極値 を 取得 する
その モード で 有効 な チャネル 定数 を 指定 し ます
kurtosis と skewness を 要素 に 持つ 配列 を 返し ます
getimagechannelkurtosis
その モード で 有効 な チャネル 定数 を 指定 し ます
チャネル の minima および maxima の 値 を 含む 配列 を 返し ます
チャネル の 範囲 を 取得 する
成功 し た 場合 に true を 返し ます
画像 の 各 チャネル の 統計 情報 を 返す
画像 の クリップマスク を 含む imagick オブジェクト を 返し ます
画像 の クリップマスク を 取得 する
成功 し た 場合 に true を 返し ます
画像 の 色空間 を 取得 する
成功 し た 場合 に true を 返し ます
画像 の 合成 演算子 を 返す
圧縮 形式 を 表す 定数 を 返し ます
現在 の 画像 の 圧縮 形式 を 取得 する
画像 の 圧縮 品質 を 表す 整数 値 を 返し ます
現在 の 画像 の 圧縮 品質 を 取得 する
画像 の 遅延 を 返し ます
画像 の 遅延 を 取得 する
比較 する imagick オブジェクト
メトリック 型定 数 のいずれ か
その 画像 で 使用 する 歪み 係数 あるい は その 推測 値 を 返し ます
ある 画像 と 再構 築 し た 画像 を 比較 する
画像 の ファイル 名 を 文字列 で 返し ます
シーケンス 内 の 特定 の 画像 の ファイル 名 を 返す
成功 し た 場合 は 画像 の フォーマット を 文字列 で 返し ます
シーケンス 内 の 特定 の 画像 の フォーマット を 返す
画像 の 幅 と 高さ を 表す 配列 を 返し ます
幅 と 高さ を 連想 配列 で 取得 する
成功 し た 場合 に & quot ;x &quot ; および & quot ;y &quot ; という キー を 持つ 配列 を 返し ます
緑 が 一番 強い 点 を 返す
画像 の 高さ を ピクセル 数 で 返し ます
画像 の 高さ を 返す
画像 の ヒストグラム を imagickpixel オブジェクト の 配列 で 返し ます
画像 の ヒストグラム を 取得 する
スタック 内 の 画像 の インデックス を 表す 整数 値 を 返し ます
現在 アクティブ な 画像 の インデックス を 取得 する
成功 し た 場合 に 画像 の インターレース 手法 を 返し ます
画像 の インターレース 手法 を 取得 する
成功 し た 場合 に 補間 方式 を 返し ます
画像 の 補間 方式 を 返す
画像 の 反復 を 表す 整数 値 を 返し ます
画像 の 反復 を 取得 する
現在 の 画像 の サイズ を 整数 値 で 返し ます
画像 の 長さ を バイト 数 で 取得 する
imagemagick の ライセンス を 文字列 で 返し ます
imagemagick の ライセンス を 文字列 で 返す
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
画像 が マットチャネル を 持っ て いる かど う か を 返す
成功 し た 場合 に imagickpixel オブジェクト を 返し ます
画像 の マット 色 を 返す
成功 し た 場合 に 整数 値 を 返し ます
画像 の 方向 を 取得 する
プロファイル 名 のみ を 返す かどう か
プロファイル 名 の パターン
画像 の プロファイル あるい は プロファイル 名 を 含む 連想 配列 を 返し ます
画像 プロファイル を 返す
プロパティ 名 の パターン
プロパティ 名 のみ を 返す かどう か
画像 の プロパティ あるい は プロパティ 名 を 含む 連想 配列 を 返し ます
画像 の プロパティ を 返す
プロパティ の 名前 たとえ ば exif :datetime
画像 の プロパティ を 含む 文字 列 を 返し ます
指定 し た 名前 の 画像 の プロパティ を 返す
赤 が 一番 強い 点 を & quot ;x &quot ; および & quot ;y &quot ; という キー を 持つ 配列 で 返し ます
赤 が 一番 強い 点 を 返す
抽出 する 範囲 の 左上 の y 座標
抽出 する 範囲 の 高さ
抽出 する 範囲 の 左上 の x 座標
抽出 する 範囲 の 幅
画像 の 一部 を 抽出 し 、 新しい wand として 返し ます
画像 の 一部 を 抽出 する
画像 の レンダリング 方向 を 返し ます
画像 の レンダリング 方向 を 取得 する
解像度 を 配列 で 返し ます
画像 の x 方向 と y 方向 の 解像 度 を 取得 する
画像 を 文字列 で 返し ます
すべて の 画像 シーケンス を blob で 返す
画像 の シーン を 返し ます
画像 の シーン を 取得 する
その ファイル の sha - 2 5 6 ハッシュ を 文字列 で 返し ます
sha - 2 5 6 メッセージダイジェスト を 生成 する
画像 の 総 インク 密度 を 返し ます
画像 の 総 インク 密度 を 取得 する
画像 の 型 を 返し ます
画像 の 型 を 取得 する
成功 し た 場合 に 仮想 ピクセルメソッド を 返し ます
仮想 ピクセルメソッド を 取得 する
色度 が 白い点 を 返し ます
色度 が 白い点 を 返す
画像 の 幅 を 返し ます
画像 の 幅 を 返す
imagick オブジェクト に 関連 付け られ て いる 画像 の 数 を 返し ます
オブジェクト 内 の 画像 の 数 を 返す
オプション の 名前
指定 し た キー に 対応 する 値 を 返し ます
指定 し た キー に 対応 する 値 を 返す
imagemagick パッケージ 名 を 文字列 で 返し ます
imagemagick パッケージ 名 を 返す
imagick オブジェクト に 関連 付け られ た ページ の ジオメトリ を 返し ます
ページ の ジオメトリ を 返す
成功 し た 場合 に imagickpixeliterator を 返し ます
magickpixeliterator を 返す
範囲 の y 座標
範囲 の 高さ
範囲 の x 座標
範囲 の 幅
画像 セクション の imagickpixeliterator を 返し ます
画像 セクション の imagickpixeliterator を 取得 する
imagick quantum depth を 文字列 で 返し ます
quantum depth を 取得 する
quantum range を 連想 配列 で 返し ます
imagick quantum range を 返す
imagemagick の リリース 日 を 文字列 で 返し ます
imagemagick の リリース 日 を 返す
リソース 型定 数 の 一覧 を 参照く ださい
指定 し た リソース の メモリ 使用 状況 を メガバイト 単位 で 返し ます
指定 し た リソース の メモリ 使用 状況 を 返す
imagemagick api の バージョン を 文字 列 と 数値 で 返し ます
imagemagick api の バージョン を 返す
リスト 内 で ひとつ 先 に 進ん だ とき にまだ オブジェクト が 画像 を 保持 し て いれ ば true 、 し て い なけれ ば false を 返し ます
オブジェクト が 次 の 画像 を 保持 し て いる かど う か を 調べる
リスト 内 で 逆方 向 に ひとつ 進ん だ とき にまだ オブジェクト が 画像 を 保持 し て いれ ば true 、 し て い なけれ ば false を 返し ます
オブジェクト が 前 の 画像 を 保持 し て いる かど う か を 調べる
内破 処理 の 半径
成功 し た 場合 に true を 返し ます
新しい 画像 を コピー として 作成 する
ピクセル の 格納 方式
ピクセル の 配列
ピクセル の 並び順 を 表す 文字列
画像 の 幅
画像 の y 位置
画像 の 高さ
画像 の x 位置
成功 し た 場合 に true を 返し ます
画像 の ピクセル を インポート する
追加 する ラベル
成功 し た 場合 に true を 返し ます
ラベル を 画像 に 追加 する
チャネルモード に 対応 し た チャネル 定数 を 指定 し ます
画像 の 黒 の 点
ガンマ 値
画像 の 白 の 点
成功 し た 場合 に true を 返し ます
画像 の レベル を 調節 する
画像 の 黒 の 点
画像 の 白 の 点
成功 し た 場合 に true を 返し ます
画像 の 輝度 を 引き伸ば し て 飽和 さ せる
成功 し た 場合 に true を 返し ます
画像 を 2 倍 に 比例 拡大 する
imagick :: layermethod _* 定数 のい ずれ か
マージ し た 画像 を 含む imagick オブジェクト を 返し ます
画像 の レイヤー を マージ する
成功 し た 場合 に true を 返し ます
画像 を その 半分 の サイズ に 比例 縮小 する
成功 し た 場合 に true を 返し ます
明度 、 飽和 度 、 色相 を 制御 する
画像 を 枠線 で 囲み ます 例 1 5 x 1 5 + 3 + 3
フォント 名 、 サイズ 、 色 を この オブジェクト から 取得 し ます
各 サムネイル の 画像 サイズ と 枠線 の サイズ 例 1 2 0 x 1 2 0 + 4 + 3 & gt ;
サムネイル の フレームモード
行単位 、 ページ 単位 の タイル 数 例 6x 4 + 0 + 0
成功 し た 場合 に true を 返し ます
合成 画像 を 作成 する
生成 する 中間 画像 の 数
この メソッド は 、 成功 し た 場合 に 新しい imagick オブジェクト を 返し ます
複数 の 画像 を モーフィング する
成功 し た 場合 に true を 返し ます
画像 から モザイク を 作成 する
この 角度 で 効果 を 適用 し ます
その チャンネルモード で 使用 可能 な 任意 の チャンネル 定数 を 指定 し ます
ガウス 演算 の 標準 偏差
ガウス 演算 の 半径
成功 し た 場合 に true を 返し ます
モーションブラー を シミュレート する
新しい 画像 の カラム 数
画像 フォーマット
この 画像 で 使用 する 背景 色
新しい 画像 の 行数
成功 し た 場合 に true を 返し ます
新しい 画像 を 作成 する
成功 し た 場合 に true を 返し ます
次 の 画像 に 移動 する
チャネルモード に 対応 し た チャネル 定数 を 指定 し ます
成功 し た 場合 に true を 返し ます
カラー 画像 の コントラスト を 強調 する
近傍円 の 半径
成功 し た 場合 に true を 返し ます
油絵 を シミュレート する
true の 場合 は 、 対象 の 色 に マッチ し ない ピクセル を 変更 し ます
あいまい さ を あらわす 量
変更 し たい 色 を あらわす imagickpixel オブジェクト あるい は 文字列
その モード で 有効 な チャネル 定数 を 指定 し ます
置き換える 色
成功 し た 場合 に true を 返し ます
対象 に マッチ する 任意 の ピクセル の 色 を 変更 する
成功 し た 場合 に true を 返し ます
画像 の 繰り返し 部分 を 削除 し て 最適 化 する
使用 する ディザリング 閾値 マップ を 含む 文字列
チャネルモード に 応じ た チャネル 定数 を 指定 し ます
成功 し た 場合 に true を 返し ます
配列 ディザリング を 行う
floodfill の 開始 位置 の x 座標
境界色 を 表す imagickpixel オブジェクト あるい は 文字列
fuzz の 量
その モード で 有効 な チャネル 定数 を 指定 し ます
塗りつぶし 色 を 表す imagickpixel オブジェクト あるい は 文字列
floodfill の 開始 位置 の y 座標
成功 し た 場合 に true を 返し ます
色 に マッチ する ピクセル を 変更 する
この 対象 色 を 変更 し て 、 画像 の 不透 明度 を 指定 し ます
不透 明度 レベル
画像 の fuzz 値
成功 し た 場合 に true を 返し ます
色 に マッチ する ピクセル を 塗り つぶし 色 に 変更 する
情報 を 読み込む ファイル 名
成功 し た 場合 に true を 返し ます
画像 の 基本 属性 を 取得 する
画像 を 含む 文字列
成功 し た 場合 に true を 返し ます
手早く 属性 を 取得 する
開い て いる 画像 の ファイルハンドル
オプション で 指定 する 、 この 画像 の ファイル 名
成功 し た 場合 に true を 返し ます
画像 の 基本 属性 を 手軽 に 取得 する
ポラロイド 角度
ポラロイドプロパティ
成功 し た 場合 に true を 返し ます
ポラロイド 写真 を シミュレート する
プレビュー 形式
成功 し た 場合 に true を 返し ます
画像 処理 用 の 適切 な パラメータ を 手早く 取得 する
成功 し た 場合 に true を 返し ます
画像 の プロファイル を 追加 あるい は 削除 する
テキスト
マルチラインパラメータ
フォント の プロパティ を 含む imagickdraw オブジェクト
フォントメトリクス を 表す 、 多次 元 配列 を 返し ます
フォントメトリクス を 表す 配列 を 返す
クエリパターン
フォント を 含む 配列 を 返し ます
設定 し た フォント を 返す
成功 し た 場合 に true を 返し ます
画像 に ラジアルブラー を 施す
成功 し た 場合 に true を 返し ます
三次元 の ボタン 風 の 効果 を シミュレート する
高い点
その モード に 対応 し た 任意 の チャネル 定数 を 指定 し ます
低い点
成功 し た 場合 に true を 返し ます
コントラスト の 高い 2 色 の 画像 を 作成 する
成功 し た 場合 に true を 返し ます
バイナリ 文字 列 から 画像 を 読み込む
成功 し た 場合 に true を 返し ます
オープン し て いる ファイルハンドル から 画像 を 読み込む
色 の 値 を 含む 行列
成功 し た 場合 に true を 返し ます
画像 の 色 を 変更 する
成功 し た 場合 に true を 返し ます
画像 の 輪郭 を なめらか に する
ディザメソッド 定数 の 一覧 を 参照く ださい
置き換える 色 を 含む imagick オブジェクト
成功 し た 場合 に true を 返し ます
画像 の 色 を 再配 置 する
成功 し た 場合 に true を 返し ます
画像 リスト から 画像 を 削除 する
画像 の プロファイル 名 を 返し ます
指定 し た 名前 の 画像 プロファイル を 削除 し て それ を 返す
成功 し た 場合 に true を 返し ます
画像 を 指定 し た 解像 度 に リサンプリング する
ページ 定義
成功 し た 場合 に true を 返し ます
画像 の ページ を リセット する
フィルタ 定数 の 一覧 を 参照く ださい
オプション の fit パラメータ
画像 の 幅
blur 要素
画像 の 高さ
成功 し た 場合 に true を 返し ます
画像 の サイズ を 変更 する
y 方向 の 丸め
x 方向 の 丸め
線幅
サイズ 補正
image displace
成功 し た 場合 に true を 返し ます
画像 の 角 を 丸める
成功 し た 場合 に true を 返し ます
ピクセル の サンプリング によっ て 画像 の 倍率 を 変更 する
成功 し た 場合 に true を 返し ます
画像 の サイズ を 変更 する
ど の 「 チャネル 」 を 戻す か
成功 し た 場合 に true を 返し ます
画像 から チャネル を 分離 する
成功 し た 場合 に true を 返し ます
画像 を セピア 調 に する
colorspace 定数 の ひとつ
成功 し た 場合 に true を 返し ます
色空間 を 設定 する
成功 し た 場合 に true を 返し ます
オブジェクト の デフォルト の 圧縮 方式 を 設定 する
成功 し た 場合 に true を 返し ます
オブジェクト の デフォルト の 圧縮 品質 を 設定 する
成功 し た 場合 に true を 返し ます
imagick イテレータ を 最初 の 画像 に 設定 する
成功 し た 場合 に true を 返し ます
imagick オブジェクト の フォーマット を 設定 する
gravity プロパティ
gravity を 設定 する
置き換える imagick オブジェクト
成功 し た 場合 に true を 返し ます
オブジェクト 内 の 画像 を 置き 換える
成功 し た 場合 に true を 返し ます
画像 の 背景 色 を 設定 する
成功 し た 場合 に true を 返し ます
画像 を 折り た たむ 任意 の メソッド について 画像 の バイアス を 設定 する
前 景色
成功 し た 場合 に true を 返し ます
画像 の 前景 色 を 設定 する
クリップマスク を 含む imagick オブジェクト
成功 し た 場合 に true を 返し ます
画像 の クリップマスク を 設定 する
colorspace 定数 のいずれ か
成功 し た 場合 に true を 返し ます
画像 の 色空間 を 設定 する
成功 し た 場合 に true を 返し ます
画像 の 合成 演算子 を 設定 する
compression 定数 のい ずれ か
成功 し た 場合 に true を 返し ます
画像 の 圧縮 を 設定 する
画像 の 圧縮 品質 を 表す 整数 値
成功 し た 場合 に true を 返し ます
画像 の 圧縮 品質 を 設定 する
画像 を 表示 さ せる 時間 を & # 0 3 9 ; ticks &# 0 3 9 ; で 表し た 値
成功 し た 場合 に true を 返し ます
画像 の 遅延 を 設定 する
成功 し た 場合 に true を 返し ます
画像 の 深度 を 設定 する
成功 し た 場合 に true を 返し ます
画像 の 配置 方法 を 設定 する
成功 し た 場合 に true を 返し ます
特定 の 画像 の ファイル 名 を 設定 する
成功 し た 場合 に true を 返し ます
画像 の ガンマ を 設定 する
gravity プロパティ
画像 の gravity を 設定 する
成功 し た 場合 に true を 返し ます
緑 が 一番 強い 点 を 設定 する
成功 し た 場合 に true を 返し ます
画像 の インターレース 手法 を 設定 する
画像 を ループ さ せる 回数
成功 し た 場合 に true を 返し ます
画像 の 反復 を 設定 する
true に する と マットチャネル を 有効 に し 、 false の 場合 は 無効 に し ます
成功 し た 場合 に true を 返し ます
画像 の マットチャネル を 設定 する
成功 し た 場合 に true を 返し ます
指定 し た 名前 の 画像 プロファイル を imagick オブジェクト に 追加 する
成功 し た 場合 に true を 返し ます
画像 の プロパティ を 設定 する
成功 し た 場合 に true を 返し ます
赤 が 一番 強い 点 を 設定 する
成功 し た 場合 に true を 返し ます
画像 の レンダリング 方向 を 設定 する
成功 し た 場合 に true を 返し ます
画像 の シーン を 設定 する
成功 し た 場合 に true を 返し ます
画像 の 型 を 設定 する
成功 し た 場合 に true を 返し ます
画像 の 解像 度 の 単位 を 設定 する
成功 し た 場合 に true を 返し ます
画像 の 仮想 ピクセルメソッド を 設定 する
成功 し た 場合 に true を 返し ます
画像 の 色度 が 白い点 を 設定 する
イテレータ を 設定 する 場所
成功 し た 場合 に true を 返し ます
イテレータ の 位置 を 設定 する
成功 し た 場合 に true を 返し ます
imagick イテレータ を 最後 の 画像 に 設定 する
成功 し た 場合 に true を 返し ます
オプション を 設定 する
成功 し た 場合 に true を 返し ます
imagick オブジェクト の ページジオメトリ を 設定 する
ポイントサイズ
成功 し た 場合 に true を 返し ます
ポイントサイズ を 設定 する
垂直方向 の 解像 度
水平方向 の 解像 度
成功 し た 場合 に true を 返し ます
画像 の 解像 度 を 設定 する
成功 し た 場合 に true を 返し ます
imagick オブジェクト の サイズ を 設定 する
幅 ピクセル 単位
高さ ピクセル 単位
画像 の オフセット
成功 し た 場合 に true を 返し ます
imagick オブジェクト の サイズ の オフセット を 設定 する
ゼロ 以外 の 値 で 、 各 ピクセル に 影 を つけ ます
光源 の 方向 を 定義 し ます
光源 の 方向 を 定義 し ます
成功 し た 場合 に true を 返し ます
3d 効果 を 作成 する
成功 し た 場合 に true を 返し ます
画像 の 影 を シミュレート する
成功 し た 場合 に true を 返し ます
画像 を シャープ に する
背景色
x 軸方 向 に 押しつぶす 角度
y 軸方 向 に 押しつぶす 角度
成功 し た 場合 に true を 返し ます
平行 四 辺形 を 作成 する
which color channels the contrast will be applied to
if true increase the contrast if false decrease the contrast
the amount of contrast to apply
where the midpoint of the gradient will be
成功 し た 場合 に true を 返し ます
画像 の コントラスト を 調整 する
この 角度 で 効果 を 適用 し ます
ガウス 変換 の 半径 ピクセル 単位 で 中心 の ピクセル は 数え ない
ガウス 変換 の 標準 偏差 ピクセル 単位
成功 し た 場合 に true を 返し ます
鉛筆画 を シミュレート する
成功 し た 場合 に true を 返し ます
画像 に ソラリゼーション 効果 を 適用 する
sparse method 定数 の 一覧 を 参照く ださい
座標 を 含む 配列
その モード で 有効 な チャネル 定数 を 指定 し ます
成功 し た 場合 に true を 返し ます
色 を 補間 する
成功 し た 場合 に true を 返し ます
無地 の 画像 を 作成 する
成功 し た 場合 に true を 返し ます
ブロック 内 の 各 ピクセル を ランダム に 移動 する
成功 し た 場合 に true を 返し ます
デジタル 透かし を 画像 に 埋め込む
成功 し た 場合 に true を 返し ます
ふたつ の 画像 を 合成 する
成功 し た 場合 に true を 返し ます
画像 から すべ て の プロパティ や コメント を 除去 する
成功 し た 場合 に true を 返し ます
テクスチャ 画像 を タイル 状 に 並べる
成功 し た 場合 に true を 返し ます
閾値 に も とづい て 個々 の ピクセル の 値 を 変更 する
最大値 を 強制 的 に 使用 する かどう か
画像 の 幅
画像 の 高さ
成功 し た 場合 に true を 返し ます
画像 の サイズ を 変更 する
切り取り ジオメトリ 文字列
画像 ジオメトリ 文字列
変換語 の 画像 を 含む imagick オブジェクト を 返し ます
切り取る サイズ と 画像 の ジオメトリ を 設定 する 便利 な メソッド
対象 と なる 色
透明度
true の 場合 は 、 対象 の 色 に マッチ し ない ピクセル を 変更 し ます
あいまい さ を あらわす 量
成功 し た 場合 に true を 返し ます
ピクセル を 透過 さ せる
成功 し た 場合 に true を 返し ます
水平 方向 に 反転 さ せ た 画像 を 作成 する
成功 し た 場合 に true を 返し ます
画像 を シャープ に する
成功 し た 場合 に true を 返し ます
現在 の アイテム が 有効 か どう か を 調べる
黒 の 点
白 の 点
楕円 の y オフセット
楕円 の x オフセット
成功 し た 場合 に true を 返し ます
ビネットフィルタ を 画像 に 追加 する
波長
波 の 振幅
成功 し た 場合 に true を 返し ます
ウェーブフィルタ を 画像 に 適用 する
画像 を 書き出す ファイル 名
成功 し た 場合 に true を 返し ます
指定 し た 名前 で 画像 を 書き込む
画像 を 書き出す ファイルハンドル
成功 し た 場合 に true を 返し ます
画像 を ファイルハンドル に 書き出す
成功 し た 場合 に true を 返し ます
画像 あるい は 画像 シーケンス を 書き込む
色 を 正規 化 する
各 チャネル の 値 を 配列 で 返し ます
色 を 返す
imagickpixel オブジェクト の 色 を 文字列 で 返し ます
色 を 文字列 で 返す
調べ たい 色
チャネル の 値 を 正規 化 し た 浮動 小数 点数 値 を 返し ます
指定 し た 色 チャネル の 値 を 正規 化 し た もの を 取得 する
hsl の 値 を それぞれ & quot ;hue &quot ;、 & quot ;saturation &quot ;、 そして & quot ;luminosity &quot ; という キー に 保持 する 配列 を 返し ます
imagickpixel オブジェクト の hsl カラー を 正規 化 し た もの を 返す
その チャネル に 設定 する 値
imagick 色 チャネル 定数 のい ずれ か
成功 し た 場合 に true を 返し ます
指定 し た チャネル の 正規 化 し た 値 を 設定 する
色相 を 正規 化 し た 値
明度 を 正規 化 し た 値
彩度 を 正規 化 し た 値
成功 し た 場合 に true を 返し ます
正規化 し た hsl カラー を 設定 する
無限 に 処理 し 続ける イテレータ
infiniteiterator を 作成 する
内部 イテレータ を 次 に 移動 する か 、 巻き戻す
あらゆる 型 を 返す こと が 可能 です
現在 の 要素 を 返す
成功 し た 場合 に スカラー 型 、 失敗 し た 場合 に null を 返し ます
現在 の 要素 の キー を 返す
次 の 要素 に 進む
iterator あるい は traversable を 実装 し た オブジェクト の インスタンス を 返し ます
外部 イテレータ を 取得 する
traversable な イテレータ
traversable な 何 か から イテレータ を 作成 する
現在 の 要素 の 値 を 返し ます
現在 の 値 を 取得 する
iteratoriterator :: __ construct に渡し た 内部 イテレータ を 返し ます
内部 イテレータ を 取得 する
json _encode で シリアライズ する データ を 返し ます
json に シリアライズ し たい データ を 指定 する
制限 し たい イテレータ
オプション の 要素 数
オプション の 開始 位置
新しい limititerator を 返し ます
limititerator を 作成 する
limititerator :: __ construct に渡さ れ た 内部 イテレータ を 返し ます
内部 イテレータ を 取得 する
現在 の 位置 を 返し ます
現在 の 位置 を 返す
現在 の 要素 の キー を 返し ます
現在 の キー を 取得 する
移動 し たい 位置
移動後 の オフセット 位置 を 返し ます
与え られ た 位置 に 移動 する
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
現在 の 要素 が 有効 か どう か を チェック する
有効 な php 関数 コールバック
$this を 返し ます
php 関数 を lua に 登録
項目 を 圧縮 し て 格納 する 場合 に memcache _compressed を 使用 し ます zlib を 使用 し ます
格納 する 値
項目 に 関連 付け られ た キー
項目 の 有効 期限
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
サーバー に 項目 を 追加 する
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
memcached サーバー と の 接続 を 閉じる
デーモン へ の 接続 の 際 に 使用 する 値 秒単位 です
memcached が 接続 を 待ち受ける ポート を 指定 し ます
memcached が 接続 を 待ち受ける ホスト を 指定 し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
memcached サーバー へ の 接続 を オープン する
項目 の 値 を value だけ 減ら し ます
値 を 減ら す 項目 の キー
項目 の 新しい 値か 、 失敗 し た 場合 に false を 返し ます
項目 の 値 を 減ら す
削除 し たい 項目 の キー
この 非推 奨 の パラメータ は サポート し て おら ず 、 デフォルト で 0 秒 に なっ て い ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
サーバー から 項目 を 削除 する
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
サーバー 上 の すべ て の 既存 項目 を 消去 する
取得 し たい キー あるい は キー の 配列
存在 し た 場合 は 、 値と とも に 取得 し た フラグ を ここ に 書き込み ます
key に関連付け られ た 文字列 を 返し ます
サーバー から 項目 を 取得 する
type を cachedump と 設定 し た 場合 に 使用 し 、 ダンプ を 取得 する slab を 指定 し ます
type を cachedump と 設定 し た 場合 に 使用 し 、 ダンプ する エントリ の 数 を 制限 し ます
取得 する 統計 情報 の 型
サーバー の 統計 情報 を 含む 連想 配列 を 返し ます
サーバー の 統計 情報 を 取得 する
デーモン へ の 接続 の 際 に 使用 する 値 秒単位 です
memcached が 接続 を 待ち受ける ポート を 指定 し ます
memcached が 接続 を 待ち受ける ホスト を 指定 し ます
memcache オブジェクト を 返し ます
memcached サーバー へ の 持続 的 な 接続 を オープン する
項目 を 圧縮 し て 格納 する 場合 に memcache _compressed を 使用 し ます zlib を 使用 し ます
格納 する 値
項目 に 関連 付け られ た キー
項目 の 有効 期限
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
既存 項目 の 値 を 置換 する
デーモン へ の 接続 の 際 に 使用 する 値 秒単位 です
サーバー と の 接続 が 失敗 し た 際 に 再試行 を 行う 頻度 を 設定 し ます
memcached が 接続 を 待ち受ける ポート を 指定 し ます
エラー が 発生 し た 際 に 実行 さ れる コールバック 関数 を 指定 できる よう に し ます
memcached が 接続 を 待ち受ける ホスト を 指定 し ます
サーバー が オンライン 状態 で ある かど う か を 制御 し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
サーバー の パラメータ および 状態 を 、 実行 時 に 変更 する
期限切 れ と なる まで の 時間
値 の 格納 先 の キー
格納 する 値
値 を 格納 し たり データ を 取得 し たり する サーバー を 表す キー
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
指定 し た サーバー に アイテム を 新しい キー で 追加 する
memcache が 動作 し て いる ポート
memcache サーバー の ホスト 名
プール 内 の 全 サーバー に おける その サーバー の 重み
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
サーバー を サーバープール に 追加 する
追記 する 文字列
値 の 格納 先 の キー
値 を 格納 し たり データ を 取得 し たり する サーバー を 表す キー
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
指定 し た サーバー で データ を 既存 の アイテム に 追記 する
格納 する 値
期限切 れ と なる まで の 時間
値 の 格納 先 の キー
既存 の アイテム に 割り当て たれ た 一意 な 値
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
アイテム を 比較 し て 入れ 替える
値 を 減ら し たい 量
その アイテム に 設定 する 有効 期限
減ら し たい アイテム の キー
その アイテム が 存在 し ない 場合 に 設定 する 値
値 を 格納 し たり データ を 取得 し たり する サーバー を 表す キー
成功 し た 場合 に アイテム の 新しい 値 、 失敗 し た 場合 に false を 返し ます
指定 し た サーバー 上 に ある 数値 アイテム の 値 を 減ら す
サーバー が アイテム を 削除 する まで の 待ち 時間
削除 し たい キー
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
アイテム を 削除 する
サーバー が アイテム を 削除 する まで の 待ち 時間
削除 し たい キー
値 を 格納 し たり データ を 取得 し たり する サーバー を 表す キー
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
指定 し た サーバー から アイテム を 削除 する
サーバー が アイテム を 削除 する まで の 待ち 時間
削除 し たい キー
値 を 格納 し たり データ を 取得 し たり する サーバー を 表す キー
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
指定 し た サーバー から 複数 の アイテム を 削除 する
次 の 結果 、 あるい は false を 返し ます
次 の 結果 を 取得 する
アイテム の 無効 化 まで に 待機 する 秒数
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
キャッシュ 内 の すべ て の アイテム を 無効 に する
cas トークン を 格納 する 変数
取得 し たい アイテム の キー
read -through キャッシュコールバック 、 あるい は null
キャッシュ に 格納 さ れ た 値 、 あるい は false を 返し ます
アイテム を 取得 する
成功 し た 場合 は 全 サーバー に 格納 さ れ て いる キー 、 失敗 し た 場合 に false を 返し ます
すべて の サーバー の キー を 取得 する
cas トークン を 格納 する 変数
read -through キャッシュコールバック 、 あるい は null
取得 し たい アイテム の キー
値 を 格納 し たり データ を 取得 し たり する サーバー を 表す キー
キャッシュ に 格納 さ れ た 値 、 あるい は false を 返し ます
指定 し た サーバー から アイテム を 取得 する
要求 する キー の 配列
result コールバック 、 あるい は null
cas トークン の 値 も 要求 する かどう か
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
複数 の アイテム を 要求 する
取得 操作 の フラグ
見つかっ た アイテム の cas トークン を 格納 する 変数
取得 し たい キー の 配列
値 を 格納 し たり データ を 取得 し たり する サーバー を 表す キー
見つかっ た アイテム の 配列 、 失敗 し た 場合 に false を 返し ます
指定 し た サーバー から 複数 の アイテム を 取得 する
memcached :: opt _* 定数 のい ずれ か
要求 さ れ た オプション の 値 、 あるい は エラー 時 に false を 返し ます
memcached の オプション の 値 を 取得 する
直近 の memcached 操作 の 結果 コード を 返し ます
直近 の 操作 の 結果 コード を 返す
最後 に 実行 し た memcached クラス の 操作 結果 を 説明 し た メッセージ
最後 に 実行 し た 操作 の 結果 を 説明 し た メッセージ を 返す
値 を 格納 し たり データ を 取得 し たり する サーバー を 表す キー
成功 し た 場合 に 配列 を 返し ます
キー と サーバー を 関連 付ける
サーバー の 統計 情報 の 配列 を 返し ます
サーバープール の 統計 情報 を 取得 する
memcached サーバー の バージョン 情報 の 配列
サーバープール の バージョン 情報 を 取得 する
値 を 増や し たい 量
その アイテム に 設定 する 有効 期限
その アイテム が 存在 し ない 場合 に 設定 する 値
増や し たい アイテム の キー
成功 し た 場合 に アイテム の 新しい 値 、 失敗 し た 場合 に false を 返し ます
数値 アイテム の 値 を 増やす
値 を 増や し たい 量
その アイテム に 設定 する 有効 期限
その アイテム が 存在 し ない 場合 に 設定 する 値
増や し たい アイテム の キー
値 を 格納 し たり データ を 取得 し たり する サーバー を 表す キー
成功 し た 場合 に アイテム の 新しい 値 、 失敗 し た 場合 に false を 返し ます
指定 し た サーバー 上 に ある 数値 アイテム の 値 を 増やす
memcache インスタンス が 持続 的 接続 を 使っ て いる 場合 に true 、 それ 以外 の 場合 に false を 返し ます
memcache へ の 接続 で 持続 的 接続 を 使っ て いる かど う か を 調べる
直近 に 作られ た インスタンス で ある 場合 に true 、 それ 以外 の 場合 に false を 返し ます
直近 に 作られ た インスタンス か どう か を 調べる
データ を 先頭 に 付加 し たい アイテム の キー
先頭 に 付加 する 文字列
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
既存 の アイテム の 前 に データ を 付加 する
データ を 先頭 に 付加 し たい アイテム の キー
先頭 に 付加 する 文字列
値 を 格納 し たり データ を 取得 し たり する サーバー を 表す キー
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
指定 し た サーバー で 既存 の アイテム の 前 に データ を 付加 する
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
開い て いる 接続 を 閉じる
期限切 れ と なる まで の 時間
値 の 格納 先 の キー
格納 する 値
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
既存 の キー の アイテム を 入れ 替える
期限切 れ と なる まで の 時間
値 の 格納 先 の キー
格納 する 値
値 を 格納 し たり データ を 取得 し たり する サーバー を 表す キー
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
指定 し た サーバー で 既存 の キー の アイテム を 入れ 替える
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
サーバーリスト から すべ て の サーバー を 消去 する
期限切 れ と なる まで の 時間
値 の 格納 先 の キー
格納 する 値
値 を 格納 し たり データ を 取得 し たり する サーバー を 表す キー
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
指定 し た サーバー に アイテム を 格納 する
サーバー に 格納 する キー / 値 の ペア の 配列
期限切 れ と なる まで の 時間
値 を 格納 し たり データ を 取得 し たり する サーバー を 表す キー
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
指定 し た サーバー で 複数 の アイテム を 格納 する
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
memcached の オプション の 値 を 設定 する
オプション の 連想 配列
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
memcached の オプション の 値 を 設定 する
認証 で 使う パスワード
認証 で 使う ユーザー 名
認証用 の 資格 情報 を 設定 する
期限切 れ と なる まで の 時間
値 の 格納 先 の キー
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
アイテム に 新しい 有効 期限 を 設定 する
指定 し なかっ たり false を 渡し たり し た 場合 は 、 書き込み 用 に 選ば れ た 接続 を 閉じ ます
接続 を 閉じる のに 成功 し た かどう か を 返し ます
接続 を 閉じる
セット 内 の ホスト に関する 情報 の 配列 を 返し ます
関連 づけ られ たすべて の ホスト の 状態 を 更新 する
この 接続 が 読み込み に 使っ て いる セカンダリ の アドレス を 返し ます
slaveokay の 読み込み に 使わ れ て いる アドレス を 返す
この インスタンス の slaveokay の 値 を 返し ます
この 接続 の slaveokay 設定 を 取得 する
可能 な 限り の 問い合わせ を レプリカセット の セカンダリメンバ に 送信 し たい とき に 、 この mongoclient インスタンス を 使い ます
この インスタンス の 、 変更 前 の slaveokay の 値 を 返し ます
この 接続 の slaveokay の 設定 を 変更 する
この 接続 が 読み込み に 使っ て いる セカンダリ の アドレス を 返し ます
slaveokay 読み込み 用 の 新しい セカンダリ を 選ぶ
バイナリデータ
データ 型
新しい バイナリデータオブジェクト を 返し ます
新しい バイナリデータオブジェクト を 作成 する
開い て いる 接続 に関する 配列 を 返し ます
開い て いる すべ て の 接続 の 情報 を 返す
カーソル の 情報 を 持つ 、 サーバー の ハッシュ
削除 し たい カーソル の id
カーソル の 削除 処理 を 実行 し た 場合 に true 、 引数 に 何か 問題 が あっ た 場合 server _hash が 間違っ て いる 場合 など に false を 返し ます
サーバー 上 の 指定 し た カーソル を 削除 する
二番目 の パイプライン 演算子
集約 コマンド の オプション
パイプライン 演算子 の 配列
最初 の パイプライン 演算子
それ 以降 の パイプライン 演算子
集約 の 結果 を 配列 で 返し ます
aggregation フレームワーク を 使っ て 集約 する
使う キー
オプション の クエリパラメータ
区別 できる 値 の 配列 を 返し ます
コレクション 内 で 、 指定 し た キー に 対応 する 区別 できる 値 の 一覧 を 取得 する
クエリ の 検索 条件
オプション で 、 返す フィールド を 絞り込め ます
更新 条件
適用 する オプション の 配列
元 の ドキュメント を 返し ます
ドキュメント を 更新 し て 返す
この インスタンス の slaveokay の 値 を 返し ます
この コレクション の slaveokay 設定 を 取得 する
追加 操作 について の オプション の 配列
配列 あるい は オブジェクト
&quot ;w &quot ; オプション が 設定 さ れ て いる 場合 は 、 追加 の 状況 を 含む 配列 を 返し ます
ドキュメント を コレクション に 追加 する
可能 な 限り の 問い合わせ を レプリカセット の セカンダリメンバ に 送信 し たい とき に 、 この mongo インスタンス を 使い ます
この インスタンス の 、 変更 前 の slaveokay の 値 を 返し ます
この コレクション の slaveokay の 設定 を 変更 する
追加 し たい 値
追加 し たい フィールド 名
この カーソル を 返し ます
トップレベル の キー / 値 の ペア を クエリ に 追加 する
バッチ で 返す 結果 の 数
この カーソル を 返し ます
ひとつ の バッチ で 返す 要素 数 を 制限 する
カーソル の limit を 送信 し 、 制限 に 達し た 場合 に count 関数 へ の 情報 の 送信 を スキップ し ます
この カーソル の クエリ が 返す ドキュメント の 数 を 返し ます
この クエリ の 結果 の 数 を 数える
現在 の 結果 を 連想 配列 で 返し ます
現在 の 要素 を 返す
クライアント にまだ 送 られ て い ない 結果 が 残っ て いる 場合 に true 、 そう で ない 場合 に false を 返し ます
まだ データベース から 送信 さ れ て い ない ドキュメント が ある かど う か を 調べる
返し たい あるい は 返し たく ない フィールド
この カーソル を 返し ます
クエリ の フィールド を 設定 する
カーソル を 不死 に する かどう か
この カーソル を 返し ます
この カーソル を タイムアウト さ せる かど う か を 設定 する
この カーソル の namespace 、 batch size 、 limit 、 skip 、 flags 、 query そして fields を 返し ます
カーソル の 作成 と 走査 に関する 情報 を 取得 する
カーソル が 追尾 可能 か どう か
この カーソル を 返し ます
この カーソル が 、 最後 の 結果 を 取得 し た 後 も オープン し た まま に し て おく かど う か を 設定 する
カーソル が レスポンス を 待つ ミリ 秒数
この カーソル を 返し ます
この クエリ の クライアント 側 の タイムアウト を 設定 する
この 日付 を 返し ます
この 日付 の 文字 列表 現 を 返す
パスワード プレーンテキスト
ユーザー 名
データベース から の 応答 を 返し ます
この データベース に ログイン する
送信 し たい クエリ
インデックス を 作る オプション の 配列 です
コマンド を 実行 する サーバー の 接続 ハッシュ を 設定 し ます
データベース の 応答 を 返し ます
データベースコマンド を 実行 する
データベース 接続
データベース 名
データベース を 返し ます
新しい データベース を 作成 する
コレクション の 名前
コレクション が 固定 サイズ か どう か
コレクション が 固定 サイズ の 場合 に 、 コレクション 内 に 格納 できる 要素 の 最大 数
capped が true の とき に これ を false に する と 、 _ id フィールド 上 で の 自動 的 な インデックス 作成 を 無効 化 でき ます
コレクション の オプション を 含む 配列
コレクション が 固定 サイズ の 場合 に その バイト 数 を 指定 し ます
新しい コレクション を あらわす コレクションオブジェクト を 返し ます
コレクション を 作成 する
データベース 参照 が 指す コレクション
配列 あるい は オブジェクト を 渡し た 場合 は 、 その _ id フィールド を 参照 id として 利用 し ます
データベース 参照 配列 を 返し ます
データベース 参照 を 作成 する
データベース から の 応答 を 返し ます
データベース の エラー を 作成 する
コレクション の 名前
コレクション を 返し ます
コレクション を 取得 する
コレクション の 一覧 を 取得 する 際 の オプション の 配列
コレクション の 名前 を 文字 列 の 配列 で 返し ます
この データベース の すべ て の コレクション 名 の 配列 を 取得 する
プロファイリングレベル を 返し ます
この データベース の プロファイリングレベル を 取得 する
この インスタンス の slaveokay の 値 を 返し ます
この データベース の slaveokay 設定 を 取得 する
エラー が あっ た 場合 は それ を 返し ます
直近 の データベース 操作 で エラー が 発生 し た かどう か を 調べる
コレクション の 一覧 を 取得 する 際 の オプション の 配列
mongocollection オブジェクト の 配列 を 返し ます
この データベース 内 の すべ て の コレクション の mongocollection オブジェクト の 配列 を 取得 する
修復 に 失敗 し た 場合 に 、 コピー し た ファイル を 保持 し ます
元 ファイル を バックアップ する かどう か
データベース の 応答 を 返し ます
この データベース を 修復 ・ 圧縮 する
データベース から の 応答 を 返し ます
データベース で 発生 し たすべて の エラー を クリア する
リンク する オブジェクト の _ id フィールド
コレクション の 名前 データベース 名 を 除く
データベース の 名前
参照 を 返し ます
新しい データベース 参照 を 作成 する
オプション の コレクション 名 プレフィックス
データベース
新しい ファイルコレクション を 作成 する
ファイル を 読み込む ため に 使う リソース を 返し ます
格納 さ れ た ファイル を 読む ため に 使う リソース を 返す
この id が 作ら れ た とき の エポック から の 経過 秒数 を 返し ます
この id が 作ら れ た とき の エポック から の 経過 秒数 を 取得 する
コールバック 関数 を 返し ます
以前 に 設定 さ れ た コールバック 関数 の 名前 を 取得 する
現在 記録 さ れ て いる ログレベル を 返し ます
現在 記録 さ れ て いる ログレベル を 取得 する
現在ログ を 記録 し て いる モジュール を 返し ます
現在ログ を 記録 し て いる モジュール を 取得 する
ログメッセージ
mongolog レベル 定数 のいずれ か
mongolog モジュール 定数 のいずれ か
イベント に 対応 し て 呼ば れる コールバック 関数
イベント に 対応 し て 呼ば れる コールバック 関数 を 設定 する
記録 し たい ログ の レベル
記録 する ログレベル を 設定 する
各 接続 プール に は 識別子 が あり 、 ホスト 名 から 始まり ます
すべて の 接続 プール に関する 情報 を 返す
正規 表現 / expr / flags 形式 の 文字列
新しい 正規 表現 を 返し ます
新しい 正規 表現 を 作成 する
正規 表現 を & quot ; / expr / flags &quot ; 形式 で 返し ます
この 正規 表現 の 文字 列表 現
すべて の 結果 ドキュメント を 配列 で 返し ます
結果 ドキュメント を 取得 する
増分
エポック 1 jan 1 9 7 0 0 0 : 0 0 : 0 0
新しい タイムスタンプ を 返し ます
新しい タイムスタンプ を 作成 する
この タイムスタンプ が 表す 、 エポック から の 経過 秒数 を 返し ます
この タイムスタンプ を 文字 列形 式 で 返す
調べ たい イタレータ
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
イテレータ が アタッチ さ れ て いる かど う か を 調べる
アタッチ さ れ て いる イテレータインスタンス の 数 を integer で 返し ます
アタッチ さ れ て いる イテレータインスタンス の 数 を 取得 する
アタッチ さ れ て いる 各 イテレータ の 現在 の 値 を 含む 配列 を 返し ます
登録 さ れ て いる イテレータインスタンス を 取得 する
デタッチ する イテレータ
イテレータ を デタッチ する
フラグ について の 情報 を integer で 返し ます
フラグ の 情報 を 取得 する
登録 さ れ て いる イテレータインスタンス を 取得 し ます の 配列 を 返し ます
登録 さ れ て いる イテレータインスタンス を 取得 する
アタッチ し て いる すべ て の イテレータインスタンス を 次 に 移動 さ せる
アタッチ し て いる すべ て の イテレータインスタンス を 巻き戻す
設定 する フラグ
フラグ を 設定 する
サブイテレータ の ひとつ ある い はすべて フラグ によって 異 なり ます が 有効 な 場合 に true 、 それ 以外 の 場合 に false を 返し ます
サブイテレータ の 有効 性 を 調べる
true に する と 、 ミューテックス を 呼び出し 元用 に ロック し て から ハンドル を 返し ます
新しく 作り 、 オプション で ロック し た ミューテックス の ハンドル を 返し ます
ミューテックス を 作る
mutex :: create を 呼ん で 取得 し た ミューテックス へ の ハンドル
成功 し た かどう か を 返し ます
ミューテックス を 破棄 する
mutex :: create を 呼ん で 取得 し た ハンドル
成功 し た かどう か を 返し ます
ミューテックス を 確保 する
mysqli _driver -& gt ;report _mode の エイリアス
使用 する イテレータ
渡さ れ た イテレータ に も とづく norewinditerator を 返し ます
norewinditerator を 作成 する
現在 の 値 を 返し ます
現在 の 値 を 取得 する
次 の 要素 に 移動 する
内部 イテレータ の 巻き戻し 操作 を 阻止 する
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
イテレータ の 有効 性 を 検証 する
この オプション の パラメータ で 、 oauth パラメータ を コンシューマ に 渡す 方法 を 定義 し ます
サービスプロバイダ が 提供 する consumer key
この オプション の パラメータ で 、 使用 する 署名 方式 を 定義 し ます
サービスプロバイダ が 提供 する consumer secret
新しい oauth オブジェクト を 作成 する
デストラクタ
true
デバッグ を 無効 に する
true
リダイレクト を 無効 に する
true
ssl チェック を 無効 に する
true
リダイレクト を 有効 に する
true
ssl チェック を 有効 に する
認証 セッションハンドル
1
利用 する http メソッド
アクセストークン api の url
成功 し た 場合 は oauth レスポンス を パース し た 配列 、 失敗 し た 場合 は false を 返し ます
アクセストークン を 取得 する
認証局 の 情報 を 含む 配列 を 返し ます
ca 情報 を 取得 する
最後 の レスポンス の ヘッダ を 文字列 で 返し ます
最後 の レスポンス の ヘッダ を 取得 する
直近 の リクエスト に対する レスポンス の 情報 を 含む 配列 を 返し ます
直近 の レスポンス の http 情報 を 取得 する
リクエスト の http メソッド
リクエスト の url
パラメータ 文字 列 あるい は 配列
生成 さ れ た リクエストヘッダ を 文字列 で 返し ます
oauth ヘッダ 文字 列 シグネチャ を 生成 する
oauth コールバック url
リクエストトークン api の url
利用 する http メソッド
成功 し た 場合 は oauth レスポンス を パース し た 配列 、 失敗 し た 場合 は false を 返し ます
リクエストトークン を 取得 する
oauth _nonce の 値
成功 し た 場合 に true を 返し ます
続く リクエスト 用 の ノンス を 設定 する
使い たい リクエストエンジン
setrequestengine
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
リクエスト に 固有 の ssl チェック を 調整 する
タイムスタンプ
true を 返し ます
タイムスタンプ を 設定 する
oauth トークン
oauth トークン secret
true
トークン と secret を 設定 する
oauth の バージョン
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
oauth の バージョン を 設定 する
必須 パラメータ
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
必須 パラメータ を 追加 する
consumernoncehandler コールバック を コール する
tokennoncehandler コールバック を コール する
http メソッド
オプション の uri 、 あるい は エンドポイント
oauth リクエスト を チェック する
これら の オプションパラメータ を 設定 できる の は cli sapi のみ です
oauthprovider オブジェクト を 返し ます
新しい oauthprovider オブジェクト を 作る
callable 関数 名
consumerhandler コールバック を 設定 する
is 2leggedendpoint
削除 し たい 必須 パラメータ
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
必須 パラメータ を 削除 する
パラメータ の 値
パラメータ の キー
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
パラメータ を 設定 する
コレクション に 追加 する 値 を 指定 し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
コレクション に 要素 を 追加 する
oci -collection の インスタンス を 指定 し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
コレクション に 他 の 存在 する コレクション から 値 を 割り 当てる
コレクション 内 の 要素 の 最大 数 、 あるい は エラー 時 に false を 返し ます
コレクション 内 の 要素 の 最大 数 を 取得 する
コレクション 内 の 要素 の 数 、 もしく は エラー 時 に false を 返し ます
コレクション の サイズ を 返す
コピー する lob
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ラージオブジェクト の データ を 他 の ラージオブジェクト に 追加 する
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
lob ディスクリプタ を 閉じる
消去 さ れ た 実際 の 文字 数 あるい は バイト 数 、 失敗 し た 場合 に false を 返し ます
内部 lob データ の 特定 の 位置 を 消去 する
出力 する データ の 長さ
ファイル へ の パス
出力 を 開始 する 位置
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
lob の 内容 を ファイル に 出力 する
デフォルト で は リソース は 解放 さ れませ ん が 、 フラグ oci _lob _buffer _free を 使用 する こと で 明示 的 に 行う こと が でき ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
lob の バッファ を サーバー に フラッシュ する 、 あるい は 書き込む
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
lob ディスクリプタ に 関連 付け られ たり ソース を 解放 する
ファイル へ の パス
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ファイルデータ を lob に インポート する
読み込む バイト 数
読み込ん だ 内容 を 表す 文字 列 、 失敗 し た 場合 に false を 返し ます
ラージオブジェクト の 一部 を 読み込む
保存 する データ
ラージオブジェクト の 先頭 から の オフセット を 指定 する ため に 利用 し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
データ を ラージオブジェクト に 保存 する
内部 ポインタ を whence で 示さ れ た 位置 から 移動 さ せる バイト 数 を 表し ます
以下 のい ずれ か です
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ラージオブジェクト の 内部 ポインタ を セット する
true は 有効 、 false は 無効 を 表し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
現在 の ラージオブジェクト 用 の バッファリング 状態 を 変更 する
ラージオブジェクト の サイズ を 返し ます
ラージオブジェクト の サイズ を 返す
lob の 内部 ポインタ の 現在 位置 を 返し ます
ラージオブジェクト の 内部 ポインタ の 現在 位置 を 返す
指定 し た 場合 は 、 この メソッド は ラージオブジェクト を length バイト に 切り つめ ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ラージオブジェクト を 切り つめる
lob に 書き込む データ
この パラメータ を 指定 する と 、 length バイト 書き込む か data の 終端 に 達 する か 、 いずれ か 早い 方 の 後 に 書き込み が 停止 し ます
書き込ん だ バイト 数 、 失敗 し た 場合 に false を 返し ます
データ を ラージオブジェクト に 書き込む
現在 の エントリ の 内部 イテレータ を 返し ます
現在 の エントリ の 内部 イテレータ を 返す
受け入れ 可能 な 場合 に true 、 それ 以外 の 場合 に false を 返し ます
受け入れ 可能 か どう か を 調べる
作成 する 元 と なる イテレータ
parentiterator を 返し ます
parentiterator を 作成 する
オブジェクト を 返し ます
parentiterator に 含まれる 内部 イテレータ の 子 を 返す
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
内部 イテレータ の 現在 の 要素 が 子 を 持つ かど う か を チェック する
イテレータ を 前 に 移動 する
イテレータ を 巻き戻す
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
トランザクション を コミット する
スキーマ を 知り たい カラム
知り たい スキーマ の 型
スキーマ を 知り たい テーブル
処理 に 成功 する と 、 スキーマ 情報 を 含む 配列 を 返し ます
指定 し た スキーマ 情報 を 取得 する
トランザクション が 現在 アクティブ な 場合 に true 、 そう で ない とき に false を 返し ます
トランザクション 内 か どう か を 調べる
id が 返さ れる べき シーケンスオブジェクト 名 を 指定 し ます
もし name パラメータ に シーケンス 名 が 指定 さ れ なかっ た 場合 、 pdo :: lastinsertid は データベース に 挿入 さ れ た 最後 の 行 の 行id に 相当 する 文字 列 を 返し ます
最後 に 挿入 さ れ た 行 の id あるい は シーケンス の 値 を 返す
新しく 作成 さ れ た ラージオブジェクト の oid 、 あるい は 失敗 し た 場合 に false を 返し ます
新しい ラージオブジェクト を 作成 する
ラージオブジェクト の id
モード が r の 場合 、 読み込み 用 の ストリーム を オープン し ます
成功 し た 場合 に ストリームリソース 、 失敗 し た 場合 に false を 返し ます
既存 の ラージオブジェクト の ストリーム を オープン する
ラージオブジェクト の id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ラージオブジェクト を 削除 する
この 配列 は 、 この メソッド によって 返さ れる pdostatement オブジェクト に対し て 1 もしく は それ 以上 の key =& gt ;value の 組 を 含み ます
これ は 対象 の データベースサーバー に対し て 有効 な sql 文 の テンプレート で なけれ ば なり ませ ん
もし データベースサーバー が 正常 に 文 を 準備 する 場合 、 pdo :: prepare は pdostatement オブジェクト を 返し ます
文 を 実行 する 準備 を 行い 、 文オブジェクト を 返す
クオート さ れる 文字 列 を 指定 し ます
クオート する スタイル を 変更 する ため 、 ドライバ に データ 型 の ヒント を 提供 し ます
理論 上安 全 な クオート さ れ た sql ステートメント の 文字列 を 返し ます
クエリ 用 の 文字列 を クオート する
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
トランザクション を ロールバック する
ドライバ の オプションパラメータ
領域 を 事前 に 確保 する ため の ヒント
カラム が バインド さ れる php 変数 名 を 指定 し ます
結果 セット 中 の カラム 番号 1 から 始まる を 指定 し ます
パラメータ の データ 型 を pdo :: param _* 定数 で 指定 し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
カラム を php 変数 に バインド する
pdostatement オブジェクト に 相当 する 結果 セット に ある カラム 数 を 返し ます
結果 セット 中 の カラム 数 を 返す
実行 さ れる sql 文 の 中 の バインドパラメータ と 同数 の 要素 から なる 、 値 の 配列
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
プリペアドステートメント を 実行 する
スクロール 可能 な カーソル を 表す pdostatement オブジェクト の 場合 、 この 値 により 呼び出し 側 に 返さ れる 行 を 定義 し ます
次 の レコード を 呼び出し元 に 返す 方法 を 制御 し ます
スクロール 可能 な カーソル を 表す pdostatement オブジェクト の 場合 で 、 cursor _orientation パラメータ が pdo :: fetch _ori _abs に 設定 さ れ た 場合 、 この 値 により 取得 さ れる 結果 セット の 行 の 絶対 位置 が 指定 さ れ ます
この 関数 が 成功 し た 場合 の 返り値 は 、 取得 形式 によって 異 なり ます
結果 セット から 次 の 行 を 取得 する
行 から 処理 し たい 0 で 始まる カラム 番号 を 指定 し ます
pdostatement :: fetchcolumn は 結果 セット の 次行 から 単 一 カラム を 返し ます
結果 セット の 次行 から 単 一 カラム を 返す
属性 の 値 を 返し ます
文 の 属性 を 取得 する
行 の 数 を 返し ます
直近 の sql ステートメント によっ て 作用 し た 行数 を 返す
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
文 の 属性 を 設定 する
api の バージョン を 、 & quot ; 1
api の バージョン を 返す
phar :: gz あるい は phar :: bz2 のいずれか を 指定 し 、 指定 し た 圧縮 アルゴリズム で の 圧縮 が 可能 か どう か を 調べ ます
圧縮 / 展開 が 可能 な 場合 に true 、 そう で ない 場合 に false を 返し ます
phar 拡張 モジュール が zlib あるい は bzip 2 による 圧縮 を サポート し て いる かど う か を 返す
この パラメータ は 、 変換 後 の アーカイブ の デフォルト の ファイル 拡張子 を 変更 し ます
これ は phar :: tar あるい は phar :: zip のいずれ かと なり ます
アーカイブ 全体 の 圧縮 を 行わ ない 場合 は phar :: none 、 zlib による 圧縮 の 場合 は phar :: gz 、 そして bzip による 圧縮 の 場合 は phar :: bz2 のいずれか を 指定 し ます
この メソッド は 、 成功 し た 場合 に phardata オブジェクト を 返し ます
phar アーカイブ を 実行 可能 で ない tar あるい は zip ファイル に 変換 する
phar アーカイブ の メタデータ として 保存 さ れ て いる 、 シリアライズ 可能 な 任意 の php 変数 を 返し ます
phar アーカイブ の メタデータ を 返す
md 5 、 sha - 1 、 sha - 2 5 6 、 sha - 5 1 2 あるい は openssl を 含む 配列 を 返し ます
サポート する シグネチャ 型 の 配列 を 返す
メタデータ が 設定 さ れ て いる 場合 に true 、 さ れ て い ない 場合 に false を 返し ます
ファイル が グローバル な メタデータ を 持つ かど う か を 返す
fopen 、 file _get _contents 、 opendir など の stat 関連 の 関数 を すべ て phar に 横取り させる
まだ 作成 さ れ て い ない phar アーカイブ の 名前 あるい は フルパス
この パラメータ は 、 指定 し た 名前 の ファイル を phar の 実行 可能 アーカイブ として 扱う か データ のみ の 非実 行可 能 アーカイブ として 扱う か を 指定 し ます
正しい 形式 の ファイル で ある 場合 に true 、 そう で ない 場合 に false を 返し ます
指定 し た ファイル 名 が 正しい 形式 の phar ファイル か どう か を 返す
phar アーカイブ が 変更 可能 な 場合 に true を 返し ます
phar アーカイブ が 変更 可能 な 場合 に true を 返す
オープン する phar アーカイブ へ の 完全 パス あるい は 相対 パス
この phar アーカイブ を さす 際 に 使用 する エイリアス
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
任意 の phar アーカイブ を 、 エイリアス を 指定 し て 読み込む
request _uri 、 php _self 、 script _name および script _filename を 含む 配列
最大 4 つまで の $ _ server 変数 を 実行 時 に 変更 さ せる
phar 内 で 探す ファイル 名 相対パス
ファイル が phar 内 に 存在 する 場合 に true 、 しない 場合 に false を 返し ます
ファイル が phar 内 に 存在 する かど う か を 調べる
phar 内 で 探す ファイル 名 相対パス
pharfileinfo オブジェクト を 返し ます
指定 し た ファイル の pharfileinfo オブジェクト を 取得 する
false の 場合 は phar アーカイブ の ディスク 上 で の フルパス を 返し ます
ファイル 名 が 正しい 形式 の 場合 に ファイル 名 、 それ 以外 の 場合 に 空文 字列 を 返し ます
現在 実行 中 の phar アーカイブ の フルパス あるい は 完全 な phar url を 返す
phar アーカイブ へ の 書き込み リクエスト の バッファリング を 終了 し 、 変更 内容 を ディスク に 書き込む
ディスク 上 の phar アーカイブ へ の パス
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
phar アーカイブ を ディスク と メモリ から 完全 に 削除 する
書き換え 関数 は 、 唯一 の パラメータ として 文字 列 を 受け取り 、 string あるい は false を 返さ ない といけ ませ ん
ファイル が 見つ から ない とき に 実行 する スクリプト の 場所
ファイル の 拡張子 と mime タイプ を 関連 付け た 配列
phar の 中 で ディレクトリインデックス と なる ファイル の 場所
phar : / / url でこの アーカイブ を 指す際に 、 フルパス の 代わり に 使用 する エイリアス
ウェブベース の phar で 使用 する フロントコントローラ
phar アーカイブ 内 に 作成 する 空 の ディレクトリ の 名前
返り値 は あり ませ ん
空 の ディレクトリ を tar / zip アーカイブ に 追加 する
phar アーカイブ に 追加 し たい ディスク 上 の ファイル へ の フルパス あるい は 相対 パス
ファイル を アーカイブ 内 に 格納 する とき の パス
ファイルシステム 上 の ファイル を phar アーカイブ に 追加 する
phar ファイル と 実際 の 場所 の 関連 を 返す イテレータ 、 あるい は splfileinfo オブジェクト を 返す イテレータ
splfileinfo オブジェクト を 返す イテレータ を 指定 し た 際 、 tar / zip アーカイブ へ の 追加 時 に フルパス から 取り除く 部分
phardata :: buildfromiterator は 連想 配列 を 返し ます
イテレータ から tar あるい は zip アーカイブ を 作成 する
圧縮 を 行う 場合 は phar :: gz あるい は phar :: bz2 、 圧縮 を 解除 する ため に は phar :: none のいずれか を 指定 し なけれ ば なり ませ ん
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
現在 の tar / zip アーカイブ 内 の すべ て の ファイル を 圧縮 する
この パラメータ は 、 変換 後 の アーカイブ の デフォルト の ファイル 拡張子 を 変更 し ます
これ は phar :: tar あるい は phar :: zip のいずれ かと なり ます
アーカイブ 全体 の 圧縮 を 行わ ない 場合 は phar :: none 、 zlib による 圧縮 の 場合 は phar :: gz 、 そして bzip による 圧縮 の 場合 は phar :: bz2 のいずれか を 指定 し ます
この メソッド は 、 成功 し た 場合 に phardata オブジェクト を 返し ます
phar アーカイブ を 実行 可能 で ない tar あるい は zip ファイル に 変換 する
成功 し た 場合 に true を 返し ます
phar アーカイブ 内 の ファイル を 、 phar 内 で 別 の 新しい ファイル として コピー する
削除 し たい ファイル の 、 アーカイブ 内 で の パス
成功 し た 場合 に true を 返し ます
tar / zip アーカイブ 内 の ファイル を 削除 する
指定 し た files の 展開 先 の パス
true に する と 既存 の ファイル を 上書き し ます
展開 し たい ファイル 名 / ディレクトリ 名 、 あるい は その 配列
成功 し た 場合 に true を 返し ます
tar / zip アーカイブ の 内容 を ディレクトリ に 展開 する
tar / zip アーカイブ が 変更 可能 な 場合 に true を 返し ます
tar / zip アーカイブ が 変更 可能 な 場合 に true を 返す
ファイル の 内容
tar あるい は zip アーカイブ 内 で 変更 する ファイル 名 相対パス
tar / zip の 内部 の ファイル に 、 外部 ファイル あるい は 文字列 の 内容 を 設定 する
tar / zip アーカイブ 内 で 変更 する ファイル 名 相対パス
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ファイル を tar / zip アーカイブ から 削除 する
この アーカイブ を 指す とき に 使用 する 短い 文字列
ダミー 関数 phar :: setalias は phardata で は 使用 不能
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
現在 の phar エントリ を zlib あるい は bzip 2 のいずれか で 圧縮 する
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
phar 内 の 現在 の phar エントリ の 圧縮 を 解除 する
成功 し た 場合 に true を 返し ます
エントリ の メタデータ を 削除 する
ディスク 上 の phar アーカイブ 内 の ファイル の バイト 数 を 返し ます
phar アーカイブ 内 で の 実際 の ファイル の 大きさ 圧縮 さ れ た 状態 を 返す
phar アーカイブ 内 の ファイル の crc 3 2 チェックサム を 返し ます
crc 3 2 コード を 返す か 、 crc が チェック でき ない 場合 に 例外 を スロー する
ファイル の メタデータ として 保存 さ れ て いる 、 シリアライズ 可能 な 任意 の php 変数 を 返し ます
ファイル ととも に 保存 さ れ て いる 、 ファイル 固有 の メタデータ を 返す
phar フラグ を 返し ます 現在 の 実装 で は 、 常 に 0 と なり ます
phar ファイルエントリ の フラグ を 返す
メタデータ が 設定 さ れ て い ない か あるい は null が 設定 さ れ て いる 場合 に false 、 null 以外 の メタデータ が 設定 さ れ て いる 場合 に true を 返し ます
エントリ の メタデータ を 返す
phar :: gz あるい は phar :: bz2 のいずれ か
phar アーカイブ 内 の ファイル が 圧縮 さ れ て いる 場合 に true 、 そう で ない 場合 に false を 返し ます
エントリ が 圧縮 さ れ て いる かど う か を 調べる
その ファイル の crc が 検証 さ れ て いる 場合 に true 、 そう で ない 場合 に false を 返し ます
ファイルエントリ の crc が 検証 さ れ て いる かど う か を 調べる
ファイル ととも に 保存 する 情報 を 含む 、 php の 変数
ファイル ととも に 保存 する 、 ファイル 固有 の メタデータ を 設定 する
この メソッド を 実装 は 、 成功 し た 場合 に true そして 失敗 し た 場合 に false を 返す 必要 が あり ます
フィルタ を 作成 する とき に コール さ れる
追加 する エントリ の 値 オプション
追加 する エントリ の キー
エントリ が 追加 さ れ た 場合 に true 、 追加 さ れ なかっ た 場合 に false を 返し ます
新 たな エントリ を ハッシュ に 追加 する
バケツリスト の 数
次 の オプション が 使え ます
新しい quickhashinthash オブジェクト を 返し ます
新しい quickhashinthash オブジェクト を 作る
削除 する エントリ の キー
エントリ が 削除 さ れ た とき に true 、 削除 さ れ なかっ た とき に false を 返し ます
エントリ を ハッシュ から 削除 する
ハッシュ 内 に 存在 する かど う か を 調べ たい キー
エントリ が 存在 する 場合 に true 、 存在 し ない 場合 に false を 返し ます
キー が ハッシュ に 存在 する かど う か を 調べる
クラス の コンストラクタ が 受け 取る の と 同じ オプション
ハッシュ を 読み込む ファイル の ファイル 名
新しい quickhashinthash を 返し ます
ファイル から ハッシュ を 作る ファクトリーメソッド
ハッシュ を シリアライズ し た 文字列
クラス の コンストラクタ が 受け 取る の と 同じ オプション
新しい quickhashinthash を 返し ます
文字列 から ハッシュ を 作る ファクトリーメソッド
ハッシュ の 保存 先 の ファイル 名
メモリ 上 の ハッシュ を ディスク に 保存 する
更新 する エントリ の キー
新しい 値
エントリ が 見つかっ て 更新 でき た とき に true 、 エントリ が 見つ から なかっ た とき に false を 返し ます
ハッシュ の エントリ を 新しい 値 で 更新 する
セット 内 に 存在 する かど う か を 調べ たい キー
エントリ が 存在 する 場合 に true 、 存在 し ない 場合 に false を 返し ます
キー が セット に 存在 する かど う か を 調べる
セット の 要素 数 を 返し ます
セット の 要素 数 を 返す
クラス の コンストラクタ が 受け 取る の と 同じ オプション
バケツリスト の 数
セット を 読み込む ファイル の ファイル 名
新しい quickhashintset を 返し ます
ファイル から セット を 作る ファクトリーメソッド
セット を シリアライズ し た 文字列
クラス の コンストラクタ が 受け 取る の と 同じ オプション
バケツリスト の 数
新しい quickhashintset を 返し ます
文字列 から セット を 作る ファクトリーメソッド
セット の 保存 先 の ファイル 名
メモリ 上 の セット を ディスク に 保存 する
この メソッド は 、 セット を シリアライズ し た 文字列 を 返し ます
シリアライズ し た セット を 返す
追加 する エントリ の 値
追加 する エントリ の キー
エントリ が 追加 さ れ た 場合 に true 、 追加 さ れ なかっ た 場合 に false を 返し ます
新 たな エントリ を ハッシュ に 追加 する
ハッシュ 内 に 存在 する かど う か を 調べ たい キー
エントリ が 存在 する 場合 に true 、 存在 し ない 場合 に false を 返し ます
キー が ハッシュ に 存在 する かど う か を 調べる
エントリ の キー
キー が 存在 する 場合 は その 値 、 キー が 存在 し ない 場合 は null を 返し ます
キー を 指定 し て ハッシュ から 値 を 取得 する
ハッシュ の 要素 数 を 返し ます
ハッシュ の 要素 数 を 返す
ハッシュ を シリアライズ し た 文字列
クラス の コンストラクタ が 受け 取る の と 同じ オプション
バケツリスト の 数
新しい quickhashintstringhash を 返し ます
文字列 から ハッシュ を 作る ファクトリーメソッド
エントリ に 新しく 設定 する 値
追加 あるい は 更新 する エントリ の キー
エントリ が 見つかっ て 更新 でき た とき に 2 、 エントリ を 新しく 追加 し た とき に 1 、 エラー が 発生 し た とき に 0 を 返し ます
ハッシュ 内 の エントリ の 値 を 更新 エントリ が 存在 し ない 場合 は 新しく 追加 する
更新 する エントリ の キー
新しい 値
エントリ が 見つかっ て 更新 でき た とき に true 、 エントリ が 見つ から なかっ た とき に false を 返し ます
ハッシュ の エントリ を 新しい 値 で 更新 する
バケツリスト の 数
次 の オプション が 使え ます
新しい quickhashstringinthash オブジェクト を 返し ます
新しい quickhashstringinthash オブジェクト を 作る
ハッシュ 内 に 存在 する かど う か を 調べ たい キー
エントリ が 存在 する 場合 に true 、 存在 し ない 場合 に false を 返し ます
キー が ハッシュ に 存在 する かど う か を 調べる
エントリ の キー
キー が 存在 する 場合 は その 値 、 キー が 存在 し ない 場合 は null を 返し ます
キー を 指定 し て ハッシュ から 値 を 取得 する
クラス の コンストラクタ が 受け 取る の と 同じ オプション
バケツリスト の 数
ハッシュ を 読み込む ファイル の ファイル 名
新しい quickhashstringinthash を 返し ます
ファイル から ハッシュ を 作る ファクトリーメソッド
ハッシュ を シリアライズ し た 文字列
クラス の コンストラクタ が 受け 取る の と 同じ オプション
バケツリスト の 数
新しい quickhashstringinthash を 返し ます
文字列 から ハッシュ を 作る ファクトリーメソッド
ハッシュ の 保存 先 の ファイル 名
メモリ 上 の ハッシュ を ディスク に 保存 する
この メソッド は 、 ハッシュ を シリアライズ し た 文字列 を 返し ます
シリアライズ し た ハッシュ を 返す
エントリ に 新しく 設定 する 値
追加 あるい は 更新 する エントリ の キー
エントリ が 見つかっ て 更新 でき た とき に 2 、 エントリ を 新しく 追加 し た とき に 1 、 エラー が 発生 し た とき に 0 を 返し ます
ハッシュ 内 の エントリ の 値 を 更新 エントリ が 存在 し ない 場合 は 新しく 追加 する
この rararchive オブジェクト の テキスト 表現 を 返し ます
テキスト 形式 で 取得 する
true に する と 、 ntfs の acl や unix の オーナー 情報 といっ た 拡張 情報 が アーカイブ に 設定 さ れ て いれ ば 、 取り出し た ファイル に も それ を 設定 し ます
取り出す ファイル の ディレクトリ と ファイル 名 を 含む パス 相対パス あるい は 絶対 パス
ファイル を 展開 する ディレクトリ へ の パス
この エントリ の 暗号 化 に 使う パスワード
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
アーカイブ の エントリ を 展開 する
属性 、 あるい は エラー 時 に false を 返し ます
エントリ の 属性 を 取得 する
エントリ の 最終 更新 時刻 を yyyy -mm -dd hh :ii :ss 形式 で 表し た 文字列 、 あるい は エラー 時 に false を 返し ます
エントリ の 最終 更新 時刻 を 取得 する
ホスト os の コード 、 あるい は エラー 時 に false を 返し ます
エントリ の ホスト os を 取得 する
メソッド 番号 、 あるい は エラー 時 に false を 返し ます
エントリ の 圧縮 方法 を 取得 する
エントリ 名 を 表す 文字 列 、 あるい は エラー 時 に false を 返し ます
エントリ の 名前 を 取得 する
圧縮後 の サイズ 、 あるい は エラー 時 に false を 返し ます
圧縮後 の エントリ の サイズ を 取得 する
この エントリ の 暗号 化 に 使う パスワード
ファイルハンドラ を 返し ます
この エントリ の ファイルハンドラ を 取得 する
展開後 の サイズ 、 あるい は エラー 時 に false を 返し ます
展開後 の エントリ の サイズ を 取得 する
バージョン 、 あるい は エラー 時 に false を 返し ます
この エントリ を 展開 する のに 必要 な rar プログラム の 最低 バージョン を 取得 する
エントリ が ディレクトリ で ある 場合 に true 、 それ 以外 の 場合 に false を 返し ます
この エントリ が ディレクトリ で ある かど う か を 調べる
エントリ が 暗号 化 さ れ て いる 場合 に true 、 それ 以外 の 場合 に false を 返し ます
この エントリ が 暗号 化 さ れ て いる かど う か を 調べる
現在 の エントリ が 配列 あるい は オブジェクト で ある 場合 に 、 その イテレータ を 返し ます
現在 の エントリ が 配列 あるい は オブジェクト で ある 場合 に 、 その イテレータ を 返す
現在 の エントリ が 配列 あるい は オブジェクト で ある 場合 に true 、 それ 以外 の 場合 に false を 返し ます
現在 の エントリ が 配列 あるい は オブジェクト で ある かど う か を 返す
子 を 含む recursivecallbackfilteriterator を 返し ます
recursivecallbackfilteriterator に 含まれる 内部 イテレータ の 子 を 返す
反復 処理 の 対象 と なる ディレクトリ の パス
フラグ を 指定 し て 、 いくつか の メソッド の 振る 舞い を 変更 する こと が でき ます
新しく 作成 し た recursivedirectoryiterator を 返し ます
recursivedirectoryiterator を 作成 する
サブパス サブディレクトリ を 返し ます
サブパス を 取得 する
サブパス サブディレクトリ と ファイル 名 を 返し ます
サブパス と 名前 を 取得 する
フィルタリング する recursiveiterator
recursiveiterator から recursivefilteriterator を 作成 する
内部 イテレータ が 子 を 持つ 場合 に true 、 それ 以外 の 場合 に false を 返し ます
内部 イテレータ の 現在 の 要素 が 子 を 持つ かど う か を 調べる
現在 の エントリ の イテレータ を 返し ます
現在 の エントリ の イテレータ を 返す
子 を 開始 する
反復 処理 を 開始 する
要素 に 子 が ある 場合 に true 、 それ 以外 の 場合 に false を 返し ます
子 を 持つ かど う か を 調べる
子 を 終了 する
許可 さ れる 最大 の 深さ 、 あるい は 無制 限 の 場合 に false を 返し ます
最大 の 深さ を 取得 する
次 の 要素
許可 さ れる 最大 の 深さ
最大 の 深さ を 設定 する
現在 の エントリ の イテレータ が 取得 可能 な 場合 に true 、 それ 以外 の 場合 に false を 返し ます
現在 の エントリ の イテレータ が 取得 可能 か どう か を 返す
子 を 開始 する
recursiveiterator を 返し ます
子 を 取得 する
子 が ある 場合 に true 、 それ 以外 の 場合 に false を 返し ます
子 を 持っ て いる かど う か を 調べる
フラグ を 指定 し て 一部 の メソッド の 振る 舞い を 変更 する こと が でき ます
recursiveiterator あるい は iteratoraggregate
内部 的 に 使う recursiveiteratoriterator の 振る 舞い を 変更 する フラグ
内部 的 に 使う recursivecachingiterator の 振る 舞い を 変更 する フラグ
recursivetreeiterator を 作成 する
接頭辞 と 接尾 辞 を つけ た 現在 の 要素 を 返し ます
現在 の 要素 を 取得 する
子 を 終了 する
反復 処理 を 終了 する
現在 の 要素 から 作っ た ツリー を 返し ます
現在 の エントリ を 取得 する
接尾辞 を 取得 する
現在 の 要素 の 前 に 置く 文字 列 を 返し ます
接頭辞 を 取得 する
接頭辞 と 接尾 辞 を つけ た 現在 の キー を 返し ます
現在 の 要素 の キー を 取得 する
次 の 要素 に 移動 する
次 の 要素
イテレータ を 巻き戻す
取得 し たい 修飾子
修飾子 の 名前 の 配列 を 返し ます
修飾子 の 名前 を 取得 する
true に 設定 する と 、 エクスポート を 発行 する の で は なく 返し ます
エクスポート する リフレクション
return パラメータ を true に 設定 する と 、 エクスポート を 文字列 で 返し ます
クラス を エクスポート する
定数 の 名前
定数 の 値 を 返し ます
定義 さ れ て いる 定数 を 取得 する
定数 の 配列 を 返し ます
定数 を 取得 する
デフォルトプロパティ の 配列 を 返し ます
デフォルトプロパティ を 取得 する
ドキュメントコメント が 存在 すれ ば それ を 返し ます
ドキュメントコメント を 取得 する
クラス を 定義 する 拡張 モジュール を 表す reflectionextension オブジェクト を 返し ます
クラス を 定義 する 拡張 モジュール を 表す reflectionextension オブジェクト を 取得 する
クラス が 定義 さ れ て いる ファイル の ファイル 名 を 返し ます
クラス が 定義 さ れ て いる ファイル の ファイル 名 を 取得 する
インターフェイス 名 の 配列 を 返し ます
インターフェイス の 名前 を 取得 する
調べ たい メソッド の 名前
reflectionmethod を 返し ます
クラスメソッド の reflectionmethod を 取得 する
結果 を フィルタ し て 、 特定 の 属性 を 持つ メソッド だけ を 含める よう に し ます
各 メソッド を 表す reflectionmethod オブジェクト の 配列 を 返し ます
メソッド の 配列 を 取得 する
修飾子 定数 の ビットマスク を 返し ます
修飾子 を 取得 する
クラス の 名前 を 返し ます
クラス の 名前 を 取得 する
開始行 を 返し ます
開始行 を 取得 する
調べ たい プロパティ の 名前
プロパティ が 定義 さ れ て いる 場合 に true 、 それ 以外 の 場合 に false を 返し ます
プロパティ が 定義 さ れ て いる かど う か を 調べる
インターフェイス の 名前
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
インターフェイス の 実装 を 調べる
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
名前 空間 内 に ある かど う か を 調べる
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
抽象 クラス で ある かど う か を 調べる
この クラス が クローン 可能 で ある 場合 に true 、 そう で ない 場合 に false を 返し ます
この クラス が クローン 可能 か どう か を 返す
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
final クラス で ある かど う か を 調べる
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
この クラス が インターフェイス で ある かど う か を 調べる
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
反復 処理 が 可能 で ある かど う か を 調べる
可変長 の 引数 を 受け付け 、 それ を call _user _func と 同じ 方式 で クラス の コンストラクタ に 渡し ます
指定 し た 引数 で クラス の 新しい インスタンス を 作成 する
この reflectionclass インスタンス の 文字 列表 現 を 返し ます
reflectionclass オブジェクト の 文字 列表 現 を 返す
クローン する
拡張 モジュール の 名前
reflectionextension オブジェクト を 返し ます
reflectionextension を 作成 する
拡張 モジュール で 定義 さ れ て いる クラス 名 の 配列 を 返し ます
クラス 名 を 取得 する
定数 名 を キー と する 連想 配列 を 返し ます
定数 を 取得 する
依存 する 拡張 モジュール を キー 、 そして required 、 optional あるい は conflicts のいずれか を 値と する 連想 配列 を 返し ます
依存性 を 取得 する
reflectionfunction オブジェクト の 連想 配列 を 返し ます
拡張 モジュール の 関数 を 取得 する
ini エントリ を キー 、 定義 さ れ て いる 値 を キー に 対応 する 値 と し た 連想 配列 を 返し ます
拡張 モジュール の ini エントリ を 取得 する
拡張 モジュール の バージョン を 返し ます
拡張 モジュール の バージョン を 取得 する
拡張 モジュール の 情報 を 表示 する
エクスポート し た 拡張 モジュール を 文字列 で 返し ます
文字列 に 変換 する
渡す 引数 の リスト
起動 し た 関数 の 結果 を 返し ます
関数 を 起動 する
無効 に なっ て いる 場合 に true 、 それ 以外 の 場合 に false を 返し ます
関数 が 無効 に なっ て いる かど う か を 調べる
その 関数 について 、 reflectionfunction :: export のよう な 出力 を 返し ます
文字列 に 変換 する
関数 の クローン を 作成 する
ドキュメントコメント が 存在 する 場合 は それ を 返し ます
ドキュメントコメント を 取得 する
ユーザー 定義 関数 の 終了 行番 号 を 返し ます
終了 行番 号 を 取得 する
拡張 モジュール の 情報 を reflectionextension オブジェクト で 返し ます
拡張 モジュール の 情報 を 取得 する
拡張 モジュール の 名前 を 返し ます
拡張 モジュール の 名前 を 取得 する
ファイル 名 を 返し ます
ファイル 名 を 取得 する
関数 の 名前 を 返し ます
関数 名 を 取得 する
名前 空間 名 を 返し ます
名前 空間 名 を 取得 する
パラメータ の 数 を 返し ます
パラメータ 数 を 取得 する
必須 パラメータ の 数 を 返し ます
必須 パラメータ の 数 を 取得 する
パラメータ を reflectionparameter オブジェクト の 配列 で 返し ます
パラメータ を 取得 する
開始 行番 号 を 返し ます
開始 行番 号 を 取得 する
静的 変数 の 配列 を 返し ます
静的 変数 を 取得 する
名前 空間 内 に ある 場合 に true 、 それ 以外 の 場合 に false を 返し ます
関数 が 名前 空間 内 に ある かど う か を 調べる
非 推奨 で ある 場合 に true 、 それ 以外 の 場合 に false を 返し ます
非 推奨 で ある かど う か を 調べる
内部 関数 で ある 場合 に true 、 それ 以外 の 場合 に false を 返し ます
内部 関数 か どう か を 調べる
ユーザー 定義 関数 で ある 場合 に true 、 それ 以外 の 場合 に false を 返し ます
ユーザー 定義 関数 で ある かど う か を 調べる
文字列 に 変換 する
その メソッド が 属 する クラス を あらわす reflectionclass オブジェクト を 返し ます
メソッド が 宣言 さ れ て いる クラス を 取得 する
メソッド の プロトタイプ の reflectionmethod オブジェクト を 返し ます
メソッド の プロトタイプ を 存在 すれ ば 取得 する
メソッド を 実行 する オブジェクト
メソッド に 渡す パラメータ
メソッド の 結果 を 返し ます
実行 する
抽象 メソッド で ある 場合 に true 、 それ 以外 の 場合 に false を 返し ます
抽象 メソッド で ある かど う か を 調べる
デストラクタ で ある 場合 に true 、 それ 以外 の 場合 に false を 返し ます
デストラクタ で ある かど う か を 調べる
final メソッド で ある 場合 に true 、 それ 以外 の 場合 に false を 返し ます
final メソッド で ある かど う か を 調べる
true を 指定 する と 、 アクセス できる よう に なり ます
メソッド の アクセス 範囲 を 設定 する
reflectionmethod の インスタンス の 文字 列表 現 を 返し ます
reflectionmethod オブジェクト の 文字 列表 現 を 返す
true に 設定 する と 、 エクスポート を 発行 する の で は なく 返し ます
エクスポート する リフレクション
return パラメータ を true に 設定 する と 、 エクスポート を 文字列 で 返し ます
エクスポート する
null を 許可 する 場合 に true 、 それ 以外 の 場合 に false を 返し ます
null を 許可 する かど う か を 調べる
reflectionclass オブジェクト を 返し ます
宣言 し て いる クラス を 取得 する
パラメータ の デフォルト 対 を 返し ます
パラメータ の デフォルト 値 を 取得 する
パラメータ 名 を 返し ます
パラメータ 名 を 取得 する
配列 を 受け 取る パラメータ で ある 場合 に true 、 それ 以外 の 場合 に false を 返し ます
配列 を 受け 取る パラメータ で ある かど う か を 調べる
デフォルト 値 が 存在 する 場合 に true 、 それ 以外 の 場合 に false を 返し ます
デフォルト 値 が 存在 する かど う か を 調べる
省略 可能 で ある 場合 に true 、 それ 以外 の 場合 に false を 返し ます
省略 可能 で ある かど う か を 調べる
パラメータ が 参照 渡し で ある 場合 に true 、 それ 以外 の 場合 に false を 返し ます
参照渡 しか どう か を 調べる
文字列 に 変換 する
クローン する
プロパティ の ドキュメントコメント を 返し ます
プロパティ の ドキュメントコメント を 取得 する
修飾子 を 数値 で 返し ます
修飾子 を 取得 する
静的 で ない プロパティ の 場合 は 、 プロパティ を 取得 し たい オブジェクト を 指定 し なけれ ば なり ませ ん
プロパティ の 現在 の 値 を 返し ます
値 を 取得 する
private プロパティ で ある 場合 に true 、 それ 以外 の 場合 に false を 返し ます
private プロパティ で ある かど う か を 調べる
protected プロパティ で ある 場合 に true 、 それ 以外 の 場合 に false を 返し ます
protected プロパティ で ある かど う か を 調べる
true を 指定 する と 、 アクセス できる よう に なり ます
プロパティ の アクセス 範囲 を 設定 する
静的 で ない プロパティ の 場合 は 、 プロパティ を 変更 し たい オブジェクト を 指定 し なけれ ば なり ませ ん
新しい 値
プロパティ の 値 を 設定 する
エクスポート する
文字列 に 変換 する
操作 モード を 返し ます
操作 モード を 返す
設定 する フラグ
フラグ を 設定 する
操作 モード
操作 モード を 設定 する
正規 表現 フラグ
正規 表現 フラグ を 設定 する
エラー が 発生 し た 場合 に false を 返し ます
現在 作業 中 の 内容 を コミット 正常 に 完了 する
構造 化文 字列 で 、 メッセージングサーバー に 接続 する 際 に 使用 する プロトコル 指定 し ます
オプション の 連想 配列 で 、 接続 の 際 に 必要 な 詳細 情報 を 表す プロパティ を 指定 し ます
この メソッド は 、 エラー が 発生 し た 場合 に false を 返し ます
メッセージングサーバー と の 接続 を 確立 する
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
メッセージングサーバー から の 接続 を 解除 する
ルート sdo _dataobject を 返し ます
ルート sdo _dataobject を 返す
ルート 要素 の 名前 を 返し ます
ルート 要素 の 名前 を 返す
ルート 要素 の uri 文字列 を 返し ます
ルート 要素 の uri 文字列 を 返す
エンコーディング 文字列
エンコーディング を 文字列 で 設定 する
xml 宣言 を 設定 する ため の boolean 値
xml 宣言 を 設定 する
xml バージョン 文字列
xml バージョン を 文字列 で 設定 する
xsd スキーマファイル へ の パス
2 番目 以降 の スキーマファイル を sdo _das _xml オブジェクト に 読み込む
型名 の 名前 空間 uri
型名
成功 し た 場合 に sdo _dataobject を 返し ます
名前 空間 uri および 型名 を 指定 し て sdo _dataobject を 作成 する
インスタンスドキュメント へ の パス
成功 し た 場合 は sdo _das _xml _document オブジェクト を 返し ます
xml インスタンスドキュメント へ の パス を 指定 し 、 sdo _das _xml _document オブジェクト を 返す
xml 文字列
成功 し た 場合 は sdo _das _xml _document オブジェクト を 返し ます
xml インスタンス 文字 列 を 指定 し 、 sdo _das _xml _document オブジェクト を 返す
sdo _das _xml _document オブジェクト
オプション の 引数 で 、 xml を 整形 する かど う か を 指定 し ます
xml 文字列 を 返し ます
sdo _das _xml _document オブジェクト を 文字列 に 保存 する
移動先 の 位置
位置 を 移動 する
返り値 通常 は 、 true が 成功 そし て false が 失敗 を 表し ます
セッション を 閉じる
デフォルト の セッション ・ ハンドラ に対し て 有効 な セッション です
新規 セッション id を 返す
破棄 する セッション id
返り値 通常 は 、 true が 成功 そし て false が 失敗 を 表し ます
セッション を 破棄 する
直近 の maxlifetime 秒 の 間 に 更新 さ れ て い ない セッション を 削除 し ます
返り値 通常 は 、 true が 成功 そし て false が 失敗 を 表し ます
古い セッション を 削除 する
セッション を 格納 / 取得 する パス
セッション 名
返り値 通常 は 、 true が 成功 そし て false が 失敗 を 表し ます
セッション を 開始 する
データ を 読み込む セッション の id
読み込ん だ データ を 常 に 文字列 で 返し ます
セッション の データ を 読み込む
返り値 通常 は 、 true が 成功 そし て false が 失敗 を 表し ます
セッション を 閉じる
破棄 する セッション id
返り値 通常 は 、 true が 成功 そし て false が 失敗 を 表し ます
セッション を 破棄 する
直近 の maxlifetime 秒 の 間 に 更新 さ れ て い ない セッション を 削除 し ます
返り値 通常 は 、 true が 成功 そし て false が 失敗 を 表し ます
古い セッション を 削除 する
セッション を 格納 / 取得 する パス
セッション 名
返り値 通常 は 、 true が 成功 そし て false が 失敗 を 表し ます
セッション を 開始 する
指定 し た 場合 、 データ を 返す かわり に ファイル に データ を 書き込み ます
filename が 指定 さ れ て い ない 場合 、 この 関数 は 成功 時 に string 、 エラー 時 に false を 返し ます
simplexml 要素 に 基づき 整形 式 の xml 文字列 を 返す
オプション で 指定 する 、 取得 し た 属性 の 名前 空間
デフォルト は false
simplexmlelement オブジェクト を 返し ます
要素 の 属性 を 定義 する
xml 名前 空間
is _prefix が true の 場合 は ns を プレフィックス として 扱い ます
ノード が 子 を 持つ かどう か に かかわらず simplexmlelement 要素 を 返し ます
指定 し た ノード の 子 ノード を 見付ける
xml 文書 の ルートノード から で なく 、 子 ノード の 配下 の 名前 空間 を 再帰 的 に チェック できる よう に し ます
指定 さ れ て いる 場合 は 、 親 ノード および 子 ノード で 宣言 さ れ て いる 全て の 名前 空間 を 返し ます
getdocnamespaces メソッド は 、 名前 空間 名 および 関連 付け られ た uri を 配列 で 返し ます
ドキュメント で 宣言 さ れ て いる 名前 空間 を 返す
getname メソッド は 、 simplexmlelement オブジェクト が 参照 し て いる xml タグ の 名前 を string で 返し ます
xml 要素 の 名前 を 取得 する
指定 さ れ て いる 場合 は 、 親 ノード および 子 ノード で 使用 し て いる 全て の 名前 空間 を 返し ます
getnamespaces メソッド は 、 名前 空間 名 および 関連 付け られ た uri を 配列 で 返し ます
ドキュメント で 使用 し て いる 名前 空間 を 返す
ns で 指定 し た 名前 空間 へ の xpath クエリ で 使用 する 、 名前 空間 プレフィックス
xpath クエリ で 使用 する 名前 空間
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
次 の xpath クエリ 用 の prefix / ns コンテキスト を 作成 する
xpath パス
simplexmlelement オブジェクト の 配列 を 返し ます
xml データ に xpath クエリ を 実行 する
現在 の 要素 を simplexmliterator オブジェクト で 返し ます
現在 の simplexml エントリ を 返す
現在 の 要素 が 子要素 を 持つ 場合 に true 、 それ 以外 の 場合 に false を 返し ます
現在 の 要素 が 子要素 を 持つ かど う か を 調べる
現在 の simplexmliterator オブジェクト が 参照 する 要素 の xml タグ 名 、 あるい は false を 返し ます
現在 の キー を 返す
最初 の 要素 に 巻き戻す
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
snmp セッション を 閉じる
直近 の snmp リクエスト から の エラー を 表す 文字 列 を 返し ます
直近 の エラーメッセージ を 取得 する
snmp オブジェクト oid
snmp オブジェクト の 値 を object _id に あわせ て 文字 列 か 配列 で 返し ます
指定 し た オブジェクト id に 続く snmp オブジェクト を 取得 する
the mib defines the type of each object id
新しい 値
snmp オブジェクト id
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
snmp オブジェクト の 値 を 設定 する
コンテキスト 名
セキュリティレベル noauthnopriv |authnopriv |authpriv
プライバシーパスフレーズ
コンテキスト engineid
認証 プロトコル md5 あるい は sha
認証 パスフレーズ
プライバシープロトコル des あるい は aes
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
セキュリティ 関連 の snmpv 3 セッションパラメータ を 設定 する
取得 する サブツリー の ルート
これ は 、 渡さ れ た 変数 の 中 で 反復 処理 の 対象 外 と する 変数 の 数 を 指定 し ます
これ は 、 繰り返す 変数 の 反復 処理 の 最大 数 を 指定 し ます
デフォルト で は 、 完全 な oid 記法 を 出力 配列 の キー として 使い ます
成功 し た 場合 は snmp オブジェクト の id とその 値 の 連想 配列 を 返し ます
snmp オブジェクト の サブツリー を 取得 する
soap 関数 を コール する 非推奨
直近 の soap リクエスト を xml 文字列 で 返し ます
直近 の soap リクエスト を 返す
直近 の soap リクエストヘッダ
直近 の soap リクエストヘッダ を 返す
直近 の soap レスポンス を xml 文字列 で 返し ます
直近 の soap レスポンス を 返す
直近 の soap レスポンスヘッダ
直近 の soap レスポンスヘッダ を 返す
soap 型 の 配列 を 返し ます
soap 型 の 一覧 を 返す
新しい エンドポイント url
それ まで の エンドポイント url を 返し ます
使用 する ウェブサービス の 場所 を 設定 する
オプション の 配列
wsdl ファイル の uri もしく は 非 wsdl モード の 場合 null 注意 : 開発 中 は 、 wsdl の キャッシュ を php
soapclient コンストラクタ
soapfault コンストラクタ
soap ヘッダ 要素 の mustunderstand 属性 の 値
soap ヘッダ の 内容
soap ヘッダ 要素 の 名前 空間
soap ヘッダ 要素 の 名前
soap ヘッダ 要素 の actor 属性 の 値
soapheader コンストラクタ
soapparam コンストラクタ
渡す もしく は 返す データ
パラメータ の 名前
soapparam コンストラクタ
単一 の 関数 を エクスポート する に は 、 この パラメータ に 文字 列 として 関数 名 を 渡し て く ださい
soap リクエスト によっ て 処理 さ れる 単一 も しく は いくつか の 関数 を 追加 する
フォールト の 名前
返し たい エラーコード
フォールト について の 詳細
フォールト を 引き起こし た アクター を あらわす 文字列
エラー について の 簡単 な 説明
エラー を 示す soapserver フォールト を 発行 する
定義 さ れ て いる 関数 の 配列 を 返し ます
定義 さ れ て いる 関数 の 一覧 を 返す
soap リクエスト
soap リクエスト を 処理 する
これら の オプションパラメータ は 、 オブジェクト 作成 時 に デフォルト の クラスコンストラクタ に 渡さ れ ます
エクスポート する クラス 名
soap リクエスト を 処理 する クラス を 設定 する
リクエスト を 処理 する オブジェクト
soap リクエスト の 処理 に 使用 する オブジェクト を 設定 する
デフォルト の soap バージョン soap _version 内部 の 文字 エンコーディング encoding アクター の uri actor を 指定 する こと が でき ます
wsdl モード の 場合 、 これ に wsdl ファイル の uri を 指定 する 必要 が あり ます
soapserver コンストラクタ
soapvar コンストラクタ
渡す もしく は 返す データ
エンコーディング id
xml ノード の 名前 空間
xml ノード の 名前
型名
型 の 名前 空間
soapvar コンストラクタ
エラー が スロー さ れ た 際 の 内部 情報 を 含む 配列 を 返し ます
例外 が スロー さ れ た 際 の 内部 情報 を 返す
フィールド 名
フィールド の 値
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
文書 に フィールド を 追加
solrdocument オブジェクト の コピー を 作成
フィールド を 返し ます
現行 の フィールド を 取得
フィールド 名
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
文書 から フィールド を 除去
デストラクタ
フィールド 名
solrdocumentfield インスタンス を 返し ます
プロパティ として フィールド に アクセス
フィールド 名
成功時 に は solrdocumentfield 、 失敗 時 に は false を 返し ます
名前 で フィールド を 取得
成功時 に は 整数 、 失敗 時 に は false を 返し ます
この 文書 内 の フィールド 数 を 返す
この 文書 内 の フィールド 名 を 含む 配列 を 返し ます
文書内 の フィールド 名 の 配列 を 返す
フィールド 名
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
フィールド が 存在 する か チェック
現行 の キー を 返し ます
現行 の キー を 返す
内部 ポインタ を 次 の フィールド に 移動
フィールド 名
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
特定 の フィールド が 存在 する かどう か チェック
フィールド 名
solrdocumentfield オブジェクト を 返し ます
フィールド を 取得
この フィールド に対する 値
フィールド 名
文書 に フィールド を 追加
フィールド 名
フィールド を 除去
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
solrdocument :: clear への エイリアス
文書 の 配列 表現 を 返し ます
文書 の 配列 表現 を 返す
エラー が スロー さ れ た 際 の 内部 情報 を 含む 配列 を 返し ます
例外 が スロー さ れ た 際 の 内部 情報 を 返す
エラー が スロー さ れ た 際 の 内部 情報 を 含む 配列 を 返し ます
例外 が スロー さ れ た 際 の 内部 情報 を 返す
エラー が スロー さ れ た 際 の 内部 情報 を 含む 配列 を 返し ます
例外 が スロー さ れ た 際 の 内部 情報 を 返す
フィールド 名
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
文書 から フィールド を 除去
成功 し た 場合 は boost 値 、 失敗 し た 場合 は false を 返し ます
文書 に対する 現行 の boost 値 を 取得
フィールド 名
成功時 に は solrdocumentfield オブジェクト 、 失敗 時 に は false を 返し ます
名前 で フィールド を 取得
フィールド 名
フィールド の boost 値 、 また は エラー が あっ た 場合 に は false を 返し ます
特定 の フィールド に対する boost 値 を 取得
成功 し た 場合 に 整数 、 失敗 し た 場合 に false を 返し ます
文書内 の フィールド 数 を 返す
成功時 に は 配列 、 失敗 時 に は false を 返し ます
文書内 の フィールド を 全て 含む 配列 を 返す
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
この 文書 に対する インデキシング 時間 の boost 値
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
この 文書 に対する boost 値 を 設定
solr オブジェクト を 生成
プロパティ 名
プロパティ の 値 を 返し ます
プロパティ を 取得 する ため に 使用 さ れる
パラメータ 値
パラメータ 名
成功時 に solrparams インスタンス を 返し ます
パラメータ 値
パラメータ 名
成功時 に solrparam オブジェクト 、 失敗 時 に false を 返し ます
オブジェクト に パラメータ を 追加
カスタム の シリアライズ で 使わ れ ます
パラメータ 値
パラメータ 名
パラメータ 値
パラメータ 名
成功時 に solrparam オブジェクト 、 値 の 場合 に false を 返し ます
パラメータ を 指定 さ れ た 値 に 設定
url エンコード さ れ た 値 が 返さ れる かどう か
成功 時 に 文字列 、 失敗 時 に false を 返し ます
オブジェクト の シリアライズ さ れ た 表現
空文 字列 を 返し ます
サーバー から の レスポンス を 返す
検索 クエリー
現行 の solrquery オブジェクト を 返し ます
検索 クエリー を 設定
シリアライズ さ れ た php データ として xml レスポンス を 返し ます
シリアライズ さ れ た php データ として xml レスポンス を 返す
レスポンス の http ステータス を 返し ます
レスポンス の http ステータス を 返す
http ステータス に関する 詳細 を 返し ます
http ステータス に関する 詳細 を 返す
solr サーバー に 送られ た 生 の リクエスト を 返し ます
solr サーバー に 送られ た 生 の リクエスト を 返す
solr サーバー に 送られ た 生 の リクエストヘッダ を 返し ます
solr サーバー に 送られ た 生 の リクエストヘッダ を 返す
solr サーバー から の 生 の レスポンス を 返し ます
solr サーバー から の 生 の レスポンス を 返す
solr サーバー から の 生 の レスポンスヘッダ を 返し ます
solr サーバー から の 生 の レスポンスヘッダ を 返す
サーバー から の xml レスポンス を 表現 する solrobject を 返し ます
サーバー から の xml レスポンス を 表現 する solrobject を 返す
solrresponse :: parse _solr _doc は 、 solrdocument インスタンス 内 の 文書 を パース し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
パースモード を 設定
apache solr エクステンション の 現行 バージョン
solr エクステンション の 現行 バージョン を 返す
インデックス の 名前
強調 さ せる キーワード
追加 の 強調 オプション 以下 を 参照く ださい の 連想 配列
ドキュメント の 内容 を 含む 文字 列 の 配列
成功 し た 場合 に 抜粋 部 の 配列 、 失敗 し た 場合 に false を 返し ます
テキスト の 抜粋 を 作成 する
トークン 化 の 設定 と キーワード 出現 統計 情報 を 取得 する インデックス
キーワード を 抽出 する クエリ
キーワード 統計 情報 の 生成 を 有効 / 無効 に する フラグ
キーワード 単位 の 情報 を 含む 連想 配列 の 配列 を 返し ます
キーワード を クエリ から 抽出 する
新しい sphinxclient オブジェクト を 作成 する
直近 の エラーメッセージ を 返し ます
直近 の エラーメッセージ を 取得 する
直近 の 警告 メッセージ を 返し ます
直近 の 警告 を 取得 する
現在 の ノード の 値 を 返し ます
現在 の 配列 の 要素 を 返す
現在 の ノード の インデックス を 返し ます
現在 の ノード の インデックス を 返す
設定 し たい インデックス
index の 新しい 値
指定 し た $ index の 値 を $ newval に 設定 する
削除 し たい インデックス
指定 し た $ index の 値 を 削除 する
前 の エントリ に 移動 する
追加 し たい 値
双方向 リンクリスト の 末尾 に 要素 を 追加 する
シリアライズ し た 文字列 を 返し ます
ストレージ を シリアライズ する
追加 する 値
双方向 リンクリスト の 先頭 に 要素 を 追加 する
双方向 リンクリスト にまだ ノード が 含まれる 場合 に true 、 そう で ない 場合 に false を 返し ます
双方向 リンクリスト にまだ ノード が ある かど う か を 調べる
ファイル へ の パス
新しい splfileinfo オブジェクト を 作成 する
ファイル に 最後 に アクセス が あっ た 時刻 を 返し ます
ファイル の 最終 アクセス 時刻 を 取得 する
返さ れる ベース 名 から 取り除き たい 、 オプション の サフィックス
パス 情報 を 含ま ない ベース 名 を 返し ます
ファイル の ベース 名 を 取得 する
最終 変更 時刻 を unix タイムスタンプ で 返し ます
inode 変更 時刻 を 取得 する
ファイル の 拡張子 を 含む 文字 列 を 返し ます
ファイル の 拡張子 を 取得 する
グループ id を 数値 形式 で 返し ます
ファイル の グループ を 取得 する
ファイルシステム の リンク 先 を 返し ます
リンク 先 を 取得 する
ファイル の 最終 変更 時刻 を unix タイムスタンプ で 返し ます
最終 変更 時刻 を 取得 する
ファイル へ の パス を 返し ます
ファイル 名 を 除い た パス を 取得 する
ファイル へ の パス を 返し ます
ファイル へ の パス を 取得 する
ファイル の パーミッション を 返し ます
ファイル の パーミッション を 取得 する
ファイル へ の パス を 返し ます
ファイル へ の 絶対 パス を 取得 する
ファイルサイズ を バイト 数 で 返し ます
ファイルサイズ を 取得 する
実行 可能 で ある 場合 に true 、 そう で ない 場合 に false を 返し ます
ファイル が 実行 可能 か どう か を 調べる
ファイル が リンク で ある 場合 に true 、 そう で ない 場合 に false を 返し ます
ファイル が リンク で ある かど う か を 調べる
書き込み 可能 な 場合 に true 、 そう で ない 場合 に false を 返し ます
エントリ が 書き込み 可能 で ある かど う か を 調べる
true に 設定 する と 、 この ファイル 名 を include _path の 中 から も 探し ます
ファイル を 開く際 の モード
コンテキスト について の 説明 は 、 マニュアル の コンテキスト の 節 を 参照く ださい
オープン し た ファイル を splfileobject オブジェクト で 返し ます
ファイル の splfileobject オブジェクト を 取得 する
splfileinfo :: openfile が コール さ れ た 際 に 使用 する クラス 名
splfileinfo :: openfile で 使用 する クラス を 設定 する
splfileinfo :: getfileinfo および splfileinfo :: getpathinfo が コール さ れ た 際 に 使用 する クラス 名
splfileinfo :: getfileinfo および splfileinfo :: getpathinfo で 使用 する クラス を 設定 する
ファイル へ の パス を 文字列 で 返す
ファイル の 現在 の 行 を 取得 し ます
ファイル の 現在 の 行 を 取得 する
ファイル が 終端 で あれ ば true 、 そう で なけれ ば false を 返し ます
ファイル の 終端 に 到達 し て いる か 調べる
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
出力 を ファイル に フラッシュ する
ファイル から 読み込ま れ た 1 文字 を 含む 文字 列 もしく は 終端 の 場合 は false を 返し ます
ファイル から 文字 を 取り出す
ファイル から 次 の 行 を 含む 文字 列 、 もしく は エラー の とき は false を 返し ます
ファイル から 1 行取り出す
オプション の パラメータ で 、 取り除き たく ない タグ を 指定 し ます
html と php コード が 取り除か れ た ファイル の 次 の 行 を 含む 文字 列 、 もしく は false を 返し ます
ファイル から 1 行取り出し html タグ を 取り除く
handle から 読み込ま れ 出力 を 通し て 渡さ れ た 文字数 を 返し ます
ファイルポインタ に 残っ て いる データ を すべ て 出力 する
オフセット です
whence の 値 は 次 の よう なもの に なり ます : seek _set - offset バイト に 等しい 位置 に セット し ます
探索 が 成功 し た 場合 は 0 、 そう で なけれ ば - 1 が 返さ れ ます
ファイルポインタ を 移動 さ せる
ファイル の 統計 情報 の 配列 を 返し ます ; 配列 フォーマット の 詳細 は stat の マニュアルページ を 参照 し て くだ さい
ファイル の 情報 を 得る
ファイルポインタ の 位置 を 整数 として 、 もしく は エラー の とき は false を 返し ます
ファイルポインタ の 現在 位置 を 返す
区切り と 囲み 文字 を 含む 数字 添字 配列 を 返し ます
csv の 区切り と 囲み 文字 を 取得 する
splfileobject :: setmaxlinelen で セット さ れる 場合 は 行 の 最大 バイト 数 を 返し ます
行 の 最大 バイト 数 を 取得 する
returns false
splfileobject は 子 を 持ち ませ ん
現在 の 行番 号 を 返し ます
行番号 を 取得 する
ゼロ を 起点 と し た 移動 さ せる 行数
ファイルポインタ を 指定行 に 移動 さ せる
フィールド の 区切り 文字 1 文字 のみ
フィールド の 囲み 文字 1 文字 のみ
フィールド の エスケープ 文字 1 文字 のみ
csv の 区切り 文字 と 囲み 文字 を セット する
ファイル 終端 に 到達 し て い なけれ ば true 、 そう で なけれ ば false を 返し ます
ファイル 終端 で ない か チェック する
配列 の サイズ を 返し ます
配列 の サイズ を 返す
現在 の 要素 の 値 を 返し ます
現在 の 配列 の 要素 を 返す
配列 の サイズ を integer で 返し ます
配列 の サイズ を 取得 する
現在 の 配列 の 添字 を 返し ます
現在 の 配列 の 添字 を 返す
次 の エントリ に 進む
調べ たい 添字
指定 し た 添字 が 存在 する 場合 に true 、 それ 以外 の 場合 に false を 返し ます
指定 し た 添字 が 存在 する かど う か を 返す
値 を 取得 し たい 添字
index で 指定 し た 添字 の 値 を 返し ます
指定 し た 添字 の 値 を 返す
消去 し たい 添字
指定 し た 添字 の 値 を 消去 する
イテレータ を 先頭 に 巻き戻す
固定 長配 列 と 同じ 内容 の php の 配列 を 返し ます
固定 長配 列 から php の 配列 を 返す
配列 にまだ 要素 が ある 場合 に true 、 それ 以外 の 場合 に false を 返し ます
配列 にまだ 要素 が ある かど う か を 調べる
アンシリアライズ 後 に 配列 を 再初 期化 する
現在 の ノード の 値 を 返し ます
イテレータ が 指す 現在 の ノード を 返す
現在 の ノード の インデックス を 返し ます
現在 の ノード の インデックス を 返す
イテレータ を 先頭 に 巻き戻す 何 もし ない
ヒープ にまだ ノード が 含まれる 場合 に true 、 そう で ない 場合 に false を 返し ます
ヒープ にまだ ノード が ある かど う か を 調べる
インポート し たい ストレージ
別 の ストレージ から すべ て の オブジェクト を 追加 する
追加 し たい オブジェクト
object に 関連 づける データ
オブジェクト を ストレージ に 追加 する
探し たい オブジェクト
object が ストレージ に 存在 する 場合 に true 、 それ 以外 の 場合 に false を 返し ます
ストレージ に 特定 の オブジェクト が 含ま れる かど う か を 調べる
ストレージ 内 の オブジェクト の 数 を 返し ます
ストレージ 内 の オブジェクト の 数 を 返す
現在 の イテレータ の 位置 に ある オブジェクト を 返し ます
現在 の ストレージ の 要素 を 返す
取り除き たい オブジェクト
オブジェクト を ストレージ から 取り除く
イテレータ の 現在 位置 に 対応 する インデックス を 返し ます
イテレータ の 現在 位置 を 返す
次 の エントリ に 移動 する
データ を 関連 づけ たい オブジェクト
object に 関連 づける データ
ストレージ 内 の オブジェクト に データ を 関連 づける
取り除き たい オブジェクト
ストレージ から オブジェクト を 取り除く
現在 の ストレージ に 残し て おき たい 要素 を 含む ストレージ
別 の ストレージ に 含ま れ て いる もの 以外 の すべ て の オブジェクト を 現在 の ストレージ から 取り除く
ストレージ の 文字 列表 現 を 返し ます
ストレージ を シリアライズ する
ストレージ を シリアライズ し た もの
ストレージ の 文字 列表 現 を アンシリアライズ する
イテレータ の エントリ が 有効 な 場合 に true 、 それ 以外 の 場合 に false を 返し ます
イテレータ の 現在 の エントリ が 有効 か どう か を 返す
observer に 更新 を 通知 する splsubject
subject の 更新 を 受信 する
比較 し たい 最初 の ノード の 優先 順位
比較 し たい 2 番目 の ノード の 優先 順位
比較 結果 を 返し ます
要素 の 優先 順位 を 比較 し 、 ヒープ 内 の 適切 な 位置 に 置く
現在 の ノード の 値 あるい は 優先 順位 あるい は その 両方 を 、 抽出 フラグ の 設定 に 応じ て 返し ます
イテレータ が 指す 現在 の ノード を 返す
挿入 する 値
関連 づける 優先 順位
キュー に 要素 を 挿入 する
現在 の ノード の インデックス を 返し ます
現在 の ノード の インデックス を 返す
次 の ノード に 移動 する
イテレータ を 先頭 に 巻き戻す 何 もし ない
キュー にまだ ノード が 含まれる 場合 に true 、 そう で ない 場合 に false を 返し ます
キュー にまだ ノード が ある かど う か を 調べる
キュー に 追加 する 値
要素 を キュー に 追加 する
デタッチ する splobserver
observer を デタッチ する
observer に 通知 する
一時ファイル に 使う メモリ の 最大 量 バイト 単位 、 デフォルト は 2 mb
新しい 一時 ファイルオブジェクト を 作成 する
スリープ さ せる 時間 ミリ秒
成功 し た 場合 に true 、 失敗 し た 場合 に false を 返し ます
接続 が ビジー 状態 の とき の ハンドラ を 設定 する
直近 の sql 文 で 変更 あるい は 挿入 、 削除 さ れ た 行 の 数 を 表す integer 値 を 返し ます
直近 の sql 文 で 変更 あるい は 挿入 、 削除 さ れ た 行 の 数 を 返す
成功 し た 場合 に true 、 失敗 し た 場合 に false を 返し ます
データベース と の 接続 を 閉じる
集約 対象 の すべ て の 項目 に 適用 する コールバック として 指定 する 、 php の 関数 あるい は ユーザー 定義 関数 の 名前
集約 処理 の 最後 に 適用 する コールバック として 指定 する 、 php の 関数 あるい は ユーザー 定義 関数 の 名前
sql 集約 関数 が 受け 取る パラメータ の 数
作成 あるい は 再定義 し たい sql 集約 関数 の 名前
集約 関数 の 作成 に 成功 し た 場合 に true 、 失敗 し た 場合 に false を 返し ます
sql の 集約 関数 として 使用 する php 関数 を 登録 する
コールバック として 指定 する 、 php の 関数 あるい は ユーザー 定義 関数 の 名前
sql 関数 が 受け 取る パラメータ の 数
作成 あるい は 再定義 し たい sql 関数 の 名前
関数 の 作成 に 成功 し た 場合 に true 、 失敗 し た 場合 に false を 返し ます
sql の スカラー 関数 として 使用 する php 関数 を 登録 する
エスケープ し たい 文字列
sql 文 の 中 で 安全 に 使える よう 適切 に エスケープ さ れ た 文字列 を 返し ます
適切 に エスケープ さ れ た 文字列 を 返す
実行 し たい sql クエリ 通常 は insert 、 update あるい は delete クエリ
クエリ が 成功 し た 場合 に true 、 失敗 し た 場合 に false を 返し ます
指定 し た データベース に 、 結果 を 返さ ない クエリ を 実行 する
直近 で 失敗 し た sqlite リクエスト の 結果 コード を 数値 で 返し ます
直近 で 失敗 し た sqlite リクエスト の 結果 コード を 数値 で 返す
直近 で 失敗 し た sqlite リクエスト について の 英文 テキスト の 説明 を 返し ます
直近 で 失敗 し た sqlite リクエスト について の 英文 テキスト の 説明 を 返す
読み込み たい ライブラリ の 名前
拡張 ライブラリ の 読み込み に 成功 し た 場合 に true 、 失敗 し た 場合 に false を 返し ます
sqlite 拡張 ライブラリ を 読み込む
sqlite データベース へ の パス
オプション の 暗号 キー
sqlite データベース の オープン 方法 を 指定 する フラグ
sqlite データベース を オープン する
準備 し たい sql クエリ
成功 し た 場合 に sqlite 3stmt オブジェクト 、 失敗 し た 場合 に false を 返し ます
実行 する sql 文 を 準備 する
実行 し たい sql クエリ
クエリ が 結果 を 返す 場合 は sqlite 3result オブジェクト を 返し ます
sql クエリ を 実行 する
デフォルト で は 、 querysingle は クエリ が 返す 結果 の 最初 の カラム の 値 を 返し ます
実行 し たい sql クエリ
結果 の 最初 の カラム の 値 あるい は 最初 の 行全 体 の 配列 entire _row が true の 場合 を 返し ます
クエリ を 実行 し 、 単一 の 結果 を 返す
キー & quot ;versionstring &quot ; および & quot ;versionnumber &quot ; を 持つ 連想 配列 を 返し ます
sqlite 3 ライブラリ の バージョン を 、 文字 列定 数 と 数値 で 返す
0 から 始まる カラム の 数値 インデックス
column _number で 指定 し た カラム の データ 型 インデックス sqlite 3 _ integer 、 sqlite 3 _ float 、 sqlite 3 _ text 、 sqlite 3 _ blob あるい は sqlite 3 _ null のいずれ か を 返し ます
n 番目 の カラム の 型 を 返す
次 の 行 を どの よう に 返すか を 制御 し ます
結果 の 行 を 、 連想 配列 あるい は 数値 添字 配列 ある い は その 両方 で 取得 し ます
結果 の 行 を 、 連想 配列 あるい は 数値 添字 配列 ある い は その 両方 で 取得 する
true を 返し ます
結果 セット を 閉じる
結果 セット の カラム 数 を 返し ます
結果 セット の カラム 数 を 返す
バインド する パラメータ の データ 型
変数 に バインド する パラメータ
パラメータ を どの 変数 に バインド する か を 表す 文字列
パラメータ を 変数 に バインド し た 場合 に true 、 失敗 し た 場合 に false を 返し ます
パラメータ を 変数 に バインド する
バインド さ れ て いる パラメータ の クリア に 成功 し た 場合 に true 、 失敗 し た 場合 に false を 返し ます
現在 バインド さ れ て いる すべ て の パラメータ を クリア する
プリペアドステートメント の 実行 に 成功 し た 場合 に sqlite 3result オブジェクト 、 失敗 し た 場合 に false を 返し ます
プリペアドステートメント を 実行 し 、 結果 セットオブジェクト を 返す
プリペアドステートメント 内 の パラメータ の 数 を 返し ます
プリペアドステートメント 内 の パラメータ の 数 を 返す
ステートメント の リセット に 成功 し た 場合 に true 、 失敗 し た 場合 に false を 返し ます
プリペアドステートメント を リセット する
新しい ストリームラッパー を 作成 する
既存 の ストリームラッパー を 破棄 する
opendir に渡す url を 指定 し ます
safe _mode 0x 0 4 を 強制 する か 否か
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ディレクトリハンドル を オープン する
path _from の 変更 後 の url
現在 の ファイル の url
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ファイル あるい は ディレクトリ の 名前 を 変える
stream _mkdir _recursive など の 値 の ビットマスク
削除 し たい ディレクトリ の url
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ディレクトリ を 削除 する
stream _select が stream _cast を コール し た 場合 は stream _cast _for _select 、 stream _cast がそれ 以外 の 用途 で コール さ れ た 場合 は stream _cast _as _stream
ラッパー が 使用 し て いる ストリームリソース 、 あるい は false を 返し ます
元 と なる リソース を 取得 する
リソース を 閉じる
読み込み / 書き込み 位置 が ストリーム の 末尾 に あっ て もう それ 以上 読み込む データ が ない 場合 に true 、 それ 以外 の 場合 に false を 返し ます
ファイルポインタ が 終端 に ある かど う か を 調べる
キャッシュデータ が 正常 に 格納 でき た あるい は 格納 する データ が なかっ た 場合 に true 、 データ を 格納 でき なかっ た 場合 に false を 返し ます
出力 を フラッシュ する
メタデータ を 設定 する ファイルパス あるい は url
option の 値 が stream _meta _touch の 場合 は 、 touch 関数 の 二つ の 引数 を 含む 配列
次 のい ずれ か です
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ストリームオプション を 変更 する
ストリーム api が 設定 する 追加 の フラグ
元 の 関数 に 渡す url を 指定 し ます
path の オープン に 成功 し 、 stream _use _path が options に 設定 さ れ て い た 場合 、 opened _path に は 実際 に オープン し た ファイル / リソース の フルパス を 設定 し なけれ ば なり ませ ん
ファイル を オープン する 際 の モード
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ファイル あるい は url を オープン する
現在 位置 から 何 バイト ぶん の データ を 返す か
count バイト 未満 の データ しか 存在 し ない 場合 は 、 返せる 限り の データ を 返し ます
ストリーム から 読み込む
移動 する ストリームオフセット
使用 可能 な 値 seek _set - offset バイト 目 の 位置 に 移動 する
位置 を 更新 し た 場合 に true 、 それ 以外 の 場合 に false を 返し ます
ストリーム 内 の 特定 の 場所 に 移動 する
stat を 参照く ださい
ファイルリソース について の 情報 を 取得 する
元 と なる システム に 書き込ま れる データ
正常 に 格納 でき た バイト 数 、 あるい は 何 も 格納 でき なかっ た 場合 は 0 を 返し ます
ストリーム に 書き込む
情報 を 取得 し たい ファイル の url
ストリーム api が 設定 する 追加 の フラグ
stat が 返す の と 同じ 要素 を 返さ なけれ ば なり ませ ん
ファイル について の 情報 を 取得 する
モデル の ファイル 名
エラー 時 に svmexception を スロー し ます
保管 さ れ た svm モデル を 読み込み
フレーム 数 を 整数 で 返し ます
ビデオ 内 の フレーム 数 を 返す
高さ を 表す ピクセル 数
幅 を 表す ピクセル 数
ビデオ の 大きさ を 設定 する
数値 の id を 返し ます
識別
状態 を 表す boolean 値 を 返し ます
状態 を 検出 する
状態 を 表す boolean 値 を 返し ます
状態 を 検出 する
オプション の マスク
成功 し た かどう か を 表す boolean 値 を 返し ます
実行 する
オブジェクト が スロー さ れ た ファイル の 名前 を 返し ます
例外 が 発生 し た ファイル 名 を 取得 する
スロー さ れ た オブジェクト に 関連 づけ られ た メッセージ を 返し ます
メッセージ を 取得 する
スタックトレース の 配列 を 返し ます
スタックトレース を 取得 する
include _path から ファイル を 探し ます
config に は 配列 あるい は 文字列 を 渡し ます
もし filename パラメータ が 与え られ た 場合 、 この 関数 は ファイル を 読み込み 、 tidy _parse _file のよう に 実行 し て ファイル に 基づい た オブジェクト を 初期化 し ます
encoding は 入出 力 ドキュメント の エンコーディング を 設定 し ます
新しい tidy インスタンス を 返し ます
新しい tidy オブジェクト を 作成 する
その ノード が 親 を 持っ て いる 場合 に tidynode 、 それ 以外 の 場合 に null を 返し ます
カレントノード の 親 ノード を 返す
ノード が 子 を 持つ 場合 に true 、 それ 以外 の 場合 に false を 返し ます
ノード が 子 を 持つ かど う か を 調べる
兄弟 ノード を 持つ 場合 に true 、 それ 以外 の 場合 に false を 返し ます
この ノード が 兄弟 ノード を 持つ かど う か を 調べる
ノード が jste で ある 場合 に true 、 それ 以外 の 場合 に false を 返し ます
この ノード が jste で ある かど う か を 調べる
ノード が php コード で ある 場合 に true 、 それ 以外 の 場合 に false を 返し ます
この ノード が php で ある かど う か を 調べる
ノード が テキスト を 著す 場合 に true 、 それ 以外 の 場合 に false を 返し ます
この ノード が マークアップ で ない テキスト で ある かど う か を 調べる
tokyotyrant :: rdbrec _int あるい は tokyotyrant :: rdbrec _dbl 定数
文字列 キー
加算 する 値
成功 し た 場合 に 新しい 値 を 返し ます
数値キー を 加算 する
ポート 番号
接続 の オプション
ホスト 名
現在 の オブジェクト を 返し ます
データベース に 接続 する
データベース へ の uri
現在 の オブジェクト を 返し ます
データベース に 接続 する
ポート 番号
接続 の オプション
ホスト 名
データベース へ の 接続 が 失敗 し た 場合 に tokyotyrantexception を スロー し ます
新しい tokyotyrant オブジェクト を 作成 する
関数 に 渡す キー
関数 に 渡す値
実行 し たい 関数 の 名前
レコードロック の 場合 は tokyotyrant :: rdbxo _lckrec 、 グローバルロック の 場合 は tokyotyrant :: rdbxo _lckglb
スクリプト 関数 の 結果 を 返し ます
リモートスクリプト を 実行 する
キー を あらわす 文字 列 、 あるい は 文字列 の 配列
指定 し た 引数 に 応じ て 、 文字 列 あるい は 配列 を 返し ます
値 を 取得 する
tokyotyrantiterator オブジェクト を 返し ます
イテレータ を 取得 する
データベース 内 の レコード の 数 を 返し ます
データベース 内 の レコード の 数 を 取得 する
文字列 の キー 、 あるい は 文字列 の キー の 配列
現在 の オブジェクト を 返し ます
レコード を 削除 する
文字列 の キー 、 あるい は key -value ペア の 配列
文字列 の キー を 使用 し た 場合 の 値
現在 の オブジェクト へ の 参照 を 返し ます
レコード を 連結 する
文字列 の キー 、 あるい は key -value ペア の 配列
文字列 の 値
現在 の オブジェクト へ の 参照 を 返し ます
値 を 格納 する
連結 する 値
レコード の 幅
文字列 の キー
現在 の オブジェクト へ の 参照 を 返し ます
レコード を 連結 する
レプリケーションマスタ の ホスト 名
整合性 の チェック を 行う か どう か
開始 時刻 の タイムスタンプ マイクロ 秒
レプリケーションマスタ の ポート
現在 の オブジェクト を 返し ます
レプリケーション の マスタ を 設定 する
成功 し た 場合 に 現在 の 値 、 失敗 し た 場合 に false を 返し ます
現在 の 値 を 取得 する
成功 し た 場合 に 現在 の キー 、 失敗 し た 場合 に false を 返し ます
現在 の キー を 返す
成功 し た 場合 に 次の 値 、 失敗 し た 場合 に false を 返し ます
次 の キー に 移動 する
イテレータ を 巻き戻す
現在 の アイテム が 有効 な 場合 に true 、 そう で ない 場合 に false を 返し ます
イテレータ が 有効 か どう か を 調べる
条件 で 使う カラム の 名前
演算子
式
この メソッド は 現在 の オブジェクト を 返し ます
条件 を クエリ に 追加 する
マッチ し た 行 の 数 を 返し ます
レコード を 数える
現在 の 行 を 返し ます
現在 の 要素 を 返す
常 に 文字列 を 返し ます
クエリ の ヒント 文字 列 を 取得 する
tokyotyrant :: rdbms _* 定数 のい ずれ か
tokyotyrantquery オブジェクト の 配列
マッチ する 行 を 返し ます
複数 の クエリ から レコード を 取得 する
次 の 行 を 返し ます
イテレータ を 次 の エントリ に 移動 する
この メソッド は 現在 の オブジェクト を 返し ます
クエリ に 基づい て レコード を 削除 する
マッチ し た 行 を 返し ます
レコード を 検索 する
先頭 から 何件 の レコード を 読み 飛ば すか
レコード の 最大 数
この メソッド は 現在 の オブジェクト を 返し ます
結果 を 制限 する
並べ 替え を 行う カラム 名
type に は 、 次 の 定数 のい ずれ か を 指定 し ます
この メソッド は 、 現在 の オブジェクト を 返し ます
結果 を 並べ 替える
tokyotyrant :: rdb _recint あるい は tokyotyrant :: rdb _recdbl 定数
文字列 キー
加算 する 値
レコード を 追加 する
主キー
行 を 配列 で 返し ます
行 を 取得 する
tokyotyrantiterator オブジェクト を 返し ます
イテレータ を 取得 する
成功 し た 場合 に tokyotyrantquery を 返し ます
クエリオブジェクト を 取得 する
整数 の キー 、 あるい は その 配列
レコード を 削除 する
行 の 内容
行 の 主キー
成功 し た 場合 に 主キー を 返し ます
行 を 格納 する
行 の 内容 の 配列
行 の 主キー 、 あるい は null
行 を 連結 する
行 の 内容 の 配列
行 の 主キー 、 あるい は null
新しい レコード を 書き込む
文字列 の キー 、 あるい は key -value ペア の 配列
文字列 の 値
値 を 格納 する
連結 する 値
レコード の 幅
文字列 の キー
レコード を 連結 する
v 8js :: registerextension で 登録 し た 拡張 の 一覧
キャッチ でき なかっ た javascript の 例外 を その 場 です ぐ に 報告 する かど う か を 制御 し ます
javascript の 中 で 使う php の 変数 の マップ
javascript に 渡す オブジェクト の 名前
新しい v 8js コンテキストオブジェクト を 返し ます
新しい v 8js オブジェクト を 作成 する
v 8jsexception あるい は null を 返し ます
キャッチ さ れ なかっ た javascript 例外 の 中 で 未処 理 の もの を 返す
true に する と 、 この 拡張 が すべ て の v 8js コンテキスト で 自動 的 に 有効 と なり ます
登録 する 拡張 が 依存 し て いる 他 の 拡張 の 名前 の 配列
登録 する javascript コード
登録 する 拡張 の 名前
拡張 の 登録 に 成功 し た 場合 に true 、 それ 以外 の 場合 に false を 返し ます
v 8js で 使う javascript の 拡張 を 登録 する
新しい マップ を 作る
マップ 内 の 生き た エントリ を 返し ます
マップ 内 の 生き た エントリ を 数える
反復 処理 中 の 現在 の 値 を 返し ます
反復 処理 中 の 現在 の 値 を 返す
マップ の 次 の 要素 に 進む
調べ たい オブジェクト
オブジェクト が マップ 内 に 含まれる 場合 に true 、 それ 以外 の 場合 に false を 返し ます
オブジェクト が マップ 内 に ある かど う か を 調べる
マップ 内 の キー として 含ま れる オブジェクト
引数 で 渡し た オブジェクト に 関連 づけ られ た 値 を 返し ます
オブジェクト を 指定 し て 、 それ が 指す値 を 返す
イテレータ が 有効 な マップ 要素 を 指し て い て そこ に アクセス できる 場合 に true 、 そう で ない 場合 に false を 返し ます
イテレータ が 有効 な マップ 要素 を 指し て いる かど う か を 返す
その 参照 が 有効 で 、 かつ 強い 参照 に 切り 替え られ た 場合 に true 、 それ 以外 の 場合 に false を 返し ます
オブジェクト へ の 強い 参照 を 確保 する
参照 が 有効 な 場合 に その 先 の オブジェクト を 返し ます
弱い 参照 が 指す先 に オブジェクト を 返す
先 に 確保 し た 参照 を 解放 でき た 場合 に true 、 それ 以外 の 場合 に false を 返し ます
確保 し た 参照 を 解放 する
オブジェクト が まだ 存在 し て weakref :: get アクセス 可能 な 場合 に true 、 それ 以外 の 場合 に false を 返し ます
参照先 の オブジェクト が まだ 存在 する かど う か を 調べる
整数 値 を 返し ます
スタック の 状態 を 調べる
状態 を 表す boolean 値 を 返し ます
状態 を 検出 する
状態 を 表す boolean 値 を 返し ます
状態 を 検出 する
同 期処 理
事前 に worker に 積ん だ threaded オブジェクト
スタック の 新しい 長さ を 返し ます
スタック 処理
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
xmlreader の 入力 を 閉じる
属性 の 名前
属性 の 値 を 返し ます
名前 を もと に 、 属性 の 値 を 取得 する
属性 の 位置
属性 の 値 を 返し ます
インデックス を もと に 、 属性 の 値 を 取得 する
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
パース し て いる ドキュメント の 妥当性 を 示す
プレフィックス を 含む 文字列
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
プレフィックス から 、 名前 空間 を 検索 する
属性 の 名前
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
指定 し た 名前 の 属性 に カーソル を 移動 する
属性 の 位置
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
指定 し た インデックス の 属性 に カーソル を 移動 する
ローカル 名
名前 空間 の uri
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
指定 し た 名前 の 属性 に カーソル を 移動 する
成功 し た 場合 に true 、 失敗 し た 場合 、 あるい は メソッド が コール さ れ た 際 の 位置 が 属性 ノード で は なかっ た 場合 に false を 返し ます
現在 の 属性 の 親要 素 に カーソル を 移動 する
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
最初 の 属性 に カーソル を 移動 する
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
次 の 属性 に カーソル を 移動 する
移動先 の ノード の 名前
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
すべて の サブツリー を 飛ば し て 、 次 の ノード に カーソル を 移動 する
libxml _* 定数 の ビットマスク
ドキュメント の エンコーディング あるい は null
ドキュメント を 指す uri
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
パース する xml を 含む uri を 設定 する
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ドキュメント 内 の 次 の ノード に 移動 する
現在 の ノード の 中身 を 、 自分 自身 も 含め て 文字 列 で 返し ます
現在 の ノード から 自分 自身 も 含め た xml を 取得 する
現在 の ノード の 内容 を 文字列 で 返し ます
現在 の ノード の 内容 を 文字列 で 読み込む
パーサオプション 定数 の ひとつ
true を 設定 する と オプション が 有効 に なり 、 それ 以外 を 設定 する と 無効 に なり ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
パーサ の オプション を 設定 する
relaxng スキーマ を 指す ファイル 名 あるい は uri
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
relaxng スキーマ の ファイル 名 あるい は uri を 設定 する
xsd スキーマファイル 名
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ドキュメント を xsd で 検証 する
libxml _* 定数 の ビットマスク
ドキュメント の エンコーディング あるい は null
パース さ れる xml を 含む 文字列
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
パース する xml を 含む データ を 設定 する
xslt パラメータ の ローカル 名 を 指定 し ます
xslt パラメータ の 名前 空間 uri を 指定 し ます
パラメータ の 値 文字列 、 あるい は 設定 さ れ て い ない 場合 は false を 返し ます
パラメータ の 値 を 取得 する
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
php が exslt を サポート し て いる かど う か を 判定 する
取り込ま れる スタイルシート を domdocument オブジェクト あるい は simplexmlelement オブジェクト として 指定 し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
スタイルシート を 取り込む
この パラメータ は 、 xslt から コール さ れる 信頼 できる 関数 のみ を 許可 し ます
php 関数 を xslt 関数 として 利用 できる よう に する
xslt パラメータ の ローカル 名 を 指定 し ます
xslt パラメータ の 名前 空間 uri を 指定 し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
パラメータ を 削除 する
xslt パラメータ の ローカル 名 を 指定 し ます
xslt パラメータ の 新しい 値 を 指定 し ます
xslt パラメータ の 名前 空間 uri を 指定 し ます
名前 = & gt ; 値 の 組 の 配列 を 指定 し ます
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
パラメータ の 値 を 設定 する
プロファイル 情報 を 出力 する ファイル へ の パス
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
プロファイル 情報 の 出力 ファイル を 設定 する
変換 する 文章 を 指定 し ます
変換先 の uri
書き込ま れ た バイト 数
uri に 変換 する
変換 対象 と なる 、 domdocument オブジェクト あるい は simplexmlelement オブジェクト を 指定 し ます
変換 結果 の 文字列
xml に 変換 する
yaf _bootstrap _abstract の インスタンス
ブートストラップ を コール する
最終 的 な 設定 として 、 どの セクション を 読み込む か
ini ファイル へ の パス 、 あるい は 設定 の 配列
yaf _application の コンストラクタ
環境 を 取得 する
ini ファイル へ の パス
ini ファイル の 中 で パース し たい セクション
yaf _config _ini の コンストラクタ
php の 配列 を 返す
php の 配列 を 返す
yaf _controller _abstract の コンストラクタ
モジュール 名 を 取得 する
yaf _request _abstract instance
現在 の リクエストオブジェクト を 取得 する
yaf _response _abstract instance
現在 の レスポンスオブジェクト を 取得 する
ビューエンジン を 取得 する
コントローラ を 初期化 する
場所 を 表す url
bool
url に リダイレクト する
ビュー の レンダリング を 無効 に する
プラグイン を 登録 する
yaf _view _interface の インスタンス
カスタムビューエンジン を 設定 する
bool
例外 の スロー の オン / オフ を 切り 替える
クラス 名 の プレフィックス を 表す 文字 列 あるい は 配列
ローカルクラスプレフィックス を 登録 する
the dispatchloopshutdown purpose
the routershutdown purpose
routerstartup フック
アイテム を レジストリ から 削除 する
アイテム を レジストリ から 取得 する
アイテム が 存在 する かど う か を 調べる
アイテム を レジストリ に 追加 する
この パラメータ を 指定 する と 、 変数 が 見つ から ない 場合 に この 値 を 返す よう に なり ます
変数 名
env 変数 を 取得 する
この パラメータ を 指定 する と 、 変数 が 見つ から ない 場合 に この 値 を 返す よう に なり ます
変数 名
server 変数 を 取得 する
この パラメータ を 指定 する と 、 変数 が 見つ から ない 場合 に この 値 を 返す よう に なり ます
変数 名
クライアント から の 変数 を 取得 する
この パラメータ を 指定 する と 、 変数 が 見つ から ない 場合 に この 値 を 返す よう に なり ます
変数 名
クエリパラメータ を 取得 する
ajax リクエスト か どう か を 調べる
コンテンツ の キー
the clearbody purpose
コンテンツ の キー
コンテンツ を 取得 する
コンテンツ 文字列
コンテンツ の キー
コンテンツ を レスポンス に 設定 する
yaf _route _regex :: _ construct の 引数 で 指定 し た パターン に リクエスト uri が マッチ し た 場合 に true 、 それ 以外 の 場合 に false を 返し ます
the route purpose
モジュール の 情報 を 取得 する キー
コントローラ の 情報 を 取得 する キー
アクション の 情報 を 取得 する キー
常 に true を 返し ます
yaf _route _simple の コンストラクタ
キー の 名前
the _ _ construct purpose
yaf _config _abstract の インスタンス を 返し ます
設定 で 定義 し た ルート を ルーター に 追加 する
ルート 名 を 文字列 で 返し ます
使わ れ て いる ルート 名 を 取得 する
登録済み の ルート を 取得 する
値 を ビューエンジン に 代入 する
テンプレートディレクトリ へ の 絶対 パス
the setscriptpath purpose
レンダリング し て 表示 する
文字列 の テンプレート
テンプレート を レンダリング する
代入 し た 変数 名
retrieve assigned variable
テンプレート を レンダリング する
変数 名
変数 の 値
値 を エンジン に 設定 する
glob の フラグ の ビットマスク
オプション の 連想 配列
glob パターン
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
ディレクトリ から 、 glob パターン を 使っ て ファイル を 追加 する
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
アクティブ な オープン さ れ た 、 あるい は 新しく 作成 さ れ た アーカイブ を 閉じる
削除 する エントリ の インデックス
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
インデックス を 使用 し て 、 アーカイブ 内 の エントリ を 削除 する
削除 する エントリ の 名前
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
名前 を 使用 し て 、 アーカイブ から エントリ を 削除 する
展開 する エントリ
ファイル を 展開 する 場所
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
アーカイブ の 内容 を 展開 する
ziparchive :: fl _unchanged を 設定 する と 、 元 の 変更 さ れ て い ない コメント を 返し ます
zip アーカイブ の コメント を 返し ます
zip アーカイブ の コメント を 返す
ziparchive :: fl _unchanged を 指定 する と 、 元 の 変化 し て い ない コメント を 返し ます
エントリ の インデックス
成功 し た 場合 に コメント 、 失敗 し た 場合 に false を 返し ます
エントリ の インデックス を 使用 し て 、 エントリ の コメント を 返す
エントリ の 名前
エントリ から 読み込む 長 さ
エントリ を 探す際 に 使用 する フラグ
成功 し た 場合 に エントリ の 内容 、 失敗 し た 場合 に false を 返し ます
名前 を 使用 し て 、 エントリ の 内容 を 返す
ziparchive :: fl _unchanged を 指定 する と 、 元 の 変化 し て い ない コメント を 返し ます
エントリ の インデックス
成功 し た 場合 に 名前 、 失敗 し た 場合 に false を 返し ます
インデックス を 使用 し て 、 エントリ の 名前 を 返す
成功時 に は ステータスメッセージ を 文字列 で 返し ます
使用 する エントリ の 名前
成功 し た 場合 に ファイルポインタ リソース 、 失敗 し た 場合 に false を 返し ます
名前 を 使用 し て 、 エントリ の ファイルハンドラ 読み込み 専用 を 取得 する
この 関数 は 、 アーカイブ 内 の 指定 し た 名前 の ファイル の インデックス を 返し ます
探し たい エントリ の 名前
成功 し た 場合 に エントリ の インデックス 、 失敗 し た 場合 に false を 返し ます
アーカイブ 内 の エントリ の インデックス を 返す
アーカイブ の オープン に 使用 する モード
オープン する zip アーカイブ の ファイル 名
エラーコード 成功 し た 場合 に true 、 それ 以外 の 場合 に エラーコード を 返し ます
zip ファイルアーカイブ を オープン する
名前 を 変更 する エントリ の インデックス
新しい 名前
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
インデックス を 使用 し て エントリ 名 を 変更 する
コメント の 内容
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
zip アーカイブ の コメント を 設定 する
コメント の 内容
エントリ の インデックス
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
インデックス を 使用 し て エントリ の コメント を 設定 する
エントリ の 名前
コメント の 内容
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
名前 を 使用 し て エントリ の コメント を 設定 する
ziparchive :: fl _unchanged を or で 連結 する と 、 アーカイブ 内 に 最初 に 記録 さ れ た 際 の 情報 を 取得 し ます
エントリ の インデックス
エントリ の 詳細 を 含む 配列 を 返し ます
インデックス を 使用 し て エントリ の 詳細 を 取得 する
エントリ の 名前
名前 を どの よう に 探す の か を 設定 し ます
エントリ の 詳細 を 含む 配列 を 返し ます
名前 を 使用 し て エントリ の 詳細 を 取得 する
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
アーカイブ に対する すべ て の 変更 を 取り消す
エントリ の インデックス
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
指定 し た インデックス の エントリ に対する すべ て の 変更 を 取り消す
エントリ の 名前
成功 し た 場合 に true を 、 失敗 し た 場合 に false を 返し ます
指定 し た 名前 の エントリ に対する すべ て の 変更 を 取り消す
