作業 コピーディレクトリ workingdir を 再帰 的 に クリーンアップ し 、 中途 半端 に なっ て いる 操作 を 完了 し て ロック を 削除 し ます
リクエスト が 送られ た 完全 な url を 返し ます
バッファ つき イベント の コールバック を 設定 し たり 、 既存 の コールバック を 変更 し たり し ます
この 関数 は php が 内部 的 に 使う ため だけ の もの で 、 ユーザー が コール する 必要 は あり ませ ん
ツリー の ルート から category が 指す 現在 の カテゴリ まで の パス を 記述 し た 配列 を 返し ます
関数 は 、 ブロック さ れ た シグナル を how パラメータ に 応じ て 追加 、 削除 あるい は 設定 し ます
ドキュメント の データ を 一時 ストリーム に 保存 し ます
生 の xml データ を domdocumentfragment に 追加 し ます
で 準備 し た クエリ を 実行 し ます
テンプレート を レンダリング し 、 結果 を すぐ に 出力 し ます
名前 空間 部分 を 除い た 、 クラス の 短い 名前 を 取得 し ます
は 、 一度 の 関数 コール で sql 文 を 実行 し 、 文 によっ て 作用 し た 行数 を 返し ます
プロパティ に対し て 値 の 設定 を 解除 し ます
imagick オブジェクト の サイズ の オフセット を 返し ます
ディレクトリ の 中身 を もと に tar / zip アーカイブ を 作成 し ます
この 関数 は 、 新しい bbcode リソース を 返し ます
a の ビット index を 設定 し ます
この 関数 は 、 指定 し た メッセージシーケンス 番号 の uid を 返し ます
は 、 自動フラッシュ を オン また は オフ に 切替 え ます
この メソッド は 、 domdocument オブジェクト 内 の & raquo ;& nbsp ;xincludes を 置換 し ます
この 関数 は 、 v 8js :: registerextension で 登録 さ れ た javascript 拡張 の 配列 を 返し ます
後 で 使用 する ため 、 ディスクベース か あるい は 仮想 pdf ドキュメント を オープン し ます
現在 の 輪郭 描画 色 を 0 から 1 まで の グレー 値 に 設定 し ます
ラージオブジェクト に対する バッファリング が 有効 か 無効 か を 調べ ます
name 0 が name 1 の エイリアス か どう か を 調べ ます
この 関数 は 、 取得 時 の 要素 集合 の 名前 を 指定 し ます
は 、 データベース へ の 直近 の 接続 が 失敗 し た 原因 を 表す sqlcode および エラーメッセージ を 返し ます
指定 し た rgb を 配色 と する 色 の id を 返し ます
この メソッド の アクセス 修飾子 の ビットフィールド を 返し ます
一時ストリーム の 大きさ を 取得 し ます
関数 の 短い 名前 名前 空間 部分 を 除い た 名前 を 取得 し ます
は 、 何 もせ ずた だ リクエスト の サイクル を 回し ます
保存 し た 整数 値 を 減ら し ます
画像 の ticks -per -second を 取得 し ます
mongoid が 一意 な id を 作る ため に 使う ホスト 名 を 返し ます
検索 を 行い ます
この 関数 は 、 まだ 実装 さ れ て いませ ん
端末 を 元 の 状態 に 戻す よう 、 newt に 通知 し ます
擬似 乱数 を 使っ て ランダム な バイト の 文字列 を 生成 し ます
value を variant に 変換 し 、 それ を variant オブジェクト に 代入 し ます
haystack の 中 で needle が 最初 に 現れる 場所 を 含め て そこ から 文字 列 の 終わり まで を 返し ます
オブジェクト に 新しい 属性 を 追加 し ます
内部 イテレータ を 取得 し ます
この 関数 は 、 検索 に 成功 し た 後 で レコード を 取得 する ため の 準備 を 行い ます
は 、 キー id priv _key _id および エンベロープキー env _key に 関連 する 公開 鍵 を 使用 し て 、 sealed _data を オープン 復号 します
指定 し た 半径 の 畳み込み フィルタ を 使用 し て 、 画像 の 輪郭 を 強調 し ます
クエリ 言語 パーサ が 特殊 文字 を 解釈 する 文字 を エスケープ し ます
宣言 さ れ て いる インターフェイス を 取得 し ます
は 、 指定 し た 大きさ の 空 の 画像 を 表す 画像 id を 返し ます
ソケットリソース が この 関数 に 渡さ れ た 場合 、 この 特定 の ソケット に 発生 し た 直近 の エラー が 返さ れ ます
この 関数 は 、 キャッシュ さ れ た opcode 全 て を リセット し ます
この メソッド は arrayiterator を 取得 し ます
ファイル の 次 の 行 に 進み ます
この 関数 は 、 アルファベット 文字 を マッチング さ せる 際 に 大文字 小文字 の 区別 を し ない こと 以外 は ereg _replace と 同じ です
指定 し た hostname に 関連 づけ られ た dns リソースレコード を 取得 し ます
と 動作 は 同じ です が 、 可変長 の 引数 で は なく 配列 を 引数 と します
指定 し た ファイル の サイズ を 取得 し ます
ファイル 全体 を 配列 に 読み込み ます
phar アーカイブ に は 、 ブートストラップローダー あるい は スタブ という もの が 含ま れ て い ます
ページ の 表示 を 、 ウィンドウ の 幅 に あわせる よう に し ます
セキュリティ 設定 を 指定 し ます
string を 逆順 に して 返し ます
指定 し た image を 、webp 形式 で 出力 あるい は 保存 し ます
名前 および 名前 空間 uri を もと にし て 属性 の 値 を 返し ます
画像 の 中心 から 、 ピクセル を 渦巻 状 に し ます
指定 さ れ た odbc 結果 id におい て 指定 さ れ た カラム 番号 に ある フィールド の 名前 を 取得 し ます
は 、 指定 し た csr を 用い て x 5 0 9 証明 書 リソース を 作成 し ます
直近 で 失敗 し た posix 関数 が 設定 し た エラー 番号 を 取得 し ます
イテレータ を マップ の 先頭 まで 巻き戻し ます
この メソッド は 、 ローカル あるい は リモート の x サーバー で 画像 を 動かし ます
現在 接続 し て いる ssh サーバー を 経由 し て 、 任意 の ホスト / ポート へ の ソケットストリーム を オープン し ます
その ページ の 現在 の テキスト 変換 行列 を 取得 し ます
各 配列 は 、& quot ; カレント & quot ; の 要素 へ の ポインタ を 有し て い ます
関数 を 起動 し て 、 その 引数 を 配列 として 渡し ます
指定 し た text を 、 truetype フォント を 使用 し て 画像 に 書き込み ます
この 関数 は 補完 用 の 関数 を 登録 し ます
は 、 dbx _result _unbuffered フラグ を 指定 し た クエリ 結果 から 、 行 を 取得 し ます
libev が 使う バックエンド を 表す 整数 値 を 返し ます
は メッセージ の severity レベル の 最小値 を 設定 し ます
現在 の 関数 テーブル を 出力 し ます
は 、 指定 し た link _identifier が 指す mysql データベース へ の 非持 続的 リンク を 閉じ ます
水平 方向 および 垂直 方向 の サンプリング 係数 を 取得 し ます
フラグ を 返し ます
この 静的 メソッド は 、 書き込み アクセス が php .ini の phar .readonly で 無効 に さ れ て いる かど う か を 調べ ます
与え られ た xpath 式 expression を 評価 し ます
sdo _das _xml _document オブジェクト を ファイル に 保存 し ます
指定 し た odbc 結果 id の 番号 で 参照 さ れる フィールド の 長さ を 取得 し ます
パス を 閉じ 、 塗りつぶし 、 輪郭 を 描き ます
を 使う と 、 現在 の セッション の 状態 を 取得 でき ます
は 、 数値 アイテム の 値 を offset で 指定 し ただけ 減ら し ます
現在 の 色空間 と 色 を 設定 し ます
は 、 サーバー が オンライン / オフライン の どちら で ある か を 返し ます
結果 セット 内 の 指定 し た カラム の データ 型 を 返し ます
画像 の 背景 色 を 返し ます
この 関数 は 、 number の 単位 を ラジアン から 度 に 変換 し ます
現在 位置 が 有効 か どう か を 調べ ます
セッション の データ を セッションストレージ に 書き込み ます
パス の 終了 点 を 開始 点 とつ なげ 、 出来 上 がっ た 線 を 描画 し ます
この 関数 は 、 ユーザー 定義 の 比較 関数 を 使っ て キー で エントリ を ソート し ます
を 画像 の 先頭 バイト を 読み その サイン を 調べ ます
静的 メソッド の コール 元 の クラス 名 を 取得 し ます
データベース から clob データ を 読み込み ます
パラメータ callback で 指定 し た ユーザー 定義 の コールバック 関数 を コール し ます
は 、 指定 し た 座標 を 中心 と する 円弧 を 描画 し ます
現在 の プロセス を セッションリーダー に し ます
名前 空間 の 名前 を 取得 し ます
テキスト の アノテーション で 使う コードセット を 表す 文字 列 を 返し ます
number あるい は boolean 型 の pcos パス の 値 を 取得 し ます
は リモートファイル が 最後 に 更新 さ れ た 時刻 を 取得 し ます
post 変数 を 取得 し ます
現在 作業 中 の 内容 を ロールバック し ます
渡さ れ た 単語 を ハイフネーション し ます
は 、 与え られ た 日付 timestamp で 指定 する と 場所 について の 日 の 入り 時刻 を 返し ます
接続 時 の ユーザーパスワード を 取得 あるい は 設定 し ます
この 関数 は 、 db2 _ connect で 作成 し た db2 クライアント 接続 を 閉じ 、 データベースサーバー へ の リソース を 返し ます
与え られ た gz ファイル へ の ポインタ を 閉じ ます
セッション の データ を セッションストレージ に 書き込み ます
既存 の 画像 を コピー し て 新しい 画像 を 作成 し ます
sqlite 3 オブジェクト を 作成 し 、 sqlite 3 データベース を オープン し ます
現在 の パス に 弧 を 追加 し ます
クエリ の 次 の 結果 セット 行 を 含む 連想 配列 を 返し ます
postscript ドキュメント を 閉じ ます
この メソッド は 一般 的 に 、 yaf _application を crontab で 実行 さ せる とき に 使い ます
は 、 socket で 指定 し た ソケットリソース を 閉じ ます
メールボックス の 情報 を 取得 し ます
graphicsmagick api の 著作 権情 報 を 文字列 で 返し ます
id 3 タグ の タイトル 文字 列 を 返し ます
この 関数 は 、 指定 し た ソースファイル を バイトコード に コンパイル し 、 開か れ て いる ファイルハンドル に 書き込み ます
オブジェクト の 圧縮 形式 を 取得 し ます
現在 の 位置 に 現在 の フォント と サイズ で text を 出力 し ます
variant の ビット 否定 演算 を 行い 、 その 結果 を 返し ます
画像 を ガンマ 補正 し ます
splfileobject によって 使わ れる フラグ を セット し ます
この メソッド は 、 splobjectstorage オブジェクト に 追加 さ れ た オブジェクト の 識別子 を 算出 し ます
現在 の 描画 色 、 不透 明度 、 線幅 を 使っ て 画像 上 に 直線 を 描き ます
この 関数 は 、 連想 配列 に おい て 各配 列 の キー と 要素 と の 関係 を 維持 しつつ ソート を 行い ます
この メソッド は 、 既存 の ハッシュ を ディスク に 保存 し ます
配列 が まだ エントリ を 持っ て いる かどう か チェック し ます
yaf _dispatcher は リクエスト を ディスパッチ し た 後 で 自動 的 に レンダリング し ます
yaf _application を 実行 し ます
新しい 日付 を 作成 し ます
属性 attribute の 値 value を 、 指定 し た ldap ディレクトリエントリ の 同じ 属性 の 値 と 比較 し ます
画像 の 配置 方法 を 取得 し ます
カレントディレクトリ を 、 指定 し た 場所 に 移動 し ます
は 、 リソース へ の 監視 を 一時 的 に 中断 し ます
イテレータ を ストレージ の 最初 の 要素 に 巻き戻し ます
現在 の directoryiterator アイテム の キー を 取得 し ます
the mqseries _put mqput は 、 メッセージ を キュー あるい は 配送 リスト に おき ます
引数 を 三つ渡し た 場合 、 この 関数 は str の コピー を 返し ます
さまざまな オプション を もと に して 、 フォームフィールドグループ を 作成 し ます
指定 し た ビット が 設定 さ れ て いる かど う か を 調べ ます
の ほう が 通常 は おすすめ です
ひとつ 前 の throwable たとえ ば exception :: __ construct の 第 三 パラメータ で 指定 し た もの を 返し ます
画像 の サイズ つまり カラム 数 と 行数 を 設定 し ます
内部 イテレータ の 現在 の 要素 を 取得 し ます
指定 さ れ た 引数 timestamp を 、 与え られ た フォーマット 文字 列 により フォーマット し 、 日付 数値 を 返し ます
情報 属性 を 定義 し ます
key -value ペア を データベース に 格納 し ます
現在 の ダッシュパターン を 黒 b および 白 w 単位 で 設定 し ます
辞書 を オープン する 際 に 使用 する 設定 を 作成 し ます
後 で 使用 する ため に 、 モデルデータ を ファイル に 保管 し ます
blob オブジェクト を 作成 し ます
パラメータ の 値 を 変数 に バインド し ます
エンコーダ の 書き込み モード を 取得 し ます
プロシージャ へ の パラメータ に関する 情報 を 取得 し ます
赤 が 一番 強い 点 を 設定 し ます
シーケンス 内 の 特定 の 画像 の フォーマット を 設定 し ます
指定 し た マイクロ 秒数 だけ プログラム の 実行 を 遅延 さ せ ます
クラス を 定義 する 拡張 モジュール の 名前 を 取得 し ます
は 、 uuencode アルゴリズム を 使用 し て 文字列 を エンコード し ます
画像 を 読み 書き する 前 に ファイル 名 を 設定 し ます
イテレータ を 、 limititerator :: __ construct で 指定 し た 開始 オフセット に 巻き戻し ます
検索 結果 エントリ から 属性 と 値 を 読み込み ます
は 、 bytea 型 の データ 文字列 を アンエスケープ し 、 エスケープ し て い ない 文字 列 、 場合 によって は バイナリデータ を 返し ます
は 、 パラメータ on _off が true の 場合 に デバッグ 出力 を 有効 に し 、 false の 場合 に は 無効 に し ます
プロパティ が 存在 する か チェック し ます
関数 は 、 c 言語 の 同名 の 関数 コール により 返さ れる 構造 体 と 同じ 内容 の 配列 を 返し ます
画像 の 周り に 三次元 の 枠線 を 追加 し ます
宣言 し て いる クラス を 取得 し ます
は 、 db2 _ prepare で 準備 さ れ た sql 文 を 実行 し ます
による ロック を その ストリーム が サポート し て いる かど う か を 調べ ます
は 、 サーバー の 統計 情報 を 含む 二 次元 の 配列 を 返し ます
で シリアライズ し た ストレージ を 復元 し ます
現在 の プロセス の タイトル を 返し ます
は 、 ispell データ を 読み込み ます
水平 方向 および 垂直 方向 の サンプリング 係数 を 取得 し ます
array 1 の キー を array 2 の キー と 比較 し 、 その 差 を 返し ます
テキスト の アノテーション に 適用 する デコレーション を 設定 し ます
mysql サーバー の バージョン を 取得 し ます
プロパティ を 取得 し ます
ある 画像 を 、 別 の 画像 の 指定 し た 位置 に 合成 し ます
を コール し て 、 ingres クライアント が 使っ て いる 文字 セット を 取得 し ます
現在 の directoryiterator アイテム の パス を 取得 し ます
splobserver に アタッチ し 、 更新 を 通知 できる よう に し ます
拡張 モジュール の 名前 を 取得 し ます
画像 に アーチファクト を 関連 づけ ます
指定 し た エラーコード に 対応 する エラーメッセージ を 返し ます
その ページ の パス の 角 の 形式 を 定義 し ます
バージョン 管理 さ れ て い ない パス path を 、 url で 指定 し た リポジトリ に コミット し ます
は array の 内部 ポインタ を 最後 の 要素 まで 進め 、 その 値 を 返し ます
アフィン 行列 の 指定 に し た がっ て 画像 を 変換 し ます
画像 の 配置 方法 を 設定 し ます
zend engine の メモリーマネージャ によっ て 使用 さ れ た メモリー を 再利 用 し ます
は 、 共有 メモリ shm _identifier を 削除 し ます
raw / gzip / zlib で 符号 化 さ れ た データ を 復元 し ます
テーブル の 主キー を 含む 結果 セット を 返し ます
指定 し た 年 year に おける 復活 祭 の 真夜 中 の unix 時 を 返し ます
と似 て い ます が 、 datetimeimmutable で 動作 し ます
指定 し た ファイルポインタ から 1 文字 読み出し ます
新しい reflectionclass オブジェクト を 作成 し ます
hyperwave サーバー について の 統計 情報 を 返し ます
指定 し た xml パーサ の カレント の バイトインデックス を 取得 し ます
特定 の 画像 チャネル の 深度 を 返し ます
ふたつ の 文字 列 の バイナリ diff を 作成 し て 結果 を 返し ます
および maxdb _real _connect で 使用 する maxdb リソース を 確保 、 あるい は 初期化 し ます
この 関数 により 、 soapserver オブジェクト の 永続 状態 を リクエスト 間 で 変更 できる よう に なり ます
radius リクエスト と 同様 、 各 レスポンス も ゼロ 個以 上 の 属性 を 含ん で い ます
通常 の 日付 パーサ を 用い て 、 パース さ れ た 相対 指定 文字 列 から dateinterval を 設定 し ます
データ と 添字 の 比較 に コールバック 関数 を 用い 、 追加 さ れ た 添字 の 確認 を 含め て 配列 の 差 を 計算 し ます
この 関数 は htmlspecialchars と 同じ です が 、 html エンティティ と 等価 な 意味 を 有する 文字 を html エンティティ に 変換 し ます
ある 1 色以 外 の すべ て の 色 の ピクセル を 削除 し ます
この 関数 は 、 キー や フルテキストクエリ を 使用 し て オブジェクト を 検索 し ます
は 、 指定 し た database 上 の テーブル の リスト を 返し ます
id 3v 2 フレーム の 配列 に id 3v 2 タグ を 関連 付け た もの を 返し ます
月 の 名前 を 含ん だ 文字列 を 返し ます
は 、 ファイルポインタ が 指す データ を ftp サーバー 上 の リモートファイル へ アップロード し ます
は 、 結果 セット に おける フィールド の 数 を 返し ます
この メソッド を コール し て はいけ ませ ん
現在 の パス の 内部 を 塗り つぶし 色 で 塗り つぶし 、 輪郭 を 輪郭色 で 描画 し ます
指定 し た エラーコード に 対応 する エラー 文字 列 を 返し ます
変数 を ユーザーキャッシュ に 追加 し ます
現在 の directoryiterator アイテム が 通常 の ファイル で ある かど う か を 調べ ます
関数 は 、 object _id で 指定 し た オブジェクト に 続く snmp オブジェクト の 値 を 取得 し ます
クエリ から 、 フィールド の 数 を 取得 し ます
現在 の directoryiterator アイテム が 実行 可能 か どう か を 調べ ます
実行 時 に 関数 を バックアップ し 、 シャットダウン 時 に リストア し ます
データベース 内 の テーブル および 関連 する 権限 情報 を 含む 結果 セット を 返し ます
さまざまな オプション を もと に 、 ディスク 上 の 画像 ファイル や 仮想 画像 ファイル を オープン し ます
単語 の スペル が 正しい 場合 に true 、 そう で ない 場合 に false を 返し ます
トップウィンドウ を 画面 から 消去 し 、 ウィンドウ が 覆っ て い た 部分 を 再描 画 し ます
指定 し た 名前 の 画像 プロファイル を 返し ます
エントリ を マップ から 削除 し ます
現在 の directoryiterator の アイテム の ファイル 名 を 取得 し ます
この 関数 は 、 キー の 詳細 bits key type を 返し ます
関数 は 、 国 コード と 地域 コード の 組み合わせ に 対応 する タイムゾーン を 返し ます
指定 し た クラス の デフォルトプロパティ を 取得 し ます
は sybase _fetch _row の 拡張 版 です
は 、 ファイル が rpm ファイル として 有効 な 形式 で ある かど う か を 調べ ます
フルテキストサーバー の 統計 情報 を 返し ます
oracle 接続 connection について 、 コミット さ れ て い ない すべ て の 変更 を 取り消し ます
reflectionfunction オブジェクト を 作成 し ます
ドット 区切り の 名前 で コレクション を 取得 する 簡潔 な 構文 です
自分 自身 の ユーザーオブジェクト を 返し ます
http 出力 文字 エンコーディング を 設定 あるい は 取得 し ます
現在 の 配列 エントリ を 取得 し ます
結果 result の フィールド 番号 offset の フィールド 長 を 返し ます
画像 あるい は 画像 シーケンス を x サーバー に 表示 し ます
クエリ の 送信 先 サーバー の ホスト 名 を 返し ます
param _name という 名前 の パラメータ を 返し ます
指定 し た コンテキスト の パラメータ を 設定 し ます
オープン し た phar アーカイブ の api バージョン を 返し ます
は 、 データベースサーバー へ の 全て の 接続 を 閉じ ます
は 、 指定 さ れ た リンク id を 閉じ て resource を 開放 し ます
id 3 タグ の アーティスト 文字 列 を 返し ます
は 、 array の 内部 ポインタ の 先頭 の 要素 に 戻し 、 配列 の 最初 の 要素 の 値 を 返し ます
は 、 トップレベル の 出力 バッファ の ステータス 情報 を 返し ます
variable で 指定 さ れ た apache 環境 変数 を 取得 し ます
新しい ページ を ドキュメント に 追加 し ます
画像 の サイズ を 指定 し た もの に 変更 し 、 関連 付け られ た プロパティ を すべ て 削除 し ます
a と b の 最大 公約 数 を 計算 し ます
は 指定 さ れ た relation _name を 解決 し 、 内部 サーバー id・ 実際 の ホスト 名 および ホスト 上 の データベース の パス を 取得 し ます
realpath キャッシュ 内容 を 取得 し ます
指定 し た 変数 が null かどう か を 調べ ます
配列 の サイズ を 、 新しい 値 size に 変更 し ます
postscript type 1 フォント を 用い て テキスト 矩形 の バウンディングボックス を 指定 し ます
は 、 size で 指定 し た 長さ に なる よう に 値 value で 埋め て array の コピー を 返し ます
この 関数 は 、 指定 し た 色 に関する インデックス を 常 に 返し ます
format によっ て 作成 さ れ た 文字列 を handle で 指定 し た ストリーム に 書き込み ます
参照 する ファイル の 型 を 返し ます
グローバル 色空間 の 値 を 取得 し ます
この メソッド は 、 flock に対応 し て コール さ れ ます
は ブラウザ もしく は クライアント に 送信 さ れる ヘッダ の 数値 配列 を 返し ます
は 、 ジャンル の id を 返し ます
現在 の 色および 線幅 で パス の 輪郭 を 描画 し 、 パス を クリア し ます
この 関数 を コール する と 、 オブジェクト を 排他 的 に 編集 する ため に ロック し ます
いくつか の データベースサーバー は 、 1つ 以上 の 行 セット 結果 セット として も 知ら れる を 返す ストアドプロシージャ を サポート し て い ます
読み込む 行 の 最大 バイト 数 を セット し ます
は 、 サーバー の バージョン 番号 を 文字列 で 返し ます
input 配列 の 要素 の うち 、 指定 し た pattern に マッチ する もの を 要素 と する 配列 を 返し ます
新しい haruannotation の インスタンス を 作成 し ます
は 、 ユーザー 定義 の 比較 関数 を 用い て 配列 の キー を ソート し ます
この 関数 は データベース 接続 の 属性 値 を 返し ます
関数 が 参照 を 返す かど う か を 調べ ます
作業 コピー 内 の ファイル や ディレクトリ の 状態 を 返し ます
カスタム の シリアライズ で 使わ れ ます .
画像 の 深度 を 取得 し ます
青 が 一番 強い 点 を 設定 し ます
直近 で 例外 を 発生 さ せ たり 失敗 し たり し た api 関数 の 名前 を 取得 し ます
この クエリ で スナップショットモード を 使い ます
hw _api _object クラス の 新しい インスタンス を 作成 し ます
何 もし ませ ん
線 がど の よう に 連結 さ れる か を 設定 し ます
public プロパティ で ある かど う か を 調べ ます
この 関数 は 、 すべて の レスポンスデータ を クライアント に フラッシュ し 、 リクエスト を 終わら せ ます
ディレクトリハンドル を オープン し ます
与え られ た 文字 列 text のすべて の 文字 が 大文字 で ある かど う か を 調べ ます
画像 の 原罪 の current 値 を 取得 し ます
8bim プロファイル の 指定 し た 名前 の パス が 存在 する 場合 に 、 それ に そっ て 切り 取り ます
arrayiterator オブジェクト を 作成 し ます
column _number で 指定 し た カラム の 名前 を 返し ます
与え られ た ファイルポインタ が 指す 位置 、 つまり 、 圧縮 さ れ て い ない ファイルストリーム に おける オフセット 値 を 返し ます
この メソッド が 、 yaf _dispatcher の 主要 な 作業 を します
この オブジェクト の 指定 し た チャネル の 値 を 設定 し ます
この 関数 は 、 バッファリング さ れ た 全て の 出力 を ファイルハンドル handle が 指す リソース に 強制 的 に 書き込み ます
ユーザーキャッシュ に 格納 さ れ た 変数 を 取得 し ます
octal _string により 指定 さ れ た 8 進数 を 1 0 進数 表現 し た 数値 を 返し ます
keys 配列 の 値 を キー として 、 また values 配列 の 値 を 対応 する 値 として 生成 し た 配列 を 作成 し ます
読み込み の セカンダリ へ の 分散 について の 情報 は 、 この マニュアル の 問い合わせ の 節 を 参照く ださい
svmmodel を 新規 構築 し ます
スロー さ れ た オブジェクト の エラーコード を 返し ます
現在 の directoryiterator アイテム の 最終 修正 時刻 を unix タイムスタンプ で 取得 し ます
この 関数 を 使用 する と 、 大量 の データ を 取得 する 際 に filter _input を 繰り返し コール する 必要 が なく なる ので 便利 です
は 、 / etc / services に 基づき 指定 し た プロトコル protocol に関し て ポート port に 関連 する インターネットサービス を 返し ます
画像 リスト 内 の 次 の 画像 を gmagick オブジェクト に 関連 付け ます
とりうる 色 の 範囲 全体 に 色 を 調整 する こと によっ て 、 カラー 画像 の コントラスト を 強調 し ます
最初 の 要素 に 巻き戻し ます
と 同様 に 、 この 関数 は 実際 に は 関数 で は なく 言語 構造 です
3 つの 文字 列 を ひとつ に 結合 し 、 その 結果 を 返し ます
この メソッド は 、 現在 の ノード を コピー し て 適切 な dom オブジェクト を 返し ます
顔文字 を パーサ に 追加 し ます
で使う イベント を 準備 し ます
指定 し た 色 マップインデックス の 色 を 設定 し ます
リモートデータベース を 空 に し ます
は 、 postgresql connection リソース で 指定 し た データベース の 名前 を 返し ます
関数 は 、 ホスト 名 あるい は ip アドレス に 対応 する インターネット 接続 方式 を 返し ます
円 を 追加 し ます
から 返さ れ た font ハンドル を 使用 し 、 指定 し た fontsize で 現在 の フォント を 設定 し ます
gmagick オブジェクト に 関連 付け られ たすべて の リソース を クリア し ます
ローカル の 時刻 ・ 日付 を 、 ロケール 設定 に も とづい て フォーマット し ます
は 、 pem エンコード 形式 の x 5 0 9 を 文字列 output に 保存 し ます
( & raquo ;& nbsp ;rfc 2 0 4 5 section 6 . 7 に 基づき 8 ビット 文字列 を quoted -printable 文字列 に 変換 し ます
apciterator から 現在 の 項目 を 取得 し ます
は 共有 メモリブロック に 文字列 を 書き込み ます
inclued データ を 取得 し ます
論理 or 処理 を 行い ます
この メソッド は エントリ を ハッシュ から 削除 し 、 削除 でき たか どう か を 返し ます
シーケンス 内 の 特定 の 画像 の フォーマット を 設定 し ます
リフレクション 対象 の メソッド を 実行 し 、 その 引数 を 配列 として 渡し ます
この 関数 は opcode キャッシュ の うち 、 特定 の スクリプト を 無効 に し ます
マップ 内 で 、 反復 処理 中 の 現在 の 位置 に ある キー が 保持 する オブジェクト を 返し ます
imap また は nntp サーバー 上 の 新しい mailbox に対し て 指定 さ れ た ストリーム を 再 オープン し ます
他 の ほとんど の oci 8 コール で 必要 な 接続 id を 返し ます
文 の 実行 で 作用 さ れ た 行数 を 取得 し ます
は 、 watch _descriptor がさす 監視 を inotify インスタンス inotify _instance から 削除 し ます
を コール し て 、 現在 の リンク で autocommit が 有効 に なっ て いる かど う か を 調べ ます
ページ の 描画 色 を 設定 し ます
mpeg ファイル の 音声 プロパティ へ の アクセス 機能 を 持つ オブジェクト を 返し ます
指定 し た 変数 が 数値 で ある かど う か を 調べ ます
指定 し た オプション の 値 を newval に 設定 し ます
gmagick オブジェクト の サイズ を 返し ます
現在 の すべ て の 一般 リソース を 配列 で 返し ます
は 、 msql サーバー から データベース を 削除 する こと を 試み ます
画像 の 輪郭 を なめらか に し ます
imagick オブジェクト の 完全 な コピー を 作成 し ます
ページ の 描画 色 を 定義 し ます
value を ヒープ に 挿入 し ます
クラス の 新しい インスタンス を 、 その クラス の コンストラクタ を 実行 せ ず に 作成 し ます
イテレータ を 最初 の 要素 に 巻き戻し ます
ノンゼロワインディング 規則 を 使用 し て 現在 の パス を 塗り つぶし ます
は 、 ジャンル id に対応 する 名前 を 返し ます
文字列 haystack の 中 で needle が 最初 に 現れる 位置 を 探し ます
この 関数 は 、 mysql 接続 に アタッチ さ れ た mysqlnd _memcache 関連 の すべ て の 設定 情報 を 配列 で 返し ます
テキスト を 現在 の 位置 に 出力 し ます
与え られ た 文字 列中 の あらゆる エンコード 文字 % # # を デコード し ます
指定 し た 変数 が スカラ か どう か を 調べ ます
オブジェクト へ の リンク を 作成 し ます
現在 の pdf ファイル の 中 に ターゲット へ の リンク 注記 を 追加 し ます
指定 し た curlm エラーコード に 対応 する エラーメッセージ の 文字列 を 返し ます
により truecolor イメージ に 二つ の 異 なる 描画 モード を 使用 可能 と なり ます
この 関数 は 次 の 関数 の エイリアス です
指定 し た フィールドインデックス の 名前 を 返し ます
yaf _application の インスタンス を 取得 し ます
引数 で 指定 し た 文字 列中 の 特殊 文字 の 前 に バックスラッシュ を 追加 し ます
エクスポート し ます
は 、 現在 の セッションデータ 保存 パス を 返し ます
イテレータ を 次 の ノード に 移動 し ます
最後 に 見つかっ た エラー を 返し ます
指定 し た ディレクトリエントリ の 名前 を 返し ます
フォント font _index を 展開 また は 圧縮 し ます
内部 ポインタ を 先頭 に リセット し ます
インデックス index 0 から 始まる を 持つ 要素 の 値 を 返し ます
ldap ディレクトリ へ の バインド を 解除 し ます
ファイル の inode を 取得 し ます
ファイル の グループ id を 取得 し ます
2 つの gmp 数 の ビット or を 計算 し ます
画像 の 輪郭 から ピクセル を 刈り 取り ます
指定 し た 設定 オプション を 元 の 値 に 戻し ます
現在 の 変換 行列 を 明示 的 に 設定 し ます
は 機能 的 に memcached :: getdelayed と 同等 です
ある 数 の 絶対 値 を 返し ます
タイムスタンプハンドラコールバック として 登録 し た 関数 を コール し ます
データベースハンドル の 属性 を 設定 し ます
指定 し た curl ハンドル に 設定 さ れ て いる すべ て の オプション を 初期化 し て デフォルト 値 に 戻し ます
画像 の マット 色 を 設定 し ます
プリペアドステートメント を 閉じ ます
は memcached :: set と 似 て い ます が 、 key が 既 に サーバー 上 に 存在 する 場合 は 失敗 し ます
ラージオブジェクト の 内容 を 返し ます
イテレータ の 最初 の 要素 に 巻き戻し ます
クローン し ます
mime メールリソース を 作成 し ます
ある 画像 を 、 別 の 画像 の 指定 し た 位置 に 合成 し ます
現在 の directoryiterator アイテム の パーミッション を 取得 し ます
変数 を ビューエンジン に 代入 し ます
は 機能 的 に memcached :: cas と 同等 です
イテレータ を 先頭 に 巻き戻し ます
一時的 な ラージオブジェクト を 生成 し 、 data を 書き込み ます
パラメータ として タイプヒント さ れ た クラス を 、 reflectionclass オブジェクト として 取得 し ます
ポール の 所要 時間 が nseconds 秒 を 超える と 、 処理 を 止め ます
文字列 str に 、 バイナリ 形式 の パッチ patch を 適用 し ます
その 接続 に おける すべ て の 実行 中 の トランザクション を コミット し ます
ハッシュ の 要素 数 を 返し ます
特定 の 画像 チャネル の 深度 を 設定 し ます
内容 を 指定 し て 、 ファイル を zip アーカイブ に 追加 し ます
有効 な mime ヘッダフィールド を 作成 し 、 返し ます
関数 は 、 その ip アドレス が 割り 当て られ て いる 組織 の 名前 を 返し ます
recursiveiterator から recursiveiteratoriterator を 作成 し ます
エントリ 名 を 使用 し て 、 エントリ の コメント を 返し ます
開い て いる ファイルハンドル に すべて の 画像 フレーム を 書き出し ます
指定 し た パス から 、 ファイル を zip アーカイブ に 追加 し ます
指定 し た ファイル が シンボリックリンク か どう か を 調べ ます
データベース から 、 レコード を 配列 形式 で 取得 し ます
は 、 ファイルシステム の 状態 を callback の result で 返し ます
は 、 指定 さ れ た リンク id が 指す データベース を サーバー 上 の 現在 アクティブ な データベース に 設定 し ます
イテレータ の 情報 を アタッチ し ます
関数 は 、 socket パラメータ で 指定 し た ソケット から o _nonblock フラグ を 取り除き ます
クラス の コンストラクタ を 取得 し ます
この メソッド は エントリ を セット から 削除 し 、 削除 でき たか どう か を 返し ます
は 、 配列 の 値 の 積 を 計算 し ます
新しい 値 を 最後 の 要素 として 追加 し ます
子 プロセス を 停止 さ せ た シグナル 番号 を 返し ます
現在 の 実行 プロセス を 別 の アクション に 転送 し ます
画像 に 関連 づけ られ た アーチファクト を 取得 し ます
直線 や 多角 形 を 高速 に 描画 する ため の アンチエイリアス 機能 を 有効 に し ます
指定 し た 値 を yield の 結果 として ジェネレータ に 送り 、 ジェネレータ を 続行 し ます
指定 し た 角度 だけ 画像 を 回転 さ せ ます
最初 の 内部 イテレータ の 最初 の 要素 まで 巻き戻し ます
画像 image を 、 angle で 指定 さ れ た 角度 だけ 回転 し ます
この スレッド を 作っ た スレッド の id を 返し ます
は 、 指定 し た calendar について の 情報 を 返し ます
直近 の リクエスト に対する レスポンス を その まま の 形式 で 取得 し ます
その クラス で 特定 の 定数 が 定義 さ れ て いる かど う か を 調べ ます
内部 の 配列 ポインタ を ひとつ 前 に 戻し ます
パレットイメージ の 色 を true カラーイメージ に 近づけ ます
gender オブジェクト を 作り ます
は 、 指定 し た host へ の 明示 的 な ssl -ftp 接続 を オープン し ます
title 属性 を 返し ます
scm データベース から サービス の 削除 を 試み ます
は 、 インターレースビット を on また は off に 切り 替え ます
リモートファイルサーバー に mode で 指定 さ れ た 権限 で ディレクトリ を 作成 し ます
指定 し た curl セッションハンドル の オプション を 設定 し ます
結果 セット 内 の 指定 し た カラム の 位置 を 返し ます
は 、 relation から タプル を すべ て 削除 し ます
object _id で 指定 し た snmp オブジェクト を get クエリ で 取得 し ます
gmagick オブジェクト の サイズ を 設定 し ます
この 関数 を 使っ て 、 フェッチ を 実行 する 前 に 結果 セット の カーソル を 移動 する こと が でき ます
この オプション は 、 シャード に 到達 でき ない 場合 に mongos が 部分 的 な クエリ 結果 を 送信 する よう に し ます
オフセット の 値 を 削除 し ます
画像 に ラジアルブラー を 施し ます
イテレータ が 現在指 し て いる オブジェクト に データ あるい は 情報 を 関連 づけ ます
ファイル file に バイナリ 形式 の パッチファイル patch を 適用 し 、 結果 を ファイル dest に 保存 し ます
パス の 終端 に 使用 する 形式 を 定義 し ます
直近 の insert 、 update 、 replace あるい は delete クエリ により 変更 さ れ た 行 の 数 を 返し ます
現在 の ノード の 中身 を 、子ノード や マークアップ も 含め て 読み込み ます
mysql により 一番 最近 に 取得 さ れ た 行 に おける 各 フィールド の 長さ を 格納 し た 配列 を 返し ます
この メソッド は 、 シリアライズ し た ハッシュ を 返し ます
ハッシュ の 要素 数 を 返し ます
この メソッド は 、 子要素 を 数え ます
は 、 指定 し た ファイル 名 の 画像 を 表す 画像 id を 返し ます
カレント の ワーキングディレクトリ を 返し ます
は 、 配列 array から 全 て の キー 数値 および 文字列 を 返し ます
この メソッド は 、 mkdir に対応 し て コール さ れ ます
この メソッド は 、 ストリーム の オプション を 設定 する 際 に コール さ れ ます
は 、 pg _put _line による コピー 操作 の 後 で postgresql フロントエンド （ 通常 は web サーバー プロセス ） と postgresql サーバー を 同期 さ せ ます
は 、 他 の 全て の 引数 に 存在 する array 1 の 値 を 全て 有 する 配列 を 返し ます
画像内 の 色 を 、 hald ルックアップテーブル を 使っ て 置換 し ます
指定 し た エントリ を ldap ディレクトリ から 削除 し ます
この 関数 で 、 inotify _read が ブロック さ れる かど う か を 知る こと が でき ます
ページ の 表示 を 拡大 し 、 バウンディングボックス の 幅 に あわせる よう に し ます
指定 さ れ た 接続 に 新規 カーソル を 割り 当て ます
文字列 content から 新しい コンテンツオブジェクト を 作成 し ます
画像 の mime type を 設定 し ます
循環 参照 コレクタ の 状態 を 返し ます
リモートデータベース の 統計 情報 を 取得 し ます
セッションデータベースサーバー と の 接続 を リセット し ます
エージェントエラーメッセージ を 取得 し ます
は 、 path に関する 情報 を 返し ます
id で 表さ れる サーバー の （ 直近 の リクエスト について の ） エラー 番号 を 返し ます
left を right で 除算 し 、 剰余 を 返し ます
needle が haystack の 中 で 最後 に 現れる 位置 を 探し ます
リフレクション を エクスポート し ます
インデックス の 情報 および テーブル の 統計 情報 を 含む 結果 セット を 返し ます
は 、 生 の http ヘッダ を 送信 する ため に 使用 さ れ ます
いっ たん エラーコード が 設定 さ れる と 、 入出 力処 理 を 含む 大半 の 操作 が 実行 でき なく なり ます
variant を 、 decimals で 指定 し た 桁 で 丸め た 結果 を 返し ます
指定 し た フィールド に 値 value を 設定 し ます
arg の アークハイパボリックタンジェント を 返し ます
現在 の ファイル の 親 を 表す splfileinfo オブジェクト を 取得 し ます
最後 に 発生 し た エラー について の 情報 を 取得 し ます
プリペアドステートメント で 使用 する sql 文 の 中 で 、 対応 する 名前 あるい は 疑問 符 の プレースホルダ に 値 を バインド し ます
で 作成 し た 、 paradox データベース の テーブル 名 を 設定 し ます
は php の umask を mask & amp ; 0 7 7 7 に セット し 、 元 の umask 値 を 返し ます
あるい は filesystemiterator :: setflags で 設定 し た 処理 フラグ を 取得 し ます
画像 を 識別 し 、 属性 を 返し ます
パラメータ で 渡さ れ た バイナリデータ を udf に デコード し ます
str の 最初 の 文字 が アルファベット で あれ ば 、 それ を 大文字 に し ます
php の 配列 array を 、 新しい splfixedarray インスタンス に インポート し ます
は 、 指定 し た クエリ を ingres サーバー に 送信 し ます
指定 し た 辞書 の パーソナル 単語 リスト に 、 単語 を 追加 し ます
ひとつ あるい は 複数 の 画像 を ひとつ にまとめ ます
指定 し た ソケット 接続 の ローカル また は リモート で の 名前 を 返し ます
現在 の コントローラオブジェクト を 取得 し ます
ファイル の 所有 者 を 取得 し ます
type 3 フォント の グリフ 定義 を 開始 し ます
は 、 postgresql データベース へ の 問い合わせ に 使う リテラル を エスケープ し ます
イテレータ が 有効 か どう か を 調べ ます
指定 し た image の 指定 し た 座標 を 中心 として 楕円 を 描画 し ます
この メソッド は closedir に対応 し て コール さ れ ます
指定 し た サイズ と 位置 で ウィンドウ を オープン し ます
この 関数 は 次 の 関数 の エイリアス です
持続 的 な データベース 接続 を 開き ます
は 、 プロトコル name の プロトコル 番号 を / etc / protocols から 取得 し て 返し ます
ドキュメント が 使用 し て い た メモリ を 開放 し ます
fam サービスデーモン へ の 接続 を オープン し ます
プリペアドステートメント に 含まれる 以下 の よう な 情報 を 直接 出力 し ます
http 上 で soap リクエスト を 実行 し ます
value 1 と value 2 を 比較 し ます
リクエストトークン の パス を 設定 し ます
更新 ログ から データベース を リストア し ます
指定 し た 秒数 だけ プロセス を ブロック し ます
指定 し た ハンドル から 一行 取得 し ます
キー を 指定 し て ハッシュ から 値 を 取得 し ます
レイヤー 間 の 階層 や グループ 関係 を 定義 し ます
直近 の snmp リクエスト の エラーコード を 返し ます
result _id の クエリ について 、 フィールド 名 を キー とし 、 sql フィールド 型 を データ と し た 連想 配列 を 返し ます
ユーザー 単位 の クォータ 設定 を 取得 し ます
新規 パターン の 定義 を 開始 し ます
座標系 の 原点 を 変更 し ます
var の float 値 を 返し ます
文 の 結果 を 表す 一文字 の 文字 列 、 そして 、 直近 に 実行 さ れ た sql 文 について の sqlstate と sqlcode を 返し ます
新しい quickhashintset オブジェクト を 作り ます
指定 し た 暗号 化 ハンドル を 閉じ ます
この 関数 は 、 php スクリプト が opcache に キャッシュ さ れ て いる か チェック し ます
str の 3 2 ビット 長 の crc cyclic redundancy checksum チェックサム を 生成 し ます
この メソッド は 、 unlink に対応 し て コール さ れ ます
フォント の 垂直 ascent ベースライン の 上側 の 高さ を 取得 し ます
画像 の ガンマ を 取得 し ます
この 関数 は 、 php 開発 者 、 モジュール 等 の リスト を 有する クレジット を 出力 し ます
次 の 行 に text を 出力 し ます
1 行分 の テキスト を 、 さまざまな オプション に 基づい て ページ 上 に 配置 し ます
ファイル source を dest に コピー し ます
は 、 filename で 指定 さ れ た リソース を ストリーム に 結び付け ます
mongo id から pid を 取り出し ます
は 、 指定 し た 文字 列 value を 既存 の アイテム の 値 として 追記 し ます
現在 の プロセス の 実効 グループ id を 設定 し ます
指定 し た timestamp まで スクリプト の 実行 を 遅延 さ せ ます
全て の プロパティ 名 の 配列 を 返し ます
は 、 old で 指定 し た タプル new から の データ で 置換 し ます
指定 さ れる パラメータ が gmt 日付 を 表す こと 以外 は mktime と 同じ です
組み込み の 簡体 字中 国語 フォント を 有効 に し ます
指定 し た 結果 id から 、 行 を 疑似 オブジェクト として 取得 し ます
は 、 配列 を 反転 し て 返し ます
新しい quickhashintstringhash オブジェクト を 作り ます
正規 表現 フラグ を 返し ます
は 読み込ん だ テキスト から html および php タグ を 全て 取り除こ う と する こと を 除い て 、 gzgets と 同じ です
成功 し た 場合 に gmagickpixel オブジェクト を 返し ます
は 、 全て の 引数 に 現れる array 1 の 全て の 値 を 含む 配列 を 返し ます
乱数 を 生成 し ます
与え られ た ファイルポインタ が 指す ファイル の ファイル 位置 記述子 を 、 ファイルストリーム 上 の 与え られ た offset バイト に セット し ます
変数 を 順 に 追加 し て いく ため の 新しい wddx パケット を 開始 し ます
この 関数 は 、 mode が ブロックアルゴリズム を 使用 する 場合 に true 、 その 他 の 場合 に false を 返し ます
は 、 gopher フォーマット さ れ た ディレクトリエントリ を 連想 配列 に 変換 し ます
は 、 handler を 用い て mode を 指定 し 、 path に データベースインスタンス を 生成 し ます
この 関数 は バックティック 演算子 と 等価 です
全て の 種類 の 注記 の 境界 色 を 設定 し ます
テキスト の アノテーション で 使う フォント を 表す 文字 列 を 返し ます
一意 な id を テーブルデータベース に 生成 し ます
結果 に おける 、 ある エントリ の dn を 見つけ ます
関数 は 、 ホスト 名 あるい は ip アドレス に 対応 する 三文字 の 国 コード を 返し ます
画像 の 長さ を バイト 数 で 返し ます
リモートファイルシステム 上 に target を 指す link という 名称 の シンボリックリンク を 作成 し ます
は 、 / etc / services に 基づき 指定 し た プロトコル protocol に関し て service に対応 する インターネットポート を 返し ます
テーブル および それ に 関連 付け られ たすべて の データ 構造 を 削除 し ます
グラフィックツリー で 使う 接頭 辞 を 設定 し ます
は 、 画像 image から jpeg ファイル を 作成 し ます
haystack におい て needle が 最初 に 見つかっ た 位置 を 含め て そこ から 最後 まで を 返し ます
終了 さ せる proc _open を 用い て 生成 さ れ た process に シグナル を 送信 し ます
新しい リレーション を 作成 し ます
画像 の 背景 色 と 同じ色 の 輪郭 を 削除 し ます
画像 タイプ 属性 を 設定 し ます
array 1 の キー を array 2 の キー と 比較 し 、 その 差 を 返し ます
シェーディング 用 の パターン を 作成 し ます
str を 16 進 表現 に 変換 し た ascii 文字列 を 返し ます
ファイル から 1 行読 み 込み 、 sprintf の ドキュメント で 説明 さ れる 規定 の format に 従っ て 解釈 さ れ ます
ある オブジェクト が クラス の インスタンス で ある かど う か を 調べ ます
number の 絶対 値 を 返し ます
ldap リンク id を 作成 し て 、 指定 し た host および port が 妥当 で ある かど う か を 調べ ます
オートコミットモード を オフ に し ます
クラス の 新しい インスタンス を 作成 し ます
url エンコード さ れ た パラメータ に対する 配列 を 返し ます
と似 て い ます が 、 datetimeimmutable で 動作 し ます
既知 の encoding タイプ に関する エイリアス の 配列 を 返し ます
総数 を 取得 し ます
は 、 バッファ さ れ た 結果 セット result の カレントレコード の インデックス を 返し ます
は 、 直近 の リクエスト で 残っ て いる すべ て の 結果 を 返し ます
大文字 小文字 を 区別 し ない バイナリセーフ な 文字 列比 較 を 行い ます
垂直 方向 に 反転 さ せ た 画像 を 作成 し ます
単語 の スペル が 正しい 場合 は true 、 そう で ない 場合 は false を 返し ます
この 関数 は 、 ビルトイン さ れ て いる 画像 を 使っ て zend ロゴ を 表示 する 際 に 使用 できる id を 返し ます
画像 の ガンマ を 設定 し ます
filename という 名前 の ファイル が http post により アップロード さ れ た もの で ある 場合 に true を 返し ます
インターフェイス を 取得 し ます
この 関数 は 次 の 関数 の エイリアス です
文字列 から データ を 読み込み ます
realpath キャッシュ で 使用 さ れる メモリー 量 を 取得 し ます
アルファブレンディングフラグ を 設定 し 、 libgd に バンドル さ れ て いる レイヤ 効果 を 使用 し ます
静的 な プロパティ の 値 を 設定 し ます
別 の ストレージ に 含ま れ て いる オブジェクト を 現在 の ストレージ から 取り除き ます
は postgresql へ の 接続 を オープン し ます
ドキュメント 情報 フィールド key に value を 設定 し ます
結果 セット 内 の 指定 し た カラム の 精度 を 返し ます
radius パラメータ で 定義 し た ブロック 内 の 各 ピクセル を 、 ランダム に 移動 さ せ ます
は 、 指定 し た 座標 に ピクセル を 描画 し ます
文字列 を 配列 に 変換 し ます
ページ の 行間 隔 を 設定 し ます
指定 し た 名前 の 画像 プロファイル を 返し ます
指定 し た インデックス の 値 を 解除 し ます
現在 の エントリ の イテレータ を 返し ます
呼び出し元 の コンテキスト が 、 この スレッド の 実行 終了 を 待つ よう に し ます
関数 sscanf は 、 printf の 入力 版 です
検証 の 際 に 使用 する relaxng スキーマ を 含む データ を 設定 し ます
フィールド の データ 型 の 名前 を 返し ます
保存 し た 整数 値 を 増や し ます
テキストブロック を 、 その プロパティ に 基づい た さまざまな データ で 塗り つぶし ます
現在 の データベース の プロファイリングレベル を 変更 し ます
モーションブラー を シミュレート し ます
結果 セット 内 の 行 を 表す 、 カラム 位置 を インデックス と する 配列 を 返し ます
例外 の 深刻 度 を 返し ます
ascii で 指定 さ れ た 、 1 文字 から なる 文字 列 を 返し ます
ロケール 情報 を 設定 し ます
yaf _application の インスタンス を 取得 し ます
事前 に gnupg _adddecryptkey で 設定 さ れ た キー を 使用 し 、 指定 さ れ た テキスト を 復号 し ます
は 公開鍵 を certificate から 抽出 し 、 他 の 関数 で 使用 できる よう 準備 し ます
セッション の データ を セッションストレージ から 読み込み 、 その 結果 を 返し ます
ユーザーキャッシュ に 格納 さ れ て いる すべ て の 値 を 消去 / 削除 し ます
の よう な 関数 で 作っ た パレット 形式 の 画像 を 、 imagecreatetruecolor で 作る よう な true color 形式 に 変換 し ます
filename で 指定 さ れ た ファイル の 最終 更新 日 を 、 time で 指定 さ れ た 値 に セット しよ う と 試み ます
指定 し た リンク id が 指す 現在 アクティブ な データベース に クエリ query を 送信 し ます
は 、 指定 し た 補間 アルゴリズム を 使っ て 画像 の 縮尺 を 変更 し ます
スクリプト の 現在 の 実行 ディレクトリ の パス を 、 絶対 パス で 取得 し ます
直接 呼出 し さ れ て はいけ ませ ん
利用 可能 な 暗号 メソッド の 一覧 を 取得 し ます
ドキュメント に 所有 者 パスワード および ユーザーパスワード を 設定 し ます
ファイルポインタ から 内容 を 読み込む際 に 最も適し た エンコーディング を 調べ ます
この 関数 が closure で ある かど う か を 調べ ます
value 1 と value 2 を 比較 し ます
ふたつ の 数 を 比較 し ます
指定 し た メールボックス mbox に 文字列 メッセージ message を 追加 し ます
 ;& nbsp ;rfc 8 2 2 準拠 の 受信 者 リスト 、 たとえ ば to : ヘッダ の 内容 など を パース し ます
xml ドキュメント を 文字 列 から 読み込み ます
名前 を 指定 し て ルート を 取得 し ます
は 機能 的 に memcached :: touch と 同等 です
ディスク 上 の 定義 ファイル から 新しい ハッシュ を 作る ファクトリーメソッド です
属性 が 編集 可能 か どう か を 調べ ます
この 関数 は 、 tidy の 設定 を デフォルト 値 に 戻し ます
現在 の 描画 色 と 太さ を 使っ て 、 指定 し た 座標 に 点 を 描き ます
セキュリティ 設定 を 取得 し ます
ラージオブジェクト あるい は ラージオブジェクト の 一部 を 他 の ラージオブジェクト に コピー し ます
指定 し た clob の 大きさ を 取得 し ます
指定 し た 色数 まで 画像 を 減色 し ます
frontbase の 結果 セット result から 、 ひとつ の セル の 内容 を 返し ます
画像 の 一部 を 抽出 し ます
現在 の ページモード を 取得 し ます
index で 指定 し た 添字 の 値 を newval に 設定 し ます
base 6 4 で エンコード さ れ た テキスト text を デコード し ます
2 つの 数 を 加算 し ます
uri を & raquo ;& nbsp ;rfc 3 6 8 6 形式 で エンコード し ます
追加 の 入力 を 待た ず に 、 端末 の 入力 バッファ の 内容 を クリア し ます
オブジェクト を 塗り つぶす とき に 使う 色 を 返し ます
指定 し た メッセージ について 、 imap _delete また は imap _mail _move で 設定 さ れ た 削除 フラグ を はずし ます
指定 し た ch ハンドル を 、 mh ハンドル から 削除 し ます
この 関数 は 、 event で 指定 し た 登録 済み の イベントハンドラ を キャンセル し ます
left _operand を right _operand に 加算 し ます
 ;& nbsp ;iptc ブロック を パース し ます
この 関数 は htmlspecialchars の 反対 です
この メソッド を コール し て はいけ ませ ん
ひとつ あるい は 複数 の 画像 チャネル の 平均 値 および 標準 偏差 を 取得 し ます
指定 し た キー について の 排他 ロック を 確保 し ます
指定 し た クラス を 継承 し て いる 、 あるい は 指定 し た インターフェイス を 実装 し て いる かど う か を 調べ ます
リスト 内 で ひとつ 先 に 進ん だ とき にまだ オブジェクト が 画像 を 保持 し て いれ ば true を 返し ます
実行 可能 で ない tar / zip アーカイブ は スタブ を 持つ こと が でき ない ので 、 この メソッド は 単 に 例外 を スロー し ます
は 、 arg の タンジェント を 返し ます
ディスクリプタ あるい は lob ロケータ を 保持 する リソース を 確保 し ます
指定 し た カラム に インデックス を 設定 し ます
で 事前 に 登録 を 解除 し た 組み込み ラッパー を 復元 し ます
x および y を 指定 し て 画像 を 補正 し ます
タイムスタンプ ノンス ハンドラコールバック を 設定 し ます
新しい 画像 を 、 ソースオブジェクト の 現在 位置 から gmagick オブジェクト に 追加 し ます
現在 アクティブ な サブイテレータ を 取得 し ます
与え られ た 文字 列 text のすべて の 文字 が 実際 に 目 に 見える 出力 を 行う か どう か を 調べ ます
変数 名 と その 値 から 配列 を 作成 し ます
は 、 queue で 指定 し た メッセージキュー を 破棄 し ます
スロー さ れ た オブジェクト の インスタンス が 作られ た 行番 号 を 返し ます
読み込み および 書き込み イベント の ウォーターマーク を 設定 し ます
は 、 指定 し た フィールドインデックス の 型 を 取得 し ます
imagemagick api の 著作 権情 報 を 文字列 で 返し ます
トークンハンドラコールバック を 設定 し ます
大文字 小文字 を 区別 し ない & quot ; 自然順 &quot ; アルゴリズム を 使っ て 、 値 で エントリ を ソート し ます
内部 ポインタ を ラージオブジェクト の 先頭 に セット し ます
指定 し た url から 読み込ん だ yaml ドキュメントストリーム 全体 ある い は その 一部 を 、 php の 変数 に 変換 し ます
この 関数 は 、 zlib データフォーマット を 用い て 与え られ た 文字列 を 圧縮 し ます
は sybase _fetch _row で 数値 インデックス の かわり に カラム 名 を 使用 する バージョン です
指定 し た 文字 を unicode に 変換 し ます
クラスメソッド の 名前 を 取得 し ます
新しい domattr オブジェクト を 作成 し ます
この 関数 は 、 配列 を シャッフル 要素 の 順番 を ランダム に します
書記 素単 位 バイト 数 や 文字数 で は あり ませ ん で 文字 列 の 長さ を 取得 し ます
この 関数 は 、 domentityreference クラス の 新しい インスタンス を 作成 し ます
この 関数 は pdflib gmbh で サポート さ れ て いませ ん
は 、 jd で 指定 し た ユリウス 日 を 指定 し た calendar に 変換 し ます
soapfault の 文字 列表 現 を 返し ます
属性 の 数 を 返し ます
画像 の 解像 度 を 設定 し ます
この 関数 は 圧縮 さ れ た 文字列 を 解凍 し ます
imap タイムアウト を 設定 あるい は 取得 し ます
現在 の directoryiterator アイテム が 書き込み 可能 か どう か を 調べ ます
新しい haruoutline の インスタンス を 作成 し ます
