solrdocument に対する コンストラクタ
非 ascii テキスト の mime メッセージヘッダエクステンション を デコード し ます & raquo ;& nbsp ;rfc 2 0 4 7 を 参照く ださい 
画像 を x 軸方 向 あるい は y 軸方 向 に 押しつぶし 、 平行 四 辺形 を 作成 し ます
認証済 み 公開鍵 を 取り除き ます
と同じ 簡易 な 方法 で ファイル を ロック もしく は ロック 解除 する
は 、 パレット を source から destination に コピー し ます
param _arr に パラメータ を 指定 し て 、 callback で 指定 し た ユーザー 定義 関数 を コール し ます
この 関数 は 、 指定 し た イベント の うち の ひとつ が データベース で 発生 する まで スクリプト の 実行 を 停止 し ます
調べ た 関数 を エクスポート し ます
この 関数 を 使っ て 、 どの ドライバモジュール を ログ に 記録 する のか を 設定 し ます
gd 2 ファイル また は url から 新規 イメージ を 生成 し ます
ディレクトリ を 読む ため の 疑似 オブジェクト 指向 の 機構 です
インクルードパス に対し て filename を 解決 し ます
現在 の リクエスト から 返さ れる レスポンス に soap ヘッダ を 追加 し ます
odbc クエリ から 、 オブジェクト を 取得 し ます
画像 の 解像 度 の 単位 を 取得 し ます
参照 で 渡さ れ た 引数 に 、 現在 の 端末 の 大きさ を 格納 し ます
現在 使用 中 の フォント を 取得 し ます
この 関数 は 、 関連 付け られ た 名前 空間 に 新しい 要素 を 作成 し ます
は 、 grp で 指定 し た グループリクエスト を キャンセル し ます
この 関数 は 、 インポート する ノード の コピー を 返し 、 それ を 現在 の ドキュメント に 関連 付け ます
関数 と 同じ です が 、 返さ れる 時刻 が グリニッジ 標準 時 gmt で ある ところ が 異 なり ます
初 期化 ベクトル を 、 ランダム な ソース から 作成 し ます
は 、 指定 さ れ た リンク 名 link で 既存 の ファイル target へ の シンボリックリンク を 作成 し ます
protected メソッド で ある かど う か を 調べ ます
ファイルキャッシュ の 中身 と その 利用 状況 について の 情報 を 取得 し ます
は 、 結果 リソース の ステータス あるい は 結果 に関する コマンド 補完 タグ を 返し ます
dir _handle で 指定 さ れ た ディレクトリ の ストリーム を ディレクトリ の 先頭 に リセット し ます
この 関数 は 、 データ を 復号 し ます
現在 の 設定 を 指定 し た ファイル に 保存 し ます
指定 し た relation に 書き込み ロック を 要求 し ます
指定 し た キー の 変数 を old _value と 比較 し 、 マッチ し た 場合 は そこ に new _value を 代入 し ます
この 関数 により 特定 の 接続 また は クエリー 結果 に関する odbc オプション を 変更 する こと が 可能 と なり ます
この 関数 は 、 文字列 source に 含ま れる html を パース し ます
は 、 id3v 2 フレーム の 短い 名前 を 返し ます
ssh 2 チャネルストリーム と 関連 付け られ た サブストリーム を 取得 し ます
は 、 2 つの 違い を 除い て sybase _connect と 全く 同様 に 動作 し ます
コマンド を サーバー に 送信 し 、 その 結果 を 待ち ます
通常 失敗 する （ そし て そう ある べき ）& quot ;none &quot ; 認証 を 試み ます
slob オブジェクト から nbytes バイト を 読み こみ ます
文字列 の 汚染 を 除去 し ます
arrayobject を シリアライズ し ます
この 関数 は 、 ファイル の ブロックデータ が 書き込ま れ た 時間 を 返し ます
オブジェクト の フォントプロパティ を 返し ます
command で 指定 し た コマンド の フォーク によっ て でき た プロセス へ の パイプ を オープン し ます
オブジェクト を 文字列 で あらわし た もの を 返し ます
splfileobject は 子 を 持た ない の で この メソッド は null を 返し ます
は 、 事前 に openssl _private _encrypt で 暗号 化 さ れ た data を 復号 し 、 それ を decrypted に 格納 し ます
画像 の 極値 を 取得 し ます
この 関数 は 、 チェックボックスリソース の 現在 の 値 を 設定 し ます
フィールド field の サイズ を 返し ます
この libev の バイナリ に 組み込ま れ たすべて の バックエンド と 、 中 でも この プラットフォーム 上 で おすすめ の バックエンド を 返し ます
画像 の サイズ を 設定 する ため の 便利 な メソッド です
ファイル を バイトコードキャッシュ に 保存 し 、 すべて の フィルタ を バイパス し ます
破線 の 「線 」 の 部分 と 「 空白 」 の 部分 の 長さ を 設定 し ます
kerberos データベース から 、 プリンシパル の エントリ を 取得 し ます
接続 で 使用 する ユーザー 名 を 取得 あるい は 設定 し ます
は 、 指定 し た postgresql result リソース の 指定 し た field _number に ある フィールド の 名前 を 返し ます
外部 エンティティ 読み込み 機能 の 有効 / 無効 を 切り 替え ます
curl の バージョン について の 情報 を 返し ます
直近 の fdf 関数 コール によっ て 設定 さ れ た エラーコード を 取得 し ます
この 関数 は 、( ある 場合 に 出力 バッファ の 内容 を 送信 し ます
mysql クライアントライブラリ の バージョン を 表す 文字 列 を 返し ます
新しい tokyotyrantiterator オブジェクト を 作成 し ます
この splfileinfo オブジェクト が 参照 する ファイル が 存在 し 、 通常 の ファイル で ある かど う か を 調べ ます
リソース を 取得 し ます
オブジェクト の デフォルト 背景 色 を 設定 し ます
left の right 乗 を 返し ます
ldap ページネーション を 有効 に する ため 、 ページネーション 制御 情報 ページサイズ や クッキー など を 送信 し ます
呼び出し 元用 に 、 別 スレッド が 所有 する ロック し て いる ミューテックス を 、 ブロック せ ず に ロック しよ う と 試み ます
2 つの gmp 数 の ビット 排他 的 論理 和 xor を 計算 し ます
画像 の 色 を 打ち消し ます
left _operand を right _operand で 除算 し ます
フィールド が 存在 する か チェック し ます
アクティブ な セッション から サーバーホスト 鍵 の ハッシュ を 返し ます
は 、 新しい 秘密 鍵 と 公開鍵 の 鍵ペア を 作成 し ます
画像 の ページ の ジオメトリ を 設定 し ます
被除数 （ x ） を 除数 （ y ） で 割っ た 余り を 返し ます
arg の アークハイパボリックコサイン を 返し ます
オフセット が 存在 する かど う か を 返し ます
訓練 データ を 受け 取る 準備 が でき て いる svm オブジェクト を 新規 構成 し ます
この 関数 は 次 の 関数 の エイリアス です
スタック 内 の 各 ハンドル を 処理 し ます
スクリプト の エラー 処理 を 行う ユーザー 関数 error _handler を 設定 し ます
これ は 、 データベース を 取得 する ため の 一番すっきり とし た 方法 です
imagick が サポート する フォーマット を 返し ます
現在 の エントリ の イテレータ を 作れる かど う か を 返し ます
主 な 検索 クエリー を 返し ます
あと で 使用 する ため に 、 フォント を 読み込み ます
現在 の gmagick オブジェクト へ の 参照 を 返し 、 画像 ポインタ を 正しい シーケンス に 設定 し ます
現在 位置 を 次 の 行 の 行頭 に 移動 し て テキスト を 表示 し ます
この メソッド は 追尾 可能 な カーソル に対し て 使い ます
購読 し て いる すべ て の メールボックス の 配列 を 取得 し ます
この メソッド は 、 liquid rescale という 方法 で 画像 を 拡大 ・ 縮小 し ます
直近 の 文 で 影響 を うけ た 行 の 数 を 取得 し ます
指定 し た 位置 に 文字列 を 表示 し ます
新しい domentityreference オブジェクト を 作成 し ます
と似 て い ます が 、 datetimeimmutable で 動作 し ます
は 、 指定 し た image から 得 られ た イメージ を 表す イメージ id を 返し ます
警告 mcrypt _generic _deinit を 使用 し て くだ さい
public メソッド で ある かど う か を 調べ ます
データ に 依存 する 三角 測量 に も とづい て 画像 の サイズ を 変更 し ます
mime ヘッダエンコーディング 方式 によっ て 文字 列 str を エンコード し ます
その クラス が 内部 クラス で は なく ユーザー が 定義 し た もの で ある かど う か を 調べ ます
mongocursor クラス に は 、 クエリオブジェクト の フラグ を 設定 する いくつか の メソッド が あり ます
関数 は 、 ホスト 名 あるい は ip アドレス に 対応 する レコード 情報 を 返し ます
オブジェクト が ストレージ 内 に 存在 する かど う か を 調べ ます
データベース から 取得 し た オブジェクト の 場合 は データベース 上 の 既存 の オブジェクト を 更新 し 、 それ 以外 の 場合 は オブジェクト を 追加 し ます
画像 の レベル を 調整 し ます
解像度 を 配列 で 取得 し ます
拡張 モジュール の 情報 を エクスポート し ます
は 、 呼び出し元 の スクリプト の 実行 を いっ たん 停止 さ せ 、 set で 指定 し た シグナル を 受け 取る まで 待ち ます
ベース uri を 設定 し ます
反復 処理 を 開始 する とき 最初 に recursivetreeiterator :: rewind が コール さ れ た 後 に コール さ れ ます
field _number に対応 し た 編集 フィールド 型 を 返し ます
curl _multi 接続 に関する アクティビティ が ある まで ブロック し ます
前方 一致 で マッチ する キー を データベース から 返し ます
は 取得 する スキーマ を 指定 し ます
画像 で 使わ れ て いる 色 の 数 を 取得 し ます
静的 メソッド で ある かど う か を 調べ ます
needle で haystack を 検索 し ます
現在 の スクリプト の inode を 取得 し ます
rsa 証明 書 を 設定 し ます
現在 の ノード が asp かどう か を 調べ ます
ひとつ あるい は 複数 の 画像 を 比較 し 、 差分 の 画像 を 返し ます
指定 し た メッセージ の 本文 の 特定 の セクション の mime ヘッダ を 取り出し ます
soap リクエスト と 共 に 送信 さ れる クッキー を 定義 し ます
は 、 msql 結果 セット の セル の 内容 を 返し ます
insert 、 update あるい は delete クエリ によっ て 変更 さ れ た 行 の 数 を 返し ます
1 6 進 エンコード さ れ た バイナリ 文字列 を デコード し ます
は 、 プログラム による システムロガー へ の 接続 を オープン し ます
lib _dir に ある すべ て の サポート する モード の 一覧 を 取得 し ます
は 、 スクリプト 実行 時 に 大量 の メモリ を 使用 する こと が 懸念 さ れる 場合 に のみ コール する 必要 が あり ます
レスポンス を 送信 し ます
オープン さ れ た アルゴリズム の ブロックサイズ を 取得 し ます
field の 外観 つまり / ap キー の 値 を 取得 し 、 ファイル に 保存 し ます
画像 の 方向 を 設定 し ます
xml document オブジェクト を 返し ます
現在 の マルチバイト 正規 表現 用 の エンコーディング を 取得 また は 設定 する
タプル を リレーション relation に 追加 し ます
これ は 直接 コール し て はいけ ませ ん
この メソッド は 、 fseek に対応 し て コール さ れ 、 現在 の 位置 を 決定 し ます
青 が 一番 強い 点 を 返し ます
指定 さ れ た データベースリンク id を 閉じ ます
アーカイブ 全体 に対し て 行わ れ たすべて の 変更 を 取り消し ます
与え られ た 文字 列 text のすべて の 文字 が 英字 で ある かど う か を 調べ ます
関数 また は メソッド を 削除 し ます
は 、 この エントリ の テキスト 表現 を 返し ます
指定 し た 部分 文字 列 を 返し ます
yaf の エラーハンドラ を 設定 し ます
script で 渡し た 文字列 を javascript の コード として コンパイル し 、 実行 し ます
left と right を 連結 し 、 その 結果 を 返し ます
データ の 比較 に コールバック 関数 を 用い 、 配列 の 共通項 を 計算 し ます
は 、 フォントメトリクス を 表す 多次 元 配列 を 返し ます
指定 し た プロパティ が 設定 さ れ て いる かど う か を 示し ます
ストレージ 内 の オブジェクト に 関連 づけ られ た データ を 返し ます
指定 し た フィールドオフセット に 移動 し ます
カレント の スレッド id を 取得 し ます
画像 を ガンマ 補正 し ます
e を arg 乗し た 値 を 返し ます
この 関数 は 、 number の 単位 を 度 から ラジアン に 変換 し ます
指定 し た メールボックス mailbox を 削除 し ます
imap ストリーム を クローズ し ます
mime リソース を 解放 し ます
現在 の キー を 取得 し ます
指定 し た 範囲 に ある テーブル および 各 テーブル に 関連 する 権限 の リスト を 取得 し ます
は 共有 メモリブロック を 閉じる ため に 使用 さ れ ます
は 、 sybase サーバー へ の 接続 を 確立 し ます
緑 が 一番 強い 点 を 返し ます
は 、 rpmreader 拡張 モジュール の 現在 の バージョン を 返し ます
外部 の 名前 ディレクトリ に 接続 し ます
エラーコード code の 説明 を 有する 文字列 を 返し ます
csv フォーマット の ファイル から 行 を 取り出し 読み込ま れ た フィールド を 含む 配列 を 返し ます
は 、 データ を 書き込む ため の 新しい blob を 生成 し ます
画像内 の スペックルノイズ を 軽減 し ます
は 、 指定 し た postgresql の 結果 リソース result におい て field _name に 相当 する カラム フィールド の フィールド 番号 を 返し ます
与え られ た 変数 の 型 が float かどう か を 調べ ます
指定 し た 関数 を 、 spl が 提供 する _ _ autoload キュー に 登録 し ます
imagick オブジェクト の サイズ を 返し ます
指定 し た ふたつ の 点 を 結ぶ 直線 を 描画 し ます
は 、 与え られ た 日付 timestamp で 指定 する と 場所 について の 日 の 出 の 時刻 を 返し ます
シェーディングオブジェクト を 使用 し て 、 シェーディングパターン を 定義 し ます
は 、 イメージ im から filename に wbmp ファイル を 作成 し ます
ドキュメント の 圧縮 モード を 定義 し ます
コレクション と 、 その インデックス を 削除 し ます
radius リクエスト を 作成 し た 後 は 、 radius _send _request でそれ を 送信 し ます
与え られ た string の 長さ を 返し ます
a と b の 間 の ハミング 距離 を 返し ます
スレッド の タイトル を 設定 し ます
は 、 一つ 以上 の 配列 の 要素 を マージ し 、 前 の 配列 の 最後 に もう 一つ の 配列 の 値 を 追加 し ます
データベース を 物理 デバイス に 同期 さ せ ます
データベースファイル 内 の フィールド の 数 を 返し ます
は xml 名前 空間 を サポート し た 新しい xml パーサ を 作成 し 、 他 の xml 関数 が 使用 する ハンドル を 返し ます
は 、 ラージオブジェクト の カレント の 位置 （ 先頭 から の オフセット ） を 返し ます
reflectionmethod を エクスポート し ます
retval を 、 指定 し た オプション の 値 として 設定 し ます
この メソッド を 使用 する と 、 任意 の 文字列 を tar / zip アーカイブ に 追加 する こと が でき ます
指定 し た mime _encoded _text を utf - 8 に 変換 し ます
tar 形式 の アーカイブ の 場合 は 、 この メソッド は アーカイブ 全体 を gzip あるい は bzip 2 で 圧縮 し ます
fields の 配列 を 、 csv の 行として ファイル に 書き出し ます
は 、 指定 し た 暗号 cipher の 名前 を 得る ため に 使用 さ れ ます
この 関数 は 、 記述子 td で 指定 し た アルゴリズム の セルフテスト を 実行 し ます
は 、 項目 の 値 を value だけ 増や し ます
直近 の insert 文 で データベース に 追加 さ れ た 行 の id を 返し ます
で 確保 し た ディスクリプタ を 解放 し ます
ストリーム の チャンクサイズ を 設定 し ます
image を 、 指定 し た mode で 反転 さ せ ます
メソッド で 与え られ た スタイルシート を 適用 し 、 ソースノード を domdocument に 変換 し ます
number を 基数 tobase で 表し た 文字列 を 返し ます
emptyiterator の valid メソッド です
ibm db2 universal database 、 ibm cloudscape あるい は apache derby データベース へ の 持続 的 接続 を 返し ます
mysql データベース から 、 テーブル 名 の リスト を 取得 し ます
事前 に 準備 さ れ た クエリ を 実行 し 、 カーソル を オープン し ます
パスワード や 暗号 化 キー の よう な 加工 さ れ た データ を 復元 する 際 の salt として 、 共有 秘密 鍵 が 必要 と なり ます
recursivefilteriterator に 含まれる 内部 イテレータ の 子 を 返し ます
key で 指定 し た メッセージキュー が 存在 する かど う か を 調べ ます
ページ の 回転 角度 を 定義 し ます
この 関数 は 、 サーバー から 返さ れ た 直近 の 拡張 サービス の 結果 を 調査 し ます
ページ を 終了 し ます
1 6 バイト の バイナリ guid を 文字列 に 変換 し ます
oracle が 追跡 する アクション 名 を 設定 し ます
base の exp 乗 を 返し ます
id 3 タグ の アルバム 文字 列 を 返し ます
ドキュメント の 暗号 化 モード を 定義 し ます
エスケープ す べき 文字 の 前 に バックスラッシュ を 付け て 返し ます
この メソッド は 、 新た な エントリ を ハッシュ に 追加 し て 追加 に 成功 し た かどう か を 返し ます
名前 空間 uri に 基づい て 、 ノード の 名前 空間 プレフィックス を 取得 し ます
は 、 指定 し た リンク id が 指す 結果 から 1 行分 の データ を 得 ます
クエリ が 準備 さ れ た 後 に 、 パラメータ について の 情報 を 配列 で 返し ます
この メソッド は 、 参照 先 の ファイル の splfileinfo オブジェクト を 取得 し ます
この 関数 は 、 2 つの ノード が 等しい か どう か を 調べ ます
この 関数 は 、 getrusage 2 への インターフェイス です
http レスポンス の ステータスコード を 取得 し たり 設定 し たり し ます
パラメータ として 配列 を ひとつ だけ 渡し た 場合 は 、 min は 配列 の 中 で 最も 小さい 数値 を 返し ます
ウォッチャー を 設定 し て 、 他 の イベントループオブジェクト で 使える よう に し ます
データベース 内 に 登録 さ れ て いる ストアドプロシージャ の 一覧 を 含む 結果 セット を 返し ます
phar アーカイブ の 検証 用 シグネチャ を 、 十 六 進 文字 列 で 返し ます
日本語 エンコーディング を 有効 に し ます
プロパティ 名 を 取得 し ます
は 、 pspell _save _wordlist が 単語 リスト と 共 に 置換 リスト を 保存 する かど う か を 定義 し ます
pdi ページ を 配置 し 、 サイズ を 変更 し ます
画像 の ピクセル を 配列 に エクスポート し ます
ファイルポインタ を 先頭 に 巻き戻し ます
指定 し た 単一 の 値 を もと に して wddx パケット を 作成 し ます
left と right の 乗算 を 行い ます
oracle 接続 connection 上 の 未解 決 な トランザクション を コミット し ます
文字列 str に 、 バイナリ 形式 の パッチ patch を 適用 し ます
は 、 ファイル を オープン し て その ファイル 記述子 を 返し ます
は 、 rpm ファイル を オープン し て それ が 正しい rpm 形式 で ある かど う か を 調べ ます
稼動 し て いる すべ て の プロセス について の 統計 データ を 取得 し ます
指定 し た id の グループ に関する 情報 を 取得 し ます
指定 し た 辞書 に 単語 を 追加 し ます
テーブル の 外部 キー を 含む 結果 セット を 返し ます
指定 し た キー に 対応 する 値 の サイズ を 返し ます
graphicsmagick の リリース 日 を 文字列 で 返し ます
新しい 画像 を 作成 し 、 背景 色 を 設定 し ます
php が 一時 ファイル を 保存 する デフォルト の ディレクトリ の パス を 返し ます
現在 使用 し て いる php が サポート する 画像 形式 を 返し ます
adaptive blur 順応 性 にじみ フィルタ を 画像 に 追加 し ます
odbc 結果 に おける 行 の 数 を 取得 し ます
は 、 bzip 2 . bz 2 ファイル を 読み 書き用 に オープン し ます
テーブル の 主キー を 有する カラム の 名前 を 取得 する 際 に 使用 可能 な 結果 id を 返し ます
この メソッド は 、 rewinddir に対応 し て コール さ れ ます
など による 丸め の 際 に コール さ れ ます
gd 2 イメージ を 、 指定 し た filename に 出力 し ます
needle が haystack の 中 で 最初 に 現れる 位置 を 探し ます
iso - 8 8 5 9 文字 を t 6 1 文字 に 変換 し ます
は 、 メモリ から 指定 し た x 5 0 9 cert リソース に 関連 し た 証明 書 を 開放 し ます
は 、 null で 終わる 文字列 を postgresql バックエンドサーバー に 送信 し ます
現在 の アイテム が 有効 か どう か を 調べ ます
ページ の 表示 を 拡大 し 、 バウンディングボックス の 高さ に あわせる よう に し ます
パス 情報 を 一切含 まない ファイル 名 を 取得 し ます
オブジェクト の 圧縮 品質 を 取得 し ます
指定 し た 矩形 内 に 収まる 弧 を 、 画像 上 に 描き ます
で 設定 さ れ た 値 を 取得 し ます
直近 の エラー について 、 sqlstate エラーコード を 含む 文字 列 を 返し ます
は imagetype 定数 で 指定 さ れる mime -type を 取得 し ます
クロージャ を 一時的 に newthis に 束縛 し 、 指定 し た パラメータ で それ を 呼び出し ます
は 、 指定 し た calendar の 日付 から ユリウス 積算 日 を 計算 し ます
string から pattern に マッチ する 文字 列 を 検索 し 、 一致し た 文字列 を callback 関数 の 出力 で 置換 し ます
オブジェクト の アンシリアライズ 時 に コール さ れ ます
ファイル が 読み込み 可能 か どう か を 調べ ます
は 、 結果 リソース の すべ て の 行 （ レコード ） を 保持 する 配列 を 返し ます
新しい haruannotation の インスタンス を 作成 し ます
ひとつ あるい は 複数 の チャネル の 内容 を 再構 築 し た 画像 と 比較 し 、 指定 し た 歪み 係数 を 返し ます
ファイル が オリジナル で ある と マーク さ れ て いる 場合 に true を 返し ます
指定 し た rng スキーマ に 基づい て 、 ドキュメント を & raquo ;& nbsp ;relaxng で 検証 し ます
サーバー へ の リクエスト が 成功 し たか チェック する ため に 使用 さ れ ます
次 の ファイル に 移動 し ます
画像 の 解像 度 の 単位 を 取得 し ます
指定 し た 回転 角 を 現在 の 座標 空間 に 適用 し ます
指定 し た テーブル に関する カラム および 付随 する 権限 の リスト を 取得 し ます
この 関数 は 、 人間 が 行う よう な 手法 で アルファベット また は 数字 の 文字列 の 順序 を 比較 する アルゴリズム を 実装 し ます
与え られ た 変数 の 型 が 整数 型 か どう か を 検査 し ます
反復 処理 が 終了 し た とき recursiveiteratoriterator :: valid が 最初 に false を 返し た とき に コール さ れ ます
は 、 ふたつ の & quot ;php 標準 &quot ; バージョン 番号 文字 列 を 比較 し ます
は 、 サーバープール 内 の すべ て の サーバー の 一覧 を 返し ます
指定 し た インデックス に対する 色 を 取得 し ます
インストール さ れ て いる gd ライブラリ の バージョン と スペック に関する 情報 を 取得 し ます
指定 さ れ た 引数 timestamp を 、 与え られ た フォーマット 文字 列 により フォーマット し 、 日付 文字 列 を 返し ます
autocommit の 状態 を 返し ます
クラス の プロパティ を 表す reflectionproperty を 取得 し ます
現在 の フラグ を 取得 し ます
プロセス pid を プロセスグループ pgid に 加え ます
指定 し た エントリ の 最初 の 属性 を 取得 し ます
現在 の ノード から 、 名前 が name で ある 属性 の 値 を 取得 し ます
この 関数 は 、 指定 し た ソケット また は 直近 の グローバル な ソケットエラー の エラーコード を クリア し ます
は 、 指定 し た キー key で memcache サーバー 上 に value を 格納 し ます
これ は ファイル を メモリ に 読み込み ます
事前 に gnupg _addsignkey および gnupg _addencryptkey で 設定 し た キー を 使用 し 、 指定 し た plaintext を 暗号 化 ・ 署名 し ます
この メソッド は 、 現在 の simplexmliterator 要素 の 子要素 を 含む simplexmliterator オブジェクト を 返し ます
この メソッド は 、 新た な エントリ を セット に 追加 し て 追加 に 成功 し た かどう か を 返し ます
指定 し た キー に対し て 、 wincache _lock を 使っ て 取得 し た 排他 ロック を 解放 し ます
n を d で 整数 として 割っ た 際 の 余り を 計算 し ます
は 指定 し た フィールド の 長さ を 返し ます
次 の ノード に 移動 し ます
ucb snmp ライブラリ で quick _print の 値 を 設定 し ます
a について 、 1 の 補数 を 返し ます
これ は 、 現在 使っ て いる データベース を 削除 し ます
範囲 を シェーディング で 塗り つぶし ます
データベース の 指定 し た レコード を 、 指定 し た 値 で 置換 し ます
ノード を ファイル に 正規 化 し ます
ダンプディレクトリ の pprof _{ process _id } への デバッグ を 開始 し ます
ファイルシステムオブジェクト の inode 番号 を 取得 し ます
ディレクトリエントリ の 圧縮 時 の サイズ を 取得 し ます
この ノード が html ドキュメント の 一部 で ある かど う か を 調べ ます
これ は 、 次 の 関数 と 同等 です
と は 対照 的 に 、 この メソッド は 結果 セット の 最初 の 結果 だけ を 返し ます
iterator で 渡さ れ た イテレータ を もと にし て 新しい recursivecachingiterator を 作成 し ます
は 、 指定 し た 結果 id に 関連 付け られ た 結果 から 、 1 行分 の データ を 取得 し ます
ファイルキャッシュ による メモリ 使用 状況 について の 情報 を 取得 し ます
現在 の directoryiterator アイテム の ファイルタイプ を 判定 し ます
この 関数 は 、 コマンドラインヒストリ に 1 行追 加 し ます
この メソッド は 、 readdir に対応 し て コール さ れ ます
オプション の base パラメータ を 指定 し た 場合 は log は log base arg を 返し ます
は 、 データベース へ の 問い合わせ に 使う 識別子 テーブル 名 や フィールド 名 など を エスケープ し ます
ページ の 現在 位置 に テキスト を 表示 し ます
値 で 配列 を ソート し ます
は 、 長方 形 、 多角 形 、 楕円 等 を 描画 する 際 の 線幅 を thickness ピクセル に 設定 し ます
全て の select クエリ に関する デフォルト の バイトモード を 設定 し ます
コレクション の 最後 から num 個 の 要素 を 切り 取り ます
は 、 callback の result 引数 で ファイル の 状態 を 返し ます
現在 の ドメイン の メッセージ を 参照 し ます
これ は 、 solrparams :: getparam に対する エイリアス です
デジタルフィルタ を 適用 し て ノイジー な 画像 の 品質 を 向上 さ せ ます
直近 の mysqli _connect コール の エラー 番号 を 返し ます
は 、 現在 の キャッシュリミッタ の 名前 を 返し ます
新しい 接続 プール が 作成 できる 接続 の 数 を 設定 し ます
オブジェクト の 輪郭 の 描画 に 使う 線 の 幅 を 返し ます
イテレータ を 前 に 移動 し ます
文字列 に 変換 し ます
画像 の 深度 を 設定 し ます
は 、 postgresql の 結果 リソース の 行数 を 返し ます
この メソッド は 、 アクション で 常 に 定義 し ない といけ ませ ん
成功時 に 、 設定 オプション の 値 を 返し ます
新しい harudestination の インスタンス を 作成 し ます
関数 は 、 ドメイン へ の パス を 設定 し ます
 / encoding キー の 値 を 取得 し ます
関数 は 、 object _id から 始まる snmp オブジェクト を 走査 し 、 その 値 と オブジェクト id を 返し ます
は 、 fbsql _fetch _array の オプション の 第 2 引数 に fbsql _assoc を 指定 し て コール する の と 等価 です
および pg _result _error が 返す メッセージ の 詳細 度 を 指定 し ます
この 関数 は 、 古い メールボックス を 新しい メールボックス に リネーム します （ mbox 名 の フォーマット について は imap _open を 参照く ださい ）
宣言 し て いる 関数 を 取得 し ます
次 の 要素 に 移動 し ます
は 指定 し た 変数 を 破棄 し ます
指定 し た ソースアンカー が 指す 対象 オブジェクト を 取得 し ます
xhprof の プロファイリング を 開始 し ます
フォーマット 文字 列 format に 基づき 生成 さ れ た 文字列 を 返し ます
指定 し た メールボックス mailbox について の ステータス 情報 を 取得 し ます
現在 の キー を 返し ます
指定 し た gd 画像 image に 入力 ガンマ 値 、 出力 ガンマ 値 を 指定 し て ガンマ 補正 を 適用 し ます
指定 し た パラメータ を 用い て プリペアドステートメント を 実行 する リクエスト を 送信 し 、 その 結果 を 待ち ます
指定 し た 名前 の ユーザー について の グループアクセスリスト を 求め ます
ラージオブジェクト の 内部 ポインタ が lob の 最後 に ある かど う か を 調べ ます
テキスト の アノテーション で 使う フォント の スタイル を 返し ます
この メソッド は 、 エントリ を 新しい 値 で 更新 し ます
配列 を 作成 し ます
は 、 array から 引数 offset および length で 指定 さ れ た 連続 する 要素 を 返し ます
この メソッド は エントリ を ハッシュ から 削除 し 、 削除 でき たか どう か を 返し ます
停止 し た evprepare ウォッチャー の インスタンス を 作り ます
新しい 画像 を 、 imagemagick 疑似 フォーマット を 使用 し て 作成 し ます
データベース から 削除 し たい レコード を マーク し ます
文字列 が 汚染 さ れ て いる かど う か を 調べ ます
準備 さ れ た sql ステートメント 中 で 、 対応 する 名前 もしく は 疑問 符 プレースホルダ に パラメータ を バインド し ます
は 、 number を フォーマット し て 返し ます
array を 入力 とし 、 値 に 重複 の ない 新規 配列 を 返し ます
オープン し た アルゴリズム で サポート する キー の 長さ を 取得 し ます
現在 の mysql サーバー の スレッド を 取得 し ます
既存 の コンテンツブロック の 前 に コンテンツ を 追加 し ます
ファイルポインタ から 1 行取 得 し ます
mysql プロトコル を 取得 し ます
指定 し た 結果 セット result の フィールド 数 を 返し ます
この 関数 は 、 文字列 data を utf - 8 に エンコード し 、 エンコード さ れ た 文字列 を 返し ます
空 の ディレクトリ を アーカイブ に 追加 し ます
関数 は 、 hostname で 指定 し た snmp エージェント から 全 て の 値 を 読み とる のに 使用 し ます
soap リクエスト で 送信 する ヘッダ を 定義 し ます
と は 異なり 、 この メソッド は 参照 で 値 を エンジン に 代入 し ます
ファイル あるい は ディレクトリ へ の パス を 含む 文字 列 を 受け取っ て 、 最後 に ある 名前 の 部分 を 返し ます
指定 さ れ た 位置 に テキスト を 出力 し ます
は 、 ひとつ の クエリ を 送信 し ます 複数 クエリ の 送信 は サポート し ませ ん 
画像 や テンプレート を 、 さまざまな オプション に 基づい て ページ 上 に 配置 し ます
デバッグ に 使用 できる 、 冗長 な リクエスト 情報 の 出力 を 有効 に し ます
は 、 border で 指定 し た 色 を 境界 色 として 塗り つぶし を 行い ます
現在 の 塗り つぶし 色 を 指定 し た rgb 値 に 設定 し ます
は 、 $ data の セッションデータ を デコード し 、 スーパーグローバル $ _ session にその 結果 を 格納 し ます
グリニッジ 標準 時 を 返す こと 以外 は 、 strftime と 同じ 動作 を します
evfork ウォッチャーオブジェクト を 作り 、 自動 的 に 開始 さ せ ます
paradox データベース を 閉じ ます
現在 の コールスタック を 配列 形式 で 返し ます
ロード さ れ た apache モジュール の リスト を 取得 し ます
simplexml 要素 に 属性 を 追加 し ます
実行用 に 文 を 準備 し ます
この メソッド は 、 シリアライズ し た ハッシュ を 返し ます
文字列 str の 文字 エンコーディング を 検出 し ます
プロパティ に対し て 値 を 設定 し ます
カーネル に 問い合わせ て 現在 時刻 を 確認 し 、 処理 中 の ev :: now が 返す 時刻 を 更新 し ます
は 、 servers を サーバープール に 追加 し ます
画面 の 中央 に 、 指定 し た サイズ の ウィンドウ を オープン し ます
メモリ 内 の データ から 、 読み込み 専用 の 仮想 ファイル を 作成 し ます
最後 の http メソッド 、 url そして パラメータ 文字 列 あるい は 配列 に も とづい て シグネチャ を 生成 し ます
画像 の サイズ を 元 の 半分 に 比例 縮小 し ます
ウェブサービス の wsdl に 記述 さ れ て いる 関数 の 配列 を 返し ます
色 ベクトル を 画像 の 各 ピクセル に 適用 し ます
この 関数 は 、 url リライト 機構 に 新しい 名前 / 値 の 組 を 追加 し ます
バッファリング さ れ た 全て の bzip 2 データ を ファイルポインタ bz に 書き込み ます
反時 計周り の 円弧 を 追加 し ます
画像 の 幅 を 返し ます
cookie 変数 を 取得 し ます
インデックス を 使用 し て 、 エントリ の 内容 を 返し ます
現在 の パス の 内部 を 現在 の 塗り つぶし 色 で 塗り つぶし ます
xml パーサ parser の 文字 データ 用 ハンドラ 関数 を 設定 し ます
この 関数 は 、 ノード が 子 を 保持 し て いる かど う か を 調べ ます
は 、 execute で 指定 し た カスタム 関数 を 実行 し 、 その他 の eio _* と 同じ よう に 処理 し ます
指定 さ れ た フォント の 文字 の 幅 を ピクセル 単位 で 返し ます
インデックス index の 要素 に 値 を 割り 当て ます
この クラス は 、 php ハンドラ から soap フォールトレスポンス を 送信 し た 場合 に 有用 です
arrayobject の 振る 舞い を 変更 する フラグ を 設定 し ます
と同じ です が 、 dir _handle の デフォルト が $ this に なり ます
リンク を 辿ら ない で リモートファイルシステム の シンボリックリンク の 情報 を 取得 し ます
は 、 すべて の リクエスト を 処理 し 終える まで libeio を ポール し ます
パラメータ の 位置 を 取得 し ます
cyrus imap 接続 へ の コールバック を バインド し ます
sql 文 が 返す sqlstate を 含む 文字 列 を 返し ます
オブジェクト の 全て の ソースアンカー を 取得 し ます
現在 の 値 を 取得 し ます
指定 し た リソース の 制限 を 返し ます
は 、 オープン さ れ て いる 全て の データベースファイル の 一覧 を 返し ます
指定 し た フォント を 傾け ます
独自 の 畳み込み 関数 を 画像 に 適用 し ます
は 、 指定 し た 結果 セット result から 現在 の テーブル 名 を 取得 し ます
直近 の frontbase 操作 の エラー 文字 列 を 返し ます
reflectionparameter クラス の コンストラクタ です
現在 の 要素 の ファイル 情報 を 取得 し ます
は 、 postgresql フロントエンド / バックエンド 間 の 通信 を デバック 用 の ファイル に トレース する こと を 有効 に し ます
複数 の curl ハンドル を 非同 期 で 実行 できる よう に し ます
関数 に 渡さ れ た 引数 の 数 を 取得 し ます
緑 が 一番 強い 点 を 設定 し ます
この メソッド は 、 countable を 実装 し た オブジェクト で count 関数 を 使用 し た 際 に 実行 さ れ ます
の よう な 関数 で 事前 に 組み立て られ た パス を 描画 し ます
ソケットリソース socket を 用い て 、 address へ の 接続 を 初期化 し ます
この 比較 は 大文字 小文字 を 区別 する こと 、 そして 、 strcmp とは 異 なり 、 バイナリセーフ で は ない こと に 注意 し て くだ さい
は 、 ルーター を 自作 する とき に 唯一実装 する 必要 の ある メソッド です
hyperwave サーバー に ログイン し ます
与え られ た 文字 列 text のすべて の 文字 が 空白 文字 で ある かど う か を 調べ ます
は 、 文字 列中 に おい て シェルコマンド を だまし て 勝手 な コマンド を 実行 する 可能 性 が ある 文字 を エスケープ し ます
は 、 マルチバイト 対応 の 正規 表現 検索 に おい て 検索 対象 の 文字列 string および 正規 表現 pattern を 設定 し ます
ファイル を size バイト に 丸め ます
この メソッド は 実際 に 参照 先 を たどる こと は あり ませ ん
は 、 接続 が ビジー か どう か を 調べ ます
は 、 結果 セット の 行数 を 返し ます
oauth パラメータ を どこ で 渡す か を 設定 し ます
フレーム の サイズ を バイト 単位 で 返し ます
新しい キー / 値 の ペア で マップ を 更新 し ます
指定 さ れ た 名前 の テーブル について の 情報 を 取得 し ます
指定 し た password で principal を 作成 し ます
フィールド が オブジェクト の プロパティ として アクセス さ れる 場合 、 文書 から フィールド を 除去 し ます
は 、 キー の 配列 keys を サーバー から 削除 し ます
この 関数 は 、 データ を 暗号 化 し ます
は 、 x 5 0 9 を ファイル filename に pkcs # 1 2 フォーマット で 保存 し ます
yaf _router は デフォルト の ルート として yaf _route _static を 使い ます
出力 する swf の 倍率 を 設定 し ます
指定 し た tuple へ 書き込み ロック を 要求 し ます
指定 さ れ た エラーコード に 対応 する エラーメッセージ を 返し ます
ディレクトリ から 、 正規 表現 の pattern に マッチ する ファイル を 追加 し ます
は 、 大きな 値 に対し て 自動 圧縮 処理 を 有効 に し ます
現在 の 設定 で 、 クエリ を マルチクエリバッチ に 追加 し ます
文字列 haystack の 中 で 、 needle が 最後 に 現れる 位置 を 探し ます
newt インターフェイス を 初期化 し ます
を 使用 し て 結果 セット を 順 に 処理 し ます
オブジェクト の インターレース 方式 を 取得 し ます
この メソッド を 使用 し て 、 ファイル が ディレクトリ か どう か を 調べ ます
は 、 pub _key _id が 指す 公開 鍵 を 使用 し 、 指定 し た data に関し て signature が 正しい こと を 確認 し ます
slob オブジェクト を 作成 し 、 オープン し ます
reflectionobject を 作成 し ます
この 関数 は 、 db2 _ pconnect で 作成 し た db2 クライアント 接続 を 閉じ 、 対応 する リソース を データベースサーバー に 返し ます
指定 し た アルゴリズム で サポート さ れる キー の サイズ を 配列 で 返し ます
は 、 二つ の 大き な 違い は ある もの の 、 ifx _connect と 非常 に 似た 動作 を します
画像 の アルファチャネル を 有効 あるい は 無効 に し ます
現在 の 描画 の 色空間 を 取得 し ます
これ は 高度 な ウォッチャー 型 で 、 ある イベントループ を 別 の イベントループ に 埋め込む こと が でき ます
ファイルポインタ が ファイル 終端 に 達し て いる かど う か を 調べ ます
画像 の 不透 明度 を 設定 し ます
png ファイル を wbmp ファイル に 変換 し ます
imagick オブジェクト 内 で 現在 アクティブ な 画像 の インデックス を 取得 し ます
と同じ です が 、 dir _handle の デフォルト が $ this に なり ます
は 、 ftp サーバー から remote _file を 取得 し 、 指定 し た ファイルポインタ fp に 書き こみ ます
結果 セット を 最初 の 行 に 戻し ます
は 、 キー key に var という 値 を 関連 付け 、 memcached サーバー に 格納 し ます
現在 の テキスト の レンダリングモード を 取得 し ます
この 関数 は 、 pdo :: __ construct の dsn パラメータ で 利用 可能 な 全て の 有効 な pdo ドライバ を 返し ます
本メソッド は 、 soap コール を 行う 低 レベル api 関数 です
この 関数 は 、 指定 し た リポジトリ url の ファイル や ディレクトリ の 一覧 を 返し ます
この 関数 は 1 つか 2 つもしく は 4 つの パラメータ を 受け取り ます 3 つ は あり ませ ん :
文字列 を utf - 8 フォーマット から utf - 1 6 に 変換 し ます
指定 し た インデックス に 新しい 値 を 設定 し ます
アノテーション を クリック し た 際 の 表示 方法 を 定義 し ます
直近 の json エンコード / デコード 処理 中 に 発生 し た エラー もし 存在 すれ ば を 返し ます
ノード に 子要素 を 追加 し 、 子要素 の simplexmlelement を 返し ます
新しい 3 2 ビット 整数 値 を 、 指定 し た 値 で 作成 し ます
エラー の 配列 を 返し ます
指定 し た xml パーサ parser を 解放 し ます
この メソッド は 、 simplexmliterator を 次 の 要素 に 移動 し ます
新しい 6 4 ビット 整数 値 を 、 指定 し た 値 で 作成 し ます
この 関数 は 、 ibm db 2 、 cloudscape あるい は apache derby データベースサーバー について の 情報 を 読み取り 専用 の プロパティ に 保持 する オブジェクト を 返し ます
設定 で 定義 し た モジュール の リスト を 取得 し ます
キリル 文字 セット を 、 別 の 文字 セット に 変換 し ます
メールボックス 単位 で クォータ 上限 最大 容量 を 設定 し ます
位置 番号 を 指定 し て 、 画像 の カラーマップ を 移動 し ます
画像 マスク として 使用 する 画像 を 設定 し ます
は 、 指定 し た key _identifier が 指す キー を メモリ から 開放 し ます
ページ の 描画 色 を 定義 し ます
a の ビット index を クリア 0 に 設定 します
この 関数 は 、 文書 の コンテンツ を hw _api _content 型 の オブジェクト として 返し ます
画像 の サンプリング 係数 を 設定 し ます
現在 の 塗り つぶし 色 と 輪郭 色 を 指定 し た rgb 値 に 設定 し ます
ミューテックス へ の ロック の 解除 を 試み ます
は 、 取得 し た 行 （ レコード ） を 保持 する 連想 配列 を 返し ます
value 1 と value 2 を 比較 し ます
は 、 終了 し たけれど も 処理 さ れ なかっ た リクエスト の 数 を 返し ます
メッセージ を キュー から 削除 し ます
新しい クエリオブジェクト を 作成 し ます
データ の 比較 に コールバック 関数 を 用い 、 追加 さ れ た 添字 の 確認 を 含め て 配列 の 差 を 計算 し ます
map という 名前 の マップ の 中 で 、 指定 し た キー key の 次 に ある キー / 値 の 組 を 返し ます
座標系 の 、 水平 方向 ・ 垂直 方向 の 縮尺 を それぞれ 設定 し ます
アクティブ な 前景 色 と 背景 色 を 設定 し ます
gd ファイル また は url から 新規 イメージ を 生成 し ます
パラメータ a および b で 表さ れる ベータ 分布 から 、 無作 為 な 値 を 返し ます
画像 リスト 内 で の イテレータ の 位置 、 index パラメータ で 指定 し た 場所 に 設定 し ます
関数 は 、 ソケット socket の オプション optname の 値 を 取得 し ます
画像 の 型 を 設定 し ます
この 関数 は 、 文字列 haystack の 中 で needle が 最後 に 現れ た 位置 から 、 haystack の 終わり まで を 返し ます
xml パーサ parser の 処理 命令 pi 用 ハンドラ 関数 を 設定 し ます
指定 し た ドキュメント について 発生 し た tidy 警告 の 数 を 返し ます
指定 し た ファイル の 中 の 整形 式 xml ドキュメント を オブジェクト に 変換 し ます
この ノード が コメント で ある かど う か を 調べ ます
バイナリ iptc データ を jpeg イメージ に 埋め こみ ます
次 の 行 を 取得 し 、 それ を オブジェクト として 返し ます
指定 し た 幅 に 収める こと の できる 文字 数 を 計算 し ます
iconv 拡張 モジュール の 内部 設定 変数 を 取得 し ます
アニメーション 画像 の フレーム を 表示 する 時間 を 調整 し ます
現在 の データベース の コピー を 作成 し ます
は デフォルト で 、( 必要 な 場合 セマフォ が 確保 できる まで ブロック し ます
この 関数 は 、 既存 の 子要素 の リスト に 新しい 子要素 を 追加 する か 、 あるい は 新しい 子要 素 リスト を 作成 し ます
指定 し た 色 マップインデックス の 色 を 返し ます
名前 で 関数 を コピー
は popen と よく 似 て い ます が 、 プログラム の 実行 を さらに 細かく 制御 できる 点 で 違い ます
関数 を 使っ て 以前 に 設定 し た http ヘッダ を 削除 し ます
string の アルファベット 部分 を すべ て 小文字 に して 返し ます ｡
認証局 ca の パス と 情報 を 設定 し ます
文字 オブジェクト の 内容 を 返し ます
静的 な プロパティ を 取得 し ます
以前 に 保存 さ れ て いる 描画 コンテキスト を 復元 し ます
で 直接 設定 さ れ たか 、 あるい は 他 の 関数 で 間接 的 に 設定 さ れ た パラメータ の 値 を 取得 し ます
zend .enable _gc を 1 に 設定 し て 、 循環 参照 コレクタ を 有効 に し ます
は 、 pem エンコード 形式 の x 5 0 9 を ファイル outfilename に 保存 し ます
value を キュー の 先頭 から 取り出し ます
現在 の 接続 で 使用 さ れ て いる データベース の パスワード を 設定 また は 取得 し ます
指定 し た 半径 の 畳み込み フィルタ を 使用 し て 、 画像 の 輪郭 を 強調 し ます
現在 の 要素 が 子 を 持つ とき に true 、 それ 以外 の 場合 に false を 返し ます
コンストラクタ で ある かど う か を 調べ ます
シンボリックリンク を 辿っ て リモートファイルシステム 上 の ファイル の 情報 を 取得 し ます
エクスポート し ます
ユーザー 定義 クラス の 定義 の 終了 行 を 取得 し ます
form に コンポーネント を 追加 し ます
クエリ を 送信 し 、 すべて の 結果 を 取得 し ます
拡張 モジュール の クラス 一覧 を 取得 し ます
この メソッド を 使っ て 、 imagemagick ライブラリ の リソース 制限 を 変更 し ます
現在 の 線幅 を 取得 し ます
イテレータ を 最初 に 巻き戻し ます
url エンコード さ れ て い ない パラメータ の 配列 を 返し ます
a を b で 割り 、 結果 を 整数 で 返し ます
oracle が 追跡 する モジュール 名 を 設定 し ます
は 、 handler を 用い て mode で path に 持続 的 な データベースインスタンス を 確立 し ます
現在 の 要素 の キー を 取得 し ます
ユーザー の ブラウザ の 機能 を 調べ ます
付随 データ を 受信 する ため に 確保 する バッファ の サイズ を 計算 し ます
対象 と なる ピクセル と その 近傍 の 透明 度 を 変更 し ます
アクティブ な スコープ 内 で 定義 さ れ て いる すべ て の 変数 名 を 返し ます 変数 の 値 で は あり ませ ん 
は 、 内部 で の libeio と の 通信 に 使う 変数 を 表す ストリーム を 取得 し ます
アウトライン が クリック さ れ た とき に ジャンプ する 先 の 対象 オブジェクト を 設定 し ます
key -value ペア を データベース に 格納 し ます
は 、 postgresql 結果 リソース から 特定 の 行 と フィールド （ カラム ） の 値 を 返し ます
指定 し た データベース の レコード （行 ） 数 を 取得 し ます
関数 long 2ip は 、 長整 数 表現 の アドレス から ドット 表記 例 :aaa .bbb .ccc .ddd の インターネットアドレス を 生成 し ます
取得 する 行 の デフォルト の 返り値 を null 値 に 設定 し ます
奇偶 規則 を 使用 し て 現在 の パス を 塗り つぶし ます
id 型 と なる 属性 attr を 宣言 し ます
指定 し た オブジェクト を 、 ワーカー の スタック に 追加 し ます
指定 し た サービス の 開始 を 試み ます
は nsapi 特有 の 関数 です
色 に マッチ する ピクセル を 、 塗りつぶし 色 に 変更 し ます
リモートファイルシステム 上 の ファイル を 改名 し ます
exe あるい は 実行 可能 ファイル は 、 三つ の 部分 から でき て い ます
指定 し た 色 を 定義 / 再定 義 し ます
カラー 画像 の コントラスト を 強調 し ます
は 、 ファイルパーミッション の うち 実行 ビット と 読み込み ビット を 設定 し ます
イテレータ の 現在 の 位置 が 指す オブジェクト に 関連 づけ られ た データ あるい は 情報 を 返し ます
ローカルファイルシステム から リモートサーバー に scp プロトコル を 使用 し て コピー し ます
arg の アークコサイン を ラジアン で 返し ます
名前 を 使用 し て 、 エントリ 名 を 変更 し ます
画像 リスト 内 の 前 の 画像 を imagick オブジェクト に 関連 付け ます
入力 し た 文書 の 配列 表現 を 返し ます
この 関数 は 、 現在 の スレッド の 一意 な id を 返し ます
指定 し た 画像 リソース image の 幅 を 返し ます
エンコーディング from _encoding の 変数 vars を エンコーディング to _encoding に 変換 し ます
オブジェクト の ポイントサイズプロパティ を 返し ます
指定 し た ピクセル の 色 を 返し ます
画像 の ページジオメトリ を 配列 で 返し ます
文字列 string の 、 start で 指定 さ れ た 位置 から length バイト 分 の 文字列 を 返し ます
ファイルパス 解決 キャッシュ による メモリ 使用 状況 について の 情報 を 取得 し ます
は 、 クエリ 結果 の フィールド 名 を 返し ます
コレクションオブジェクト に 関連 付け られ た リソース を 解放 し ます
は 、 openssl ライブラリ から 直近 の エラー を 返し ます
relation に 他 の クライアント から の 読み込み アクセス さえ 拒否 する 排他 的 ロック を 要求 し ます
全 フィールド を ドロップ し て 文書 を リセット し 、 文書 の boost を ゼロ に リセット し ます
は msql _connect とほぼ 同じ 動作 を し ます が 、 大きな 違い が ふたつ あり ます
ジェネレータ は シリアライズ でき ない ので 、 例外 を スロー し ます
バイナリカラムデータ を 処理 できる よう に し ます 関係 する odbc sql 型 : binary varbinary longvarbinary 
は 、 取得 し た 行 の フィールド 名 に 対応 する プロパティ を 有する オブジェクト を 返し ます
は 、 カレント の リクエスト の http ヘッダ を 連想 配列 で 返し ます
画像 を 解析 し 、 似 て いる 部分 を 特定 し ます
ファイル から 画像 を 読み込み ます
この クラス の 静的 な プロパティ の 値 を 取得 し ます
いくつか の pdflib パラメータ を 数値 型 で 取得 し ます
指定 し た ローカル 名 および 名前 空間 uri に 一致 する すべ て の 要素 の domnodelist を 返し ます
type 3 フォント の グリフ 定義 を 終了 し ます
private メソッド で ある かど う か を 調べ ます
ランダム な ノイズ を 画像 に 追加 し ます
ユーザーエラー を 発生 さ せる ため に 使い ます
str のすべて の アルファベット を 小文字 に して 返し ます
オブジェクト の 属性 を 複製 し ます
yaml ドキュメントストリーム 全体 ある い は その 一部 を 、 php の 変数 に 変換 し ます
x および y を 指定 し て 画像 を 補正 し ます
属性 oldnode を 要素 から 削除 し ます
繁体 字中 国語 エンコーディング を 有効 に し ます
関数 は 、 ホスト 名 あるい は ip アドレス に 対応 する 二文字 の 大陸 コード を 返し ます
この 関数 は 、 データベース から レコード を 削除 し ます
サンプルモード で の プロファイル を 開始 し ます
文字列 の 配列 を 返し ます
指定 し た メッセージ 番号 について の 情報 を 、 その ヘッダ を 読み込ん で 取得 し ます
指定 し た テーブル に ある カラム 名 の リスト を 取得 し ます
現在 の プロセス の プロセス id を 返し ます
は 、 proc _open で 開か れ た プロセス に関する 情報 を 取得 し ます
val が この プラットフォーム 上 で 有効 な 有限 値 で ある かど う か を 調べ ます
結果 セット を 巻き戻し 、 クエリ を まだ 実行 し て い ない 場合 は 実行 し ます
指定 し た リレーションファイル を オープン し ます
さまざまな オプション を もと に して 、 画像 状態 オブジェクト を 作成 し ます
現在 の 要素 の 子 を 取得 し ます
dirname で 指定 さ れ た ディレクトリ を 削除 しよ う と 試み ます
指定 し た 画像 パレット の 色数 を 返し ます
静的 プロパティ で ある かど う か を 調べ ます
コメント を 画像 に 追加 し ます
画像 状態 オブジェクト を アクティブ に し ます
splfileobject の インスタンス 用 の フラグセット を integer 形式 で 取得 し ます
は 、 指定 し た リンク id が 指す サーバー 上 に 新規 の データベース を 作成 し ます
ページ の 幅 を 取得 し ます
この 関数 は 、 query で 指定 し た プリペアドクエリ の パラメータ の 数 を 返し ます
それ まで のすべて の 描画 コマンド を レンダリング し ます
画像 の 圧縮 を 設定 し ます
pdflib パラメータ の 値 を 数値 型 で 設定 し ます
フィールド に対する インデキシング 時間 の boost 値 を 設定 し ます
入力 文字 エンコーディング が 無効 、 また は 出力 文字 エンコーディング に 文字 コード が 存在 し ない 場合 の 代替 文字 を 指定 し ます
指定 し た 位置 に 、 web ページ を 指す ハイパーリンク を 設定 し ます
スクリプト に 渡さ れ た オプション を パース し ます
実行 可能 で ない tar / zip アーカイブ は スタブ を 持つ こと が でき ませ ん
画像 の 深度 を 取得 し ます
クエリ の 結果 の 行 を 連想 配列 で 返し ます
クラス の インスタンス 化 が 可能 で ある かど う か を 調べ ます
既存 の コンテンツブロック の 後 に コンテンツ を 追加 し ます
現在 の 点 から 別 の 点 まで 線 を 描画 し ます
指定 し た インデックス に 対応 する 色 マップ 上 の 色 を 返し ます
新規 セッション を 初期化 し 、 curl ハンドル を 返し ます
暗号 初期化 ベクトル iv の 長さ を 取得
この メソッド は 、 以下 と 同等 です
この メソッド は エントリ を 新しい 値 で 更新 し 、 更新 でき たか どう か を 返し ます
この 関数 は 、 bbcode _create で 作成 し た bbcode _container の 規則 に も とづい て 文字 列 to _parse を パース し ます
最終行 の 次 の 行 から テキスト を 出力 し ます
( x y を 中心 と する 円 を 描き ます
は 、 与え られ た ファイル 記述子 に関する 情報 を 返し ます
現在 アクティブ なすべ て の リソース の 配列 を 返し ます
この 関数 は 、 エクステンション の 現行 バージョン を 文字 列 として 返し ます
その クラス で 特定 の メソッド が 定義 さ れ て いる かど う か を 調べ ます
新しい reflectionmethod を 作成 し ます
テンプレート を レンダリング し 、 結果 を 返し ます
は 、 php の 配列 var _array を oracle の プレースホルダ name に バインド し ます
mpeg ファイル の id 3v 2 オブジェクト を 返し ます
新しい テンプレート を 開始 し ます
スクリプト を fdf に 追加 し ます
raw 画像 を 読み込み ます
データベース の 接続 オプション を 調節 し ます
指定 し た 範囲 の ページ に おける ページラベル の 形式 を 設定 し ます
エラー 配列 を 取得 し ます
ディレクトリ 内 の ファイル の 監視 を 要求 し ます
フィールド 情報 を 含む オブジェクト を 返し ます
直近 の pcre 正規 表現 処理 の エラーコード を 返し ます
mnogosearch 結果 パラメータ を 取得 し ます
アーカイブエントリ の crc を 、 十 六 進 文字 列表 現 で 返し ます
は 、 データベース へ の 問い合わせ に 使う 文字列 を エスケープ し ます
取得 し た 行 に 対応 する 連想 配列 を 返し 、 内部 データポインタ を ひとつ 進め ます
tar 形式 の アーカイブ の 場合 は 、 この メソッド は アーカイブ 全体 の 圧縮 を 解除 し ます
この 関数 は 、 指定 し た sequence の メッセージ の フラグ に 指定 し た flag を 設定 し 、 保存 し ます
この 関数 は 、 指定 さ れ た sequence の メールヘッダ を 取得 し て その 内容 の 概要 を 返し ます
結果 データ を 取得 し ます
の よう な 描画 関数 によっ て 事前 に 作成 さ れ た パス を 塗り つぶし 、 描画 し ます
各 画像 を シーケンス 内 の 次 の 画像 と 比較 し 、 最大 の 境界 範囲 を 返し ます
問題 を 、 oauthexception 形式 で 渡し ます
オープン さ れ た slob オブジェクト に関する 現在 の ファイル また は シーク 位置 を 設定 し ます
この 関数 は 、 成功 し た 場合 に 接続 リソース 、 失敗 し た 場合 に ゼロ を 返し ます
この 関数 を 使っ て 、 ingres データベースプロシージャ ストアドプロシージャ から の 返り値 を 取得 し ます
オブジェクト の フォントプロパティ を 設定 し ます
渡さ れ た 変数 を シリアライズ し 、 指定 し た パケット に 結果 を 追加 し ます
は 現在 オープン さ れ て いる トランザクション を ロールバック し 、 トランザクション の 間 に データベース に 行わ れ た 全て の 変更 を キャンセル し ます
管理 サーバー へ の 接続 を 閉じ 、 関連 する すべ て の リソース を 開放 し ます
既存 の bbcode _container tag _set に 、 tag _rules を 使用 し て タグ を 追加 し ます
現在 の ページ 上 の マッチボックス について の 情報 を 問い合わ せ ます
