この 関数 は 、 パレット 上 で 指定 し た インデックス index を 指定 し た 色 color に 設定 し ます
プリペアドステートメント を リセット し 、 実行 前 の 状態 に 戻し ます
バイナリ 文字 列 から 画像 を 読み込み ます
は 、 接続 さ れ て おり 区別 でき ない 2 つの ソケット を 作成 し 、 それ を fd に 保存 し ます
指定 さ れ た classes のすべて を 実装 、 拡張 また は 使用 し て 、 指定 さ れ た 名前 の クラス を 新規 作成 し ます
オブジェクト の グローバル 色空間 の 値 を 設定 し ます
文字列 haystack の 中 で 、 needle が 最初 に 現れる 位置 を 探し ます
アイテム が 存在 する かど う か を 調べ ます
キー keydata を インポート し 、 インポート 処理 に ついて の 情報 を 配列 で 返し ます
variant を 、 vt _date あるい は それ に 似た型 から unix タイムスタンプ に 変換 し ます
include _path 設定 オプション の 値 を 、 この スクリプト 内 で だけ 変更 し ます
メソッド を 使用 し て 画像 の サムネイル を 作成 する 方法 を 指定 する 際 に 便利 です
接続 で 使用 する データベース 名 を 取得 あるい は 設定 し ます
は 、 指定 し た postgresql connection リソース で 、 サーバー 側 の デバッグ 出力 が 送 られる tty 名 を 返し ます
dom 実装 が 、 指定 し た 機能 feature を 実装 し て いる かど う か を 調べ ます
オープン し て いる ファイルハンドル から 画像 を 読み込み ます
column _number で 指定 し た カラム の 型 を 返し ます
コンパイル さ れ た データ の 終了 を 示す 文字 \ x 0 0 を 書き込み ます
指定 し た 親 から 、 オブジェクト を 削除 し ます
実行 する sql 文 を 準備 し 、 sqlite 3stmt オブジェクト を 返し ます
画像 を 指定 し た 解像 度 に リサンプリング し ます
string を 、 正規 表現 によっ て 配列 に 分割 し ます
value を 優先 順位 priority で キュー に 挿入 し ます
コマンド と パラメータ を 分割 し て サーバー に 送信 し ます
この 館数 は 、 現在 の ノード の インデックス を 返し ます
クエリ が 返す レコード の 数 を 返し ます
は 、 ウェブベース の phar で 使用 し ます
グレースケール 画像 に 三次 元効 果 を 施し た もの を 返し ます
ユリウス 積算 日 を ユダヤ 暦 に 変換 し ます
は サーバー から の 直近 の メッセージ を 返し ます
ファイル の 統計 情報 を 集め ます
配列 から シンボルテーブル に 変数 を インポート し ます
作成 し た イベントリソース を 解放 し ます
アーカイブ の 全体 あるい は 指定 し た ファイル を 、 指定 し た 場所 に 展開 し ます
ドキュメント で 使用 し て いる 名前 空間 を 返し ます
直近 の クエリ について の 詳細 な 情報 を 返し ます
format によっ て 作成 さ れ た 文字列 を handle で 指定 し た ストリーム に 書き込み ます
modulus で 割っ た 余り を 求める こと を 考慮 し て 、 left _operand の right _operand 乗 を 高速 に 計算 し ます
その 位置 を もと にし て 属性 の 値 を 返し ます
この テキストノード が 空白 のみ を 含む （ あるい は 空 で ある ） かどう か を 示し ます
指定 し た ドキュメント の fdf バージョン 、 あるい は パラメータ を 指定 し なかっ た 場合 は ツールキット api の バージョン を 返し ます
は 、 php .ini を パース し た 後 で 、 設定 ファイル の リスト を カンマ 区切り で 返し ます
ラージオブジェクト の 内部 ポインタ を セット し ます
切り取る サイズ と 画像 の ジオメトリ を 設定 する 便利 な メソッド です
関数 は 、 level が 指す プロトコルレベル で ソケット socket の オプション optname に 値 optval を 設定 し ます
現在 バインド さ れ て いる すべ て の パラメータ を クリア し ます
ファイル の 中身 が 変更 さ れ た 時刻 を 返し ます
引数 str に対し て rot 1 3 変換 を 施し 、 その 結果 の 文字列 を 返し ます
結果 セット の 次行 から 単 一 カラム を 返し ます
imagick オブジェクト の グローバル gravity プロパティ を 取得 し ます
d を 法として n を 計算 し ます
データベース の 指定 さ れ た 位置 から 読み込ん だ データ を 返し ます
画像 の 高さ を 返し ます
現在 の パス の 角 の 形式 を 取得 し ます
画像 の シーン を 取得 し ます
ページ の 表示 を 、 ウィンドウ に あわせる よう 設定 し ます
ファイル が 存在 し 、 読み込み 可能 で ある かど う か を 調べ ます
この メソッド は 、 大文 字小 文字 を 区別 し ない arrayobject :: natsort です
配列 を 受け 取る パラメータ で ある かど う か を 調べ ます
この 関数 は 、 引数 で 渡し た フォーム を 実行 し ます
ファイル の パーミッション を 取得 し ます
予期 せ ぬ エラー が 発生 し た 場合 に 例外 を スロー する かど う か を 切り 替え ます
この ノード が マークアップ さ れ て い ない テキスト で ある かど う か を 調べ ます
現在 の 画像 上 の imagickdraw オブジェクト を レンダリング し ます
デフォルト の スケール を 設定 し ます
は 、 callback の result 引数 で ファイル の 状態 を 返し ます
ドキュメント を 、 指定 し た ファイル に 保存 し ます
画像 ピクセルストリーム の sha - 2 5 6 メッセージダイジェスト を 生成 し ます
デフォルト の イベントループ が 新しい イベント を ポーリング し た 回数 を 返し ます
サービス の 稼動 状況 を 問い合わせ 、 情報 を 配列 で 返し ます
data で 渡し た データ を yaml 形式 に して 返し ます
スペシャルファイル あるい は 通常 の ファイル を 作成 し ます
指定 し た 角度 だけ 画像 を 回転 さ せ ます
任意 の command を ftp サーバー に 送信 し ます
パラメータ value で 指定 し た 値 で 配列 を 埋め ます
この メソッド は 、 fclose に対応 し て コール さ れ ます
linejoin パラメータ を 設定 し 、 パス を 描画 する 際 の 角 の 形状 を 指定 し ます
画像 を 元 の サイズ の 2 倍 に 比例 拡大 し ます
画像 の 型 を 取得 し ます
パラメータ が null を 許可 する かど う か を 調べ ます
は 、 path で 指定 し た ファイル を 切り 詰め て 、 ちょうど length バイト に し ます
マルチバイト 文字 列 の 中 で 正規 表現 に 一致 し た 部分 の 位置 と 長さ を 配列 で 返し ます
この 関数 は 、 アクセスポイント ccl 限定 辞 が 定義 する サーバー に関し て ccl クエリパーサ と rpn へ の マッピング を 設定 し ます
メソッド を 実行 し ます
ldap ディレクトリ 内 の エントリ を 修正 し ます
distinct コマンド は 、 指定 し た キー に 対応 する 区別 できる 値 の 一覧 を 返し ます
関数 は 、 auto _increment 属性 を 持つ カラム が ある テーブル 上 で の クエリ により 生成 さ れ た id を 返し ます
指定 し た 1 個 の ファイル の 監視 を 指示 し ます
データベース へ の 接続 を オープン し ます
ノード の デフォルトドメイン を 返し ます
この 関数 は 、 dom ドキュメント の ノード を 引数 とし 、 simplexml ノード を 作成 し ます
ポリシー 名 を 含む 配列 を 取得 し ます
指定 し た 名前 の プロパティ を 画像 に 設定 し ます
イメージファイル を オープン し ます
は 、 path へ の シンボリックリンク new _path を 作り ます
現在 の 塗り つぶし 色 を 0 から 1 まで の グレー 値 に 設定 し ます
関数 は 、 socket から len バイト の データ を 受信 し て buf に 格納 し ます
この 関数 は 、 与え られ た クラス class の 親 クラス 名 を 配列 で 返し ます
クラス の バイトコード を 読み込み 、 ユーザー 関数 を コール し ます
現在 の リクエスト に おける すべ て の http リクエストヘッダ を 取得 し ます
は ユーザー が 定義 し た ビットマップ を 読み込み 、 その id を 返し ます
この 関数 は 文字列 str の 最後 から 空白 文字 を 取り除き 、 取り除か れ た 文字列 を 返し ます
画像 に 畳み込み 配列 を 適用 し ます
オフセット が 存在 する かど う か を 調べ ます
は 、 php token 値 の シンボル 名 を 返し ます
は 、 insert update delete クエリ により 変更 さ れ た タプル インスタンス / レコード / 行 の 数 を 返し ます
指定 し た チャネル の 尖度 と 歪度 を 取得 し ます
配列 を 、 要素 数 が size の 配列 に 分割 し ます
テキスト の アノテーション で 使う フォント の ポイント 数 を 返し ます
現在 の エントリ の イテレータ を 返し ます
関数 は 、 ホスト 名 あるい は ip アドレス に 対応 する 完全 な 国名 を 返し ます
によっ て 開始 し た テンプレート を 終了 し ます
キー の fingerprint を エクスポート し ます
画像 を 指定 し た ファイル 名 で 書き出し ます
エントリ の 最終 更新 時刻 を 取得 し ます
この 関数 を 定義 すれ ば 、 クラス の オートローディング を 有効 に でき ます
この メソッド が コール さ れる の は 、 フィルタクラス の オブジェクト の インスタンス を 生成 する とき です
は 、 その 名前 を ファイルシステム から 削除 し ます
固定 サイズ の サムネイル を 作成 し ます
登録 さ れ て いる イテレータインスタンス の current の 結果 を 取得 し ます
クラス の メソッド の 配列 を 取得 し ます
指定 し た relation から 前 の タプル の データ を 読み込み 、 tuple に 連想 配列 として 返し ます
この メソッド は 、 直接 コール する こと を 想定 し た もの で は あり ませ ん
この メソッド により 、 独自 に 拡張 し た dom クラス を 登録 する こと が でき ます
指定 し た 名前 の グループ に関する 情報 を 取得 し ます
現在 の php の 状態 に関する 、 多く の 情報 を 出力 し ます
整数 属性 を 、 現在 の radius リクエスト に アタッチ し ます
dom 表現 から html ドキュメント を 作成 し ます
は 、 id 3 タグ に 格納 さ れ て いる すべて の ジャンル を 配列 で 返し ます
この メソッド は 、 エントリ を 新しい 値 で 更新 し ます
ドキュメント の 一時 ストリーム を 巻き戻し ます
この 関数 は 、 variant の コピー を 作成 し て 、 それ を 指定 し た type に 強制 的 に 変換 し ます
テキスト の 印字 用 に 使用 する 現在 位置 を 取得 し ます
トランザクション を 閉じ ず に ロールバック し ます
は 、 大文 字小 文字 を 区別 し ない バージョン の natsort です
は データベース を 選択 し 、 そこで クエリー を 実行 し ます
この メソッド が コール さ れる の は 、 fflush への 対応 を する 場合 や ストリーム を 閉じる 場合 です
は fbsql _field _name 関数 と 同じ です が 、 返 さ れる 内容 が フィールド の 型 と なり ます
レスポンス の http ステータス を 返し ます
は 、 certificate signing request csr を 受け取り 、 それ を outfilename という 名前 の ファイル に ascii テキスト として 保存 し ます
クエリ 結果 に おい て フィールド の 型 を 取得 し ます
現在 の パス に対し て 、 3 つの 制御 点 を 指定 し て 3 次 ベジエ 曲線 を 追加 し ます
文字列 str の 、 start と length で 指定 さ れ た 一部 を 返し ます
この メソッド を 使っ て 、 固定 サイズ の コレクション や 特別 な オプション を 要する その 他 の コレクション を 作成 し ます
は 現在 の サーバー の 状態 を 返し ます
ファイル の 現在 の 行 を 取得 し ます
指定 し た ソケット の リモート 側 に 問い合わせ 、 その型 に 応じ て ホスト / ポート 、 あるい は unix ファイルシステム の パス を 返し ます
は 、 arg の サイン を 返し ます
内部 で の 結果 保持 用 に 割り 当て られ て い た メモリ を 開放 し ます
個人 の 単語 リストファイル を 設定 し ます
すべて の マップエントリ を 返し ます
は 、 yaz _errno で返さ れ た 直近 の エラー 番号 に 対応 する 英語 の メッセージ を 返し ます
は システムログ へ の 書き こみ に 使用 さ れ て いる デスクプリタ を 閉じ ます
filtername で 指定 さ れ た フィルタ を 、 stream に 付加 さ れ て いる フィルタ の リスト に 加え ます
evcheck ウォッチャーオブジェクト を 作り ます
value を json 形式 に し た 文字列 を 返し ます
は 、 文字列 haystack の 中 で の 副文 字列 needle の 出現 回数 を 返し ます
拡張 モジュール の バージョン を 取得 し ます
奇偶 規則 を 使用 し て 現在 の パス を 塗り つぶし ます
name という 名前 の 属性 を 要素 から 削除 し ます
正規 表現 フラグ を 設定 し ます
指定 し た 型 の エントリ の キャッシュ を 破棄 し ます
指定 さ れ た フィールドオフセット に 移動 し ます
result _id に 関連 する クエリ を 実行 し た 後 の sqlca .sqlerrd 0 から sqlca .sqlerrd 5 に関する 擬似 レコード を 返し ます
指定 し た ドキュメント 属性 の 文字 列値 を 取得 し ます
コレクション 間 で オブジェクト を 移動 し ます
は 、 pid の 優先 度 を 設定 し ます
inotify イベント を inotify インスタンス から 読み込み ます
プロセス pid の セッション id を 返し ます
指定 し た 色ペア の 前景 色 と 背景 色 を 取得 し ます
コンパイラ の 実行 を 中止 し ます
により 作成 さ れ た 結果 id から 全 て の 行 を 出力 し ます
二つ の 座標 を 指定 し て 、 現在 の 描画 色 と 線幅 そし て 塗り つぶし 設定 を 使っ た 矩形 を 描き ます
この 関数 は 、 __ autoload 用 の 代替 関数 で ある spl _autoload が 使用 する ファイル 拡張子 を 変更 し たり 調べ たり し ます
ディレクトリ を 先頭 に 巻き戻し ます
現在 の directoryiterator アイテム の inode 番号 を 取得 し ます
画像 を シャープ に し ます
これ は 、 id が 作ら れ た とき に time を 実行 し た 結果 と 同じ もの を 返し ます
指定 さ れ た 変数 を シリアライズ し た もの を 含む 構造 体 を 用い て wddx パケット を 作成 し ます
クエリ 結果 の フィールド について の 情報 を 取得 する ため に 使用 さ れ ます
gmagickpixel オブジェクト を 作り ます
フォーム の 結果 を 表示 する pdf ドキュメント として 、 もと の フォーム と は 別 の もの を 指定 し ます
クラス の 名前 を 取得 し ます
指定 し た data を base 6 4 で エンコード し ます
関数 は 、 国 コード と 地域 コード の 組み合わせ に 対応 する 地域 名 を 返し ます
指定 し た フィールドオフセット を 探し ます
この 関数 は 、 soap コール が 失敗 し た かどう か を 調べ たい が 、 例外 を 使用 し たく ない 場合 に 有用 です
取得 し た 行 に 対応 する 連想 配列 を 返し 、 内部 の データポインタ を 前 に 進め ます
scm に 、 実行 中 の サービス の 現在 の 状態 を 通知 し ます
string の アルファベット 部分 を すべ て 大文字 に して 返し ます ｡
format に 基づき 文字 列 フォーマット さ れ た 文字列 を 出力 し ます フォーマット は sprintf の ドキュメント に 既述 さ れ て い ます 
必須 の 依存 性 、 衝突 する 依存 性 の 両方 を 取得 し ます
path に ある ファイル あるい は ディレクトリ 、 シンボリックリンク を 作業 コピー から 削除 し ます
直近 で 失敗 し た sqlite リクエスト について の 英文 テキスト の 説明 を 返し ます
mask user group で 指定 し た 許可 属性 に 変更 し ます
は 、 ascii 変換 さ れ た pem エンコード さ れ た key を outfilename の ファイル に 保存 し ます
icc 、 iptc あるい は 汎用 の プロファイル を 画像 に 追加 あるい は 削除 し ます
現在 の 要素 の キー を 返し ます
バイナリ 文字 列 から 画像 を 読み込み ます
関数 は 、 対応 する geoip データベース の ファイル 名 を 返し ます
画像 を 指定 し た 解像 度 に リサンプリング し ます
この ブローカー で 発生 し た 直近 の エラー を 返し ます
は 、 既存 の キャッシュ 内 の すべ て の アイテム を 即時 デフォルト あるい は 指定 し た delay の 後 に 無効 化 し ます
stream で 指定 さ れ た ファイルポインタ に buffer で 表さ れ た バイト 数分 だけ 出力 バッファ を 設定 し ます
は 、 ファイル 名 を 変更 し たり 別 の 場所 に 移動 し たり し ます
関数 は 任意 の 画像 ファイル の 大きさ を 決定 し 、 ファイル の 型 と 高さ / 幅 を 表す 文字 列 を 返し ます
内部 イテレータ の フィルタリング し た 子 を 取得 し ます
コレクション の 子 、 あるい は 文書 の 属性 を 取得 し ます
この 関数 は 、 miller -rabin の 確率 的 テスト を 使用 し て 、 その 数 が 素数 か どう か を 調べ ます
コントローラ の モジュール 名 を 取得 し ます
現在 の ノード を 取得 し ます
現在 の 画像 シーケンス を 、 replace で 指定 し た オブジェクト の 画像 で 置き 換え ます
ノード の 文字 データ の 最後 に 文字列 data を 追加 し ます
現在 の プロセス の 実際 の ユーザー id を 返し ます
画像 の ヒストグラム を imagickpixel オブジェクト の 配列 で 返し ます
現在 の php スクリプト に 割り 当て られ た メモリ の 量 を バイト 単位 で 返し ます
は 、 取得 し た 行 （ レコード ） を 配列 で 返し ます
x 方向 および y 方向 の 解像 度 を 取得 し ます
エンコーダ の 型 を 取得 し ます
は 機能 的 に memcached :: deletemulti と 同等 です
指定 し た ドキュメント について 発生 し た tidy エラー の 数 を 返し ます
と ev :: resume が 、 それぞれ ループ の 一時 停止 と 再開 に 対応 し ます
文字列 の 最初 から 空白 もしく は その 他 の 文字 を 取り除き ます
指定 し た dn で ひとつ あるい は 複数 の 属性 の 置換 を 行い ます
クオータレベル の 設定 、 メールボックス 毎 の 使用 状況 を 取得 し ます
テキスト の アノテーション で 使う フォント の ウェイト を 返し ます
一段下 がる とき に コール さ れ ます
これ は 、 カーソル の 反復 処理 が 始まる 前 で も 後 でも コール する こと が でき ます
指定 し た パラメータ により 取得 し た メッセージ 番号 を ソート し ます
描画 に 使う 不透 明度 を 返し ます
データベース から blob データ を 読み込み ます
待機 中 の fam イベント を 調べ ます
この 関数 は 、 属性 が 定義 済み の id かどう か を 調べ ます
バックスラッシュ を 取り除い た 文字列 を 返し ます
クラスメソッド に関する reflectionmethod を 取得 し ます
結果内 の 最初 の エントリ の エントリ id を 返し ます
与え られ た 連想 配列 もしく は 添字 配列 から url エンコード さ れ た クエリ 文字 列 を 生成 し ます
local _socket で 指定 さ れ た 接続 ポイント に 、 ストリーム また は データグラムソケット による 接続 を 作成 し ます
arg の アークタンジェント を ラジアン で 返し ます
radius リクエスト に は 、 リクエスト の 種類 を 指定 する コード および 追加 情報 を 指定 する ゼロ 個以 上 の 属性 が 含ま れ ます
現在 の キー を 返し ます
は 、 プリペアドステートメント を 作成 し ます
エラー の 数 を 取得 し 、 また オプション で エラーメッセージ も 取得 し ます
サーバー 上 の 、 特定 の カーソル を 削除 し たく なる こと が あり ます
は 、 指定 し た data の 署名 を 作り ます
mnogosearch api バージョン 番号 を 取得 し ます
email を 送信 し ます
関数 socket _write は 、 buffer の 内容 を ソケット socket に 書き込み ます
通常 の ssl ピア 証明 書 および ホスト の チェック を 有効 に し ます デフォルト は 有効 です 
関数 で 定義 さ れ て いる パラメータ の 数 を 、 必須 と 任意 の 両方 を 含め て 取得 し ます
frontbase サーバー へ の 持続 的 な 接続 を 確立 し ます
この 関数 は 、 ファイル の 拡張 属性 の 値 を 設定 し ます
ファイルポインタ handle により オープン さ れ た ファイル の 統計 情報 を 取得 し ます
id 3 v 2 . x フレーム 内 の 画像 フレーム に 添付 さ れ た 説明 を 返し ます
は エラー severity レベル の 最小値 を 設定 し ます
関連付け られ て いる プロパティ の うち 、 パターン に マッチ する もの を すべ て 返し ます
座標系 を x 方向 および y 方向 に それぞれ alpha 度 、 beta 度歪 ませ ます
クエリ 結果 から 列 データ を 順 に 返し ます
直近 の db ++ 操作 から の エラーコード を 返し ます
画像 の 圧縮 を 設定 し ます
文字列 を 汚染 さ せ ます
画像 の 各 チャネル の 統計 情報 を 返し ます
文書 に対する 現行 の boost 値 を 取得 し ます
直近 の 転送 に関する 情報 を 取得 し ます
現在 の 画像 シーケンス を 使用 し た 新しい imagick オブジェクト を 返し ます
指定 し た パラメータ で プリペアドステートメント を 実行 する リクエスト を 送信 し 、 その 結果 を 待ち ませ ん
は 、 現在 の リソース に おける ソフトリミット および ハードリミット を 配列 で 返し ます
リモート の ssh サーバー と の 接続 を 確立 し ます
現在 の 要素 の 後 に 置く 文字 列 を 取得 し ます
ローカル また は リモートサーバー の データベース を 停止 し ます
は 、 result リソース に関する エラーメッセージ の 特定 の フィールド を 返し ます
zend .enable _gc を 0 に 設定 し て 、 循環 参照 コレクタ を 無効 に し ます
この 日付 の 文字 列表 現 を 返し ます
名前 を 使用 し て 、 エントリ の コメント を 設定 し ます
ワーカー が シャットダウン し た かどう か を 調べ ます
指定 し た ディレクトリ を 作成 し ます
現在 の 線幅 を 設定 し ます
id 3 タグ の コメント を 返し ます
は 、 指定 し た リンク id が 指す サーバー から データベース 全体 を 破棄 削除 します
database について 説明 する 結果 ポインタ を 返し ます
arrayobject を 配列 に エクスポート し ます
 / status キー の 値 を 取得 し ます
ファイル の グループ を 取得 し ます
後 で pdf _setfont で 使用 する フォント を 検索 し 、 準備 し ます
新しい v 8js オブジェクト を 作成 し ます
は 、 サーバー に 同名 の キー が 存在 し ない 場合 に 限り 、 key という キー で 値 var を 格納 し ます
link で 表さ れる 接続 で 使用 し て いる mysql プロトコル の バージョン を 整数 値 で 返し ます
指定 し た 接続 リソース について の autocommit の 状態 を 設定 あるい は 取得 し ます
指定 し た 範囲 の 全て の テーブルリスト を 得 ます
postgresql は 、 ある 種 の 文字 セット について は サーバー と クライアント の 間 の 自動 文字 コード 変換 を サポート し て い ます
function パラメータ で 指定 し た ユーザー 定義 の 関数 あるい は メソッド を 、 それに 続く 引数 を 指定 し て コール し ます
は 、 id3v 2 フレーム の 長い 名前 を 返し ます
指定 し た バッファ つき イベント を 無効 に し ます
関数 の クローン を 作成 し ます
ディスク 上 の pdf ドキュメント あるい は 仮想 pdf ドキュメント を オープン し 、 あと で 使える よう に 準備 し ます
asxml メソッド は 、 親 オブジェクト の データ を xml version 1 . 0 形式 に フォーマット し ます
指定 し た object について 、 その スコープ 内 で アクセス 可能 な 非 static プロパティ を 取得 し ます
この 関数 は 、 使用 する アルゴリズム および モード の モジュール を オープン します
は 、 パラメータ errno に socket _last _error の 返す ソケットエラーコード を 受け取り 、 対応 する 内容 を 文字列 で 返し ます
zip _entry により 指定 さ れ た ディレクトリエントリ の 圧縮 方法 を 返し ます
与え られ た 文字 列 text のすべて の 文字 が 句読 点 で ある かど う か を 調べ ます
は 入力 文字 列 の まわり に 引用 符 を 付け 必要 で あれ ば 、 入力 文字列 に ある シングルクオート を エスケープ し ます
ひとつ あるい は 複数 の チャネル の 内容 を 再構 築 し た 画像 と 比較 し 、 指定 し た 歪み 係数 を 返し ます
指定 し た object の クラス 名 を 取得 し ます
は 、 haystack の 中 で 最初 に needle が 現れる 場所 を 探し 、 haystack の 部分 文字 列 を 返し ます
は memcache :: connect とほぼ 同じ です が 、 確立 する 接続 が 持続 的 なもの で ある という 点 が 違い ます
は 、 str を 引数 とし 、 正規 表現 構文 の 特殊 文字 の 前 に バックスラッシュ を 挿入 し ます
スレッド 化 さ れ た メッセージ の ツリー を 取得 し ます
プロパティ の 値 を 設定 変更 します
この 関数 は 、 ソート 条件 を 設定 し て z 3 9 . 5 0 sort を 有効 に し ます
指定 し た curl セッション を 実行 し ます
イテレータ 内 の 指定 し た 位置 に 移動 し ます
画面 全体 の スクリーンショット を 取得 し ます
3 つの 制御 点 を 使用 し て 現在 の 点 から ベジエ 曲線 を 描画 し ます
は パッシブモード を オン また は オフ に し ます
例外 を ジェネレータ に スロー し て 、 ジェネレータ を 続行 し ます
ストアドプロシージャ また は リモートストアドプロシージャ へ パラメータ を バインド し ます
データ を 指定 し て 、 チェックボックスツリー の アイテム を 探し ます
指定 し た 位置 の 属性 に カーソル を 移動 し ます
既存 の paradox データベースファイル を オープン し ます
現在 位置 を 新しい 座標 に 指定 し ます
この 関数 は 、 domattr クラス の 新しい インスタンス を 作成 し ます
ftp サーバー 上 に 、 指定 し た directory を 作成 し ます
ストリームラッパー を 閉じる とき に 、 streamwrapper :: stream _flush の 直前 に 呼び出さ れ ます
指定 し た インデックス の 値 を 削除 し ます
平面度 を 設定 し ます
現在 の directoryiterator の アイテム の ベース 名 を 取得 し ます
開い て いる すべ て の 接続 と 、 それぞれ の サーバー の 情報 を 配列 で 返し ます
各 リクエスト の 終了 時 に php がすべて の リソース を 開放 する ので 、 この 関数 を コール する 必要 は あり ませ ん
protected プロパティ で ある かど う か を 調べ ます
画像 の 極値 を 取得 し ます
現在 の セッション を 閉じ ます
ncurses インターフェイス を 初期化 し ます
ファイル から 1 行取り出し ます
メソッド で 与え られ た スタイルシート を 適用 し 、 ソースノード を 文字列 に 変換 し ます
この メソッド は 、 チェックボックスツリー の 選択 さ れ て いる アイテム を 返し ます
この 関数 は 、 現在 の ノード の インデックス を 返し ます
それ 以降 の soap リクエスト で 使用 する エンドポイント url を 設定 し ます
result で 指定 し た id に関連付け られ た 全 メモリ を 開放 し ます
エントリ に対する すべ て の 変更 を 取り消し ます
env 変数 を 取得 し ます
a から b を 引い た 結果 を 返し ます
与え られ た 変数 が 配列 か どう か を 検査 し ます
クエリ から 、 結果 セット の 次 の 行 を 含む 数値 添字 配列 を 返し ます
渡さ れ た オブジェクト が マップ 内 で 参照 さ れ て いる かど う か を 調べ ます
さまざまな readline の 内部 変数 の 取得 あるい は 設定 を 行い ます
現在 の スペリングセッション の 、 直近 の エラー を 返し ます
この メソッド は 、 feof に対応 し て コール さ れ ます
データベース を 指定 し ない 場合 は 、 現在 の データベース を 使い ます
新しい フォーム を 作成 し ます
セッション を 破棄 し ます
は 、 指定 し た key が データベース に 存在 する かど う か を 確認 し ます
属性 の 値 を 取得 し ます
left _operand から right _operand を 引き ます
xml パーサ parser の デフォルト の ハンドラ 関数 を 設定 し ます
は 共有 メモリブロック の 大きさ を 得る ため に 使用 さ れ ます
は 、 infilename という 名前 の ファイル の 内容 について パラメータ signcert および privkey で 指定 し た 証明 書 と 公開鍵 を 用い て サイン を します
指定 し た 文字列 を エスケープ し 、 sql ステートメント で 安全 に 使用 できる よう に し ます
直近 の 警告 メッセージ を 返し ます
ucd ライブラリ に 保持 さ れ た quick _print の 現在 の 値 を 返し ます
新しい オブジェクト を 挿入 し ます
は 、 結果 セット に おける 行 の 数 を 返し ます
指定 さ れ た odbc 結果 id におい て 指定 番号 で 参照 さ れる フィールド の sql 型 を 取得 し ます
ドキュメント を 開い た とき に 、 どの ページ を 表示 する か を 定義 し ます
この 関数 は 、 チェックボックスリソース の さまざまな フラグ を 設定 し ます
この 関数 は 、 現在 の 配列 キー を 返し ます
クラス で 定義 さ れ て いる 定数 を 取得 し ます
dbase データベース から 、 レコード を 連想 配列 として 取得 し ます
関数 ip 2long は 、 インターネット 標準 形式 ドット 表記 の 文字列 表現 から 、 長整 数 表現 の ipv 4 インターネットネットアドレス を 生成 し ます
指定 し た キー の 変数 が ユーザーキャッシュ に 存在 する かど う か を 調べ ます
は 相当 する pdostatement オブジェクト によっ て 実行 さ れ た 直近 の delete insert update 文 によっ て 作用 し た 行数 を 返し ます
index で 指定 し た 添字 が 存在 する かど う か を 返し ます
この 関数 は 、 新しい アイテム を チェックボックスツリー に 追加 し ます
は 、 すべて の memcache サーバー の 状態 を 含む 配列 を 返し ます
この 関数 は 、 キー が 押さ れる まで 結果 を 返し ませ ん
リモートデータベース に 接続 し ます
オブジェクト 内 の 名前 と 値 の ペア の パラメータ を 全て 返し ます
置換 候補 を 保持 する ファイル を 設定 し ます
left _operand に right _operand を 掛け ます
指定 し た options に 基づい て principal を 変更 し ます
画像 の 色度 が 白い点 を 設定 し ます
指定 し た jpeg 画像 を 読み込み ます
php .ini ファイル が 読み込ま れ て いる かど う か を 調べ 、 その パス を 取得 し ます
この メソッド は 、 ラッパー が 初期化 さ れ た たとえ ば fopen や file _get _contents 直後 に コール さ れ ます
mysql _connection と memcache _connection を 関連 づけ ます
反復 処理 が 可能 で ある かど う か を 調べ ます
文字列 str におい て 指定 し た 文字 領域 に ある 数値 エンティティ を 変換 し 、 変換後 の 文字列 を 返し ます
str の 中 で 指定 し た 文字 コード を 文字 コード から html 数値 エンティティ に 変換 し ます
名前 を もと に し て 、 アーカイブ 内 の エントリ を 削除 し ます
は 、 指定 し た 文字 列 value を 既存 の アイテム の 前 に 付加 し ます
blur にじみ フィルタ を 画像 に 追加 し ます
この 関数 は 、 主 に データベース で 修正 さ れ た レコード の 数 を 得る 際 に 有用 です
画像 の 型 を 返し ます
リクエストトークン 、 secret そして 追加 の レスポンスパラメータ を サービスプロバイダ から 取得 し ます
この スレッド が 開始 し た かどう か を 調べ ます
現在 の メールボックス に関する 情報 を 調べ ます
新しい recursivetreeiterator を 、 指定 し た 再帰 イテレータ から 作成 し ます
画像 ピクセルストリーム の sha - 2 5 6 メッセージダイジェスト を 生成 し ます
と似 て い ます が 、 datetimeimmutable で 動作 し ます
関数 dio _fcntl は 、 ファイル 記述子 fd におい て cmd で 指定 さ れ た 処理 を 行い ます
画像 の 解像 度 を 設定 し ます
指定 し た バッファ つき イベント を 有効 に し ます
は 、 指定 し た オプション option の 値 を 新しい 値 value に 更新 し ます
フォント の 名前 を 取得 し ます
xpath メソッド は 、 xpath path に マッチ する simplexml ノード を 検索 し ます
は 、 この 拡張 モジュール により サポート さ れる 全て の ハンドラ の 一覧 を 返し ます
val を 、 指定 し た precision 小数 点以 下 の 桁数 に 丸め た 値 を 返し ます
指定 し た 名前 の 画像 プロファイル を 削除 し て 返し ます
画像 の 周り を 枠線 で 囲み ます
mpeg ファイル の チャンネル 数 を 返し ます
指定 し た リンク id 上 の 、 現在 アクティブ な データベース を 設定 し ます
指定 し た 画像 の 仮想 ピクセルメソッド を 返し ます
ユーザー から の 入力 を 一行 読み込み ます
サーバー 上 で 一定 の 時間 何 も しない 状態 が 続け ば 、 デフォルト で は カーソル は & quot ; 死 に ます &quot ;
エラー の 原因 の 数 を 返し ます
取得 さ れ た 行 に 対応 する 配列 を 返し 、 内部 の データポインタ を 前 に 進め ます
を 使用 し て 、 結果 セット の 現在 の 行 から 指定 し た カラム の 値 を 取得 し ます
ある 数 の 符号 を 反転 し た もの を 返し ます
直近 の sqlstate を 文字列 で 返し ます
「 ファイル 選択 」 フィールド fieldname によっ て アップロード さ れ た ファイル を 展開 し 、 それ を savepath に 保存 し ます
この メソッド は 、 solrdocument インスタンス に フィールド を 追加 し ます
親 ディレクトリ に 移動 し ます
hostname で 指定 し た インターネットホスト を 検索 し て 得 られ た ipv 4 アドレス の リスト を 返し ます
イテレータ を 、 ストレージ 内 の 次 の オブジェクト に 移動 し ます
読み込み 操作 を サポート する ファイルハンドラ を 返し ます
directory 内 の ファイル および ディレクトリ を 配列 で 返し ます
library で 指定 さ れ た php 拡張 モジュール を 読み込み ます
指定 し た データベース の すべ て の コレクション の リスト を 取得 し 、 その 名前 を 文字 列 の 配列 で 返し ます
原罪 の 画像 の gravity プロパティ を 設定 し ます
辞書 リソース を 開放 し ます
は 、 key に対応 する 既存 項目 の 値 を 置換 する ため に 使用 し ます
画像 の 周り に 三次元 の 枠線 を 追加 し ます
インデックス を 使用 し て 、 エントリ の コメント を 設定 し ます
双方向 リンクリスト にまだ ノード が ある かど う か を 調べ ます
全て の 種類 の 注記 の 境界 の 破線 形式 を 設定 し ます
フォント を 検索 し 、 後 に 使用 する ため に 準備 し ます
ファイル の 拡張子 を 取得 し ます
サービスプロセス に 送信 さ れ た 、 直近 の 制御 コード を 返し ます
文書内 の フィールド を 全て 含む 配列 を 返し ます
リクエスト に 固有 の ssl チェック を 調整 し ます
は 、 結果 セット に おける フィールド 数 を 返し ます
データ を 一時 ストリーム から 読み込み ます
リンク に関する 情報 を 取得 し ます
left を right で 割り 、 その 結果 を 返し ます
textflow の 現在 の 状態 を 問い合わ せ ます
現在 の グラフィックスモード を 取得 し ます
画像 ブロック を 、 その プロパティ に 基づい た さまざまな データ で 塗り つぶし ます
シンボリックリンク filename の 所有 者 を user に 変更 しよ う と 試み ます
画像 セクション の imagickpixeliterator を 取得 し ます
val が & # 0 3 9 ; 非数 値 not a number & # 0 3 9 ; で ある かど う か を 調べ ます
right を left から 引き ます
スクリプト が 実行 可能 な 秒数 を 設定 し ます
指定 し た blob オブジェクト を 二重化 し ます
soapserver オブジェクト で 定義 さ れ て いる 関数 の 一覧 を 返し ます
ファイルポインタ handle を 引数 とし 、 ファイル を 指定 し た 長さ 、 サイズ に 丸め ます
は 、 ファイル の コア 内 の 情報 を ストレージデバイス に 同期 さ せ ます
画像 の ヒストグラム を imagickpixel オブジェクト の 配列 で 返し ます
全て の apache レスポンスヘッダ を 配列 として 取得 し ます
メールボックス の リスト を 読み込み ます
オブジェクト の ポイントサイズプロパティ を 設定 し ます
文字列 string を 、 指定 し た 座標 で 垂直 に 描画 し ます
双方向 リンクリスト の 現在 の ノード を 取得 し ます
データベース 上 で 検索 を 実行 する ため の クエリオブジェクト を 取得 し ます
old _file と new _file の 差分 を 含む unified diff を 作成 し 、 ファイル dest に 保存 し ます
は 、 直近 の 検索 に関する ヒット 数 を 返し ます
epoch から 現在 時刻 まで の 秒数 を 返し ます
yaf _config _simple から php の 配列 を 返し ます
スタイルシート 処理 時 の プロファイル 情報 を 出力 する ファイル を 設定 し ます
トランザクション を 開始 し ます
3d ビュー を 作成 し ます
文書 の 配列 表現 を 返し ます
以前 に 読み込ま れ て いる 画像 を ページ に 配置 し ます
あと で ifx _do で 使用 する ため の query を 準備 し ます
直近 の エラー 番号 を 整数 値 で 返し ます
solr サーバー から の 生 の レスポンスヘッダ を 返し ます
この 正規 表現 の 文字 列表 現 を 返し ます
class に parent を 拡張 さ せ ます
は データベース を 同期 し ます
大文字 小文字 を 区別 せ ず 、 文字 列内 で 最後 に あらわ れる 場所 の 書記 素単 位 の 位置 を 見つけ ます
domnodelist オブジェクト から 、 index で 指定 し た ノード を 取得 し ます
現在 の プロセス を 所有 する ユーザー の ログイン 名 を 返し ます
サブパス と ファイル 名 を 取得 し ます
この メソッド は 、 現在 の simplexmliterator 要素 が 子要素 を 持つ かど う か を 調べ ます
デフォルト の 外部 エンティティローダー を 変更 し ます
この 関数 は 、 php から 既存 の 関数 を バイトコード として 読み込み 、 開か れ て いる ファイルハンドル に 書き込み ます
定義 さ れ て いる 定数 を 取得 し ます
読み込み の セカンダリ へ の 分散 について の 情報 は 、 この マニュアル の 問い合わせ の 節 を 参照く ださい
データベースサーバー の 統計 情報 を 返し ます
imagick イテレータ を 最初 の 画像 に 設定 し ます
イテレータ を 、 position で 指定 し た オフセット に 移動 し ます
この メソッド は 、 既存 の ハッシュ を ディスク に 保存 し ます
直近 の snmp リクエスト の エラー 文字 列 を 返し ます
与え られ た 文字 列 text のすべて の 文字 が 制御 文字 で ある かど う か を 調べ ます
imagick オブジェクト の サイズ を 設定 し ます
は 、 リクエスト を リクエストグループ に 追加 し ます
相対 ファイルパス と それ に 対応 する 絶対 ファイルパス と の 対応 を 記録 し た キャッシュ について の 情報 を 取得 し ます
gd 2 ファイル また は url の 指定 し た 部分 から 新規 イメージ を 生成 し ます
三次ベジエ 曲線 を 描画 する 際 の 閾値 を 設定 し ます
サービス を 停止 し ます
後続 の 接続 で 使用 する 、 オブジェクト の データベース ・ エディション を 設定 し ます
指定 し た 拡張 モジュール に関する & quot ; phpinfo & quot ; の 情報 を 表示 し ます
ispell データ 用 に 確保 さ れ た メモリ を 解放 し ます
インストール さ れ た ハンドラ を 削除 し 、 端末 の 設定 を もと に 戻し ます
この 関数 は 、 simplexml クラス の ノード node を 受け取り 、 それ を domelement ノード に 変換 し ます
文字列 haystack の 中 で の 部分 文字 列 needle の 出現 回数 を 数え ます
実行 時 に 、 名前 を 指定 し て 定数 を 定義 し ます
で 設定 し た load data infile local ハンドラ を 削除 し ます
子 プロセス が 終了 し た 原因 が 、 シグナル が 捕捉 さ れ なかっ た こと で ある かど う か を 調べ ます
は 、 frontbase サーバー へ の 接続 を 確立 し ます
新しい filteriterator を 作成 し ます
function の 名前 を rename に 変更 し ます
イテレータ を 追加 し ます
で 開始 し た トレース を 停止 し ます
画像 の 幅 を 取得 し ます
この コンストラクタ は 、 wsdl モード もしく は 非 wsdl モード で soapclient オブジェクト を 生成 し ます
データベース 内 の テーブル および 関連 する メタデータ を 含む 結果 セット を 返し ます
名前 空間 uri および 型名 を 指定 し て sdo _dataobject を 作成 し ます
ひとつ あるい は 複数 の 属性 を 、 指定 し た dn から 削除 し ます
セッション の データ を セッションストレージ から 読み込み 、 その 結果 を php の 内部 処理 用 に 返し ます
外部 イテレータ を 返し ます
この 関数 は ingres _fetch _array に 似 て い ます が 、 配列 の 代わり に オブジェクト が 返さ れる という 違い が 一つ あり ます
は 、 与え られ た bzip 2 ファイルポインタ から 読み込み ます
は 、 ひとつ の 違い を 除い て current と 同じ です
は 、 指定 し た postgresql connection リソース の オプション を 保持 する 文字 列 を 返し ます
画像 リスト から 画像 を 削除 し ます
これ は 、 solrinputdocument :: clear の エイリアス です
現在 の 接続 の 文字 セット で unescaped _string の 特殊 文字 を エスケープ し 、 mysql _query で 安全 に 利用 できる 形式 に 変換 し ます
テキスト の 位置 を 次 の 行 の 行頭 に 移動 し ます
query から キーワード を 抽出 し ます
何 もし ませ ん
blur にじみ フィルタ を 画像 に 追加 し ます
imagick オブジェクト の サイズ と オフセット を 設定 し ます
3 つの ファイル を ひとつ に 統合 し 、 結果 を ファイル dest に 保存 し ます
bzip 圧縮 さ れ た ファイル を 読み込み 、 バイトコード から クラス を 生成 し ます
この ノード が php で ある かど う か を 調べ ます
画像 の 色空間 を 設定 し ます
画像 の クリップマスク を 含む imagick オブジェクト を 返し ます
パス の 描画 用 に 使用 する 現在 位置 を 取得 し ます
は 、 ある 文字 列 から の 部分 文字 列 の 抽出 を mb _substr と 同じ 方法 で 行い ます
この 関数 は 、 gettext が コール さ れ た 際 に 検索 を 行う ドメイン を 設定 し ます
指定 し た パラメータ で プリペアドステートメント を 作成 する リクエスト を 送信 し 、 その 結果 を 待ち ませ ん
ファイル や ディレクトリ の オーナー を 変更 し ます
imagick オブジェクト の フォーマット を 返し ます
sql 文 によっ て 削除 、 挿入 あるい は 更新 さ れ た 行 の 数 を 返し ます
数字 の エージェントエラーコード を 受信 し ます
クエリ に マッチ する すべ て の レコード を 削除 し ます
error _code で 指定 し た エラーコード について の 説明 テキスト を 取得 し ます
対象 に マッチ する ピクセル と その 近傍 の 色 を 変更 し ます
現在 の ドキュメント の 任意 の ページ に 移動 先 を 作成 し ます
は 、 ファイルディスクリプタ fd で 指定 し た ファイル や ディレクトリ の オーナー を 変更 し ます
mysql の character _set 変数 の 値 を 取得 し ます
アノテーション が 初期 状態 で 開い て いる かど う か を 定義 し ます
ベンダー 固有 の 整数 属性 を 、 現在 の radius リクエスト に アタッチ し ます
自動的 に リダイレクト を たどり まず
は 、 mssql _fetch _row の 拡張 版 です
フィールド field の 、 oracle における 生 の & quot ;sqlt &quot ; データ 型 を 返し ます
evchild ウォッチャーオブジェクト を 作り ます
id 3v 1 タグ を 表す オブジェクト を 返し ます
ローカル な 数値 および 通貨 フォーマット 情報 を 有する 連想 配列 を 返し ます
domnamednodemap オブジェクト から 、 index で 指定 し た ノード を 取得 し ます
bevent の 優先 度 を 設定 し ます
変数 が 空 で ある かど う か を 検査 し ます
phar アーカイブ 内 の ファイル を 、 その アーカイブ 内 で 別 の 新しい ファイル として コピー し ます
新しい ドキュメント の インスタンス を 生成 し ます
読み込み の セカンダリ へ の 分散 について の 情報 は 、 この マニュアル の 問い合わせ の 節 を 参照く ださい
画像 の シーン を 取得 し ます
field _number に対応 する フィールド の 幅 を 返し ます
は 、 db ++ クライアントライブラリ に 組み込ま れ た aql インタプリタ を 使用 し て ローカル raw aql クエリ を 実行 し ます
指定 し た エンコーディング encoding で tidy 設定 ファイル を ロード し ます
ストアドプロシージャ の パラメータ を 含む 結果 セット を 返し ます
この 関数 は 、 phar アーカイブ 内 で の ファイル の 大きさ を 返し ます
kerberos データベース に対する すべ て の 変更 を 取り消し 、 kerberos 管理 サーバー と の 接続 は オープン し た まま に し ます
クエリ の ヒント 文字 列 を 取得 し ます
ワーカー が 実行 終了 を 待っ て いる オブジェクト の 数 を 返し ます
は 、 php が 稼動 し て いる オペレーティング システム に関する 説明 を 返し ます
イメージ の パレット で 指定 し た 色 + アルファ 値 の インデックス を 返し ます
サーバー 設定 について の 情報 を 返し ます
読み込ま れ た フォント について の 詳細 情報 を 問い合わ せ ます
取得 さ れ た 行 を 表す プロパティ を 有する オブジェクト を 返し 、 内部 の データポインタ を 前 に 進め ます
curl ハンドル の セット を 閉じ ます
すで に 接続 し て いる ssh 2 サーバー から 、 公開鍵 サブシステム を 要求 し ます
fdf ドキュメント の 文字 エンコーディング を 設定 し ます
引数 number を 8 進数 表現 し た 文字列 を 返し ます
関数 が 名前 空間 内 で 定義 さ れ て いる かど う か を 調べ ます
imagick quantum depth を 文字列 で 返し ます
pdostatement オブジェクト に 関連 付け られ た 結果 セット から 1 行 取得 し ます
は 現在 の セッション から name という 名前 の グローバル 変数 の 登録 を 削除 し ます
と似 て い ます が 、 datetimeimmutable で 動作 し ます
は 、 ファイルディスクリプタ を 複製 し ます
arrayobject の 振る 舞い の フラグ を 取得 し ます
ディレクトリ から 、 glob pattern に マッチ する ファイル を 追加 し ます
画像 に 関連 付け られ て いる 合成 演算子 を 返し ます
は mssql _connect とほとんど 同じく 動作 し ます が 、 違う点 が 2 つあり ます
が指す データベース の 直近 の エラー について の 文字 列表 現 を 返し ます
は 、 msql _fetch _array に 似 て い ます が 、 配列 の 代わり に オブジェクト を 返す ところ だけ が 異なっ て い ます
疑似 乱数 の バイト 文字 列 を 生成 し ます
使用 さ れ て いる 接続 の 型 を 返し ます
ストレージ 内 の オブジェクト の 数 を 数え ます
読み込み バッファ を 設定 し ます
tar / zip アーカイブ 内 の すべ て の ファイル を ディスク に 展開 し ます
は 、 指定 さ れ た エントリ を データベース から 削除 し ます
新しい テーブル 、 あるい は 既存 の テーブル に セル を 追加 し ます
alias という 名前 の エイリアス を 、 ユーザー 定義 の クラス original に対し て 作成 し ます
は 、 指定 し た postgresql connection リソース が 接続 し て いる ホスト の 名前 を 返し ます
現在 の 要素 の 前 に 置く 文字 列 を 取得 し ます
は 、 ファイル の 最終 アクセス 時刻 と 変更 時刻 を 変更 し ます
コンテンツ を レスポンス に 設定 し ます
指定 し た variable _key を 有する 変数 を 共有 メモリ から 削除 し 、 占有 する メモリ を 解放 し ます
その レベル の 再帰 処理 が 終了 し た とき に コール さ れ ます
csv フィールド を 処理 する のに 使わ れる 区切り と 囲み 文字 を 取得 し ます
コンシューマハンドラコールバック として 登録 し た 関数 を コール し ます
この クラス が クローン 可能 か どう か を 返し ます
開い て いる ファイルハンドル から データ を 読み込み 、 バイトコード から クラス を 生成 し ます
は 、 プリンシパル の 名前 を 含む 配列 を 返し ます
文字 オブジェクト を 作成 し ます
gif 形式 の 画像 を 、 シーケンス 内 の ひとつ 前 の 画像 と 比較 し ます
直近 の ldap コマンド により 返さ れ た 、 標準 化 さ れ た エラー 番号 を 返し ます
は 、 文字列 ini の 設定 を 連想 配列 で 返し ます
sqlite 3 データベース を オープン し ます
snmp セッションオブジェクト を 閉じ ます
は 、 取得 する レコード の 構文 を 指定 し ます
画像 パレット 中 の 特定 の 色 の インデックス を 返し ます
文字列 に 変換 し ます
画像内 の スペックルノイズ を 軽減 し ます
現在 の directoryiterator アイテム の inode 修正 時刻 を 取得 し ます
画像 の 大きさ を 取得 し ます
str の 最初 の 文字 が アルファベット で あれ ば 、 それ を 小文字 に し ます
現在 の セッション を 閉じ ます
imagick イテレータ を 最後 の 画像 に 設定 し ます
ファイルシステム の リンク 先 を 取得 し ます
イテレータ の 位置 を 、 画像 リスト 内 の index で 指定 し た 位置 に 設定 し ます
指定 し た 引数 で プログラム を 実行 し ます
magic _quotes _runtime の 現在 アクティブ な 設定 を セット し ます
すべて の 登録 済み 設定 オプション を 返し ます
関数 socket _send は 、 buf から ソケット socket に len バイト の データ を 送信 し ます
直近 の soap レスポンス で 受信 し た xml を 返し ます
スレッド の 状態 を チェック
ランダム な ノイズ を 画像 に 追加 し ます
filename を 削除 し ます
この クラス が 名前 空間 内 で 定義 さ れ て いる かど う か を 調べ ます
指定 し た 接続 リソース 上 で 実行 中 の トランザクション を ロールバック し 、 新しい トランザクション を 開始 し ます
名前 と 国 を 指定 し て 、 似 た 名前 を 取得 し ます
現在 の 内部 イテレータ を 返し ます
2 つの variant の ビット 値 が 等しい か どう か を 調べ ます
a および p の & raquo ;& nbsp ; ヤコビ 記号 を 計算 し ます
は 、 その 時点 で サーバー 上 に key という キー の データ が 存在 する 場合 に 、 格納 さ れ て いる データ を 返し ます
この 関数 は 、 ccl パーサ を 起動 し ます
新しい domxpath オブジェクト を 作成 し ます
まだ 保存 さ れ て い ない 場合 に のみ 、 変数 を データ 領域 に キャッシュ し ます
lzf 拡張 モジュール が 圧縮 時 に 使用 し た 最適 化 指定 を 取得 し ます
odbc 結果 に おける フィールド カラム の 数 を 取得 し ます
は 、 指定 し た 結果 id が 指す ms sql 結果 に関する 内部 行 ポインタ を 指定 し た 行番 号 に 移動 し ます
振る 舞い の フラグ を 設定 し ます
リクエスト を ルーティング し ます
現在 の 要素 が 有効 か どう か を チェック し ます
種々 の assert 制御 オプション を 設定 し たり 、 単 に 現在 の 設定 を 調べ たり し ます
新しい セッション を 作成 する か 、 あるい は 既存 の セッション を 再度 初 期化 し ます
現在 の プロセス の 有効 な ユーザー id を 返し ます
json エンコード さ れ た 文字列 を 受け取り 、 それ を php の 変数 に 変換 し ます
クラス の デフォルトプロパティ 継承 し た プロパティ を 含む を 取得 し ます
現在 実行 中 の zend engine の バージョン を 含む 文字 列 を 返し ます
指定 し た フィールド の javascript アクション を 設定 し ます
指定 し た 色定 義 から 赤 、 緑 、 青 の 各 コンポーネント を 取得 し ます
新しい tokyotyrant オブジェクト を 作成 し 、 オプション で データベース に 接続 する
は 、 結果 id result に関する すべ て の メモリ を 開放 し ます
指定 し た 画像 リソース image の 高さ を 返し ます
は 、 memcache サーバー へ の 接続 が 持続 的 接続 か どう か を 調べ ます
この メソッド は php が & raquo ;& nbsp ;exslt library と 共に ビルド さ れ た かどう か を 判定 し ます
登録 さ れ て いる イテレータインスタンス の key の 結果 を 取得 し ます
指定 し た メールボックス の acl を 取得 し ます
座標系 を 回転 し ます
現在 の セッション を 終了 し 、 セッションデータ を 書き込み ます
新しい 属性 ノード attr を 要素 に 追加 し ます
指定 し た dn を より ユーザー に わかり やすい 形式 に する ため 、 型名 を 取り除き ます
前 に バックアップ し た 関数 を リストア し ます
画像 の レベル を 調整 し ます
利用 可能 な ハッシュ id の 最大 値 を 取得 し ます
現在 の directoryiterator アイテム が 読込 可能 か どう か を 調べ ます
トランザクション を コミット し 、 次 に pdo :: begintransaction で 新た な トランザクション が 開始 さ れる まで 、 データベース 接続 を オートコミットモード に 戻し ます
数 値型 を 有する pdi ドキュメントパラメータ の 内容 を 取得 し ます
修正版 utf - 7 の text を iso - 8 8 5 9 - 1 文字列 に デコード し ます
文字列 str について 、 . \ + * ? [ ^ ] $ の 前 に バックスラッシュ 文字 \ で クォート し て 返し ます
原因 の 型 を 返し ます
関数 は 、 signo が 指す シグナル に関する ハンドラ を 新た に 設定 する か 、 既存 の ハンドラ を 置き 換え ます
テンプレート を レンダリング し て 、 結果 を 返し ます
この メソッド を 使用 する と 、 空 の ディレクトリ が dirname に 作成 さ れ ます
デジタルフィルタ を 適用 し て 、 ノイジー な 画像 の 品質 を 向上 さ せ ます
リターン を 生じ た 子 プロセス が 現在 停止 し て いる かど う か を 調べ ます
画像 ヒストグラム を 均等 化 し ます
読み込み の セカンダリ へ の 分散 について の 情報 は 、 この マニュアル の 問い合わせ の 節 を 参照く ださい
は 、 文字列 を 与え られ た bzip 2 ファイルストリーム に 書き込み ます
指定 し た メールボックス の acl を 設定 し ます
ラベル を 画像 に 追加 し ます
クエリ の 次 の 行 を 内部 バッファ に 取得 し ます
この メソッド は 、 シリアライズ し た ハッシュ を 返し ます
固定 サイズ の サムネイル を 作成 し ます
指定 し た ttf ファイル を 読み込み 、( オプション で その データ を ドキュメント に 埋め込み ます
実行 中 の スクリプト 本体 の 最終 更新 時刻 を 取得 し ます
phar アーカイブ 内 の ファイル の メタデータ を 返し ます
指定 し た インデックス の エントリ に対する すべ て の 変更 を 取り消し ます
現在 の cpu 使用 状況 について の 情報 を 取得 し ます
前 に 行っ た 操作 の エラーコード を 返し ます
新しい paradox オブジェクト を 作成 し ます
この 関数 は 、 インデックス を 使用 し て エントリ の 詳細 情報 を 取得 し ます
識別 および 回帰 の 準備 が でき た モデルファイル を 読み込み ます
field の 精度 を 返し ます
指定 し た ファイル の タイプ を 返し ます
指定 し た 名前 の 属性 の 値 を 返し ます
内部 デバッグ 用 の 出力 を 有効 あるい は 無効 に し ます
仮想 ファイル を 削除 し 、 その データ 構造 体 を 開放 し ます ファイル の 中身 は 削除 し ませ ん 
ファイル file に パッチファイル patch を 適用 し 、 結果 を ファイル に 保存 し ます
この フック が 動く の は 、 ルーティング が 終了 し た とき です
破線 の 「線 」 の 部分 と 「 空白 」 の 部分 の 長さ を 設定 し ます
指定 し た 画像 あるい は 画像 群用 に imagick の インスタンス を 作り ます
で 準備 し た クエリ を 実行 し ます
指定 し た ファイル 名 の ファイル が 、 phar 拡張 モジュール で 利用 できる 正しい 形式 の phar ファイル で ある かど う か を 返し ます
指定 さ れ た クラス から 全 て の メソッド を エクスポート し ます
dir _handle で 指定 し た ディレクトリ の ストリーム を クローズ し ます
現在 の フォント で text を 出力 し ます
画像 の 配置 方法 を 取得 し ます
新しい zip アーカイブ を 、 読み込み / 書き込み / 変更 用 に オープン し ます
この 関数 は 次 の 関数 の エイリアス です
ドキュメント で 現在 使用 し て いる エンコーダ を 定義 し ます
指定 し た バッファ つき イベント の 読み込み タイムアウト および 書き込み タイムアウト を 設定 し ます
この 接続 の 直近 の クエリ について 、 発生 し た 警告 の 数 を 返し ます
その ページ の テキスト の レンダリングモード を 定義 し ます
この 関数 は 、 名前 を 使用 し て エントリ の 詳細 情報 を 取得 し ます
は 、 個々 の memcache サーバー に 問い合わせ て 、 その 時点 で 格納 さ れ て いる すべ て の キー の 配列 を 取得 し ます
グローバル 変数 が セッション に 登録 さ れ て いる かど う か を 調べ ます
新しい 属性 ノード attr を 要素 に 追加 し ます
は 、 指定 し た image を wbmp にし て 出力 あるい は 保存 し ます
画像 の 反復 を 取得 し ます
この 関数 は 、 module _name で 示し た モジュール で 定義 さ れ た 全て の 関数 の 名前 を 返し ます
は 、 指定 さ れ た システムリソース に対し て ソフトリミット および ハードリミット を 設定 し ます
この 関数 は 、 domprocessinginstruction クラス の 新しい インスタンス を 作成 し ます
直前 の 検索 結果 として 保存 さ れ た エントリ の 数 を 返し ます
指定 し た フィールド の 後 の フィールド の 名前 を 返し ます
パーサ の オプション を 設定 し ます
関数 は 、 指定 し た php コード の 文法 チェック （ lint ） を 行い 、 スクリプト の エラー を チェック し ます
多く の 関数 で 利用 さ れる パラメータ を 設定 し ます
インデックス を 使用 し て 、 エントリ 名 を 変更 し ます
例外 の スタックトレース を 返し ます
によっ て 開始 し た ページ を 終了 し ます
は 、 path へ の ハードリンク new _path を 作り ます
この メソッド を 使用 する と 、 画像 全体 を 読み込ま なく て も 画像 の 幅や高さ 、 サイズ そし て フォーマット を 取得 でき ます
引数 hex _string により 指定 さ れ た 1 6 進数 に 等価 な 1 0 進数 を 返し ます
ひとつ あるい は 複数 の オプション を 設定 し ます
は 、 キー key を サーバー から 削除 し ます
は png 画像 を 保存 する 際 に （ 単一色 の 透過 設定 で は ない ） 完全 な アルファチャネル 情報 を 保存 する フラグ を 設定 し ます
指定 さ れ た opcode を ユーザー 定義 の 関数 で オーバーロード し ます
オープン さ れ た モード の 暗号 が ブロックアルゴリズム で ある かど う か を 調べ ます
データベースファイル 内 の レコード の 数 を 取得 し ます
は 、 指定 し た variable _key を 有する 変数 variable の 挿入 また は 更新 を 行い ます
指定 さ れ た フォント と サイズ で 出力 し た 場合 に 、 グリフ の 幅 が 何 ポイント に なる か を 計算 し ます
この 関数 は 、 指定 し た 名前 name の タグ を 持つ すべて の 子孫 要素 から なる クラス domnodelist の 新しい インスタンス を 返し ます
プロパティ の 値 を 取得 し ます
現在 の リクエスト に対する レスポンス として 、 エラー を 表す 内容 を クライアント に 送信 し ます
指定 し た フィールド が 含ま れる テーブル の 名前 を 返し ます
指定 し た 文字数 で 、 指定 し た 文字 を 用い て 文字列 を 分割 し ます
と似 て い ます が 、 datetimeimmutable で 動作 し ます
指定 し た オフセット に 値 を 代入 し ます
グローバルユニーク id guid を 生成 し ます
は 、 最初 の 配列 の 値 を それ 以降 の 配列 の 同じ 要素 の 値 で 置き 換え ます
は 、 最初 の 配列 の 値 を それ 以降 の 配列 の 同じ 要素 の 値 で 置き 換え ます
指定 し た xml パーサ の カレント の カラム 番号 を 取得 し ます
ソースファイルポインタ から ストリームデータ を 取得 し 、 encoding を 適用 し て それ を 出力 ファイルポインタ に 書き込み ます
指定 し た ユーザー user の パスワード を 変更 し ます
既存 の stream に関する 情報 を 返し ます
ふたつ の ファイル の バイナリ diff を 作成 し 、 その 結果 を パッチファイル として 保存 し ます
画像 から チャネル を 分離 し 、 グレースケール 画像 を 返し ます
次 の libxml ドキュメント の 読込 ／ 書き こみ の ため に ストリームコンテキスト を 設定 し ます
現在 の 塗り つぶし の 色空間 を 取得 し ます
は 、 ファイルディスクリプタ fd で 指定 し た ファイル や ディレクトリ の パーミッション を 変更 し ます
既存 の blob を 読み込み 用 に オープン し ます
この メソッド を 直接 呼ぶ の は 推奨 し ませ ん
指定 し た rdn および パスワード を 用い て ldap ディレクトリ に バインド し ます
この 関数 は 、 n を d で 割り ます
楕円 を 画像 上 に 描き ます
現在 の ノード を 取得 し ます
は 、 mod _include の & lt ;! --# include virtual ... --& gt ; と 似 て いる apache 用関数 です
ホスト hostname 上 の hyperwave サーバー へ の 接続 を オープン し ます
マップ の 次 の 要素 に 進み ます
関数 は 、 object _id で 指定 し た snmp オブジェクト の 値 を 取得 し ます
ページ の 塗り つぶし 色 を 定義 し ます
バイナリ 属性 を 、 現在 の radius リクエスト に アタッチ し ます
与え られ た xpath 式 expression を 実行 し 、 可能 で あれ ば 型付け さ れ た 結果 を 返し ます
この 関数 は 、 ファイル の 拡張 属性 の 名前 の 一覧 を 取得 し ます
この 関数 は 次 の 関数 の エイリアス です
使用 可能 な 辞書 の 一覧 と 、 その 詳細 を 返し ます
シーケンス 内 の 特定 の 画像 の ファイル 名 を 設定 し ます
ひとつ あるい は 複数 の チャネル の 範囲 を 取得 し ます
キャッシュ の 内容 を 取得 し ます
指定 さ れ た offset から 始まる 内部 lob データ の 特定 の 位置 を 消去 し ます
この メソッド は 、 ファイル や ディレクトリ そし て リンク から パス 情報 を 除い た ベース 名 を 返し ます
var の boolean として の 値 を 返し ます
ページ の 表示 を 、 ウィンドウ の 高さ に あわせる よう に し ます
は 、 fifo スペシャルファイル を 作成 し ます
データ を 暗号 化 し て 、 それ を 返し ます
は 、 指定 し た ファイル の id3 タグ に 含ま れる すべ て の 情報 を 取得 する ため に 使用 さ れ ます
キュー にまだ ノード が ある かど う か を 調べ ます
directoryiterator の 指定 し た 位置 に 移動 し ます
メソッド によっ て 実行 さ れる sql ステートメント を 準備 し ます
この スレッド が 同期 さ れ て いる かど う か を 調べ ます
画像 の 解像 度 を 設定 し ます
クライアントライブラリ が スレッドセーフ で コンパイル さ れ て いる かど う か を 返し ます
id 型 と なる 属性 を localname および namespaceuri で 宣言 し ます
は 、 lzf で 符号 化 さ れ た 文字列 を 含む data を 伸長 し ます
現在 の php プロセス の id を 取得 し ます
は ストリーム の 配列 を 受け 取る と 、 それら の 状態 が 変化 する まで 待ち ます
lib _dir パラメータ に ある サポート する すべ て の アルゴリズム の 一覧 を 取得 し ます
オブジェクト を シリアライズ し て 、 json _encode が ネイティブ に シリアライズ できる 値 に し ます
ncurses の 色機 能 を 初期化 し ます
現在 の 行間 隔 の 値 を 取得 し ます
ファイル あるい は ディレクトリ が 存在 する かど う か を 調べ ます
新しい quickhashinthash オブジェクト を 作り ます
サーバー 上 で の 直近 の リクエスト に関する 詳細 な エラーメッセージ を 返し ます
この メソッド は 、 rmdir に対応 し て コール さ れ ます
newt インターフェイス を 終了 し ます
これ は 、 yaf プラグイン の フックシステム 内 で の 最初 の フック です
ファイルポインタ を 指定行 に 移動 さ せ ます
関数 socket _read は 、 関数 socket _create また は socket _accept により 作成 さ れ た ソケット リソース socket から 読み込み ます
これ は 、 読み込み 用 に 使う 新しい セカンダリ を ランダム に 選び ます
関数 の ドキュメントコメント を 取得 し ます
エントリ の インデックス を 使用 し て 、 エントリ の コメント を 返し ます
実行 中 の phar アーカイブ の フルパス を 返し ます
ビット start から 最上 位 ビット の 方 に 、 最初 の クリアビット が 見付 かる まで a を スキャン し ます
zip ファイルアーカイブ を 閉じ ます
購読 中 の メールボックス の 情報 を 取得 し ます
サーバー に おける 現在 の メールボックス の ステータス を 調べ ます
は 、 指定 し た postgresql result リソース に おける 指定 し た field _number の 型 の oid を 返し ます
この エントリ を 展開 する のに 必要 な rar プログラム winrar など の 最低 バージョン を 取得 し ます
別 の ストレージ に ある すべ て の オブジェクト と データ の ペア を 、 現在 の ストレージ に 追加 し ます
指定 し た rgb 値 に 「 近い 」 画像 パレット 中 の 色 の インデックス を 返し ます
インデックス を 使用 し て 、 エントリ の 名前 を 返し ます
soap リクエスト を 処理 し 、 必要 な 関数 を コール し 、 レスポンス を 返送 し ます
すべて の エラー 結果 ドキュメント を 取得 し ます
パラメータ として 配列 を ひとつ だけ 渡し た 場合 は 、 max は 配列 の 中 で 最も 大きい 数値 を 返し ます
apache の バージョン を 取得 し ます
final クラス で ある かど う か を 調べ ます
弱い 参照 が 指す先 に オブジェクト を 返し ます
gz ファイルポインタ について 現在 位置 から eof まで データ を 読み込み 、 標準 出力 に 伸長 さ れ た 結果 を 書き込み ます
blob の 読み込み あるい は 書き込み を 行お う とし て いる ファイル の 名前 を 設定 し ます
数 の 符号 を 調べ ます
最後 に 挿入 さ れ た 行 の id 、 あるい は シーケンスオブジェクト から 次 の 値 を を 返し ます
組み込み の 韓国 / 朝鮮語 フォント を 有効 に し ます
クライアント の バージョン 番号 を 整数 値 で 返し ます
( msdn ライブラリ による 以下 の 規則 に 従い 、 left を right に 加算 し ます
指定 し た リレーション relation に 拘束 を 設定 し ます
配列 の サイズ を 取得 し ます
により 、 標準 の libxml エラー を 無効 に し 、 ユーザー による エラー 処理 を 有効 に する こと が でき ます
指定 し た オフセット offset で ノード を 2 つに 分割 し ます
新しい 座標 系 の 原点 を 設定 し ます
ftp サーバー に site exec command リクエスト を 送信 し ます
variant オブジェクト の 型 を 返し ます
は 、 ファイル や ディレクトリ の パーミッション を 変更 し ます
ひとつ あるい は 複数 の 画像 チャネル の 極値 を 取得 し ます
画像 の ガンマ を 設定 し ます
現在 の ノード の 内容 を 文字列 で 読み込み ます
と ev :: resume が 、 それぞれ ループ の 一時 停止 と 再開 に 対応 し ます
は 、 ファイル に対する ユーザー の アクセス 権限 を 調べ ます
は 、 現在 の メールボックス に ある msg _number 番目 の メッセージ の 本文 を 返し ます
画像 リスト 内 の 次 の 画像 を imagick オブジェクト に 関連 付け ます
は 引数 filename から 得 られる 画像 を 表す イメージid を 返し ます
画像 の 明度 、 彩度 、 色相 を 制御 し ます
中心 の y 軸 を 基準 し て ピクセル を 反転 さ せ 、 水平 方向 の ミラー 画像 を 作成 し ます
この 関数 は 、 入力 さ れ た data を デコード し た もの を 返し ます
その 数 が 平方数 で ある かど う か を 調べ ます
mailbox へ の imap ストリーム を オープン し ます
特定 の 画像 チャネル の 深度 を 設定 し ます
イテレータ の ポインタ を 次 の 要素 に 移動 さ せ ます
現在 の directoryiterator アイテム の 最終 アクセス 時刻 を 取得 し ます
テキスト による 注記 を 画像 に 加え ます
は 、 指定 し た フィルタ filtertype を image に 適用 し ます
は date を パース し た 結果 を 配列 で 返し ます
これ は 、 現在 読み込み に 使っ て いる セカンダリ の アドレス を 探し ます
画像 の 角 を 丸め ます
スクリプト の 実行 を 終了 し ます
は クライアント の severity レベル の 最小値 を 設定 し ます
バッファ つき イベント の 入力 バッファ から データ を 読み込み ます
この 関数 は 、 map ファイル を 読み込み 、 照合 を 行い ます
は 、 ingres _query を コール し た 後 で 、 ingres サーバー により 返さ れ た 結果 の フィールド 数 を 返し ます
は 、 クエリ から の 結果 セット 中 に ある カラム に バインド さ れ た 特定 の 値 を 取得 する ため の 準備 を します
は 、 object _id で 指定 し た snmp オブジェクト の 値 を 設定 し ます
は 、 relation に 指定 さ れ た 現在 の 主キー を 、 domlist で 指定 さ れ た ドメイン に 変更 し ます
value を 双方 向 リンクリスト の 末尾 に 追加 し ます
テキスト を 指定 し た 位置 に 表示 し ます
指定 し た スキーマ 情報 を データベース から 取得 し ます
指定 さ れ た 値 base を 基数 （ デフォルト は 1 0 ） と する 、 var の integer として の 値 を 返し ます
は 、 fd が 指す ファイル の offset から 最大 length バイト まで を 読み込み ます
変数 が 既 に キャッシュ に 存在 し ない 場合 に のみ 変数 を ユーザーキャッシュ に 追加 し ます
中心 の x 軸 を 基準 し て ピクセル を 反転 さ せ 、 垂直 方向 の ミラー 画像 を 作成 し ます
すべて の http ヘッダ を 現在 の リクエスト から 取得 し ます
シリアライズ し ます
filtername で 指定 さ れ た フィルタ を 、 stream に 付加 さ れ て いる フィルタ の リスト に 加え ます
mysql の 結果 セット から ひとつ の セル の 内容 を 取得 し ます
old _data 文字列 と new _data 文字列 の 差分 を 含む unified diff を 作成 し 、 結果 を 返し ます
この 関数 は 、 指定 し た リソース の 型 を 取得 し ます
メソッド で 与え られ た スタイルシート を 適用 し 、 ソースノード を uri に 変換 し ます
イテレータ を 取得 し 、 データベース 内 の すべ て の キー / 値 を 反復 処理 できる よう に し ます
組み込み の 内部 関数 および ユーザー 定義 関数 の 中 から 、 function _name で 指定 し た 名前 の 関数 を 探し ます
現在 の directoryiterator アイテム が ディレクトリ で あり 、 かつ . あるい は .. のどちらか で ある かど う か を 調べ ます
指定 し た データベース に 、 結果 を 返さ ない クエリ を 実行 し ます
sql クエリ を 実行 し 、 クエリ が 結果 を 返す 場合 は sqlite 3result オブジェクト を 返し ます
3d モデル を 、 ディスク 上 あるい は 仮想 ファイル から 読み込み ます
は 、 callback の result 引数 で ファイル の 状態 を 返し ます
関数 は exec 関数 と 同様 、 command を 実行 し ます
mongodb を 普通 に 使っ て いる 限り 、 この メソッド は あまり 有用 で は あり ませ ん
graphicsmagick api の バージョン を 文字 列 と 数値 で 返し ます
文書 から フィールド を 除去 し ます
この 関数 は 出力 の バッファリング を オン に し ます
現在 の 文字 間隔 を 取得 し ます
直近 の soap リクエストヘッダ を 返し ます
は 指定 し た 結果 id に 関連 する 結果 から 1 行分 の データ を 取得 し ます
赤 が 一番 強い 点 を 返し ます
マッチ する 任意 の ピクセル の 色 を 、 fill で 定義 し た 色 に 変更 し ます
は 結果 の 行数 を 返し ます
この 関数 は 、 子要 素群 から 子要素 を 削除 し ます
指定 し た 色 チャネル の 値 を 取得 し ます
現在 の ページ に 生じ た 直近 の imap エラーメッセージ の 全文 を 返し ます
修飾子 を 取得 し ます
は 、 指定 し た フィールドインデックス の 名前 を 取得 し ます
str の metaphone キー を 計算 し ます
サブパス を 取得 し ます
パラメータ data から の データ を lob の 内部 ポインタ の 現在 位置 に 書き込み ます
インデックス を もと に し て 、 アーカイブ 内 の エントリ を 削除 し ます
新しい tidy オブジェクト を 作成 し ます
data を ラージオブジェクト に 保存 し ます
bourne シェル 経由 で コマンド を 実行 し 、 プロセス へ の pty ストリーム を オープン し ます
filename という 名前 の ファイル 、 また は シンボリックリンク の 情報 を 得 ます
指定 し た 変数 の 型 が 文字 列 か どう か を 調べ ます
位置 番号 を 指定 し て 、 画像 の カラーマップ を 移動 し ます
また は mdecrypt _generic を コール する 前 に 、 常 にこの 関数 を コール する 必要 が あり ます
指定 し た seconds および nanoseconds の 時間 だけ プログラム の 実行 を 遅延 さ せ ます
ファイル の 最終 アクセス 時刻 を 取得 し ます
は 、 relation の 名前 を name に 変更 し ます
指定 さ れ た 接続 id に関する カーソル 名 を 返し ます
指定 し た オブジェクト パラメータ を 省略 し た 場合 は 、 すべて の オブジェクト を 、 ワーカー の スタック から 削除 し ます
は 、 table _name で 指定 し た テーブル に assoc _array の 値 を を 挿入 し ます
キー と データ の 関係 を 維持 しつつ 、 配列 を キー で ソート し ます
slob オブジェクト を 削除 し ます
は 、 指定 し た データベース connection 上 で query を 実行 し ます
内部 の 整合 性 を チェック libev の デバッグ 用 し 、 もし データ 構造 が 壊れ て いる 場合 は プログラム を 終了 さ せ ます
は 、 指定 し た フィールド の 名前 を 返し ます
サーバー と の 接続 が 有効 か どう か を 調べ ます
は 、 main _str の offset 文字 目以降 の 最大 length 文字 を 、 str と 比較 し ます
別 の ストレージ に 含ま れ て いる もの 以外 の すべ て の オブジェクト を 現在 の ストレージ から 取り除き ます
blob オブジェクト の 内容 を 返し ます
ドキュメントデータ を 標準 出力 に 書き出し ます
いくつか の pdflib パラメータ の 内容 を 文字 列 として 取得 し ます
サーバー の 環境 変数 に setting を 追加 し ます
指定 し た リンク id に 関連 する frontbase サーバー へ の 接続 を 閉じ ます
画像 の 一部 を 抽出 し 、 新しい imagick オブジェクト として 返し ます
ノード の xpath ロケーションパス を 取得 し ます
は preg _replace と 似 て い ます が 、 マッチ し た 結果 を 変換 し た もの のみ を 返し ます
は 、 arg の コサイン を 返し ます
は 、 指定 し た ファイル 名 から 得 られ た イメージ を 表す イメージ id を 返し ます
options に 、 指定 さ れ た オプション が 予め 設定 さ れ た ストリームコンテキスト を 作成 し 、 それ を 返し ます
プロセス pid の プロセスグループ id を 返し ます
は 、 指定 し た x 5 0 9 cert に関する 情報 を 返し ます
指定 し た 結果 から 複数 の エントリ を 読み込み 、 その 属性 および 複数 の 値 を 読み込み ます
は 機能 的 に memcached :: set と 同等 です
は 、 table _name の テーブル 定義 を 配列 として 返し ます
は 、 テーブル を 配列 に コピー し ます
は 、 relation を 閉じ て 削除 し ます
直近 に 実行 さ れ た ステートメント が 成功 あるい は 失敗 し た 際 の エラーコード を 返し ます
指定 し た uid の メッセージ 番号 を 返し ます
エントリ 内 の 属性 を 取得 し ます
この 関数 は 、 ファイル の 拡張 属性 の 値 を 取得 し ます
recursiveiterator から recursivefilteriterator を 作成 し ます
与え られ た 文字 列 text のすべて の 文字 が 英字 また は 数字 で ある かど う か を 調べ ます
は 、 assoc _array で 指定 し た キー と 値 を 用い て テーブル から レコード を 削除 し ます
文字列 の 定義 から 新しい ハッシュ を 作る ファクトリーメソッド です
php の 変数 を 、 oci _fetch で 取得 する クエリ の カラム に 関連 づけ ます
レコード を 連結 し 、 左 に シフト し ます
は memcached :: setoption と 似 て い ます が 、 設定 する オプション の 配列 を 受け取り ます
これ は 、 データベース の すべ て の データ の 最新 コピー を 作成 し ます
cyrus imap サーバー へ の 接続 を 閉じ ます
は 、 指定 さ れ た リンク link _identifier が 指す sybase データベース へ の リンク を 閉じ ます
任意 の フォント に おける text の 幅 を 返し ます
画像 リスト 内 の 前 の 画像 を gmagick オブジェクト に 関連 付け ます
を シャットダウン 関数 として 登録 し ます
は 、 ms sql 結果 行 から セル の 内容 を 返し ます
現在 の 輪郭 色 を 指定 し た rgb 値 に 設定 し ます
ある 画像 と 再構 築 し た 画像 を 比較 し 、 指定 し た 歪み 係数 を 返し ます
は lob あるい は file の ディスクリプタ を 閉じ ます
直近 の insert クエリ に おい て 、 default unique 定義 さ れ て いる カラム で 生成 さ れ た id を 返し ます
が返し た ステートメントリソース 内 の sql 文 の パラメータ に php 変数 を バインド し ます
は 、 一般 ファイル や 特殊 ファイル こちら の ほう が 頻繁 に あり ます を 作り ます
画像 フォーマット を 直接 記憶 し ます
filename から の データ を ラージオブジェクト の 現在 の 位置 に 書き込み ます
arrayobject の public プロパティ の 数 を 取得 し ます
imagickpixel オブジェクト の 色 を 、 配列 で 返し ます
マイクロ 秒単 位 の 現在 時刻 に も とづい た 、 接頭 辞 つき の 一意 な id を 取得 し ます
データベースレプリケーション の マスタ を 設定 し ます
与え られ た ファイルポインタ を eof まで 読み 、 結果 を 出力 バッファ に 書き出し ます
関数 は 、 hostname で 指定 し た snmp エージェント から すべて の オブジェクト id とその 値 を 読み こむ ため に 使用 し ます
アンシリアライズ し ます
ルート 要素 の uri 文字列 を 返し ます
observer を デタッチ し 、 更新 を 通知 し ない よう に し ます
include と 似 て い ます が 、 関数 や クラス の 外部 に ある コード は 無視 さ れ ます
パラメータ および オプション の 情報 を 、 ストリーム あるい は コンテキスト から 取得 し ます
新規 soapvar オブジェクト を 生成 し ます
は 共有 メモリブロック から 文字列 を 読み込み ます
設定 し た フォント を 返し ます
文書 を コミット し ます
関数 の 拡張 モジュール 情報 を 取得 し ます
この 関数 は 、 openssl _pkey _new で 作成 し た 秘密 鍵 を 開放 し ます
 ;& nbsp ;rfc 2 8 2 2 の 定義 に 基づき 、 アドレス 文字列 を パース し ます
この 関数 は 、 timeoutms ミリ 秒 が 経過 する か キュー に メッセージ が 到着 する まで 待機 し ます
は xml ドキュメント を 処理 し ます
作業 コピー あるい は リポジトリ 内 に ディレクトリ を 作成 し ます
error _reporting の モード を 設定 し ます
接続 で 使用 さ れ て いる ホスト 名 を 取得 あるい は 設定 し ます
新規 テンプレート の 定義 を 開始 し ます
は 、 fd で 指定 し た ファイル を 閉じ ます
この メソッド は 、 既存 の セット を ディスク に 保存 し ます
は 、 ラージオブジェクト から 最大 len バイト 分読 み 込み 、 文字 列 として 返し ます
有効 期限 を 過ぎ た セッション を 削除 し ます
与え られ た 文字 列 text のすべて の 文字 が 印字 可能 な 文字 で ある かど う か を 調べ ます
を 使用 する の は 、 既存 の ファイル 情報 として は 表せ ない 独自 の 情報 を 保存 する 場合 のみ に 限る べき です
指定 し た bevent を event _base に 関連 づけ ます
接頭辞 と 接尾 辞 を つけ た 現在 の キー を 取得 し ます
は 、 その 他 の ヘッダ 情報 と 共に 送信 する クッキー を 定義 し ます
指定 し た ハッシュ が パスワード に マッチ する かど う か を 調べ ます
ユリウス 積算 日 を フランス 革命 暦 に 変換 し ます
新しい 画像 を 作成 し 、 imagickpixel の 値 を 背景 色 として 関連 付け ます
から 返さ れる error _code の 可読 性 が 高い 説明 を 返し ます
テーブル の ユニーク 行 id カラム を 含む 結果 セット を 返し ます
は 、 handle が 指す データベース から key が 指す データ を 取得 し ます
パラメータ が あらかじめ xsltprocessor :: setparameter で 設定 さ れ て いる 場合 、 それ を 取得 し ます
は 機能 的 に memcached :: add と 同等 です
与え られ た ファイルポインタ から 返さ れ た bzip 2 エラー の エラー 番号 と エラー 文字 列 を 返し ます
画像 の 型 を 設定 し ます
ビューエンジン を 無効 に し ます
イテレータ を 巻き戻し ます
は 機能 的 に memcached :: append と 同等 です
この メソッド は 、 closure クラス の インスタンス を 作れ ない よう に する ため に 存在 し ます
の 呼び出し を ブロック し て いる すべ て の スレッド に ブロードキャスト し ます
画像 を 指定 し た ファイル 名 で 書き出し ます
画像 の 前景 色 を 返し ます
link が 指す 接続 に おける 直近 の クエリ の カラム の 数 を 返し ます
は 、 keys 配列 で 指定 し た 複数 の キー の アイテム に対する リクエスト を memcache に 発行 し ます
この 関数 は 、 finfo _open が オープン し た リソース を 閉じ ます
関数 は 、 直近 に 実行 さ れ た クエリ に ついて の 情報 を 文字列 で 返し ます
現在 の パス の 終端 の 形式 を 取得 し ます
名前 空間 namespaceuri に ある localname という 名前 の 属性 を 、 指定 し た 値 に 設定 し ます
は 、 handle で 指定 し た データベース に key および value で 記述 さ れる エントリ を 置換 また は 挿入 し ます
指定 し た アルゴリズム の ブロック 長 を 取得 し ます
指定 し た フィールド が 含ま れる テーブル の 名前 を 返し ます
この 関数 は freetype テキスト 用 の バウンディングボックス を ピクセル 単位 で 算出 し 、 それ を 返し ます
現在 の 座標 空間 に対し て 水平 方向 と 垂直 方向 の 倍率 を 調整 し ます
イメージ を 置き 、 サイズ を 変更 し ます
その プロセス で 現在 制御 し て いる 端末 の パス 名 を 表す 文字 列 を 作成 し ます
field _number に対応 する フィールド 名 を 返し ます
arg の ハイパボリックコサイン を 返し ます
クローン し ます
画像 の 輪郭 を 明る く し たり 暗く し たり する こと によっ て 、 三次元 の ボタン 風 の 効果 を シミュレート し ます
修正 さ れ た html を 文字列 で 返し ます
論理 表記 の ヘブライ 語 を 物理 表記 に 変換 し ます
php 関数 を lua に & quot ;$ name &quot ; という 関数 として 登録 し ます
この メソッド は 、 テーブルデータベース で は サポート し て いませ ん
現在 の レスポンスオブジェクト を 取得 し ます
この クライアント により ロック さ れ た タプル を 全 て 解放 し ます
は 、 key に対応 する 項目 を 削除 し ます
は 、 配列 input の 中 から column _key で 指定 し た 単一 の カラム の 値 を 返し ます
最後 の http メソッド 、 url そして パラメータ 文字 列 あるい は 配列 に も とづい て oauth ヘッダ 文字 列 シグネチャ を 生成 し ます
直近 の curl 操作 に関する エラーメッセージ を クリアテキスト で 返し ます
name string あるい は boolean 型 の pcos パス の 値 を 取得 し ます
現在 の エントリ が 書き込み 可能 か どう か を 調べ ます
カラー 画像 の コントラスト を 強調 し ます
指定 し た オブジェクト が ストレージ に 含ま れる かど う か を 調べ ます
指定 し た マルチバイト 文字 列 に対する マルチバイト 正規 表現 マッチング を 行い ます
新しい domdocument オブジェクト を 作成 し ます
通常 の 操作 で は 、 この メソッド は 使い ませ ん
ステートメントリソース が 使用 し て いる カーソル の 型 を 返し ます
新しい 描画 パス の 開始 位置 を 定義 し ます
は key を パース し 、 他 の 関数 で 使用 できる よう 準備 し ます
この メソッド は 、 現在 の 値 と キー そし て 内部 イテレータ を 使っ て コールバック を コール し ます
は ストリーム に ping を 行い 、 まだ アクティブ で ある かど う か を 調べ ます
ワーカー が stackable を 実行 中 かど う か を 調べ ます
式 を 画像 の 各 ピクセル に 適用 し ます
有効 な グレゴリウス 暦 の 範囲 は 紀元 前 4 7 1 4 年 から 紀元 9 9 9 9 年 まで です
指定 し た ファイル filename に対し て 文法 チェック lint を 行い 、 スクリプト に エラー が ない か どう か を 調べ ます
この 関数 は 、 指定 し た ftp 接続 について option の 値 を 返し ます
指定 し た ftp ストリーム に ログイン し ます
スロー さ れ た オブジェクト に 関連 づけ られ た メッセージ を 返し ます
は 、 指定 し た キー に 新しい 有効 期限 を 設定 し ます
server 変数 を 取得 し ます
これ は arrayaccess インターフェイス を 実装 し た もの です
現在 の libev の 構成 で サポート する バックエンド 群 を 返し ます
新しい ページ を ドキュメント に 追加 し ます
すべて の 登録 済み _ _ autoload 関数 を 取得 し ます
は 、 fd で 指定 し た ファイル 内 で の オフセット を 、 offset と whence で 指定 し た 位置 に 移動 し ます
ストレージ 内 の オブジェクト に データ を 関連 づけ ます
静的 変数 を 取得 し ます
この メソッド は 、 fwrite に対応 し て コール さ れ ます
この 関数 は 、 指定 し た ファイル を 保持 する ファイルシステム が 拡張 属性 を サポート し て いる かど う か を 調べ ます
次 の 要素 に 移動 し ます
は 、 certificate signing request csr を 受け取り 、 それ を out に ascii テキスト として 保存 し ます
曜日 を 返し ます
graphicsmagick パッケージ 名 を 返し ます
実行 中 の システム で 使用 可能 な 、 登録 済み の ストリーム の 一覧 を 取得 し ます
によっ て セット さ れる 行 の 最大 バイト 数 を 取得 し ます
は 、 指定 し た relation の 空 の コピー を name という 名前 で 作成 し ます
中心 の y 軸 を 基準 し て ピクセル を 反転 さ せ 、 水平 方向 の ミラー 画像 を 作成 し ます
xml パーサ から オプション の 値 を 取得 し ます
指定 し た ファイル の モード の mode へ の 変更 を 試み ます
画像 リスト 内 で の イテレータ の 位置 を 、 index パラメータ で 指定 し た 場所 に 設定 し ます
この メソッド を 使う と 、 新しい カラム を 既存 の レコード に 追加 する こと が でき ます
取得 し た 行 に 対応 する 配列 を 返し 、 内部 の データポインタ を 前 に 進め ます
オブジェクト の 塗り つぶし に 使う 色 を 設定 し ます
リモート の ファイルサーバー から ディレクトリ を 削除 し ます
ストリームラッパー を オープン し た とき に 、 streamwrapper :: stream _open の 直前 に コール さ れ ます
結果 セット に おける フィールド 数 を 整数 として 返し ます
arg の ハイパボリックサイン を 返し ます
この タイムスタンプ の & quot ;sec &quot ; フィールド を 返し ます
新しい パターン を 開始 し ます
指定 さ れ た 引数 を format に 基づい て バイナリ 文字列 に パック し ます
yaf _route _simple は 、 ルート 情報 を クエリ 文字 列 から 取得 し ます
指定 し た code を php コード として 評価 し ます
パス の 終了 点 と 開始 点 を つなげ ます
は 、 id 3 タグ に 格納 さ れ て いる 情報 を 削除 する ため に 使用 さ れ ます
パースモード を 設定 し ます
と似 て い ます が 、 datetimeimmutable で 動作 し ます
指定 し た key が 配列 に 設定 さ れ て いる 場合 、 array _key _exists は true を 返し ます
画像 の 色 を 変換 し ます
フィールド が 存在 する か チェック し ます
ビット start から 最上 位 ビット の 方 に 、 セット さ れ て いる ビット が 最初 に 見付 かる まで a を スキャン し ます
条件 変数 へ の ハンドル の 破棄 は 、 条件 変数 を 使い 終え た とき に プログラマー が 明示 的 に 行う 必要 が あり ます
ファイル から 画像 を 読み込み ます
関数 により 、 単一 の 複数 形 メッセージ 参照 について 現在 の ドメイン を 上書き する こと が でき ます
現在 位置 から 指定 し た 位置 まで 直線 を 描画 し ます
を 使う と 、 特別 な イベントループ を 実装 でき ます
は 、 セッション を 作成 し ます
指定 し た relation の 次 の タプル から データ を 読み込み 、 tuple に 連想 配列 として 返し ます
それ 以降 の リクエスト 用 の トークン と secret を 設定 し ます
以降 の 描画 処理 で の 線幅 を 設定 し ます
イテレータ を 先頭 に 巻き戻し ます
辞書 が 存在 する かど う か を 調べ ます
構造体 要素 やその 他 の 内容 を 閉じ ます
を コール する 必要 が ある の は 、 スクリプト の 実行 中 に 大量 の メモリ を 使用 する こと が 気 に なる 場合 のみ です
例外 が 作られ た 行番 号 を 取得 し ます
現在 の 画像 上 の gmagickdraw オブジェクト を レンダリング し ます
子 プロセス を 終了 さ せ た シグナル 番号 を 返し ます
ファイル が グローバル な メタデータ を 持っ て いる かど う か を 返し ます
現在 の 描画 コンテキスト を 保存 し ます
フィールド は & quot ;fieldname &quot ; : bool 形式 で 指定 し ます
指定 し た dn に 属性 を 追加 し ます
緑 が 一番 強い 点 を 返し ます
この 関数 は 、 指定 し た 接続 上 で z 3 9 . 5 0 スキャンリクエスト の 準備 を します
フィールド の 外観 すなわち 、 / ap キー の 値 を 設定 し ます
現在 の 塗り つぶし 色 を 取得 し ます
libxml から 直近 の エラー を 取得 し ます
この 関数 を 使用 する と 、 大量 の 変数 を 取得 する 際 に filter _var を 繰り返し コール する 必要 が なく なる ので 便利 です
現在 の パス を 描画 し ます
画像群 を 、 ひとつ の 大き な 画像 に 追加 し ます
gmagick quantum depth を 文字列 で 返し ます
この 関数 は 、 出力 用 バッファ の 内容 を 出力 し 、 出力 の バッファリング を オフ に し ます
は 、 x 5 0 9 を pkcs # 1 2 ファイルフォーマット に し た もの を out で 指定 し た 文字列 に 格納 し ます
この 関数 は 、 指定 し た 文字列 str から 全 て の nul バイト と html および php タグ を 取り除き ます
これ は 高度 な 関数 な ので 、 今何 を し て いる の か を わかっ て いる 人以 外 は 使っ て はいけ ませ ん
は 、 指定 さ れ た 結果 id が 指す 結果 から 1 行分 の データ を 取り込み ます
ブートストラップ を 実行 し ます
イテレータ の 現在 位置 が 有効 か どう か を 調べ ます
long および longvarbinary の カラム を 処理 できる よう に し ます
この 関数 を 使う と 、 現在 有効 に なっ て いる ログ の レベル を 調べる こと が でき ます
文 の 属性 を 取得 し ます
この 関数 は 文字列 input の 左 、 右また は 両側 を 指定 し た 長さ で 埋め ます
handle の ファイル 位置 指示子 を 、 ファイルストリーム の 先頭 に セット し ます
は 、 ある クエリー の 結果 に おい て 、 フィールド に関する 情報 を 得る ため に 使用 し ます
gmp 数 を base を 基数 と する 文字 列表 現 に 変換 し ます
配列 イテレータ の クラス 名 を 取得 し ます
ibm db2 universal database 、 ibm cloudscape あるい は apache derby データベース へ の 新しい 接続 を 作成 し ます
全て の 種類 の 注記 の 境界 の 形式 を 設定 し ます
クラス が 定義 さ れ て いる ファイル の ファイル 名 を 取得 し ます
関数 は 、 ホスト 名 あるい は ip アドレス に 対応 する 国および 地域 を 返し ます
timezonedb の 現在 の バージョン を 返し ます
認証局 の 情報 を 取得 し ます
新規 soapheader オブジェクト を 生成 し ます
ラージオブジェクト 用 の バッファリング を on _off パラメータ の 値 で 設定 し ます
は ロケールカテゴリ の 独立 し た 要素 に アクセス する ため に 使用 さ れ ます
各 画像 を シーケンス 内 の 次 の 画像 と 比較 し 、 最大 の 境界 範囲 を 返し ます
画像 から すべ て の プロパティ や コメント を 除去 し ます
指定 し た 名前 について 、 特定 の 国 に おける 性別 を 取得 し ます
imagickpixel オブジェクト の 色 を 文字列 で 返し ます
この コンストラクタ により soapserver オブジェクト を wsdl また は 非 wsdl モード で 作成 する こと が 可能 です
現在 の 位置 に テキスト を 出力 し ます
lob を 切り つめ ます
結果 セット 内 の 行 を 表す 、 カラム 位置 および カラム 名 の 両方 を インデックス と する 配列 を 返し ます
現在 認証 済み の 公開鍵 の 一覧 を 表示 し ます
glob 式 から 見つかっ た ディレクトリ や ファイル の 数 を 取得 し ます
宣言 し て いる クラス を 取得 し ます
塗りつぶし や 描画 を 行わ ず 、 現在 の パス を 終了 し ます
xml バージョン を 文字列 で 設定 し ます
指定 し た キー の エントリ が ハッシュ に 存在 する かど う か を 調べ ます
この メソッド は 、 phar アーカイブ 内 の ファイル の 圧縮 を 解除 し ます
imagick インスタンス の quantum range を 文字列 で 返し ます
引数 で 指定 さ れ た 日付 の 妥当性 を チェック し ます
直近 の 国際 化関 数 の コール による エラーメッセージ を 取得 し ます
この 関数 は 配列 を ソート し ます
メールボックス 内 の すべ て の メッセージ の ヘッダ を 返し ます
現在 の directoryiterator アイテム の 所有 者 を 、 数値 形式 で 取得 し ます
lob の 内部 ポインタ の 現在 位置 を 取得 し ます
画像 に 関連 付け られ て いる 合成 演算子 を 返し ます
は 、 エントリ の データ を 展開 し ます
条件 変数 上 で シグナル を 待ち ます
引数 の 内容 が 、 関数 として コール 可能 か どう か を 調べ ます
raw ccitt イメージ を オープン し ます
各 要素 に対し て 、 子 を 持っ て いる かど う か を 調べる ため に コール し ます
icc プロファイル を 検索 し 、 後 に 使用 する ため に 準備 し ます
指定 し た 結果 セット から フィールド の 数 を 返し ます
は 、 mode で 指定 し た アクセスモード で ディレクトリ を 作り ます
指定 し た relation について 、 カレントタプル に関する データ を 読み込み ます
は 、 指定 し た 大きさ の 黒い 画像 を 表す 画像 id を 返し ます
event _base を event と 関連 づけ ます
テキスト による 注記 を 画像 に 加え ます
シリアライズ し た arrayobject を アンシリアライズ し ます
は 、 データベーススキーマ を 返し ます
は 、 assoc _array の 中 の 値 を チェック し 、 sql 文 の 中 で 使用 可能 な 形式 に 変換 し ます
新しい domimplementation オブジェクト を 作成 し ます
この メソッド は エントリ を 新しい 値 で 更新 し 、 更新 でき たか どう か を 返し ます
は sqlite _open と 同様 に sqlite データベース を オープン 、 もしく は データベース が 存在 し ない 場合 は 生成 しよ う と 試み ます
一段下 の 再帰 処理 が 終了 し た とき に コール さ れ ます
result の フィールド 番号 offset の 型 を 返し ます
the mqseries _conn mqconn を コール する と 、 アプリケーションプログラム を キューマネージャ に 接続 し ます
connection を 使っ て sql _text を パース し 、 ステートメント id を 返し ます
は 、 指定 し た link _identifier 上 で 使用 可能 な データベース の 一覧 を 返し ます
は 、 直近 の 強度 チェック から の メッセージ を 返し ます
reflectionmethod オブジェクト の 文字 列表 現 を 返し ます
arg の 平方根 を 返し ます
指定 し た tidy オブジェクト object の 設定 時 に 発生 し た tidy エラー の 数 を 返し ます
は クライアント の エンコーディング を 設定 し 、 成功 し た 場合 に 0 、 エラー 時 に - 1 を 返し ます
textflow オブジェクト を 作成 する か 、 既存 の textflow に テキスト と 明示 的 な オプション を 追加 し ます
ページ を 終了 し 、 さまざまな オプション を 適用 し ます
全て の select クエリ に関する デフォルト の テキストモード を 設定 し ます
指定 し た 名前 の 、 中断 し て いる サービス を 再開 し ます
イベント の 優先 度 レベル を 表す 数値 を 設定 し ます
は 、 サーバーリスト から すべ て の memcache サーバー を 削除 し 、 サーバーリスト を 空 に し ます
複数 形版 の gettext です
直近 の frontbase 操作 から の エラーメッセージ を 表す 数値 を 返し ます
と同じ です が 、 fgetss は 読み込ん だ テキスト から nul バイト や html および php の タグ を 取り除こ う と する こと が 異なり ます
エンコード さ れ た mime ヘッダ の 文字列 str を デコード し ます
現在 の テキストオブジェクト を 終了 し ます
は 、 msql _fetch _row の 拡張 版 です
画像群 を 平均 化 し ます
指定 し た エンコーディング の haruencoder の インスタンス を 取得 し ます
は 、 現在 の セッションモジュール の 名前 を 返し ます
テキスト の アノテーション に 適用 する デコレーション を 返し ます
リクエストグループ 内 の リクエスト 数 を 制限 し ます
指定 し た odbc 結果 id における フィールド 名 に 対応 する カラムスロット の 数 を 取得 し ます
サーバー から の レスポンス を 返し ます
イテレータ が 有効 な マップ 要素 を 指し て いる かど う か を 返し ます
画像 の 色空間 を 取得 し ます
unicode の ドメイン 名 を 、 idna が 定め た ascii 形式 に 変換 し ます
データベース から lob データ を 取得 する 際 の モード を 設定 し ます
lob の 内容 を ファイル に 出力 し ます
この メソッド が 返す ストリームリソース を 、 php のすべて の ファイル 操作 関数 群 ファイル を 読み込む 関数 で 使え ます
linecap を 設定 し 、 ストローク を 考慮 し たうえ で パス の 終端 の 形状 を 制御 し ます
クラス が 定義 さ れ て いる 名前 空間 の 名前 を 取得 し ます
は 、 一方 の ファイルディスクリプタ から もう 一方 の ファイルディスクリプタ に データ を コピー し ます
画像 シーケンス に 関連 付け られ た ファイル 名 を 取得 し ます
は サーバー の severity レベル の 最小値 を 設定 し ます
現在 の テキストライズ の 値 を 取得 し ます
ファイル php .ini で 定義 さ れ た クッキーパラメータ を 設定 し ます
リモートスクリプト を 実行 し ます
この 関数 は 、 gmp 数 を php ネイティブ の 整数 に 変換 し ます
ユーザー 定義 の 関数 を 使っ て 、 値 で エントリ を ソート し ます
タイムアウト は いつ でも 設定 可能 で 、 同じ カーソル で の それ 以降 の クエリ に 影響 を 及ぼ し ます
 mqdisc を コール する と 、 キューマネージャ と アプリケーションプログラム と の 間 の 接続 を 切断 し ます
は 、 指定 し た connection から 直近 の エラーメッセージ を 返し ます
指定 さ れ た ディレクトリエントリ を 閉じ ます
指定 さ れ た フォント と サイズ で 出力 し た 場合 に 、 文字列 の 幅 が 何 ポイント に なる か を 計算 し ます
画像 を 閉じ 、 その リソース を 開放 し ます
imagickpixel オブジェクト の hsl カラー を 正規 化 し た もの を 返し ます
画像 の 高さ を 取得 し ます
接続 オブジェクト に対し て & quot ;commit &quot ; メソッド を コール する と 、 現在 処理 中 の トランザクション の すべ て の 内容 を コミット し ます
は 文字列 str を 何らか の 文字 token によって 区切 られ て いる 小さ な 文字列 トークン に 分割 し ます
subject に関し て pattern を 用い て 検索 を 行い 、 replacement に 置換 し ます
この 関数 は variant _cast に 似 て い ます が 、 「 その 場 で 」 変換 さ れる という 点 が 異 なり ます
は 、 req で 指定 し た リクエスト を 取り消し ます
ラージオブジェクト の サイズ を 取得 し ます
エントリ の メタデータ が 存在 する 場合 に それ を 削除 し ます
array 配列 の 各要 素 に ユーザー 定義 関数 callback を 適用 し ます
ノード が 子 を 持つ かど う か を 調べ ます
は 指定 し た 文字 列 source を パース し 、 zend engine の 字句 解析 スキャナ により php 言語 の トークン に 分割 し ます
は 、 hash で 指定 し た ハッシュ 関数 を data に 適用 し ます
は 、 文字列 str を 受け取り 、 その 3 2 ビットハッシュ 値 を 返し ます
この 関数 は 、 アルファベット 文字 を マッチング さ せる 際 に 大文字 小文 字 の 区別 を し ない こと 以外 は ereg と 同じ です
現在 の 描画 色 を 取得 し ます
接続 ステータス の ビットフィールド を 取得 し ます
パラメータ が 参照 渡し で ある かど う か を 調べ ます
アタッチ し て いる すべ て の イテレータインスタンス を 次 に 移動 さ せ ます
php および php が 使っ て いる cgi web サーバー など の バックエンド の システム 書き込み バッファ を フラッシュ し ます
関数 dio _read は 記述子 fd で 示さ れる ファイル から len バイト を 読み込み 、 それ を 返し ます
は 画像 image を 保持 する メモリ を 解放 し ます
指定 し た map から 、 key に対応 する 値 を 返し ます
は postscript type 1 フォント が 使用 し た メモリ を 解放 し ます
ページ の 水平 方向 の 拡大 率 を 設定 し ます
画像 の 反復 を 取得 し ます
base 6 4 で エンコード さ れ た data を デコード し ます
ファイル から 読み込ん だ 公開鍵 を 使用 し た 認証 を 行い ます
は 実際 に サーバー に データ を 書き込み ます
private プロパティ で ある かど う か を 調べ ます
この メソッド は 、 rename に対応 し て コール さ れ ます
文字列 を utf - 3 2 フォーマット から utf - 1 6 に 変換 し ます
出力 圧縮 に 使用 さ れ た コーディング の 種類 を 返し ます
subject におい て mask の 文字 が どれ も 含ま れ て い ない 最初 の セグメント の 長さ を 返し ます
指定 し た 大きさ と フィルタ で 、 画像 の サイズ を 変更 し ます
statement の 現在 の 行 の 、 指定 し た フィールド field が null で ある かど う か を 調べ ます
は 、 field =& gt ;value 形式 の assoc _array で 指定 し た レコード を 選択 し ます
韓国 / 朝鮮語 エンコーディング を 有効 に し ます
この 関数 は 、 指定 し た 名前 localname および namespaceuri の タグ を 持つ すべて の 子孫 要素 を 取得 し ます
で オープン し た リレーション を 閉じ ます
は 、 指定 し た 座標 から 始まる 矩形 を 作成 し ます
指定 し た image から 、 png 画像 を 出力 あるい は 保存 し ます
データ の 比較 に コールバック 関数 を 用い 、 配列 の 差 を 計算 し ます
この 関数 は 現在 利用 可能 な spl クラス を 配列 で 返し ます
指定 し た 名前 で 画像 を 書き込み ます
3 0 2 ヘッダ を 送出 し て 、 url に リダイレクト し ます
指定 し た 名前 の 属性 の 値 を 返し ます
は rpm ファイルポインタ を 閉じ ます
は 、 指定 し た リンク id に 関連 づけ られ た informix データベース へ の 接続 を 閉じ ます
メソッド は 、 データベース と の 接続 を 強制 的 に 閉じ ます
は memcached :: res _* 定数 のい ずれ か を 返し ます
例外 が スロー さ れ た 際 の 内部 情報 を 返し ます
例外 が スロー さ れ た 際 の 内部 情報 を 返し ます
は 、 tiff あるい は jpeg 画像 に 埋め込ま れ た サムネイル を 読み込み ます
結果 セット から 行 の 数 を 取得 し ます
oracle データベース の バージョン と 利用 可能 な オプション を 返し ます
現在 の フォント の サイズ を 取得 し ます
それ 以降 の リクエスト 用 の oauth タイムスタンプ を 設定 し ます
この 関数 は 、 エラー 番号 errno が 意味 する エラーメッセージ 文字 列 を 返し ます
色 color で 塗り つぶ し た 矩形 を 、 指定 し た image 上 に 作成 し ます
この メソッド は 、 php 関数 を xsl スタイルシート で の xslt 関数 として 利用 できる よう に し ます
キュー から 先頭 の ノード を 取り出し ます
レコード の 次 の バッチ を 返し ます
内部 イテレータ の 巻き戻し 操作 を 阻止 し ます
は postgresql データベース から ラージオブジェクト を 取得 し 、 その 内容 を ローカルファイルシステム 上 の ファイル に 保存 し ます
画像 の 型 を 取得 し ます
harufont の インスタンス を 取得 し ます
ウェブサービス の wsdl で 定義 さ れ て いる 型 の 配列 を 返し ます
は 、 指定 し た 接続 に ログイン する ユーザー を 変更 し ます
直近 の interbase 関数 の コール によって 得 られ た エラーコード を 返し ます
は 画像 image 上 に 塗り つぶ し た 多角 形 を 生成 し ます
( x y を 中心 と し た 円 の 一部 を 描き ます
は 、 新規 の 辞書 を ロード し て 辞書 リンク id を 返し ます
フォントメトリクス を 表す 、 多次 元 配列 を 返し ます
は 、 直近 の リクエスト から 次 の 結果 を 取得 し ます
オブジェクト を 指定 し て 、 それ が 指す値 を 返し ます
結果 セット 内 の 行 を 表す 、 カラム を プロパティ と する オブジェクト を 返し ます
は 画像 image から gif ファイル filename を 作成 し ます
と同じ です が 、 ウォッチャー を 自動 的 に は 開始 し ませ ん
subject の 中 で 、 mask 内 の 文字 だけ を 含む 最初 の 部分 の 長さ を 返し ます
ページハンドル を 閉じ 、 その ページ に 関係 する 全て の リソース を 開放 し ます
は システムログ が 出力 する ログメッセージ を 生成 し ます
新しい ボタン を 作成 し ます
http リクエスト の 送信 に 使う リクエストエンジン を 設定 し ます
リモートエンド 上 の シェル を オープン し 、 その ため の ストリーム を 割り 当て ます
は 証明 書 を 調べ 、 purpose で 指定 し た 目的 に 使用 可能 で ある かど う か を 確認 し ます
index で 指定 し た 添字 の 値 を 返し ます
赤 が 一番 強い 点 を 返し ます
この 関数 は 、 php から 既存 の 定数 を バイトコード として 読み込み 、 開か れ て いる ファイルハンドル に 書き込み ます
ストリーム あるい は url が 、 ローカル の もの で ある かど う か を 調べ ます
variant の 論理 否定 演算 を 行い ます
は 、 postgresql 結果 リソース の フィールド が sql の null で ある かど う か を 調べ ます
格納 さ れ て いる 変数 を キャッシュ から 取り除き ます
次 の 素数 を 見つけ ます
アイテム を レジストリ から 削除 し ます
ユリウス 暦 は 紀元 前 4 7 1 3 年 から 紀元 9 9 9 9 年 の 範囲 で 使え ます
プラグイン yaf _plugin _abstract を 参照 を 登録 し ます
コンテンツ を 取得 し ます
は 、 その セマフォ が コール 元 の プロセス により 現在 確保 さ れ て いる 場合 、 解放 し ます
xml パーサ の オプション を 設定 し ます
実行 時 に クラス また は 関数 エントリ の フラグ を 取得 また は 設定 し ます
定数 群 を キャッシュ から 読み込み ます
この 関数 は 、 url の 様々 な 構成 要素 の うち 特定 できる もの に関し て 連想 配列 に して 返し ます
この 関数 は 、 url エンコード さ れ た 文字列 を デコード し ます
type 3 フォント 定義 を 終了 し ます
この メソッド は 、 simplexmliterator を 最初 の 要素 に 巻き戻し ます
は 、 検索 の 制約 を 追加 し ます
は 、 ファイル を 先読み し て ページキャッシュ に 格納 し ます
直近 の mysqli _fetch _field の コール で 使用 し た フィールドカーソル の 位置 を 返し ます
画像 の 色度 が 白い点 を 設定 し ます
ローカル また は リモートサーバー の データベース を 開始 し ます
directoryiterator を 最初 に 巻き戻し ます
apciterator オブジェクト を 作成 し ます
は 、 &# 0 3 9 ; exp number - 1 &# 0 3 9 ; の 値 を 返し ます
mysqli 拡張 モジュール が 接続 し て いる mysql サーバー の バージョン を 文字列 で 返し ます
モーションブラー を シミュレート し ます
handle が 指し て いる ファイル の ファイル 位置 識別子 を ファイル ・ ストリーム 中 の offset バイト 目 に セット し ます
は 、 eio を 初期化 し ます
dtd に 基づい て ドキュメント を 検証 し ます
db ++ サーバー は 、 各 クライアント 接続 について tcl インタプリタ を 準備 し ます
oauth リクエスト を チェック し ます
文書内 の フィールド 名 の 配列 を 返し ます
画像 の レンダリング 方向 を 設定 し ます
は 、 指定 し た 接続 で 検索 を 行う 準備 を します
ファイル 終端 に 到達 し たか チェック し ます
指定 し た 名前 の 画像 プロファイル を imagick オブジェクト に 追加 し ます
imagick オブジェクト 内 で 現在 アクティブ な 画像 の インデックス を 取得 し ます
は 、 queue で 指定 し た メッセージキュー の メタデータ を 返し ます
フレーム を id 3v 2 タグ に 追加 し ます
アノテーション の 枠 の 形式 を 定義 し ます
新しい ページ を 作成 し 、 指定 し た ページ の 直前 に 挿入 し ます
セット の 要素 数 を 返し ます
ファイル の 拡張子 を 取得 し ます
前 景色 と 背景 色 の 色ペア を 定義 / 再定 義 し ます
は 、 oid で 関連 付け られ た ラージオブジェクト を 削除 し ます
slob オブジェクト を オープン し ます
プロパティ として フィールド に アクセス する ため の マジックメソッド
論理 表記 を 物理 表記 に 変換 し ます
は 、 指定 し た サーバー を サーバープール に 追加 し ます
で 使用 する ため の inotify インスタンス を 初期化 し ます
指定 し た blob の 大きさ を 返し ます
2 - legged フロー あるい は リクエスト の 署名
により 、 結果 セット の 指定 し た カラム から 、 指定 し た サイズ の lob データ を 取得 し ます
関数 は 、 geoip データベース の バージョン を 返し ます
yaf _route _supervar は yaf _route _static と 似 て い ます
さまざまな オプション を もと にし て ブックマーク を 作成 し ます
は 、 指定 さ れ た site コマンド を ftp サーバー に 送信 し ます
別 の imagick オブジェクト から 画像 の クリップマスク を 設定 し ます
関数 は 、 ローカル の マシン に 設定 さ れ て いる 標準 的 な ホスト 名 を 取得 し ます
アクティブ な イベントループ を その 場 で 中止 し ます
この 関数 は 、 指定 し た 文字列 を & raquo ;& nbsp ;rfc 3 9 8 6 に 従っ て url エンコード し ます
指定 し た キー の エントリ が ハッシュ に 存在 する かど う か を 調べ ます
この 関数 は 、 指定 し た アルゴリズム の セルフテスト を 実行 し ます
現在 の エントリ が 配列 あるい は オブジェクト で ある かどう か 、 つまり recursivearrayiterator :: getchildren で イテレータ を 取得 できる かど う か を 返し ます
指定 し た 結果 セット result の 行数 を 取得 し ます
は 結果 の フィールド 数 を 返し ます
この メソッド は 、 実行 可能 で ない tar あるい は zip アーカイブ を 別 の 実行 可能 で ない 形式 に 変換 し ます
ファイル へ の パス を 返し ます
は 、 新しい com オブジェクト の インスタンス を 作成 する こと に 似 て い ます
イテレータ を 巻き戻し て 新た に 反復 処理 を 始め られる よう に し ます
指定 し た キー の エントリ が セット に 存在 する かど う か を 調べ ます
は 、 ユーザー 名 と パスワード を 設定 し ます
現在 の 描画 色 、 線幅 、 塗りつぶし 色 、 塗りつぶし テクスチャ を 使っ て 、 指定 し た 座標 の 配列 による ポリライン を 描き ます
指定 し た エンベロープ envelope および ボディセクション body に 基づい て mime メッセージ を 作成 し ます
オブジェクト の 親 を 取得 し ます
icu の エラーコード 名 を 返し ます
イテレータ から infiniteiterator を 作成 し ます
は 、 キー key に 格納 さ れ た アイテム を 返し ます
ユーザー 定義 の 関数 を 使っ て 、 キー で エントリ を ソート し ます
reflectionextension オブジェクト を 作成 し ます
さまざまな値 を 取得 し ます
この メソッド は 、 データベース 参照 を 作る ため の 柔軟 な インターフェイス です mongodbref を 参照く ださい 
は 、 htmlspecialchars および htmlentities におい て 内部 的 に 使用 さ れる 変換 テーブル を 返し ます
は 、 現在 の アーカイブエントリ を 追加 する 際 に 使用 し た メソッド の 番号 を 返し ます
ウェーブフィルタ を 画像 に 適用 し ます
この 関数 は pdflib バージョン 5 で 廃止 さ れ まし た
ドキュメント の 情報 フィールド を 設定 し ます
現在 の ディレクトリ が 暗号 化 さ れ て いる かど う か を 調べ ます
間隔 を フォーマット し ます
php 変数 var の 型 を 返し ます
既存 の セッション を 再度 初 期化 する か 、 あるい は 新しい セッション を 作成 し ます
は 、 id 3 タグ に 格納 さ れ て いる 情報 を 変更 する ため に 使用 さ れ ます
ユーザー が 定義 し た 関数 の 引数 リスト から 、 指定 し た 引数 を 取得 し ます
展開後 の アーカイブエントリ の サイズ を 取得 し ます
これ は 古い 関数 です
ビルトイン さ れ て いる 画像 を 使っ て php ロゴ を 表示 する 際 に 使用 できる id を 返し ます
ファイル へ の パス を 返し ます
指定 し た ドキュメント の パース で 発生 し た 警告 と エラー を 返し ます
oid が 指す ラージオブジェクト を データベース から 削除 し ます
現在 の テキストライズ の 値 を 設定 し ます
により 、 メッセージキューデータ 構造 体 の msg _perm .uid 、 msg _perm .gid 、 msg _perm .mode および msg _qbytes フィールド を 変更 する こと が 可能 です
は 、 現在 の プロセス の 優先 度 を increment で 指定 さ れ た 値 に 変更 し ます
新しい ミューテックス を 作り 、 オプション で 呼び出し 元用 に ロック し ます
と 、 それ に 関連 する recursiveiteratoriterator :: rewind を コール し た 後 で コール さ れ ます
number で 指定 し た 符号 なし 整数 値 を 1 6 進数 表現 し た 文字列 を 返し ます
gmagick オブジェクト 内 で 現在 アクティブ な 画像 の インデックス を 取得 し ます
関数 session _unset は 現在 登録 さ れ て いる 全て の セッション 変数 を 開放 し ます
油絵風 の 効果 を 施す フィルタ を 適用 し ます
gd イメージ を 、 指定 し た filename に 出力 し ます
mpeg ファイルヘッダ の バージョン を 返し ます
指定 さ れ た 接続 id が 指す データベースサーバー へ の 接続 を 閉じ ます
アニメーション 画像 の 繰り返し 回数 を 設定 し ます
与え られ た gz ファイルポインタ が 指す ファイル の ファイル 位置 記述子 を 、 ファイルストリーム の 先頭 に セット し ます
は 、 phar アーカイブ の スタブ 内 で のみ 使用 し ます
エンコーディング を 文字列 で 設定 し ます
key が 指す 要素 を ユーザーキャッシュ から 削除 し ます
パフォーマンス を 向上 さ せる ため 、 newt は 必要 時 に しか 画面 を 更新 しませ ん
例外 が 作ら れ た ファイル の 名前 を 取得 し ます
この 関数 は 、 domtext クラス の 新しい インスタンス を 作成 し ます
指定 し た 画像 の 補間 方式 を 返し ます
ページ の 平坦 度 を 定義 し ます
で オープン し た パイプ へ の ファイルポインタ を クローズ し ます
すで に 定義 さ れ て いる ストリームラッパー を 無効 に し ます
ページ の 表示 を 、 ページ の バウンディングボックス を ウィンドウ に あわせる よう 設定 し ます
指定 し た 文字列 を & raquo ;& nbsp ;rfc 3 9 8 6 に も とづい て エンコード し ます
画像 の 上 に テキスト を 描画 し ます
操作 モード を 返し ます
画像 シーケンス に 関連 付け られ た ファイル 名 を 取得 し ます
は 、 指定 し た result リソース が 指す 結果 から 1 行分 の データ を 取得 し ます
と似 て い ます が 、 getimagesizefromstring の 最初 の パラメータ は ファイル 名 で は なく 文字 列 と なり ます
新しい タイムスタンプ を 作成 し ます
get / post / cookie 変数 を グローバルスコープ に インポート し ます
ある 値 を 既存 の キー に 追記 し ます
キャッシュ の サイズ の 合計 を 取得 し ます
この メソッド は 、 opendir に対応 し て コール さ れ ます
string を 、 正規 表現 によっ て 配列 に 分割 し ます
ルート 要素 の 名前 を 返し ます
は 、 指定 さ れ た postgresql クエリ 結果 resource に関する メモリ と データ を 開放 し ます
str のすべて の アルファベット を 大文字 に して 返し ます
object _id で 指定 し た オブジェクト に 続く snmp オブジェクト の 値 を 取得 し ます
指定 し た テキスト を 復号 ・ 検証 し 、 署名 の 情報 を 返し ます
指定 し た apc キー が 存在 する かど う か を 調べ ます
は 、 link _identifier が 指す 接続 に おい て 直近 の insert 、 update 、 delete クエリ で 変更 さ れ た レコード の 数 を 返し ます
この 関数 は 、 php から 既存 の クラス を バイトコード として 読み込み 、 開か れ て いる ファイルハンドル に 書き込み ます
指定 し た ファイル を opcode キャッシュ から 削除 し ます
は 、 haystack の 中 で 最後 に needle が 現れる 場所 を 探し 、 haystack の 部分 文字 列 を 返し ます
dom 表現 から html ドキュメント を 作成 し ます
この 関数 は 、 phar の マニフェスト 内 の フラグセット を 返し ます
さまざまな オプション を もと に して 、 新しい pdf ファイル を 作成 し ます
読み込み もしく は 書き込み の ため に gzip . gz ファイル を オープン し ます
指定 し た rng ソース に 基づい て 、 ドキュメント を & raquo ;& nbsp ;relaxng で 検証 し ます
オブジェクト の 輪郭 の 描画 に 使う 色 を 返し ます
prefix に 基づい て 、 ノード の 名前 空間 uri を 取得 し ます
は 、 path で 指定 し た ファイル を ftp サーバー から 削除 し ます
引数 binary _string により 指定 さ れ た 2 進数 と 等価 な 1 0 進数 を 返し ます
この メソッド は 、 fseek に対応 し て コール さ れ ます
この 関数 は 、 暗号 化記 述子 td で 指定 し た 暗号 化 を 終了 し ます
現在 の フォント の フォントエンコーディングベクタ の 中 で ord 番目 の 位置 に ある グリフ を 出力 し ます
関連付け られ て いる プロファイル の うち 、 パターン に マッチ する もの を すべ て 返し ます
この クラス の アクセス 修飾子 の ビットフィールド を 返し ます
デフォルト の イベントループ で 直近 の 処理 が 始まっ た 時刻 を 返し ます
（ x y ） を 左下 の 角と する 矩形 を 描き ます
トランザクション の ロック locking および 分離 レベル isolation を 設定 し ます
画像 の 背景 色 を 設定 し ます
後 で 使用 する ため に 、 画像 を 読み込み ます
配列 から 画像 に ピクセル を インポート し ます
キー で 配列 を ソート し ます
hostname に対応 する mx レコード を dns から 探し ます
オブジェクト 内 の 指定 し た キー に 対応 する 値 を 返し ます
読み込み の セカンダリ へ の 分散 について の 情報 は 、 この マニュアル の 問い合わせ の 節 を 参照く ださい
chdb データベース から 、 キー に 対応 し た 値 を 取得 し ます
指定 し た テーブル について の 情報 を 取得 し ます
bcompiler の exe ファイル から データ を 読み込み 、 バイトコード から クラス を 生成 し ます
は データベース 内 に ラージオブジェクト を オープン し 、 それ を 操作 する ため の ラージオブジェクトリソース を 返し ます
画像 の 型 を 設定 し ます
文字数 に 基づき マルチバイト 対応 の substr 処理 を 行い ます
は 確立 さ れ た データベース を 閉じ 、 により 指定 し た データベースハンドル の 全て の リソース を 開放 し ます
指定 し た エンコーディング の mime charset 文字列 を 取得 し ます
イテレータ を デタッチ し ます
この 関数 は 、 出力 バッファ の 内容 の 長さ を バイト 単位 で 返し ます
直近 に 実行 さ れ た ステートメント が 成功 あるい は 失敗 し た 際 の エラーメッセージ を 文字列 で 返し ます
直近 で 発生 し た 例外 の テキスト や 、 関数 コール が 失敗 し た 理由 の テキスト を 取得 し ます
haystack におい て needle を 検索 し ます
リスト 内 で 逆方 向 に ひとつ 進ん だ とき にまだ オブジェクト が 画像 を 保持 し て いれ ば true を 返し ます
与え られ た 変数 が オブジェクト か どう か を 調べ ます
サーバー から 送 られる ページネーション 情報 を 取得 し ます
ssh の 認証 を 、 ssh agent を 使っ て 行い ます
この 関数 は 、 オブジェクト あるい は オブジェクト 階層 の 全体 を チェックイン し ます
指定 し た object に クラスメソッド が 存在 する かど う か を 調べ ます
結果 セット 内 の カラム を 表示 する ため に 必要 な 最大 の バイト 数 を 返す
指定 し た 画像 の 9 枚 の サムネイル を タイル 状 に 並べ 、 さまざまな 強度 で 画像 処理 を 適用 し ます
最後 に 実行 し た クエリ について の 、 次 の ingres エラー を 取得 し ます
画像 の 周り を 枠線 で 囲み ます
は 、 ftp サーバー から リモートファイル を 取得 し ます
この 関数 は 、 結果 セット に 新しい 名前 を 割り 当て ます
クライアント と の 接続 が 切断 さ れ て いる かど う か を 調べ ます
文字列 の 定義 から 新しい ハッシュ を 作る ファクトリーメソッド です
は 、 truecolor イメー ジ を パレットイメージ に 変換 し ます
例外 メッセージ を 返し ます
この メソッド は 、 stream _select に対応 し て コール さ れ ます
stream に タイムアウト の 値 を 設定 し ます
新しい レイヤー 定義 を 作成 し ます
内部 イテレータ の 現在 の 要素 の キー を 取得 し ます
アウトライン を 最初 に 表示 し た 際 に 、 この ノード を 開く か 開か ない か を 定義 し ます
は 、 指定 し た postgresql connection リソース が 接続 し て いる ポート の 番号 を 返し ます
magic _quotes _gpc の 現在 の 設定 を 返し ます
armor 形式 の 出力 を 切り 替え ます
この メソッド は 、 オブジェクト を クローン さ せ ない よう に し ます
中心 の x 軸 を 基準 し て ピクセル を 反転 さ せ 、 垂直 方向 の ミラー 画像 を 作成 し ます
cyrus imap サーバー へ クエリ を 送信 し ます
値 を 最後 の 要素 として 追加 し ます
result の フィールド 番号 offset の 名前 を 返し ます
抽象 メソッド で ある かど う か を 調べ ます
デフォルト で は 、 ドキュメント は ひとつ の pages オブジェクト を 持っ て おり 、 これ がすべて の ページ の ルート と なり ます
この メソッド は 、 現在 の 要素 の simplexmliterator オブジェクト あるい は null を 返し ます
参照 画像 内 の 色 を 解析 し 、 その 画像 を 表す ため の 色 を 固定 の 色数 で 選び ます
パスワード や 暗号 化 キー の よう な 加工 さ れ た データ を 復元 する 際 に は リクエスト 認証子 が 必要 と なり ます
現在 の 単語 間隔 の 値 を 取得 し ます
名前 を 使用 し て 、 エントリ の ファイルハンドラ を 取得 し ます
コンテンツ を len バイト 分読 み 込み 、 指定 し た バッファ に 保存 し ます
この 関数 の 動作 は 、 ほぼ preg _replace と 同じ です が 、 replacement の 代わり に callback を 指定 する ところ が 異 なり ます
リソース の 監視 を 終了 し ます
image で 指定 さ れ た 画像 上 の 特定 位置 に ある ピクセル の 色 の インデックス を 返し ます
関数 は 、 親 プロセス と その pid および ppid のみ が 異なる 子 プロセス を 生成 し ます
パラメータ が 省略 可能 で ある かど う か を 調べ ます
solrdocument オブジェクト の コピー を 作成 し ます
配列 の サイズ を 返し ます
ラベル を 画像 に 追加 し ます
現在 の プロセス の グループセット を 取得 し ます
ページ の 表示 方法 を 、 三つ の パラメータ left 、 top および zoom で 設定 し ます
反復 処理 が 終了 し た とき recursivetreeiterator :: valid が 最初 に false を 返し た とき に コール さ れ ます
与え られ た 引数 に 従っ て unix の タイムスタンプ を 返し ます
プリペアドステートメント を 実行 し ます
cyrus imap サーバー に 接続 し ます
この メソッド は 、 fread および fgets に対応 し て コール さ れ ます
クラス を 定義 する 拡張 モジュール を 表す reflectionextension オブジェクト を 取得 し ます
handle ファイル の 読み 書き 用 ポインタ の 現在 位置 を 返し ます
この 関数 を 使っ て 、 どの ドライバモジュール を ログ に 記録 し て いる のか を 調べ ます
指定 し た tcp _server tcplisten など に 接続 し 、 デバッグデータ を ソケット に 送信 し ます
arg の ハイパボリックタンジェント を 返し ます
ベンダー 固有 の バイナリ 属性 を 、 現在 の radius リクエスト に アタッチ し ます
を 処理 し ます
直近 の curl 処理 に関する エラー 番号 を 返し ます
画像 を 読み 書き する 前 に ファイル 名 を 設定 し ます
ページオフセット や 処理 方法 を 指定 し て 、 複数 の 画像 を 合成 し ます
現在 の 要素 の 値 を 取得 し ます
イテレータ 内 の すべ て の 要素 に対し て 関数 を コール し ます
ip アドレス 属性 を 、 現在 の radius リクエスト に アタッチ し ます
シーケンス 内 の 特定 の 画像 の フォーマット を 返し ます
は final メソッド な ので 、 オーバーライド でき ませ ん
通常 の ssl ピア 証明 書 および ホスト の チェック を 無効 に し ます
この 関数 は 、 subject の 中 の search を 全て replace に 置換 し ます
この メソッド は エントリ を 新しい 値 で 更新 し 、 更新 でき たか どう か を 返し ます
画像 の 方向 を 取得 し ます
 mqbegin を コール する と 、 作業 ユニット を 開始 し ます
結果 セット 内 の 指定 し た カラム の 位取り を 返し ます
結果 セット を 閉じ ます
複数 の curl ハンドル で 、 データ を 共有 できる よう に し ます
sqlite 3 ライブラリ の バージョン を 、 文字 列定 数 と 数値 で 返し ます
は 、 現在 の セッション 名 を 返し ます
この 関数 は str の 最初 および 最後 から 空白 文字 を 取り除き 、 取り除か れ た 文字列 を 返し ます
エラー の 配列 を 返し ます
は htmlentities の 反対 で 、 string に ある すべ て の html エンティティ を 適切 な 文字 に 変換 し ます
ユーザー / システム キャッシュ を クリア し ます
指定 し た 座標 を 中心 と する 楕円 を 描画 し ます
この 関数 は 、 シーケンス 内 の 文字 を 返し ます
は 、 挿入 さ れ た 行 に 割り 当て られ た oid を 取得 し ます
直近 の sql 文 で 変更 あるい は 挿入 、 削除 さ れ た 行 の 数 を 返し ます
プリペアドステートメント を 実行 し 、 結果 セットオブジェクト を 返し ます
現在 の 描画 パス に 矩形 を 追加 し ます
イテレータ に ある 要素 を カウント し ます
カーソル を 無効 に して 関連 付け られ た 全て の リソース を 開放 し 、 読み込み を キャンセル し ます
ingres データベース へ の 持続 的 接続 を オープン し ます
直近 の コミット 以降 に 発行 さ れ たすべて の 文 を ロールバック し 、 現在 の トランザクション を 終了 し ます
ヘッダ がす でに 送信 さ れ て いる かど う か を 調べ ます
結果内 の エントリ 属性 の 、 すべて の 値 を 読み込み ます
この 関数 は truetype テキスト の bounding box を ピクセル 単位 で 計算 し て 返し ます
ファイル 記述子 fd 上 で オープン し て いる 現在 の 端末 デバイス へ の 絶対 パス を 文字列 で 返し ます
は 、 配列 array から 全 て の 値 を 取り出し 、 数値 添字 を つけ た 配列 を 返し ます
指定 し た slob オブジェクト id bid の slob オブジェクト を 削除 し ます
インタプリタ を 再開 する ため に 、 一般 的 に は ソケット 経由 で 送信 し ます
プリペアドステートメント 内 の パラメータ の 数 を 返し ます
key が cert に対応 する 秘密 鍵 か どう か を 調べ ます
セッション を 破棄 し ます
楕円 を 現在 の パス に 追加 し ます
新しい バイナリデータオブジェクト を 作成 し ます
現在 の 要素 が 子 を 持っ て いる かど う か を 調べ ます
デストラクタ で ある かど う か を 調べ ます
ファイル を 配列 に して 返す こと 以外 は readgzfile と 同じ です
指定 し た 文字 オブジェクト bid に関し て 文字 オブジェクト の 内容 を 更新 し ます
は id を 返し ます
アーカイブ に対する すべ て の 変更 を 取り消し ます
カスタム の シリアライズ で 使わ れ ます
現在 の メールボックス に ある メッセージ 数 を 返し ます
木炭画 を シミュレート し ます
ldap の 検索 結果 を パース し ます
ファイル から 文字 エンコードベクトル を ロード し 、 変更 し ます
と同じ です が 、 ウォッチャー を 自動 的 に は 開始 し ませ ん
イテレータ を 、 次 の 配列 の 要素 に 進め ます
現在 の 塗り つぶし 色 を 取得 し ます
メソッド を アクセス 可能 に し ます
url 経由 で 渡さ れる クエリ 文字 列 と 同様 に str を 処理 し 、 現在 の スコープ に 変数 を セット し ます
現行 の フィールド を 取得 し ます
直近 の soap リクエスト で 送信 さ れ た xml を 返し ます
画像 の 色 を 、 ルックアップテーブル を もと に 置き 換え ます
現在 の directoryiterator アイテム の ファイル 名 を 取得 し ます
は 「 チェック し て 設定 」 という 操作 を 行い ます
この 関数 は 、 オブジェクト の 一意 な 識別子 を 返し ます
線端 を どの よう に 表示 する か を 設定 し ます
は 同名 の c 関数 と 同じ 動作 を します
テーブルデータベース から レコード を 削除 し ます
指定 し た ファイル が 通常 の ファイル か どう か を 調べ ます
指定 し た 名前 および 値 を 使用 し て 、 hw _api _attribute の 新しい インスタンス を 作成 し ます
は 、 数値 アイテム の 値 を offset で 指定 し ただけ 減ら し ます
画像 の 遅延 を 取得 し ます
新規 soapparam オブジェクト を 生成 し ます
2 つの lob / file ロケータ を 比較 し ます
トランザクション を ロールバック し ます
ポラロイド 写真 を シミュレート し ます
この 関数 は 、 指定 し た calendar について year 年 month 月 の 日数 を 返し ます
は 、 item で 指定 し た 文字列 を sqlite sql ステートメント で 使用 できる よう に 正しく クオート し ます
は 、 phar :: startbuffering メソッド と 組み合わせ て 使用 し ます
この 関数 は 、 出力 バッファ の 内容 を 消去 し ます
エージェントセッション 用 に 確保 さ れ た メモリ を 開放 し ます
 mqconnx を コール する と 、 アプリケーションプログラム を キューマネージャ に 接続 し ます
この 関数 は 、 db 2 データベースクライアント について の 情報 を 読み取り 専用 の プロパティ に 保持 する オブジェクト を 返し ます
シグナル sig を プロセス id pid の プロセス に 送信 し ます
は 、 ランダム に 生成 さ れ た 秘密 鍵 および 指定 し た method を 使用 し て data を シール 暗号 化 します
現在 の キー を 取得 し ます
パターン の 定義 を 終了 し ます
php が 出力 を 送信 し はじめる とき に コール する 関数 を 登録 し ます
textflow および 関連 付け られ た データ 構造 体 を 削除 し ます
次 の 要素 に 移動 し ます
msg _number が 指す メッセージ に 削除 予定 の マーク を します
入力 ／ 出力 ドキュメント の エンコーディング を 設定 し ます
小文字 の ベースライン から の 距離 を 取得 し ます
reflectionclass オブジェクト の 文字 列表 現 を 返し ます
xml 要素 の 名前 を 取得 し ます
ラージオブジェクト の データ を 他 の ラージオブジェクト に 追加 し ます
この rararchive オブジェクト の 文字 列表 現 を 取得 し ます
は 、( 0 1 の 範囲 の 疑似 乱数 を 返し ます
塗りつぶし 色 や 塗り つぶし テクスチャ を 使っ た 描画 の とき に 使う 不透 明度 を 設定 し ます
現在 定義 さ れ て いる 全て の 定数 の 名前 と 値 を 返し ます
は 、 ブラウザ に 送信 さ れる 際 クッキー の 値 が 自動 的 に url エンコード さ れ ない こと を 除き 、 setcookie と 等価 です
画像 に ラジアルブラー を 施し ます
複数 の 画像 を モーフィング し ます
特定 の 画像 チャネル の 深度 を 返し ます
現在 の 描画 色 、 線幅 、 塗りつぶし 色 、 塗りつぶし テクスチャ を 使っ て 、 指定 し た 座標 の 配列 による 多角 形 を 描き ます
関数 は 、 maxdb 拡張 モジュール で 使用 さ れ て いる 、 クライアント の バージョン を 表す 文字 列 を 返す ため に 使用 さ れ ます
プロセス の タイトル を 設定 し ます
指定 し た リレーション relation の 最初 の タプル の データ を 読み込み 、 連想 配列 として tuple に 返し ます
radius リクエスト を 発行 する 前 に は 、 ライブラリ が 接続 可能 な サーバー を 知っ て いる 必要 が あり ます
dn で 指定 し た エントリ について 、 名前 の 変更 また は 移動 を 行い ます
格納 さ れ て いる 変数 を キャッシュ から 取得 し ます
は 機能 的 に memcached :: setmulti と 同等 です
内部 的 な zend の 値 を 表す 文字列 を ダンプ し ます
キー で エントリ を ソート し 、 キー と 値 の 関係 は 保持 し ます
新しい domprocessinginstruction オブジェクト を 作成 し ます
これ は arrayaccess インターフェイス を 実装 し た もの です
データベース は 、 一回 の 応答 で 最大 4mb まで の ドキュメント を ひと まとめ に し て 送信 し ます
arg を 出力 し ます
開始行 を 取得 し ます
また は imagecolorallocatealpha で 確保 さ れ た 色 を 開放 し ます
多く の 関数 で 利用 さ れる 値 を 設定 し ます
メソッド は 、 最後 に 実行 し た memcached クラス の メソッド の 結果 コード の 内容 を 説明 し た 文字列 を 返し ます
php の カレントディレクトリ を directory に 変更 し ます
パラメータ を 変数 に バインド し ます
jpeg ファイル を wbmp ファイル に 変換 し ます
パラメータ value を 値と する num 個 の エントリ から なる 配列 を 埋め ます
新しい イテレータ を arrayobject インスタンス から 作成 し ます
id 3 タグ の ジャンル を 返し ます
クォート さ れ た 文字列 を 元 に 戻し ます
ドライバ 内 で 、 現在 トランザクション が アクティブ に なっ て いる かど う か を 調べ ます
オブジェクト を ストレージ に 追加 し 、 オプション で それ を 何ら か の データ に 関連 づけ ます
結果 セット の 次 の 結果 を 返し ます
画像 の 遅延 を 設定 し ます
この 色 に 関連 づけ られ た 色 カウント を 返し ます
filename が 存在 し て 、 かつ それ が 書き込み 可能 で あれ ば true を 返し ます
底 を 1 0 と する arg の 対数 を 返し ます
は 、 shm _identifier で 指定 し た 共有 メモリセグメント から 変数 variable _key を 読み こみ ます
は 、 指定 し た image を xbm にし て 出力 あるい は 保存 し ます
水平 方向 に 反転 さ せ た 画像 を 作成 し ます
path の 作業 コピー を revno で 指定 し た リビジョン に アップデート し ます
この 関数 は 、 xmlタグ の 中 で 定義 さ れ た 属性 と その 値 を 取得 し ます
parentiterator に 含まれる 内部 イテレータ の 子 を 取得 し ます
pdf ブロック を 、 その プロパティ に 基づい た さまざまな データ で 塗り つぶし ます
は 、 直近 の yaz _scan の 実行 時 に サーバー から 受信 し た 項目 と 関連 情報 を 返し ます
は 、 principal の 新しい パスワード を password に 設定 し ます
現在 の パス に 円 を 追加 し ます
現在 の エントリ の イテレータ を 返し ます
必須 パラメータ を 削除 し ます
データ を 順 に パース し 、 指定 し た mime メールリソース に 格納 し ます
現在 の ノード から 、 名前 空間 namespaceuri における localname という ローカル 名 の 属性 の 値 を 取得 し ます
ファイル から 1 文字取り出す
指定 し た フィールド の オプション を 設定 し ます
画像 の 深度 を 設定 し ます
結果 セット 内 の 指定 し た カラム の 名前 を 返し ます
ユリウス 積算 日 を & quot ;月 / 日 / 年 &quot ; の 形式 で ユリウス 暦 を 含む 文字 列 に 変換 し ます
指定 し た オフセット の 値 を 設定 し ます
ファイル を 読ん で 標準 出力 に 書き出し ます
ページ の サイズ および 方向 を 、 定義 済み の フォーマット に 変更 し ます
文字列 の 定義 から 新しい ハッシュ を 作る ファクトリーメソッド です
与え られ た ファイルポインタ から 返さ れ た bzip 2 エラー の エラー の 文字列 を 返し ます
sql の 集約 関数 として 使用 する php 関数 を 登録 し ます
は 、 マルチバイト 対応 の strripos 操作 を 、 文字数 に 基づい て 行い ます
mpeg ファイル が 著作 権 で 保護 さ れ て いる 場合 に true を 返し ます
結果 セット の 行数 を 返し ます
png 画像 を 読み込み ます
evprepare ウォッチャーオブジェクト を 作り 、 自動 的 に 開始 さ せ ます
マルチハンドル に対し て 、 個別 の 転送 に メッセージ / 情報 が 残っ て いる かど う か を 問い合わ せ ます
glob 式 から 新しい ディレクトリイテレータ を 作成 し ます
この 関数 は 、 入力 data を gzip プログラム の 出力 と 互換 性 の ある 形式 で 圧縮 し て 返し ます
指定 し た フィールド の フラグ を 設定 し ます
データベース に 送信 する 文字 列 は utf - 8 で なけれ ば なり ませ ん
ある 単語 が 、 現在 の セッション 内 に 既 に 存在 する かど う か を 調べ ます
スタック し た オブジェクト を すべ て 実行 し 終え た ワーカー を シャットダウン し ます
この メソッド は 、 memcached の オプション の 値 を 返し ます
文書 から フィールド を 除去 し ます
名前 空間 namespaceuri に ある localname という 名前 の 属性 を 要素 から 削除 し ます
は 、 ファイルシステム 上 の ファイル の データ を もと にし て 新しい ラージオブジェクト を データベース 内 に 作成 し ます
zip ファイルアーカイブ の 中 の 次 の エントリ を 読み込み ます
次 の 要素 が 利用 可能 と なっ た とき に コール さ れ ます
配列 の 要素 を glue 文字列 で 連結 し ます
ある 数 の 平方根 を 余り つき で 計算 し ます
例外 を 文字列 で 表現 し た もの を 返し ます
は event の 実行 予定 を 追加 し ます
バッファ つき イベント が 操作 する ファイル 記述子 を 変更 し ます
は 、 ftp list コマンド を 実行 し 、 結果 を 配列 として 返し ます
関数 は 、 現在 の 結果 セット の pos で 指定 し た 位置 に ある レコード を 調べ ます
クラス の ドキュメントコメント を 取得 し ます
tar あるい は zip アーカイブ を イテレータ から 作成 し ます
ファイルストリーム に おい て 現在 の オフセット を 表す ファイルポインタ の 現在 位置 を 返し ます
指定 し た エラー 番号 errno に対応 する posix システムエラーメッセージ を 返し ます
指定 し た データベース に おける フィールド （ カラム ） 数 を 取得 し ます
ファイル から 画像 を 読み込み ます
は 、 eio _poll を 呼ぶ カスタムループ の 中 から コール さ れ ます
現在 の directoryiterator アイテム が シンボリックリンク で ある かど う か を 調べ ます
は msql サーバー と の 接続 を 確立 し ます
指定 し た 大きさ と フィルタ で 、 画像 の サイズ を 変更 し ます
データベースオブジェクト から コレクション を 取得 する ため の 最 も 簡単 な 方法 です
指定 し た index の 値 を newval に 設定 し ます
結果 セット を 解放 し ます
テーブル を 、 ページ 全体 あるい は 部分 的 に 配置 し ます
例外 が スロー さ れ た 際 の 内部 情報 を 返し ます
現在 の 位置 から 指定 さ れ た 座標 まで の 直線 を 現在 の パス に 追加 し ます
パラメータ を reflectionparameter の 配列 で 取得 し ます
imagick オブジェクト に 関連 付け られ た ページ の ジオメトリ を 返し ます
新しい oauthprovider オブジェクト の インスタンス を 作成 し ます
この 関数 は 、 作成 し た ボタン を 含む グリッド を 返し ます
青 が 一番 強い 点 を 返し ます
perl の carp :: croak と 同じ よう に 動作 し ます
は フィールド 長 を 返し ます
8bim プロファイル の 最初 の パス が 存在 する 場合 に 、 それ に そっ て 切り 取り ます
新しい レコード を データベース に 書き込み ます
定義済 み の ディザリング 閾値 マップ に も とづい た 、 複数 の 強度 レベル による 配列 ディザリング を 行い ます
クエリ を 実行 し 、 単一 の 結果 を 返し ます
共通 の 属性 を 有する セッション を 検索 する 際 に 使用 し ます
指定 し た xml インスタンス 文字 列 から sdo _dataobjects の ツリー を 作成 し ます
format に 基づき 、 バイナリ 文字 列 から 配列 に 分解 し ます
は 、 指定 し た リンク id に関連付け られ た msql サーバー と の 持続 的 で ない 接続 を 閉じ ます
imagemagick の ホーム url を 返し ます
フラグ について の 情報 を 取得 し ます
は 機能 的 に memcached :: prepend と 同等 です
で 定義 し た pdf の 結果 を 出力 する 対象 の フレーム を 設定 し ます
オブジェクト の デフォルト の 圧縮 品質 を 設定 し ます
は 、 http リクエスト に対する レスポンス 内 で サーバー によっ て 送出 さ れ た ヘッダ の 配列 を 返し ます
は 、 jpeg あるい は tiff の 画像 ファイル から exif ヘッダ を 読み込み ます
特定 の フィールド に対する boost 値 を 取得 し ます
文字列 str に関し て 「 半角 」- 「 全角 」 変換 を 行い ます
新しい 行 を データベース に 格納 し ます
ファイル file に バイナリ 形式 の パッチファイル patch を 適用 し 、 結果 を ファイル dest に 保存 し ます
トークンハンドラコールバック として 登録 し た 関数 を コール し ます
hostname で 指定 し た インターネットホスト の ipv 4 アドレス を 返し ます
は 、 直近 の エラーメッセージ を 返し ます
現在 の ページ を 一時 停止 し ます
は 、 key を pem エンコード し た 文字 列 として 取得 し 、 out （ 参照渡 し ） に 格納 し ます
は 、 強力 な 一方向 ハッシュアルゴリズム を 使っ て 新しい パスワードハッシュ を 作り ます
イテレータ の 現在 の エントリ が 有効 か どう か を 返し ます
curl セッション 用 の 複数 の オプション を 設定 し ます
は 、 bzip 2 形式 の データ を 含む 文字 列 を 解凍 し ます
その ページ の 現在 の 変換 行列 を 取得 し ます
lob の 内部 ポインタ の 現在 位置 から length バイト 読み込み ます
コールバック 関数 を 取得 し ます
画像 の 背景 色 を 返し ます
 mqput 1 は 、 ひとつ の メッセージ を キュー に 置き ます
は 、 filename で 指定 し た ini ファイル を ロード し 、 連想 配列 として その 設定 値 を 返し ます
この オブジェクト の 、 指定 し た チャネル の 値 を 正規 化 し た もの を 設定 し ます
新しい domelement オブジェクト を 作成 し ます
アーカイブエントリ の ホスト os の コード を 返し ます
日付け を フランス 革命 暦 から ユリウス 積算 日 に 変換 し ます
ユーザーキャッシュ に 格納 さ れ た データ について の 情報 を 取得 し ます
は 、 キー （ 文字 列形 式 ） を 配列 に 分割 し ます
は 、 needle が haystack の 中 で 最初 に 現れる 位置 を 返し ます
ロック さ れ た オブジェクト の ロック を 解除 し ます
ステートメントリソース あるい は 接続 リソース から 、 指定 し た オプション の 値 を 取得 し ます
実行 中 の スクリプト に関する 情報 を 、 一般的 に は ソケット 経由 で リクエスト し ます
samconnection オブジェクト に対し て & quot ;disconnect &quot ; メソッド を コール する と 、 php スクリプト と メッセージングサーバー と の 接続 を 解除 し ます
この 関数 は 、 連想 配列 に おい て 各配 列 の キー と 要素 と の 関係 を 維持 しつつ 配列 を ソート し ます
は 、 指定 し た リビジョン url repos _url の 中身 の 完全 な 履歴 を 返し ます
この 関数 は 、 コマンドヒストリ を ファイル から 読み込み ます
個々 の ピクセル の 輝度 を 閾値 と 比較 し 、 その 色 を 変更 し ます
指定 し た 結果 id が 指す frontbase 結果 の 内部 行 ポインタ を 指定 し た 行番 号 に 移動 し ます
文字列 を utf - 1 6 フォーマット から utf - 8 に 変換 し ます
この 関数 は 、 apache の table _get および table _set の ラッパー です
文字列 の 長さ を 取得 し ます
大文字 小文字 を 区別 せ ず 、 文字 列内 で 最初 に あらわ れる 場所 の 書記 素単 位 の 位置 を 見つけ ます
と似 て い ます が 、 datetimeimmutable で 動作 し ます
プロセス の タイトル を 設定 し ます
ネゴシエート さ れ た メソッド の リスト を 返し ます
画像 の 遅延 を 設定 し ます
を 使っ て 、 文字 列内 の 特殊 文字 を エスケープ し て から データベース に 送信 し ます
が サポート する アルゴリズム で 生成 し た 有効 な ハッシュ を 渡す と 、 その ハッシュ に関する 情報 の 配列 を 返し ます
現在 の imagick オブジェクト へ の 参照 を 返し 、 画像 ポインタ を 正しい シーケンス に 設定 し ます
配列 input から offset および length で 指定 さ れ た 要素 を 削除 し 、 配列 replacement で それ を 置換 し ます
パーサ の オプション を 設定 あるい は 変更 し ます
この 関数 は 、 soap サーバー で soap エラーハンドラ を 使用 する かど う か を 設定 し ます
対象 に マッチ する 任意 の 点 の 色 の 値 を 変更 し ます
は ms sql サーバー へ の 接続 を 確立 し ます
paradox ファイル に 保存 さ れ て いる 日付 を 、 人間 が 理解 し やすい 形式 に 変換 し ます
form に 複数 の コンポーネント を 追加 し ます
配列 イテレータ の クラス 名 を 設定 し ます
は 、 結果 リソース の 行 の 位置 を 指定 さ れ た offset に セット し ます
は 、 mp 3 ファイル 内 の id3 タグ の バージョン を 取得 し ます
新規 テンプレート の 定義 を 開始 し ます
要素 の メンバ として name という 名前 の 属性 が 存在 する かど う か を 示し ます
さまざまな オブジェクト や イベント に 適用 可能 な アクション を 作成 し ます
は sybase _fetch _array に 似 て い ます が 、 違い が 一つ あり ます
で 実行 する ため の クエリ を 準備 し ます
テーブルデータベース 上 で 検索 を 実行 し ます
アプリケーション 内 で 、 場所 によっ て デバッグ の レベル を 増減 する 際 に 使用 可能 です
この 関数 は 、 domcdatasection クラス の 新しい インスタンス を 作成 し ます
opcode キャッシュ による メモリ 使用 状況 について の 情報 を 取得 し ます
それ 以降 の すべ て の リクエスト 用 の ノンス を 設定 し ます
新しい スレッド を 開始 し 、 実装 さ れ て いる run メソッド を 実行 し ます
この 関数 は 、 指定 し た アルゴリズム が ブロックアルゴリズム の 場合 に true 、 ストリームアルゴリズム の 場合 に false を 返し ます
この 関数 は 、 domattr クラス の 新しい インスタンス を 作成 し ます
スクリプト の 実行 を 停止 し 、 接続 し て いる ソケット から の 応答 を 待ち受ける ため に 使用 し ます
この 関数 は 、 現在 の ノード の インデックス を 返し ます
は 、 指定 し た filename から 得 られ た イメージ を 表す イメージ id を 返し ます
result に 関連 する 直近 の select 、 update あるい は delete クエリ により 変更 さ れ た 行 の 数 を 返し ます
allo コマンド を ftp サーバー に 送信 し 、 アップロード さ れる ファイル の ため の スペース を 確保 し ます
ディスク 上 に 新しい ファイル を 作成 し 、 postscript ドキュメント を その 中 に 書き込み ます
イベント 発生 時 に コール さ れる callable 関数 です
画像 の 解像 度 の 単位 を 設定 し ます
は 指定 さ れ た ファイル の サイズ を バイト 数 で 返し ます
内部 イテレータ の 現在 の 要素 が 子 を 持つ かど う か を 調べ ます
画像 の 輝度 を 引き伸ば し て 飽和 さ せ ます
指定 し た インターフェイス が 定義 さ れ て いる かど う か を 調べ ます
関数 は 、 error _reporting ディレクティブ を 実行 時 に 設定 し ます
paradox ファイル の リソース を 削除 し 、 メモリ を 開放 し ます
指定 し た バージョン version で 、 機能 feature が サポート さ れ て いる かど う か を 調べ ます
画像 の 輪郭 を なめらか に し ます
現在 の プロセス の 実効 ユーザー id を 設定 し ます
ページ を どの よう に 表示 する か を 定義 し ます
は 、 日付 / 時刻 関数 で 使用 さ れる デフォルトタイムゾーン を 設定 し ます
fdf ドキュメント を 文字 列 として 返し ます
は 、 指定 し た command を 実行 し 、 結果 を 出力 する c 言語 の system 関数 に 似 て い ます
指定 し た 符号 化方 式 で データ を 圧縮 し ます
は 、 指定 し た ingres database と の 接続 を オープン し ます
zip アーカイブ の コメント を 返し ます
通常 、 echo や print など の あらゆる 出力 は 、 親 の スコープ から 出力 し て いる か の よう に 出力 さ れ ます
array のすべて の キー を 小文 字 あるい は 大文字 に し た 配列 を 返し ます
テーブル および インデックス に関する 統計 情報 を 取得 し ます
クエリ の 並び順 を 設定 し ます
この メソッド は 、 参照 する ファイル の ファイル 名 を 返し ます
インポート さ れ た pdf ドキュメント の 要素 を 処理 し ます
internal _encoding で エンコード さ れ た 文字列 を output _encoding に 変換 し ます
ファイル を 読み込み 、 解凍 し 、 標準 出力 に 書き込み ます
テキスト の アノテーション で 使う フォント の ポイント 数 を 設定 し ます
crud 操作 以外 の ほと んどすべて の 操作 は 、 データベースコマンド で 行い ます
ローカルクラスプレフィックス を 登録 し ます
の よう な 描画 関数 によっ て 事前 に 作成 さ れ た パス を 塗り つぶし ます
シンボリックリンク の ターゲット を 返し ます
odbc クエリ から 、 連想 配列 を 取得 し ます
は 、 事前 に openssl _public _encrypt で 暗号 化 さ れ た data を 復号 し 、 それ を decrypted に 格納 し ます
指定 し た バッファ つき イベント に データ を 書き込み ます
ページ の 平坦 度 を 取得 し ます
アーカイブエントリ の 、 os に 依存 する 属性 を 返し ます
指定 し た wddx パケット を 終了 し 、 パケット を 含む 文字 列 を 返し ます
と同じ です が 、 ウォッチャー を 自動 的 に は 開始 し ませ ん
指定 し た メッセージ の 本文 全体 、 あるい は その 一部 を 保存 し ます
内部 イテレータ を 取得 し ます
は 、 array 1 の 各要 素 に callback 関数 を 適用 し た 後 、 その 全 て の 要素 を 含む 配列 を 返し ます
指定 し た 対象 を 指し て いる すべ て の ソースアンカー を 取得 し ます
関数 は 、 socket パラメータ で 指定 し た ソケット に o _nonblock フラグ を 設定 し ます
リポジトリ の url を 指定 し て 、 ファイル の svn blame を 取得 し ます
バッファ を 修正 する ため の ob _start コールバック 関数 です
この メソッド は 、 接続 を 認証 済み の 状態 に し ます
この 接続 に おける 全て の 未解 決 の 命令 を ロールバック し ます
複数 の クエリ を データベース 上 で 実行 し 、 マッチ する レコード を 返し ます
は 、 指定 し た image に 多角 形 を 作成 し ます
設定 し た フォント を 返し ます
現在 の 属性 の 親要 素 に カーソル を 移動 し ます
xml パーサ parser の 表記 法宣 言用 ハンドラ 関数 を 設定 し ます
指定 し た ファイル から 読み込ん だ yaml ドキュメントストリーム 全体 ある い は その 一部 を 、 php の 変数 に 変換 し ます
イテレータ を 取得 し 、 データベース 内 の すべ て の キー / 値 を 反復 処理 できる よう に し ます
imagick オブジェクト の グローバル gravity プロパティ を 設定 し ます
現在 の データベース の プロファイリングレベル を 返し ます
fam サービス へ の 接続 を クローズ し ます
oracle サーバー へ の 持続 的 接続 を 生成 し 、 ログオン し ます
終了 行番 号 を 取得 し ます
oldname を newname に リネーム し 、 必要 なら ディレクトリ を 移動 しよ う と 試み ます
最小 の メッセージ 深刻 度 を 設定 し ます
事前 に 作成 さ れ た 構造 体要 素 やその 他 の 内容 を アクティブ に し ます
ファイル を パース し ます
data で 指定 し た データ を socket で 指定 し た ソケット に 送信 し ます
この ノード が jste で ある かど う か を 調べ ます
現在 の 水平 方向 の 拡大 率 を 取得 し ます
は php バックトレース を 生成 し ます
は 、 指定 し た ドキュメント について 発生 し た tidy アクセシビリティ 警告 の 数 を 返し ます
php の 変数 variable を oracle プレースホルダ bv _name に バインド し ます
setsecurity は 、 snmp プロトコルバージョン 3 で 使う セキュリティ 関連 の セッションパラメータ を 設定 し ます
新しい 一時 ファイルオブジェクト を 作成 し ます
phar アーカイブ 内 で 、 この ファイル 用 の マニフェスト に 保存 さ れ た メタデータ を 返し ます
php が リンク さ れ て いる oracle c クライアント ・ライブラリ の バージョン 番号 を 含む 文字 列 を 返し ます
は 複数 回 コール さ れる こと も ありえ ます
値 を ビューエンジン に 代入 し ます
host に対応 する type 型 の レコード を dns から 探し ます
指定 し た 名前 の 画像 プロファイル を gmagick オブジェクト に 追加 し ます
新しい quickhashstringinthash オブジェクト を 作り ます
例外 が スロー さ れ た 際 の 内部 情報 を 返し ます
シリアライズ さ れ た php データ として xml レスポンス を 返し ます
すべて の 定義 済み 関数 を 配列 で 返し ます
が 呼ば れ た とき に 使用 する 、 カスタムクラス を 設定 し ます
文字 が アルファベット の 場合 、 str の 各単 語 の 最初 の 文字 を 大文字 に し た もの を 返し ます
さまざまな値 を 設定 し ます
から 返さ れ た 接続 id が 指す interbase データベース へ の リンク を 閉じ ます
トランザクション を コミット し ます
variant の 絶対 値 を 返し ます
ストリーム 再生 する ビデオ の 幅 と 高さ を 設定 し ます
画像 の 総 インク 密度 を 取得 し ます
テンプレート の ベースディレクトリ を 設定 し ます
オブジェクト を ストレージ から 取り除き ます
php スクリプト に 割り 当て られ た メモリ の 最大値 を 、 バイト 単位 で 返し ます
クエリ 結果 result _id の 全て の 行 を html テーブル に フォーマット し ます
配列 を 受け取っ て 、 要素 の 順番 を 逆に し た 新しい 配列 を 返し ます
画像 の レンダリング 方向 を 取得 し ます
は 、 ある クエリー 結果 の フィールド に関し て 情報 を 得る ため に 使用 し ます
は 、 ラージオブジェクト の カレント の シーク 位置 に データ を 書き込み ます
現在 の 描画 色 を 取得 し ます
disable _functions ディレクティブ で 関数 が 無効 に なっ て いる かど う か を 調べ ます
ベジエ 曲線 を 現在 の パス に 追加 し ます
パス を 閉じ 、 その 輪郭 を 描き ます
現在 の ファイル の パス と ファイル 名 を 取得 し ます
oracle サーバー へ の 新規 接続 を 確立 し 、 ログオン し ます
データベース に 新しい レコード を 挿入 し ます
関数 の 開始 行番 号 を 取得 し ます
content を テキスト に 持つ メールボックス の 名前 を 配列 で 返し ます
この メソッド は 、 ノード が 属性 を 保持 し て いる かど う か を 調べ ます
は 、 pid の 優先 度 を 設定 し ます
確保 し た 参照 を 解放 し ます
ストリーム を インポート し 、 ソケット を ソケットリソース に カプセル 化 し ます
直近 の レスポンス に関する http 情報 を 取得 し ます
現在 の パス を 閉じ ます
画像 シーケンス を マージ し ます
xml パーサ parser の 外部 エンティティ 参照 用 ハンドラ 関数 を 設定 し ます
使用 中 の 出力 ハンドラ の 一覧 を 返し ます
string の 単語 数 を 数え ます
カレントノード の 親 ノード を 返し ます
個々 の ピクセル の 輝度 を 閾値 と 比較 し 、 その 色 を 変更 し ます
イテレータ を 前 の ノード に 移動 し ます
2 つの gmp 数 の ビット and を 計算 し ます
この メソッド は 、 すべて の stat 関連 の 関数 に 対応 し て コール さ れ ます
この 関数 は コマンドヒストリ を ファイル に 書き込み ます
filename の 中 の コード を 構文 ハイライト 表示 し て 出力 し ます
この 関数 は 、 有効 な グリフ 名 を 取得 する ため に adobe の フォントメトリックファイル を 必要 と します
この 関数 は モード 名 を 返し ます
後 の 書式 設定 で 使用 する テキスト の 前処 理 を 行い 、 textflow オブジェクト を 作成 し ます
次 の xpath クエリ 用 の prefix / ns コンテキスト を 作成 し ます
 mqclose を コール する と オブジェクト へ の アクセス を 破棄 し ます
phar アーカイブ 内 の ファイル の crc 3 2 チェックサム を 返し ます
は 現在 の セッションid を 新しい もの と 置き 換え ます
現在 の バッファ の 中身 を 取得 し 、 出力 バッファ を 削除 し ます
文字列 haystack の 中 で 、 needle が 最後 に 現れる 位置 を 探し ます
ファイル file の バイナリパッチ を 元 ファイル に 適用 し て 作成 する ファイル の サイズ を 返し ます
は 、 データベース に key および value で 記述 さ れる エントリ を 挿入 し ます
によっ て 開始 し た パターン を 終了 し ます
この 関数 は 、 ibase _connect あるい は ibase _pconnect のいずれか によっ て オープン さ れ た データベース を 削除 し ます
handle が 指し て いる ファイル を クローズ し ます
この 関数 が 非推 奨 で ある かど う か を 調べ ます
gmagickpixel オブジェクト の 色 を 配列 で 返し ます
現在 の 配列 の 要素 を 取得 し ます
サンプルモード の xhprof プロファイラ を 終了 し ます
抽象 クラス で ある かど う か を 調べ ます
は 、 が 指す データベース の 次 の キー を 返し 、 内部 キーポインタ を 進め ます
固定 長配 列 から php の 配列 を 返し ます
この 関数 は 、 与え られ た クラス class とその 親 が 実装 し て いる インターフェイス を 配列 で 返し ます
は 、 指定 さ れ た リンク id が 指す サーバー 上 で 現在 アクティブ な データベース に クエリ を 送信 し ます
画像 の 合成 演算子 を 設定 し ます
ユーザー 定義 の 関数 あるい は メソッド で 、 パラメータ の デフォルト 値 を 取得 し ます
指定 し た フィールド の 長さ を 返し ます
ms -sql サーバー から の 直近 の メッセージ を 取得 し ます
result _id に 間連 する クエリ の リソース を 解放 し ます
は 配列 array の 最後 の 値 を 取り出し て 返し ます
すべて の 既存 ガベージサイクル を 強制 的 に 収集 し ます
周辺 の ピクセル の 輝度 の 範囲 に も とづい て 、 各 ピクセル の 閾値 を 選択 し ます
メモリ 内 で の ファイル の 状態 を ストレージデバイス に 同期 さ せ ます
直近 の mysql 関数 から の エラー 文字 列 を 返し ます
この 関数 は 、 有効 な dsn （ 複数 回 の コール の 後 ） の リスト を 返し ます
xml パーサ parser の 要素 ハンドラ 関数 を 設定 し ます
gmagick が サポート する フォーマット を 返し ます
この メソッド は 、 既存 の ハッシュ を ディスク に 保存 し ます
offset の 位置 に 、 文字列 data を 挿入 し ます
読み込み 用 に 新規 に zip アーカイブ を オープン し ます
は mssql _fetch _array に 似 て い ます が 、 配列 の 代わり に オブジェクト が 返さ れる という 違い が あり ます
もし パラメータ が 設定 さ れ て いれ ば 削除 し ます
現在 の パス を 、 描画 範囲 の 境界 として 定義 し ます
offset を whence で 指定 さ れる 位置 に 追加 する こと で 、 ファイル の 始め から バイト 単位 で ファイルポイント を 移動 さ せ ます
、 imap _mail _move 、 あるい は imap _setflag _full で 削除 用 マーク を 設定 さ れ たすべて の メッセージ を 削除 し ます
ディスク 上 の 定義 ファイル から 新しい ハッシュ を 作る ファクトリーメソッド です
直近 の mysql 関数 で 発生 し た エラー の 番号 を 返し ます
画像 の ガンマ を 取得 し ます
生成 さ れ た pdf データ を 含む バッファ の 内容 を 取得 し ます
input を multiplier 回 を 繰り返し た 文字列 を 返し ます
value を 双方 向 リンクリスト の 先頭 に 追加 し ます
は variable で 指定 さ れ た apache 環境 変数 の 値 を 設定 し ます
指定 し た 幅 の 一行 中 に 配置 できる 文字 の バイト 長 を 返し ます
関数 は 、 すべて の geoip データベース 形式 について の 詳細 情報 を 多次 元 配列 で 返し ます
は 、 データベース へ の 直近 の 接続 が 失敗 し た 原因 を 表す sqlstate を 返し ます
サポート する すべ て の エンコーディング の 配列 を 返し ます
リモート ftp サーバー の システム 型 id を 返し ます
fdf ドキュメント を 閉じ ます
mpeg ファイル の レイヤ 通常 は 3 で 、 これ は mp3 を 意味 し ます を 返し ます
で後 で 使用 する よう に ページ を 準備 し ます
この 接続 上 で 最後 に 成功 し た insert クエリ が 自動 生成 し た id を 返し ます
画像 の シーン を 設定 し ます
haystack 文字列 の 中 で needle が 最初 に 登場 し た 場所 を 含め て それ 以降 の 部分 文字 列 を 返し ます
は 新しい xml パーサ を 作成 し 、 他 の xml 関数 が 使用 する ハンドル を 返し ます
新しい テキストオブジェクト を 開始 し 、 テキスト の 現在 位置 を 0 0 に 設定 し ます
空 の domdocumenttype オブジェクト を 作成 し ます
は 、 req に 関連 づけ られ た 直近 の エラー の 説明 を 文字列 で 返し ます
は データベース 接続 を 調べ 、 その 接続 が 壊れ て いる 場合 に は 再度 接続 を 試み ます
フォント の 垂直 descent ベースライン の 下側 の 高さ を 取得 し ます
シンボリックリンク filename の グループ を group に 変更 しよ う と 試み ます
画像 の サイズ を 指定 し た もの に 変更 し 、 関連 付け られ た プロパティ を すべ て 削除 し ます
ページ の 幅 を 設定 し ます
トップレベル の 内部 イテレータ の 最初 の 要素 に イテレータ を 巻き戻し ます
埋め込ん だ ループ に対し て 単一 の 非 ブロックスイープ を 行い ます
新しい oauth オブジェクト を 作成 し ます
関数 により 、 単一 の メッセージ 参照 について 現在 の ドメイン を 上書き する こと が でき ます
ファイル filename の 所有 者 を 名前 また は 番号 で 指定 し た ユーザー user に 変更 しよ う と 試み ます
final メソッド で ある かど う か を 調べ ます
は 、 指定 し た result _identifier に関連付け られ た 結果 から データ を 1 行取 得 し ます
フォームデータ を 含む ファイル を オープン し ます
オープン し て いる ファイルハンドル から 画像 を 読み込み ます
sqlite 拡張 ライブラリ を 読み込み ます
は 、 配列 array の 値 を キー とし 、 array における その 値 の 出現 回数 を 値と し た 配列 を 返し ます
get 変数 を 取得 し ます
さまざまな パラメータ を 取得 し ます
指定 し た アドレス の xml インスタンスドキュメント から sdo _dataobjects の ツリー を 作成 し ます
str の soundex キー を 計算 し ます
は 、 指定 さ れ た データベース を 最適 化 し ます
この 関数 は 次 の 関数 の エイリアス です
内部 文字 エンコーディング を 設定 あるい は 取得 し ます
結果 の エントリ から 、 属性 の すべ て の 値 を 読み込み ます
は 指定 し た リンク id が 指す サーバー 上 の 現在 アクティブ な データベース に クエリ を 送信 し ます
ふたつ の パス path 1 および path 2 の 差分 を 再帰 的 に 取得 し ます
現在 の 要素 を 返し ます
は クライアント ・ プロトコル および サーバー の バージョン を 配列 で 返し ます
シーケンス 内 の 特定 の 画像 の ファイル 名 を 返し ます
は ftp サーバー から リモートファイル を 取得 し 、 それ を ローカルファイル に 保存 し ます
現在 の 塗り つぶし 色 を 取得 し ます
dom 表現 から xml ドキュメント を 作成 し ます
result から テーブル 名 を 取得 し ます
オブジェクト に パラメータ を 追加 し ます
システムエラー 、 また は zip メッセージ に関する エラー 情報 を 返す
name という 名前 の 属性 を 、 指定 し た 値 に 設定 し ます
直近 に 保存 さ れ た 描画 状態 を 復元 し ます
指定 し た データ から blob を 作成 し ます
splfileobject は 子 を 持た ない の で この メソッド は 常 に false を 返し ます
gmagick の コンストラクタ です
テキスト の アノテーション で 使う フォント の ウェイト を 設定 し ます
ステータスコード が 正常 終了 を 表し て いる かど う か を 調べ ます
ノード の コピー を 作成 し ます
は 、 指定 さ れ た 結果 id が 指す sybase 結果 の 内部 行 ポインタ を 指定 し た 行番 号 に 移動 し ます
は 、 bytea 型 の ため に 文字列 を エスケープ し 、 エスケープ し た 文字列 を 返し ます
現在 の directoryiterator の 位置 が 有効 な ファイル で ある かどう か チェック し ます
新規 セッション id を 生成 し て 返し ます
画像 の 仮想 ピクセルメソッド を 設定 し ます
現在 の エントリ が ディレクトリ で ある かど う か を 調べ ます
画面 の 再描 画 を readline に 依頼 し ます
は 、 ob _start の コールバック 関数 です
imagick オブジェクト に 関連 付け られ たすべて の リソース を クリア し ます
ファイル が 実行 可能 か どう か を 調べ ます
キャッシュヒット の 総数 を 取得 し ます
pdflib の マイナーバージョン 番号 を 返し ます
は 、 項目 の 値 を value だけ 減ら し ます
出力 バッファリングハンドラ の ネストレベル を 返し ます
新しい イベントベース を 返し ます
は 、 データ を 保存 せ ず に セッション を 終了 し ます
filename を リモートファイルシステム 上 の 有効 な 実パス に 変換 し ます
は 、 指定 し た リンク id に 関連 付け られ た サーバー 上 の 現在 アクティブ な データベース に クエリ を 送信 し ます
新しい paradox データベースファイル を 作成 し ます
この 関数 は 、 配列 を 逆順 に 高位 から 低位 に ソート し ます
テキスト 内 の バイト の 型 を 取得 し ます
は 、 memcached サーバー へ の 接続 を 確立 し ます
は 、 指定 さ れ た リンク id に 関連 付け られ た サーバー 上 の 現在 アクティブ な データベース に クエリ を 送信 し ます
マップ 内 の 反復 処理 中 に 、 現在 の 値 を 返し ます
補間 方法 を 設定 し ます
添付 さ れ た 画像 を 指定 し た ファイル 名 で 保存 し ます
imagick オブジェクト を 破棄 し 、 関連 する リソース を すべ て 開放 し ます
は 、 data から 最大 len バイト を ファイル fd に 書き込み ます
この 関数 は 、 指定 し た 色 の インデックス を 必ず返し ます
( 名前 また は 番号 で 指定 し た ファイル filename の グループ を group に 変更 しよ う と 試み ます
現在 の 要素 が 有効 か どう か を 調べ ます
オープン さ れ た slob オブジェクト に関し て 現在 の ファイル また は シーク 位置 を 返し ます
は 、 ファイルシステム の 状態 を callback の result で 返し ます
ページ の 線幅 を 定義 し ます
画像 の 高さ を 返し ます
この 関数 は 、 gettimeofday 2 への インターフェイス です
この 関数 は 物理 的 な コピー を 作成 し ます
矩形 を 描画 し ます
画像 の サイズ を 指定 し た 大きさ に 変更 し ます
ドキュメント の 現在 の ページ を 取得 し ます
left _operand の 、 modulus を 法と する 剰余 を 取得 し ます
現在 位置 を 次 の 要素 に 移動 し ます
は string の 内容 を 与え られ た gz ファイル に 書き込み ます
画像 の 配置 方法 を 設定 し ます
は 、 数値 アイテム の 値 を offset で 指定 し ただけ 増や し ます
aql query を 、 指定 し た server および dbpath で 実行 し ます
は 、 マルチバイト 対応 の strrpos 操作 を 、 文字数 に 基づい て 行い ます
hostname で 指定 し た リソース へ の ソケット 接続 を 開始 し ます
は 、 正規 化 し た 絶対 パス を callback 関数 の result 引数 で 返し ます
は 、 指定 し た host へ の ftp 接続 を オープン し ます
大文字 小文字 を 区別 し ない マッチング の ため の 正規 表現 を 作成 し ます
行列 を 現在 の 変換 行列 current transformation matrix : ctm に 追加 し ます
ページ の マイターリミット の 現在 値 を 設定 し ます
結果 を 保持 する リソース を 開放 し ます
直近 で 発生 し た 例外 の 番号 や 、 失敗 し た 関数 コール の 理由 を 表す 番号 を 取得 し ます
xmlreader オブジェクト が 現在 パース し て いる 入力 を 閉じ ます
frontbase の 警告 を 有効 また は 無効 に し ます
a と b をかけ 、 結果 を 返し ます
ストレージ の 文字 列表 現 を 返し ます
コマンドラインヒストリ 全体 を 取得 し ます
と似 て い ます が 、 datetimeimmutable で 動作 し ます
複数 の 画像 を 合成 し て 画像 を 作成 し ます
値 の 保存 可能 な 表現 を 生成 し ます
画像 に 特殊 効果 を 施し 、 印画紙 の 特定 の 箇所 の 露光 時間 を 長く し た よう な 画像 に なり ます
画像 の 解像 度 の 単位 を 設定 し ます
yaf _config _ini から php の 配列 を 返し ます
オブジェクト が 配列 として 扱わ れる 際 に 、 文書 に フィールド を 追加 する ため に 使用 さ れ ます
結果 の 指定 し た フィールド に 関連 付け られ た フラグ を 取得 し ます
指定 さ れ た フォント の 文字 の 高さ を ピクセル 単位 で 返し ます
画像 から チャネル を 分離 し 、 グレースケール 画像 を 返し ます
指定 し た データ から clob を 作成 し ます
は 、 / etc / protocols に 基づき プロトコル 番号 number が 指す プロトコル 名 を 返し ます
現在 の 要素 の 、 name という 名前 の 属性 ノード を 返し ます
関数 は 接続 し て いる （ link で 表さ れる ） サーバー の バージョン を 整数 値 で 返し ます
画像 の 明度 、 飽和 度 、 色相 を 制御 し ます
この 関数 は 、 domcomment クラス の 新しい インスタンス を 作成 し ます
オープン さ れ た ディレクトリエントリ から 読み込み ます
拡張 モジュール で 定義 さ れ て いる 定数 を 取得 し ます
mpeg ファイル の 長さ を 返し ます
画像 の 輪郭 を 明る く し たり 暗く し たり する こと によっ て 、 三次元 の ボタン 風 の 効果 を シミュレート し ます
は 、 指定 し た マップ map の マスタ nis サーバー の マシン 名 を 返し ます
この 文書 内 の フィールド 数 を 返し ます
この 関数 は 、 複合 語 を 正しい 複合 語 として 処理 する かど う か を 定義 し ます
は 、 カレント の phpリク エスト を 実行 し て いる apache プロセス を リクエスト 終了 時点 で 終了 しま す
arg の アークハイパボリックサイン を 返し ます
オブジェクト の 輪郭 の 不透 明度 を 返し ます
を もっと 簡単 に する もう ひとつ の 方法 です
result _id に 関連 する クエリ により 変更 さ れ た 行 の 数 を 返し ます
は 、 connection リソース で 指定 し た postgresql データベース へ の 持続 的 で ない 接続 を 閉じ ます
は 、 array の 先頭 に 指定 さ れ た 要素 を 加え ます
既 に 処理 が 始まっ て いる 場合 は 、 例外 を スロー し ます
文字列 str の 幅 を 返し ます
left および right を 整数 値 に 変換 し 、 整数 の 除算 を 行い ます
現在 の 行番 号 を 取得 し ます
配列 targets で 指定 し た 、 ローカル の 作業 コピー で 変更 さ れ た ファイル の 内容 を リポジトリ に コミット し ます
拡張 モジュール で 定義 さ れ て いる の クラス 名 の 一覧 を 取得 し ます
は 、 指定 し た リンク が 指す ingres サーバー へ の 接続 を クローズ し ます
画像 の 長さ を バイト 数 で 返し ます
php の 設定 オプション option の 値 を 取得 し ます
stream の モード を ブロック あるい は 非 ブロック に 設定 し ます
名前 を 使用 し て 、 エントリ の 場所 を 取得 し ます
青 が 一番 強い 点 を 設定 し ます
色度 が 白い点 を 返し ます
文字列 str を 指定 し た 幅 width で 丸め ます
この 関数 は 、 domdocument :: getelementsbytagname と 同じ です が 、 指定 し た id から 要素 を 検索 する 点 が 違い ます
指定 し た ファイルポインタ から の データ を 読み込み 、 uuencode さ れ た ファイル を 一時 ファイル に 展開 し ます
や odbc _exec から 返さ れ た 行 データ を 取得 し ます
指定 し た 変数 が リソース か どう か を 調べ ます
この 関数 は 、 インデックス と それ に 対応 する 要素 を 関連 づけ た 配列 を ソート し ます
代入 し た 変数 を 取得 し ます
接続 connection を 閉じ ます
は 、 数値 アイテム の 値 を offset で 指定 し ただけ 増や し ます
指定 し た 名前 の サービス を 中断 し ます
によっ て 開始 さ れ た 現在 の トランザクション を ロールバック し ます
以前 dbplus _lockrel により 得 られ た 書き込み ロック を 開放 し ます
これ は arrayaccess インターフェイス を 実装 し た もの です
指定 し た 画像 image の 指定 し た 位置 に 、 文字 c を 垂直 に 描画 し ます
この メソッド は 、 phar アーカイブ 内 の ファイル を bzip あるい は zlib で 圧縮 し ます
sdo _das _xml _document オブジェクト を 文字列 に 保存 し ます
ftp サーバー 上 の 、 指定 し た directory を 削除 し ます
プリペアドクエリ を 解放 し ます
与え られ た 結果 セット 中 にまだ レコード が ある かど う か を 見つけ ます
リモートファイルシステム 上 の ファイル を 削除 し ます
現在 の 破線 の パターン を 取得 し ます
新しい domcomment オブジェクト を 作成 し ます
タイムスタンプ を 変更 し た 新しい datetimeimmutable オブジェクト を 作り ます
で リレーションファイル を 探す際 の 仮想 カレントディレクトリ を 変更 し ます
xml ドキュメント を ファイル から 読み込み ます
この メソッド を 使用 する と 、 任意 の ファイル あるい は url を tar / zip アーカイブ に 追加 する こと が でき ます
関数 で 定義 さ れ て いる 必須 パラメータ の 数 を 取得 し ます
テキスト の アノテーション で 使う フォント の スタイル を 設定 し ます
画像 の 背景 色 を 設定 し ます
アクセストークン 、 secret そして 追加 の レスポンスパラメータ を サービスプロバイダ から 取得 し ます
solr サーバー から の 生 の レスポンス を 返し ます
クライアント から の 変数 を 取得 し ます
プロセス に対し て 、 指定 し た 秒数 後 に sigalrm シグナル を 送信 する タイマー を 作成 し ます
ご存知 の とおり 、 define は 非常 に 遅い です
事前 に 静的 メソッド create で 作成 し た xml das に対し て 、 2 番目 以降 の スキーマファイル を 読み込み ます
画像 の 前景 色 を 設定 し ます
指定 し た ユーザー に関する 情報 を 配列 で 返し ます
指定 し た 定数 imagetype _xxx に対応 する 拡張子 を 返し ます
現在 の ストレージ の 要素 を 返し ます
この 関数 は 、 指定 し た イベント の ハンドラ として php ユーザー 関数 を 登録 し ます
この 関数 は 、 url の 問い合わせ 部分 に 使用 する 文字 列 の エンコード や 次 の ページ へ 変数 を 渡す際 に 便利 です
select クエリ が 実行 さ れ た 後 、 フィールド に関する 情報 を 配列 として 返し ます
サーバー から の xml レスポンス を 表現 する solrobject を 返し ます
デジタル 透かし を 画像 に 埋め込み ます
次 の directoryiterator アイテム に 移動 し ます
直近 の mysqli 関数 の コール が 成功 あるい は 失敗 し た 際 の エラーコード を 返し ます
これ は 、 phar アーカイブ 内 の ファイル が gzip あるい は bzip 2 で 圧縮 さ れ て いる かど う か を 返し ます
文書内 の フィールド を 取得 し ます
クエリ を 準備 また は 実行 さ れ た 後 、 この 関数 を コール する こと により 、 クエリ 結果 中 で カラム 数 が 得 られ ます
これ は 、 イテレータ を 先頭 に 巻き戻し ます
この メソッド は 、 現在 の 要素 の xml タグ 名 を 取得 し ます
この 文書 に対する boost 値 を 設定 し ます
この 関数 は アルゴリズム 名 を 返し ます
ユーザー が サスペンドキー （ 通常 は ^ z ） を 押し た 際 に 起動 する コールバック 関数 を 設定 し ます
は 、 pathname で 指定 し た ファイル あるい は ディレクトリ へ の 監視 を 追加 あるい は 変更 し ます
は フィールド の 精度 を 返し ます
この 関数 は 、 ファイル の 拡張 属性 を 削除 し ます
localname および namespaceuri で 指定 し た ノード を 取得 し ます
この 関数 により 単一 の 参照 について カレント の ドメイン を 上書き する こと が でき ます
ダンプディレクトリ の apd _dump _{ process _id } への デバッグ を 開始 し ます
pwl ファイル を 使用 し て 辞書 を 作成 し ます
ピクセル の サンプリング によっ て 、 指定 し た 大きさ に 画像 の 倍率 を 変更 し ます
画像 の 一部 を 抽出 し ます
この メソッド は 、 レプリカセット へ の 接続 に対し て のみ 使え ます
内部 ポインタ を 次 の フィールド に 移動 し ます
シグナルイベント を デフォルトループ に 送り ます
ノード が 定義 さ れ た 行 の 番号 を 取得 し ます
オプション で 指定 し た 属性 を 使用 し て 、 構造体 要素 ある い は その 他 の 内容 を オープン し ます
指定 し た 領域 内 に テキスト を 表示 し ます
属性 の 、 指定 し た 言語 に おける 値 を 返し ます
は 、 配列 array の 各要 素 に callback 関数 を 繰り返し 適用 し 、 配列 を 一つ の 値 に 減ら し ます
ディスク 上 の 定義 ファイル から 新しい ハッシュ を 作る ファクトリーメソッド です
は 、 指定 し た link _identifier に関連付け られ た サーバー 上 の アクティブ な データベース を 設定 し ます
現在 の イテレータエントリ の 内部 イテレータ を 返し ます
は ハードリンク を 作成 し ます
指定 し た オフセット の 値 を 返し ます
シーケンス 内 の 特定 の 画像 の フォーマット を 返し ます
array 1 の キー を array 2 の キー と 比較 し 、 その 差 を 返し ます
グレースケール 画像 に 三次 元効 果 を 施し た もの を 返し ます
変数 を データ 領域 に キャッシュ し ます
現在 の 配列 の 添字 を 返し ます
pecl / oauth に関する sbs を 生成 し ます
アーカイブ 内 の ファイル を 削除 し ます
と似 て い ます が 、 stream _get _contents は 既 に オープン し て いる ストリームリソース に対し て 操作 を 行い ます
辞書 の 詳細 を 返し ます
イテレータ 上 に parentiterator を 作成 し ます
seed により 乱数 生成 器 に シード を 指定 し ます
ユーザー 定義 関数 の ファイル 名 を 取得 し ます
指定 し た 点 を 通る ベジエ 曲線 を 画像 上 に 描き ます
apc の 共有 メモリ 割り当て に関する 情報 を 取得 し ます
filename 内 の 各行 を パース し & lt ;meta &gt ; タグ 内 の 情報 を 配列 として 返し ます
コレクション の サイズ を 返し ます
は 、 新しい csr certificate signing request を dn の 情報 に 基づい て 作成 し ます
画像 の アルファチャネル の 値 を 取得 し ます
オフセット の 設定 を 解除 し ます
この メソッド は 、 テーブルデータベース で は サポート し て いませ ん
拡張 モジュール の ini エントリ を 取得 し ます
データベース 内 の レコード を 更新 し ます
この 関数 は 、 まだ ibase _blob _close で 閉じ られ て い ない 場合 に blob を 捨て ます
最初 の 属性 に カーソル を 移動 し ます
シード seed で 乱数 ジェネレータ を 初期化 し ます
直近 に 起動 し た プリペアドステートメント について の sqlstate エラーコード を 含む 文字 列 を 返し ます
コンシューマハンドラコールバック を 設定 し ます
画像 の 一部 を 削除 し 、 そこ に あっ た 画像 を なく し ます
enchant プロバイダ を 列挙 し 、 その 基本 情報 を 通知 し ます
文書 から フィールド を 除去 し ます
left _operand と right _operand を 比較 し 、 結果 を 整数 値 で 返し ます
key に 関連 づけ られ た 値 を 、 1 あるい は inc _by で 指定 し た 数 だけ 増や し ます
この クラス が インターフェイス で ある かど う か を 調べ ます
は 、 指定 し た アクセスモード で dbase データベース を オープン し ます
mode で 指定 さ れ た 方法 で string に対し て ケースフォルディング を 行い ます
パース する xml を 含む データ を 設定 し ます
現在 の ノード の 中身 を 、 ノード 自身 も 含め て 読み込み ます
有効 期限 を 過ぎ た セッション を 削除 し ます
は 、 sqldbc 通信 を トレース する ため に 使用 さ れ ます
イテレータ が アタッチ さ れ て いる かど う か を 調べ ます
アイテム を レジストリ に 追加 し ます
curl セッション を 閉じ 、 全て の リソース を 開放 し ます
は pclose と 似 て い ます が 、 proc _open で 開か れ た プロセス に対し て のみ 機能 する という 点 で 異 なり ます
バッファリング さ れ たすべて の 出力 を ファイル に 強制 的 に 書き込み ます
この 関数 で 、 どの 程度 の 冗長 性 で ログ を 記録 する か とどんな 活動 を 記録 する か を 設定 し ます
テンプレート の 定義 を 終了 し ます
キャッシュ さ れ た ファイル や ユーザー 変数 の バイナリダンプ を apc キャッシュ から 取得 し 、 指定 し た ファイル に 出力 し ます
画像 の 背景 色 と 同じ色 の 輪郭 を 削除 し ます
画像 を 元 の サイズ の 二 倍 に 比例 拡大 し ます
imagemagick パッケージ 名 を 返し ます
パース さ れる xml ドキュメント を 含む uri を 設定 し ます
指定 し た hash の 名前 を 取得 し ます
指定 し た フィールド が ある テーブル の 名前 を 返し ます
関数 は 、 socket から 送 られ て くる 受信 、 送信 ある い はすべ て （ デフォルト ） の データ を 停止 し ます
参照先 の オブジェクト が まだ 存在 する かど う か を 調べ ます
この 関数 は 、 オブジェクト あるい は オブジェクト 階層 の 全体 を チェックアウト し ます
指定 し た データベース の 現在 の 状態 を 取得 し ます
終了 し た 子 プロセス の リターンコード を 返し ます
この 関数 により 単一 の 複数 形 メッセージ の 参照 について カレント の ドメイン を 上書き する こと が でき ます
直近 の mysqli 関数 の コール が 成功 あるい は 失敗 し た 際 の エラーメッセージ を 返し ます
次 の 要素 が 利用 可能 と なっ た とき に コール さ れ ます
画像 の 透過 色 を 、 rgb 値 の 範囲 を 用い て 定義 し ます
ヒープ にまだ ノード が ある かど う か を 調べ ます
キー を 指定 し て ハッシュ から 値 を 取得 し ます
は 現在 の セッション id を 取得 また は 設定 する ため に 使用 さ れ ます
暗号化 さ れ た 画像 を 復号 し ます
この メソッド は 、 memcached の オプション の 値 を 設定 し ます
現在 の 接続 に おける 、 デフォルト の 文字 セット を 設定 し ます
空 の 配列 を 返し ます
ユーザー username の パスワード を 変更 し ます
現在 の イテレータ の キー を 取得 し ます
key -value ペア を データベース に 格納 し ます
文書 キャッシュサーバー の 統計 情報 を 返し ます
ファイル の 所有 者 を 取得 し ます
現在 の プロセス の グループ id を 設定 し ます
は 、 ラージオブジェクト を 作成 し て その oid を 返し ます
は 引数 filename から 得 られる 画像 を 表す 画像 id を 返し ます
登録済み の ルート を 取得 し ます
シェーディングオブジェクト に 基づい た シェーディング で 、 領域 を 塗り つぶし ます
スタックトレース の 配列 を 返し ます
与え られ た gz ファイルポインタ から 非圧縮 の 1 文字 を 読み込み 、 これ を 含む 文字列 を 返し ます
ip _address で 指定 し た インターネットホスト の ホスト 名 を 返し ます
syslog 関数 で 使用 さ れる 全て の 定数 を 初期化 し ます
は 、 指定 し た query を ingres サーバー に 送信 し ます
クエリ 中 の 全て の フィールド の informix sql フィールドプロパティ を 連想 配列 として 返し ます
swf 出力 の 圧縮 レベル を 設定 する
field の 名前 を 返し ます
ファイル の splfileobject オブジェクト を 作成 し ます
この 関数 は 、 mysql _query で 指定 可能 なよう に unescaped _string を エスケープ し ます
直近 の フラッシュ 以降 に リレーション relation に 適用 さ れ たすべて の 変更 を ディスク に 書き込み ます
圧縮後 の アーカイブエントリ の サイズ を 取得 し ます
環境 を 取得 し ます
テキスト の 出力 位置 を 設定 し ます
readline に 、 カーソル が 新しい 行 に 移動 し た こと を 通知 し ます
現在 の プロセス の 有効 な グループ id を 返し ます
この 関数 は 、 php スクリプト を コンパイル し て opcode キャッシュ に 追加 し ます が 、 スクリプト は 実行 し ませ ん
文字列 に 変換 し ます
他 の イベントループ に 埋め込める バックエンド 群 を 返し ます
ドキュメント 内 の 次 の ノード に カーソル を 移動 し ます
ディレクトリ から 次 の エントリ の 名前 を 返し ます
は 共有 メモリブロック を 作成 また は オープン し ます
新しい マップ を 作り ます
は 、 path で 指定 し た ファイル を アクセスモード mode で 開き ます
が コール さ れる まで は 、 これ は null を 返し ます
により 中断 さ れ た 指定 し た リソース へ の 監視 を 再開 し ます
ページ の リクエスト の 間か エラースタック が リセット さ れ て 以来 生じ た 全て の imap エラー 存在 すれ ば を 返し ます
sql の スカラー 関数 として 使用 する php 関数 を 登録 し ます
は 、 セッション ・ ストレージ に 保存 さ れ て い た 元 の 値 で セッション を 再初 期化 し ます
この 関数 は 、 domelement クラス の 新しい インスタンス を 作成 し ます
許可 さ れる 最大 の 深さ を 設定 し ます
メモリ 上 の 画像 フォーマット を 直接 操作 し ます
整形式 xml 文字列 を オブジェクト として 返し ます
left _operand の right _operand 乗 を 求め ます
その バイトストリーム が 指定 し た エンコーディング で 有効 なもの かど う か を 調べ ます
id 3 タグ の トラック 番号 を 返し ます
指定 し た フィールド の 値 を 取得 し ます
シーケンス 内 の 特定 の 画像 の ファイル 名 を 設定 し ます
web リソース へ の リンク を 追加 し ます
画像 を x 軸方 向 あるい は y 軸方 向 に 押しつぶし 、 平行 四 辺形 を 作成 し ます
uri を 使用 し て データベース に 接続 し ます
は 、 system v セマフォ を 指定 し た キー で アクセス する ため に 使用 可能 な id を 返し ます
ビューエンジン を 取得 し ます
現在 の パス を クリッピングパス として 使用 し 、 パス を 終了 し ます
 / f キー の 値 を 取得 し ます
unix タイムスタンプ 値 timestamp を vt _date 型 の variant に 変換 し ます
検証 の 際 に 使用 する relaxng スキーマ の ファイル 名 あるい は uri を 設定 し ます
へ の エイリアス です
の 結果 や oracle から 取得 し た 、 oracle の カーソル および 文 に 関連 付け られ た 全て の リソース を 解放 し ます
名前 で フィールド を 取得 し ます
次 の 要素 が ある とき は 、 イテレータ を 次 の 要素 に 移動 し ます
pdostatement オブジェクト に 相当 する 結果 セット に ある カラム 数 を 返す ため に pdostatement :: columncount を 使用 し ます
複数 の ヘッダ 要素 を 含む オブジェクト を 取得 し ます
この 関数 は 、 端末 に ビープ 音 を 送信 し ます
現在 の directoryiterator アイテム を 取得 し ます
グリフ 名 や unicode 値 を 、 カスタムエンコーディング に 追加 し ます
は string で 指定 さ れ た 文字列 が pattern で 指定 さ れ た シェルワイルドカード に マッチ する かどう か チェック し ます
ハッシュ の 要素 数 を 返し ます
画像 に 特殊 効果 を 施し 、 セピア 調 の 写真 の よう な 画像 に し ます
開い て いる ファイルハンドル に 画像 シーケンス を 書き出し ます
画像 の レイヤー を ひとつ にまとめ ます
指定 さ れ た メールボックス mailbox の 購読 を 中止 し ます
は 、 memcached サーバー と の 接続 を 閉じ ます
クエリ から 、 結果 セット の 次 の 行 を 含む オブジェクト を 返し ます
は 、 memcached :: * bykey 系 の 操作 で 指定 さ れ た server _key に対応 する サーバー を 返し ます
各 画像 を シーケンス 内 の 次 の 画像 と 比較 し 、 最大 の 境界 範囲 を 返し ます
msglist で 指定 さ れ た メッセージ を 、 指定 し た メールボックス に コピー し ます
呼び出し元 が 、 ファイル に 割り 当て られ た ディスク 空間 を 直接 操作 できる よう に し ます
ブローカーリソース を 、 その 辞書 ととも に 開放 し ます
指定 し た odbc 結果 id の 番号 で 指定 し た フィールド の 精度 を 取得 し ます
自身 と 同じ 本体 と バインド 変数 を 持つ新しい 無名 関数 を 作っ て 返し ます
作業 コピー あるい は リポジトリ の 内容 を 、「 クリーン な 」 ディレクトリ に エクスポート し ます
クエリーパラメータ を 指定 さ れ た 値 に 設定 し ます
は 、 互い に 接続 さ れ て おり 区別 でき ない ソケットストリーム の 組 を 作成 し ます
画像 を シャープ に し ます
最小 の エラー 深刻 度 を 設定 し ます
は 機能 的 に memcached :: getmulti と 同等 です
ふたつ の 画像 を 合成 し て ひとつ の 画像 に し ます
readline コールバックインターフェイス を 設定 し 、 プロンプト prompt を 表示 し て 入力 を 受け取り ます
作成 さ れ た pdf ファイル を 閉じ 、 さまざまな オプション を 適用 し ます
は 、 他 の 全て の 引数 に 存在 する array 1 の 値 を 全て 有 する 配列 を 返し ます
findandmodify コマンド は 、 単一 の ドキュメント を アトミック に 変更 し て 返し ます
画像 の 色 を 、 参照 画像 の 中 の 最も 近い色 に 置き 換え ます
offset で 指定 し た 位置 から count 文字 ぶん の 文字 を 削除 し ます
blob の 長さ や 他 の 便利 な 情報 を 返し ます
次 の 待機 中 の fam イベント を 返し ます
一つ 以上 の ランダム な エントリ を 配列 から 取り出し 、 取り出し た エントリ の キー を 返し ます
指定 し た 色 に 最も 近い 色合 い 、 白 、 黒 を 有する 色 の インデックス を 取得 し ます
opcode キャッシュ の 中身 と その 利用 状況 について の 情報 を 取得 し ます
関数 は 、 object _id から 始まる snmp オブジェクト を 走査 し 、 その 値 と オブジェクト id を 返し ます
関数 socket _sendto は 、 アドレス addr の port を 使用 し 、 buf から ソケット socket に len バイト の データ を 送信 し ます
は 、 クライアントライブラリ の バージョン を 表す 文字 列 を 返し ます
imagemagick の ライセンス を 文字列 で 返し ます
変数 に 含ま れる すべ て の 要素 、 あるい は オブジェクト に 含まれる 何か の 数 を 数え ます
関数 は 、 ホスト 名 あるい は ip アドレス に 対応 する 二文字 の 国 コード を 返し ます
は 、 複数 の 配列 を 一度 に 、 また は 、 多次 元 の 配列 を その 次元 の 一つ で ソート する 際 に 使用 可能 です
mod を 法として base の exp 乗 を 計算 し ます
指定 し た filename から postscript type 1 フォント を 読み込み ます
直近 の クエリ 通常 は insert により auto _increment カラム 用 に 生成 さ れ た id を 取得 し ます
は 、 uuencode さ れ た 文字列 を デコード し ます
新しい イベントリソース を 作成 し て 返し ます
読込み 用 に zip ファイル の 中 に ディレクトリエントリ を オープン し ます
プロファイラ を 終了 し て 、 xhprof の 実行 結果 データ を 返し ます
この 関数 は 、 子要素 oldnode を 新しい ノード に 置き換え ます
は 、 クライアントライブラリ が スレッドセーフ に コンパイル さ れ て いる かど う か を 示し ます
ドキュメント の 使用 権限 を 定義 し ます
imagick オブジェクト に 関連 付け られ て いる 画像 の 数 を 返し ます
textflow の 次 の 部分 を 、 矩形 領域 に 配置 し ます
自動 文字 エンコーディング 検出 の 順番 を encoding _list に 設定 し ます
この 関数 は 、 fsockopen と 全く 同様 に 動作 し ます
画像 リスト から 画像 を 削除 し ます
オープン さ れ た 、 あるい は 作成 さ れ た アーカイブ を 閉じ 、 変更 内容 を 保存 し ます
soap リクエスト を 処理 する ハンドラ として 、 soapserver :: setclass のよう な 単 なる クラス で は なく 特定 の オブジェクト を 設定 し ます
は 、 libxml エラーバッファ を クリア し ます
ベジエ 曲線 を 現在 の パス に 追加 し ます
この 関数 は 、 cc および bcc 受信 者 の 正確 な 処理 を 行っ て email を 送信 する こと が 可能 です
は ラージオブジェクトリソース の 位置 を シーク し ます
ディレクトリ を 指定 する こと により 、 この 関数 は 対応 する ファイルシステム また は ディスクパーティション で 利用 可能 な バイト 数 を 返し ます
文字列 str の 文字 セット を in _charset から out _charset に 変換 し ます
fbsql デーモン で 現在 使用 可能 な データベース を 含む 結果 ポインタ を 返し ます
与え られ た 文字 列 text のすべて の 文字 が 数字 で ある かど う か を 調べ ます
サーバー 上 で 実行 中 の トランザクション の 状態 を 返し ます
例外 の コピー を 作成 しよ う とし ます
は 機能 的 に memcached :: delete と 同等 です
この メソッド は 、 新た な エントリ を ハッシュ に 追加 し て 追加 に 成功 し た かどう か を 返し ます
この 関数 は 、 キャッシュ ・ インスタンス について の 構成 情報 を 返し ます
テーブル の カラム および 関連 する メタデータ を 含む 結果 セット を 返し ます
それ 以降 の リクエスト 用 の oauth の バージョン を 設定 し ます
画像 の インターレース 手法 を 取得 し ます
が返す ldap 検索 結果 を ソート し ます
指定 し た curl 共有 ハンドル に 、 オプション を 設定 し ます
リダイレクト 先 を 自動 的 に たどる 機能 を 無効 に し 、 リクエスト を 手動 で リダイレクト できる よう に し ます
chdb の ファイル を メモリ に マップ する こと によって 読み込み ます
file _name で 指定 し た ファイル 用 の 新しい splfileinfo オブジェクト を 作成 し ます
magic .mime ファイル の 情報 を 用い て 、 ファイル の mime content type を 返し ます
文字列 の ハッシュ を 返し ます
木炭画 を シミュレート し ます
実行 可能 で ない tar / zip アーカイブ は エイリアス を 持つ こと が でき ない ので 、 この メソッド は 単 に 例外 を スロー し ます
画像 の 前景 色 を 返し ます
solrparams :: setparam の エイリアス
この 関数 が ユーザー 定義 関数 な の か 内部 関数 な のか を 調べ ます
タグ が 存在 する けれ ども 中身 が 空 の 場合 に true を 返し ます
は 、 relation に 新しい セカンダリインデックス を 作成 し ます
は 、 af _inet 型 で すべて の ローカルインターフェイス の 指定 し た ポート 上 で 新規 接続 を 待ち受ける 新規 ソケットリソース を 作成 し ます
与え られ た ファイルポインタ から 返さ れ た bzip 2 エラー の エラー 番号 を 返し ます
参照 する ファイル の ファイルサイズ を バイト 数 で 返し ます
すべて の サブツリー を 飛ば し て 、 カーソル を 次 の ノード に 移動 し ます
は ラージオブジェクト を クローズ し ます
指定 し た ファイル および ユーザー 変数 の バイナリダンプ を apc キャッシュ から 返し ます
新規 に pdflib オブジェクト を 作成 し ます
は 指定 さ れ た コマンド command を 実行 し ます
配列 にまだ 要素 が ある かど う か を 調べ ます
この 関数 は 、 引数 で 渡し た フォーム を 実行 し ます
赤 が 一番 強い 点 を 設定 し ます
指定 し た rgb 値 と alpha レベル に 「 近い 」 画像 パレット 中 の 色 の インデックス を 返し ます
は 、 すべて の 既存 項目 を 直ち に 無効 に し ます
yaf _config _ini の コンストラクタ です
idna の ascii 方式 で エンコード さ れ た ドメイン 名 を utf - 8 で エンコード さ れ た unicode に 変換 し ます
指定 し た サーバー 上 で 新しい データベース の 作成 を 試み ます
データ の 比較 に コールバック 関数 を 用い 、 追加 さ れ た 添字 の 確認 も 含め て 配列 の 共通項 を 計算 し ます
attempts to strip 読み込む テキスト から html と php タグ を 取り除こ う と する こと 以外 、 splfileobject :: fgets と 同じ です
ビット の implication 操作 を 行い ます
は 、 shm _attach で 作成 さ れ 、 指定 し た shm _identifier を 有する 共有 メモリ へ の 接続 を 閉じ ます
署名 方式 を 設定 し ます
ノード が 兄弟 ノード を 持つ かど う か を 調べ ます
mpeg ファイル の ビットレート を 返し ます
は 、 文字列 string の start および オプション の length パラメータ で 区切 られ た 部分 を replacement で 指定 し た 文字列 に 置換 し ます
指定 し た 座標 に 文字列 string を 描画 し ます
大文字 の ベースライン から の 距離 を 取得 し ます
描画 の 方向 以外 は 、 この 関数 の 動作 は pdf _arc とまっ たく 同じ です
この メソッド は 、 phar .readonly が 0 かつ ディスク 上 の 実際 の phar アーカイブ が 読み取り 専用 で ない 場合 に true を 返し ます
全 二重 接続 を 一時 的 ある い は そう で なく 終了 し ます
は 、 全て の 利用 可能 な memcached サーバー の バージョン 情報 を 含ん だ 配列 を 返し ます
オブジェクト の 輪郭 の 描画 に 使う 線 の 幅 を 設定 し ます
（ & raquo ;& nbsp ;rfc 2 0 4 5 section 6 . 7 に 基づき ）quoted -printable 文字列 を 8 ビット 文字 列 に 変換 し ます
反復 処理 中 に 次 の キー に 移動 し 、 その 値 を 返し ます
配列 から 現在 の キー と 値 の ペア を 返し て 、 カーソル を 進め ます
配列 の コピー を 取得 し ます
アイテム を レジストリ から 取得 し ます
は 、 hostname で 指定 し た snmp エージェント から すべ て の 値 を 読み込み ます
は 、 サーバー の 統計 情報 を 含む 連想 配列 を 返し ます
imagick オブジェクト の ページジオメトリ を 設定 し ます
ディレクトリエントリ の 実際 の ファイルサイズ を 返し ます
sqlite ライブラリ は 、 iso - 8 8 5 9 - 1 また は utf - 8 互換 モード の どちらか で コンパイル する こと が でき ます
現在 の directoryiterator アイテム の ファイルサイズ を 取得 し ます
画像 の サイズ を 指定 し た 大きさ に 変更 し ます
プロパティ の 値 を 取得 する ため に 使用 さ れ ます
直近 の 書き込み クエリ によっ て 変更 さ れ た レコード 数 を 返し ます
その ページ の テキスト 変換 行列 を 定義 し ます
domxpath オブジェクト に 、 namespaceuri および prefix を 登録 し ます
現在 の ページ の 変換 行列 と 指定 し た 行列 を 連結 し ます
を コール し て 、 ingres から の 値 の 出力 に 影響 する 環境 設定 を します
検索 クエリー を 設定 し ます
key に 関連 づけ られ た 値 を 、 1 あるい は dec _by で 指定 し た 数 だけ 減ら し ます
指定 し た キー の エントリ が ハッシュ に 存在 する かど う か を 調べ ます
指定 し た 変数 が boolean で ある かど う か を 調べ ます
この メソッド は 、 画像 を x サーバー に 表示 し ます
ユーザー が 入力 し た 文字 を 読み込み ます
文字列 の テンプレート を レンダリング し て 結果 を 返し ます
拡張 モジュール の 名前 を 取得 し ます
この メソッド は 、 値 を 返し ます
csv 形式 の 文字 列入 力 の フィールド を パース し て 、 読み込ん だ フィールド の 内容 を 配列 で 返し ます
nodename で 指定 さ れ た ノード を 取得 し ます
結果用 に 確保 さ れ た メモリ を 開放 し ます
フォント の 文字 の 幅 を 取得 し ます
画像 が マットチャネル を 持っ て いる 場合 に true 、 そう で ない 場合 に false を 返し ます
は dbx _sort の ヘルパ 関数 で 、 独自 の ソート 関数 を 作成 しやすくし ます
は データベース を 選択 し 、 そこに対し て クエリ を 実行 し ます
緑 が 一番 強い 点 を 設定 し ます
ページ の 文字 間隔 を 定義 し ます
traversable な 何 か から イテレータ を 作成 し ます
次 の 要素 に 移動 し ます
これ は 、 solrparams :: addparam に対する エイリアス です
event を キャンセル し ます
mime ヘッダフィールド を デコード し ます
によっ て フェッチ さ れ た 現在 の 行 の フィールド field から データ を 返し ます
value を キュー の 末尾 に 追加 し ます
関数 は 、 object _id で 指定 し た snmp オブジェクト の 値 を 設定 する ため に 使用 し ます
原因 の 説明 を 返し ます
現在 の ヘルプ 行 を スタック に 保存 し 、 新しい 行 を 表示 し ます
ファイル は ふたつ の コレクション に また がっ て 格納 さ れ ます
マルチバイト 文字 列 に対する 正規 表現 マッチング を 行い ます
により 返さ れ た dn を 分割 し 、 複数 の 要素 に 分け ます
magickpixeliterator を 返し ます
整数 また は 文字 列 から gmp 数 を 生成 し ます
ログイン 中 の 全 ユーザー の 一覧 を 返し ます
オブジェクト あるい は クラス の 親 クラス の 名前 を 取得 し ます
の コール 結果 を 、 独自 の ソート 関数 で 並べ 替え ます
現在 の 値 を 取得 し ます
その メソッド が 宣言 さ れ て いる クラス を 取得 し ます
エクスポート し ます
パラメータ 名 を 取得 し ます
ssh 上 で プレーン な パスワード を 使用 し た 認証 を 行い ます
リモート snmp エージェント に対し て 、 object _id で 指定 し た snmp オブジェクト の 値 を 設定 さ せ ます
は 、 サーバー から の メッセージ を 処理 する ユーザー 関数 を 設定 し ます
結果 セット 内 の 行 を 表す 、 カラム 名 を インデックス と する 配列 を 返し ます
address で 指定 し た 名前 を socket で 指定 し た ソケット に バインド し ます
画像 に 関連 づけ られ た アーチファクト を 削除 し ます
アーカイブ の メタデータ を 取得 し ます
すで に 接続 さ れ た ssh 2 サーバー から sftp サブシステム を 要求 し ます
色度 が 白い点 を 返し ます
は 、 指定 し た postgresql の result リソース に おい て 、 指定 し た field _number の 型名 を 保持 する 文字列 を 返し ます
指定 し た ファイル の パーミッション を 取得 し ます
指定 し た ドキュメント の fdf バージョン を version に 設定 し ます
は 、 connection _string で 指定 さ れ た 情報 を 用い て データベース と の 接続 を オープン し ます
属性 の すべ て の 値 を 取得 し ます
ディスク 上 の 定義 ファイル から 新しい セット を 作る ファクトリーメソッド です
は ソケット の 配列 を 受け取り 、 それら の 状態 が 変化 する まで 待ち ます
は fbsql _fetch _row と fbsql _fetch _assoc を 組み合わ せ た もの です
アタッチ さ れ て いる イテレータインスタンス の 数 を 取得 し ます
テーブル の カラム および 関連 する 権限 情報 を 含む 結果 セット を 返し ます
は 、 haystack の 中 で 最後 に needle が 現れる 場所 を 探し 、 haystack の 部分 文字 列 を 返し ます
type 1 フォント を 指定 し た ファイル から 読み込み 、 pdf ドキュメント に 登録 し ます
オブジェクト が スロー さ れ た ファイル の 名前 を 返し ます
指定 し た 年 year におい て 、 3 月 2 1 日 から 復活 祭 まで の 日数 を 返し ます
以下 の 表 に 基づい た 論理 and 処理 を 行い ます
この メソッド を 使用 し て 、 splfileinfo オブジェクト が 参照 する ファイル が リンク で ある かど う か を 調べ ます
この 関数 は 、 ibase _blob _open によって 読み込み 用 に オープン し た blob から 最大 len バイト を 返し ます
solr サーバー に 送られ た 生 の リクエスト を 返し ます
既存 の 画像 を コピー し て 新しい 画像 を 作成 し ます
この 関数 は 、 指定 し た メッセージ に関する すべ て の 構造 化 さ れ た 情報 を 取り出し ます
データベース を 選択 し 、 そこ で クエリ を 実行 し ます
arg の アークサイン を ラジアン で 返し ます
関数 は libc の glob 関数 で 使わ れる ルール に 基づい て pattern に マッチ する 全て の パス 名 を 検索 し ます
この 関数 の 目的 は 、 イベントシンク に 使用 する スケルトンクラス の 作成 を 支援 する こと です
実行 時 に 定数 を 除去 し ます
remote _socket で 指定 さ れ た 接続 先 と の 、 ストリーム また は データグラム 接続 を 確立 し ます
は 、 rpm ファイル の ヘッダ から 指定 し た タグ を 取得 し て それ を 返し ます
コード 変換 指令 request に 基づき 文字 列 string の コード を 変換 し ます
テクスチャ 画像 を タイル 状 に 繰り返し 並べ ます
ミューテックス へ の ハンドル の 破棄 は 、 ミューテックス を 使い 終え た とき に プログラマー が 明示 的 に 行う 必要 が あり ます
指定 し た ディレクトリ および それ に 含まれる 全 て の ファイル を 監視 する よう 指示 し ます
a *s + b *t = g = gcd a b となる よう な g s t を 計算 し ます
 / status キー の 値 を 設定 し ます
鉛筆画 を シミュレート し ます
パラメータ を 設定 し ます
関数 の 引数 リスト を 配列 で 取得 し ます
( drm の よう な 保護 機構 が この ファイル で 有効 に なっ て いる 場合 に true を 返し ます
ページ の 表示 を 、 パラメータ で 指定 し た 矩形 に あわせる よう 設定 し ます
画像 の 影 を シミュレート し ます
この 関数 は 、 検索 、 取得 等 で 使用 する １つ また は 複数 の データベース を 指定 し ます
指定 し た リソース の メモリ 使用 状況 を メガバイト 単位 で 返し ます
呼び出し 元用 に 、 ミューテックス の ロック を 試み ます
タグ を 使用 し て 新しい 辞書 を 作成 し ます
アタッチ さ れ たすべ て の observer に 通知 し ます
クエリ query を 、 サーバー 上 の 現在 アクティブ な データベース に 送信 し ます
現在 の 内部 イテレータ の インデックス を 取得 し ます
この 関数 は 、 uri に リクエスト の 一部 を 行い ます
mongo に は 、 追尾 可能 tailable カーソル という 機能 が あり ます
その 後 の ページ 出力 で 使用 する レイヤー を 開始 し ます
指定 し た 名前 の 画像 プロファイル を 削除 し て それ を 返し ます
テキスト の アノテーション で 使う フォント の 完全 な 名前 を 設定 し ます
この 関数 は hwapi _insert の 短縮 版 です
この メソッド は 、 php の 関数 を xpath 式 の 中 で 使える よう に し ます
は 、 指定 し た ファイル の s / mime メッセージ を 読み込み 、 デジタル 署名 を 評価 し ます
は 、 postgresql の result の 指定 し た 値 に関し て 、 実際 に 表示 し た 場合 の 長さ 文字 の 数 を 返し ます
solrdocument に対する デストラクタ
シグナル の 受信 を シミュレート し ます
データベース 内 の レコード の 数 を 返し ます
field に対応 する カラム の 桁数 を 返し ます
全て の select クエリ に関する デフォルト の blob モード を 設定 し ます
は 、 その memcache インスタンス が 直近 に 作ら れ た もの かど う か を 調べ ます
関数 は 、 対応 する geoip データベース が 存在 し 、 ディスク 上 に オープン できる かど う か を 調べ ます
msglist で 指定 さ れ た メッセージ を 、 指定 さ れ た メールボックス mbox に 移動 し ます
sql 文 の 中 で 使える よう 適切 に エスケープ さ れ た 文字列 を 返し ます
は 、 文字列 を シングルクオート で 括り 、 既存 の シングルクオート を 全て クオート / エスケープ し ます
新しい 条件 変数 を 作り ます
リフレクション を エクスポート し ます
文字 列内 で 最後 に あらわ れる 場所 の 書記 素単 位 の 位置 を 見つけ ます
この 関数 を 呼ぶ と 、 bucket brigade の 先頭 に bucket を 追加 でき ます
座表系 の スケール を 設定 し ます
は 、 ファイルポインタ が 指す データ を ftp サーバー 上 の リモートファイル へ アップロード し ます
新しい ページ を 開始 し ます
この メソッド は 、 オブザーバ が アタッチ さ れ て いる 任意 の splsubject が splsubject :: notify を コール し た とき に コール さ れ ます
ベジエ 曲線 を 現在 の パス に 追加 し ます
認証 パラメータ key の 値 を value に 設定 し ます
php の 文字 列用 の xmlrpc 型 を 、 base 6 4 あるい は datetime に 設定 し ます
関数 の 挙動 は pcntl _sigwaitinfo とほぼ 同じ です が 、 さらに 2 つの パラメータ が あり ます
画像 が マットチャネル を 持っ て いる 場合 に true 、 そう で ない 場合 に false を 返し ます
すべて の 接続 プール に関する 情報 の 配列 を 返し ます
プレーン な ピクセル 群 を 暗号 化 し ます
function パラメータ で 指定 し た ユーザー 定義 の 関数 あるい は メソッド を コール し ます
id 3 タグ の 年 を 返し ます
事前 に gnupg _addencryptkey で 設定 し た キー を 使用 し 、 指定 さ れ た テキスト を 暗号 化 し ます
この スレッド の id を 返し ます
は 機能 的 に memcached :: get と 同等 です
この 関数 は 、 指定 し た クラス が 使っ て いる トレイト の 名前 を 配列 で 返し ます
空 の テキストノード を 削除 し 、 この ノード に 隣接 する テキストノード と その すべ て の 子 を マージ し ます
与え られ た ファイルポインタ から 最大 length - 1 バイト の 文字 を 読み込み 、 これ を 含む 非圧縮 の 文字列 を 返し ます
開発 中 や テスト 時 に 、 クエリ を 改善 する ため に 便利 な 関数 です
直近 に 配置 さ れ た テーブルインスタンス について の テーブル の 情報 を 取得 し ます
現在 の 要素 を 返し ます
は 、 文字列 haystack から char _list を 探し ます
fdf ドキュメント を 保存 し ます
現在 位置 が 属性 ノード の 場合 は 次 の 属性 に カーソル を 移動 し ます
リモートクライアント 用 に 単一 も しく は 複数 の 関数 を エクスポート し ます
文字列 str の 文字 エンコーディング を 、 オプション で 指定 し た from _encoding から to _encoding に 変換 し ます
変数 var の 型 を type に セット し ます
指定 し た データベースハンドル db _handle を 閉じ ます
この 関数 は 、 参照 し て いる ノード の 直前 に 新しい ノード を 挿入 し ます
最後 の レスポンス の ヘッダ を 取得 し ます
は mailbox で 指定 さ れ た 新しい メールボックス を 作成 し ます
名前 空間 宣言 の スコープ を 抜ける とき に コール さ れる ハンドラ を 設定 し ます
radius 関数 が 失敗 し た 場合 に は エラーメッセージ が 記録 さ れ ます
与え られ た データ を データベース に 追加 し ます
現在 の directoryiterator アイテム が ディレクトリ か どう か を 調べ ます
kerberos データベース から principal を 削除 し ます
前 に 発生 し た 例外 exception :: __ construct の 3 番目 の 引数 を 返し ます
tar 形式 の phar アーカイブ で は 、 この メソッド は badmethodcallexception を スロー し ます
マルチバイト 正規 表現 に マッチ し た 部分 を 返し ます
は 、 バックエンド データベースサーバ の プロセス の プロセス id を 取得 し ます
指定 し た blob オブジェクト id bid に関する blob オブジェクト の 内容 を 更新 し ます
は 取得 し た レコード 行 を 有 する 配列 を 返し ます
直近 の soap レスポンスヘッダ を 返し ます
wddx packet を デシリアライズ し ます
この 関数 は 、 filename という 名前 の ファイル から 読み込ん だ html ドキュメント を パース し ます
画像 の サンプリング 係数 を 設定 し ます
を コール し た とき に 発生 し た javascript の 例外 の 中 で 未処 理 の もの を v 8jsexception で 返し ます
例外 コード を 返し ます
オプションリスト で 定義 し た 破線 パターン を 設定 し ます
が radius _vendor _specific を 返す 場合 に 、 ベンダ を 特定 する ため に radius _get _vendor _attr を コール し ます
出力用 バッファ の 内容 を 取得 し ます
キー を 指定 し て ハッシュ から 値 を 取得 し ます
指定 し た 範囲 の 全て の プロシージャ の リスト を 取得 し ます
は 、 関係 の 中 の タプル に 完全 に 一致 する 場合 、 tuple を 削除 し ます
unix タイムスタンプ 1 9 7 0 / 1 / 1 から の 秒数 timestamp を ユリウス 歴 に 変換 し て 返し ます
get / post / cookie データ を パース し 、 グローバル 変数 を 設定 し ます
トランザクション を 閉じ ず に コミット し ます
b を 法と し た a の 逆 を 計算 し ます
phar ファイルフォーマット の api バージョン を 返し ます
冗長 な リクエスト 情報 を 無効 に し ます デフォルト は 無効 です 
指定 し た 文字列 を 、 正規 表現 で 分割 し ます
配列 を キー により 逆順 に ソート し ます
oauth プロバイダ の 必須 パラメータ を 追加 し ます
ユーザーキャッシュ による メモリ 使用 状況 について の 情報 を 取得 し ます
関数 は 、 現在 の 接続 の スレッド id を 返し ます
apc の データ から 、 キャッシュ さ れ た 情報 および メタデータ を 取得 し ます
spl が 提供 する _ _ autoload キュー から 、 関数 を 削除 し ます
行 を テーブルデータベース から 取得 し ます
結果 の 行 を array に 取得 し ます
は 、 変数 の 値 に関する 情報 を 解り 易い 形式 で 表示 し ます
現在 の 配列 を 、 別 の 配列 あるい は オブジェクト と 交換 し ます
ストレージ の エントリ を アンシリアライズ し 、 現在 の ストレージ に 追加 し ます
ファイル が 実行 可能 か どう か を 調べ ます
この 関数 は 、 swfvideostream の ビデオフレーム 数 を 返し ます
この 関数 は 次 の エントリ に イテレータ を 移動 し ます
複数 クエリ は まだ サポート さ れ て い ない ので 、 maxdb _next _result は 常 に false を 返し ます
画像 の サイズ を 元 の 半分 に 比例 縮小 し ます
画像 の 幅 を 返し ます
新規メールボックス を 購読 し ます
は 、 指定 し た フィールド の フィールドフラグ を 返し ます
オブジェクト の すべ て の 対象 アンカー を 取得 し ます
は 、 mysql _field _name 関数 に 似 て い ます
セット さ れ て いる ビット の 数 を 返し ます
ふたつ の ファイル の バイナリ diff を 作成 し 、 その 結果 を パッチファイル として 保存 し ます
配列 の 要素 の 数 、 あるい は オブジェクト の public プロパティ の 数 を 取得 し ます
指定 し た 添字 の 値 を 消去 し ます
指定 し た 定数 が 存在 し 、 定義 さ れ て いる かど う か を 調べ ます
paradox ファイル に 保存 さ れ て いる タイムスタンプ を 、 人間 が 理解 し やすい 形式 に 変換 し ます
画像 の レンダリング 方向 を 取得 し ます
は 、 結果 リソース の 指定 し た カラム について 全 て の 行 （ レコード ） を 含む 配列 を 返し ます
で 準備 さ れ た 命令 を 実行 し ます
repos に ある リポジトリ の リビジョン revision を 、 targetpath の 作業 コピー に チェックアウト し ます
文字列 属性 を 、 現在 の radius リクエスト に アタッチ し ます
デジタルフィルタ を 適用 し て 、 ノイジー な 画像 の 品質 を 向上 さ せ ます
マップ の 呼出 番号 を 返し ます
出力用 バッファ の 内容 を 消去 し 、 出力 の バッファリング を オフ に し ます
この メソッド は 、 yaf _view _simple で は なく カスタムビューエンジン を 使い たい とき に 利用 し ます
filename で 指定 さ れ た ファイル に ついて の 統計 情報 を 取得 し ます
指定 し た xml パーサ の カレント の 行番 号 を 取得 し ます
既存 の コンテンツ を 消去 し ます
デストラクタ です
ファイル 記述子 fd が 、 有効 な 端末 デバイス を 指し て いる かど う か を 調べ ます
text のすべて の 文字 が 小文字 だっ た 場合 に true 、 そう で ない 場合 に false を 返し ます
テキスト の アノテーション で 使う コードセット を 表す 文字 列 を 設定 し ます
は 、 出力 バッファ を フラッシュ し て その 内容 を 文字 列 として 返し た 後 、 出力 バッファリング を 終了 し ます
現在 の カテゴリ と 同じ レベル の 全て の カテゴリ の 一覧 を 配列 として 返し ます
フォント を 設定 し ます
& # 0 3 9 ; タグ &# 0 3 9 ; で 表さ れる 言語 で 使用 する 辞書 の 優先 順位 を 宣言 し ます
画像 の 一部 を 削除 し 、 そこ に あっ た 画像 を なく し ます
テンプレート を レンダリング し て 、 結果 を すぐ に 返し ます
ルーティングプロセス で 使わ れ て いる ルート 名 を 取得 し ます
paradox データベース に レコード を 保存 し ます
指定 し た 名前 の 属性 を 削除 し ます
は ftp サーバー から リモートファイル を 取得 し 、 それ を ローカルファイル に 保存 し ます
パラメータ の デフォルト 値 が 存在 する かど う か を 調べ ます
指定 し た オブジェクト id の 文字 オブジェクト を 削除 し ます
画像 を ページ に 表示 し ます
gmagick オブジェクト を 破棄 し 、 関連 する リソース を すべ て 解放 し ます
エラーメッセージ を web サーバー の エラーログ あるい は ファイル に 送り ます
この 関数 は 、 いずれか の バージョン の オブジェクト の 属性 情報 を 取得 し ます
を コール する と 、 dbplus _find により relation に 設定 さ れ た 制約 が 削除 さ れ ます
この メソッド で 、 splfileinfo :: getfileinfo および splfileinfo :: getpathinfo が コール さ れ た 際 に 使用 する カスタムクラス を 設定 し ます
内部 イテレータ の 現在 の 要素 が 子 を 持つ かど う か を チェック し ます
現在 の 位置 から パス の 開始 位置 に 直線 を 追加 し ます
事前 に stream _filter _prepend あるい は stream _filter _append で ストリーム に 追加 し た フィルタ を 削除 し ます
最初 の エラー の 原因 を 返し ます
現在 の メールボックス に ある 新しい メッセージ の 数 を 返し ます
拡張 モジュール で 定義 さ れ て いる 関数 を 取得 し ます
charlist パラメータ に 羅列 さ れ た 文字 の 前 に バックスラッシュ を 付け た 文字列 を 返し ます
指定 し た ファイル が ディレクトリ か どう か を 調べ ます
principal および 指定 し た password を 使用 し て kadm 5 ライブラリ と の 接続 を オープン し 、 admin _server から 証明 書 を 取得 し ます
指定 し た event _base を 破棄 し 、 関連 づけ られ た リソース を すべ て 解放 し ます
これ は 、 yaf プラグイン の フックシステム 内 で の 最後 の フック です
は 、 指定 さ れ た arg を lzf 符号 化方 式 で 圧縮 し ます
与え られ た gz ファイルポインタ が eof ファイル 終端 を 指す かど う か を 調べ ます
php の ソースコード filename から コメント と 空白 文字 を 取り除い た もの を 返し ます
ある 文字 列 の 中 で 別 の 文字 列 が 最初 に 現れる 位置 を 見つけ ます
画像 の 遅延 を 取得 し ます
は 、 指定 さ れ た 定義 で dbase データベース を 作成 し ます
指定 し た フィールドオフセット に 移動 し ます
は 、 リクエストグループ を 作り ます
アクティブ な カーソル の 名前 を 文字列 で 返し ます
ある 文字 列 str に 、 unified 形式 の パッチ 文字 列 patch を 適用 し て その 結果 を 返し ます
callback 関数 により フィルタ 処理 が 行わ れ た array の 全て の 要素 を 含む 配列 を 返し ます
画像 の 前景 色 を 設定 し ます
与え られ た ファイルポインタ の 現在 位置 から 終端 まで を 読み込み 結果 を 出力 バッファ に 書き出し ます
xml ドキュメント の 最初 に xml 宣言 を 生成 する かど う か を 制御 し ます
solr の 現行 バージョン を 返し ます
サポート する シグネチャ 型 の 配列 を 返し ます
現行 の キー を 返し ます
この 関数 は 、 ingres _fetch _row の 拡張 版 です
指定 し た cipher / mode の 組み合わせ に おける iv の 大きさ を 取得 し ます
stream 、 fstream あるい は string 型 の pcos パス の 内容 を 取得 し ます
属性 の 名前 を 返し ます
画像 の 中心 から 、 ピクセル を 渦巻 状 に し ます
通信 の エンドポイント 終端 と 呼ば れる こと も ある ソケット の リソース を 作成 し 、 返し ます
ビジーハンドラ を 設定 し ます
は 、 data を 公開鍵 key で 暗号 化 し 、 それ を crypted に 格納 し ます
この メソッド は 、 指定 し た 要素 の 子 を 見つけ ます
truetype コレクション ttc ファイル から 、 指定 し た インデックス の truetype フォント を 読み込み ます
ページ を 再開 し 、 さらに 内容 を 追加 し ます
新しい filesystem イテレータ を path から 作成 し ます
セッションクッキー の パラメータ を 取得 し ます
元 オブジェクト の 現在 の 位置 に ある 新しい 画像 を 、 imagick オブジェクト の 画像 リスト に 追加 し ます
oci ステートメント statement の 種類 を あらわす キーワード を 返し ます
指定 し た データベースリンク id の カラム 構造 について の 情報 を 返し ます
代数 演算 、 関係 演算 、 論理 演算 など を 疑似 画像 に 適用 し ます
別 の パーサ を bbcode _container に アタッチ し ます
調べ て いる クラス を エクスポート し ます
排他 的 論理 和 を 計算 し ます
hash に ユーザー が 指定 し た password を 用い て キー を 生成 し ます
これ は 、 圧縮 さ れ た ファイル を 含む phar を 読み込む 前 に 、 圧縮 が 可能 か どう か を 調べる ため に 使用 し ます
この メソッド は カーソル の 状態 に は 何 の 影響 も 及ぼ しませ ん
クエリ が 返す 結果 の 最大 数 を 設定 し ます
指定 し た フィールド の 投稿 フォームアクション を 設定 し ます
画像 シーケンス を はめ 込み 合成 し て 単一 の 画像 に し ます
直近 の エラー の 内容 を 文字列 で 返し ます
この メソッド は xsltprocessor に 変換 の ため の スタイルシート を 取り込み ます
この 関数 は 収縮 さ れ た 文字列 を 伸長 し ます
関数 は 、 特定 の キー と 値 の ペア を 含む chdb ファイル を 作成 し ます
クライアント の 接続 が 切断 さ れ た 際 に スクリプト の 実行 を 終了 する かど う か を 設定 し ます
直近 に 実行 さ れ た プリペアドステートメント の エラー について 、 sqlstate エラーコード を 含む 文字 列 を 返し ます
( x y を 中心 と し た 円 の 一部 を 描き ます
は 、 x 5 0 9 certdata で 指定 し た 証明 書 を パース し 、 その 証明 書用 の リソース id を 返し ます
phar アーカイブ を ディスク と メモリ から 削除 し ます
この メソッド は エントリ を ハッシュ から 削除 し 、 削除 でき たか どう か を 返し ます
イテレータ の 要素 を 配列 に コピー し ます
は 、 指定 し た ファイル 名 から 得 られる 画像 を 表す id を 返し ます
現在 の エントリ の イテレータ が 取得 可能 か どう か を 返す この イテレータ は recursiveregexiterator :: getchildren で 取得 し ます
path が 指す ファイル 、 ディレクトリ あるい は シンボリックリンク を 作業 コピー に 追加 し ます
コマンド を リモートエンド で 実行 し 、 チャネル を 割り 当て ます
gender クラス の 定数 から 、 国 を 表す 文字 列 を 取得 し ます
要素 の メンバ として localname という 名前 の 属性 が 名前 空間 namespaceuri に 存在 する かど う か を 示し ます
画像 の 反復 を 設定 し ます
引数 number を 2 進数 表現 し た 文字列 を 返し ます
は 、 pkcs 1 2 で 指定 し た pkcs # 1 2 認証 ストア を パース し て certs で 指定 し た 配列 に 格納 し ます
は 、 与え られ た 文字列 を 圧縮 し 、 bzip 2 形式 の データ として 返し ます
この 関数 は 、 fopen 、 fwrite 、 fclose を 続け て コール し て データ を ファイル に 書き込む の と 等価 です
は ローカルファイル を ftp サーバー に 保存 し ます
結果 セット の カラム 数 を 返し ます
新しい 正規 表現 を 作成 し ます
油絵風 の 効果 を 施す フィルタ を 適用 し ます
オブジェクト の 属性 および 内容 を 置き 換え ます
ベンダー 固有 の 文字 列属 性 を 、 現在 の radius リクエスト に アタッチ し ます
現在 の 要素 の 子 を 取得 し ます
パース し て いる ドキュメント が 妥当 なもの で ある かど う か を 論理 型 で 返し ます
指定 し た 文字列 に 定義 さ れ て いる スキーマ に 基づい て ドキュメント を 検証 し ます
画像 あるい は 画像 シーケンス を 書き込み ます
メソッド の プロトタイプ を 取得 し ます
は 、 ファイルディスクリプタ fd で 指定 し た ファイル を 切り 詰め て 、 ちょうど length バイト に し ます
直近 の informix エラー に関する informix エラーメッセージ を 返し ます
は ラージオブジェクト を 生成 し 、 その ラージオブジェクト の oid を 返し ます
この 関数 は 、 domdocumentfragment クラス の 新しい インスタンス を 作成 し ます
色および 描画 状態 パラメータ を 全て デフォルト 値 に リセット し ます
は sql クエリ query を mysql に 送信 し ます
事前 に 生成 さ れ た 他 の コレクション から コレクション の 値 を 割り 当て ます
指定 し た バイナリダンプ を apc の ファイル / ユーザーキャッシュ に 読み込み ます
より 以前 に 得 た 指定 tuple の 書き込み ロック を 解放 し ます
エントリ を ソート し ます
さまざまな 方式 で 画像 を 歪め ます
現在 の プロセス の 実際 の ユーザー id を 設定 し ます
遠く から 光 を あて て いる よう に 見せる 三次 元効 果 を 作成 し ます
ベンダー 固有 の ip アドレス 属性 を 、 現在 の radius リクエスト に アタッチ し ます
を 使い 、 指定 し た object _id を 起点 と する snmp サブツリー を 読み込み ます
は 、 connection で 指定 し た 接続 の ステータス を 返し ます
指定 さ れ た constant を value として 再定 義 し ます
ページ の 破線 パターン を 定義 し ます
イテレータ の 現在 位置 を 返し ます
内部 iterator の 、 ゼロ から 数え た 現在 位置 を 返し ます
関数 は 、 指定 し た ファイル の 文法 チェック （ lint ） を 行い 、 スクリプト の エラー を チェック し ます
imagick オブジェクト の フォーマット を 設定 し ます
リスト 内 で ひとつ 先 に 進ん だ とき にまだ オブジェクト が 画像 を 保持 し て いれ ば true を 返し ます
画像 シーケンス 内 の 色 を 解析 し 、 その 画像 を 表す ため の 色 を 固定 の 色数 で 選び ます
関数 の 名前 を 取得 し ます
mpeg ファイル の サンプルビットレート を 返し ます
link が 使用 し て いる 接続 の 情報 を 文字列 で 返し ます （ サーバー の ホスト 名 を 含み ます ）
は 、 オープン し た fd の 端末 属性 と ボーレート を 指定 し ます
コンテンツ の mimetype を 返し ます
現在 の 言語 を 設定 あるい は 取得 し ます
data を 復号 し 、 復号 さ れ た データ を 返し ます
sql 文 を 直接 実行 し ます
a の 階乗 a ! を 計算 し ます
は 、 data を 秘密 鍵 key で 暗号 化 し 、 それ を crypted に 格納 し ます
画像 に 特殊 効果 を 施し 、 印画紙 の 特定 の 箇所 の 露光 時間 を 長く し た よう な 画像 に なり ます
指定 し た ハッシュ が 、 特定 の アルゴリズム と オプション を 満た し て いる かど う か を 調べ ます
pdflib オブジェクト を 削除 し 、 内部 リソース を 全 て 開放 し ます
hue 色相 、 saturation 彩度 および luminosity 明度 を 正規 化 し た 値 によっ て imagickpixel オブジェクト の 色 を 設定 し ます
指定 さ れ た sybase 結果 セット に おい て 、 指定 し た 行お よび オフセット に おける セル の 内容 を 返し ます
searchd に 接続 し 、 指定 し た ドキュメント の 抜粋 を 作成 する よう 要求 し 、 その 結果 を 返し ます
設定 で 定義 し た ルート を yaf _router の スタック に 追加 し ます
yield し た 値 の キー を 取得 し ます
算術 演算 、 関係 演算 、 論理 演算 など を 画像 に 適用 し ます
利用 可能 な ダイジェスト ・メソッド の 一覧 を 取得 し ます
取得 する レコード の 範囲 を 指定 し ます
指定 し た 位置 に 、 同 一 ドキュメント 内 の ページ へ の ハイパーリンク を 設定 し ます
文字列 に 変換 し ます
は 、 透明度 を 指定 する パラメータ alpha が 追加 さ れ て いる 以外 は imagecolorallocate と 等価 です
この メソッド を 使用 する と 、 画像 全体 を 読み込ま なく て も 画像 の 幅や高さ 、 サイズ そし て フォーマット を 取得 でき ます
variant の 整数 部 を 取得 し ます
namespaceuri が デフォルト の 名前 空間 で ある かど う か を 調べ ます
variant の 整数 部 を 返し ます
コメント を 画像 に 追加 し ます
指定 し た 型 と ドキュメント 要素 の domdocument オブジェクト を 作成 し ます
画像 から すべ て の プロパティ や コメント を 除去 し ます
位置 offset から count 文字 ぶん の データ を 、 data に 置換 し ます
は 指定 し た フィールド の 長さ を 返し ます
現在 の プロセス の 実際 の グループ id を 返し ます
カーソル は 一般 的 に 、 結果 オブジェクト を バッチ で 取得 し て ローカル に 格納 し ます
指定 さ れ た blob オブジェクト id の blob オブジェクト を 削除 し ます
は 、 notify sql コマンド により 送信 さ れ た 通知 メッセージ を 取得 し ます
グローバル の 関数 テーブル で 関数 名 を 変更 し ます
フィールド に null を 設定 可能 か どう か を 調べ ます
現在 の ノード の 、 名前 空間 namespaceuri における localname という ローカル 名 の 属性 ノード を 返し ます
は 、 現在 オープン し て いる トランザクション を コミット し 、 全 て の 変更 を データベース に 保存 し ます
関数 は 、 直近 の maxdb _connect の コール の エラーコード を 返し ます
data を 修正 版 utf - 7 テキスト に 変換 し ます
開始 位置 offset と 最大 数 count を 指定 し た イテレータ iterator から 新しい limititerator を 作成 し ます
マイターリミット の 値 を 取得 し ます
イテレータ の 現在 の 要素 が この フィルタ を 通過 する かど う か を 返し ます
現在 の 画像 の 圧縮 形式 を 取得 し ます
は 、 指定 し た relation の 空 の コピー を name という 名前 で 作成 し ます が 、 デフォルト の インデックス を 使用 し ます
imagemagick api の バージョン を 文字 列 と 数値 で 返し ます
文書内 の フィールド 数 を 返し ます
この 関数 は 、 include 、 include _once 、 require あるい は require _once により スクリプト に ロード さ れ たすべて の ファイル の 名前 を 取得 し ます
comobject が 生成 し た イベント を php オブジェクト sinkobject に 通知 する よう 、 com に 指示 し ます
現在 の 要素 から 作っ た ツリー を 取得 し ます
指定 し た パス path の recursivedirectoryiterator を 作成 し ます
現在 の フォントサイズ 、 文字 エンコーディング および 単語 間隔 を 使用 し て テキスト の 幅 を 取得 し ます
この 関数 は 、 指定 し た アンカー が 属し て いる オブジェクト を 取得 し ます
ストアドプロシージャ また は リモート の ストアドプロシージャ を 初期化 し ます
アタッチ し て いる すべ て の イテレータインスタンス を 巻き戻し ます
samconnection オブジェクト に対し て & quot ;connect &quot ; メソッド を コール する と 、 php スクリプト を メッセージングサーバー と 接続 さ せ ます
この 関数 は 、 指定 し た imap ストリーム の 現在 オープン し て いる メールボックス におい て 検索 を 行い ます
添付 さ れ た 画像 フレーム の 画像 の mime type を 返し ます
この 関数 は 、 人間 が 行う よう な 手法 で アルファベット また は 数字 の 文字列 の 順序 を 比較 する アルゴリズム を 実装 し ます
現在 の ページ に ブックマーク を 追加 し ます
指定 し た イベントベース の イベントループ を 開始 し ます
は 、 ファイル の 大きさ を 最大 offset バイト まで に 丸め ます
組み込み の 日本語 フォント を 有効 に し ます
指定 し た hash の ブロックサイズ を 取得 し ます
val が （ 正また は 負 の ） 無限 大 で ある 場合 に true を 返し ます
は ある クエリ 結果 に 含ま れる フィールド の 情報 を 取得 する 際 に 使用 する こと が でき ます
ページ の 現在 の フォント および フォントサイズ を 定義 し ます
クエリ から 、 結果 セット の 次 の 行 を 含む 配列 を 返し ます
pattern で 指定 し た 正規 表現 により subject を 検索 し ます
string におい て 各 バイト 値 0 .. 2 5 5 が 存在 する 数 を かぞえ 、 様々 な 手法 で 返し ます
bcompiler ファイル の ヘッダ を 書き込み ます
ディレクトリ を 含む 文字 列 を 指定 し て くだ さい
画像 を シャープ に し ます
オープン さ れ た filepro データベース に おける 行 の 数 を 返し ます
left と right を 比較 し ます
は 、 array の 最初 の 値 を 取り出し て 返し ます
この 関数 は 、 指定 し た ftp ストリーム に関し て の さまざまな 実行 時 オプション を 制御 し ます
は 接続 を リセット し ます
書き込み 可 の モード w + で ユニーク な 名前 を 有する テンポラリファイル を 作成 し 、 ファイルハンドル を 返し ます
新しい haruannotation の インスタンス を 作成 し ます
指定 し た 画像 image 上 の 透明 色 を 設定 し ます
非 ブロッキングモード で 、 ファイル の 取得 / 送信 を 継続 し ます
は 、 配列 の 中 の 値 の 合計 を 整数 また は float として 返し ます
塗りつぶし 色 に 指定 し た 色 に マッチ する ピクセル を 変更 し ます
現在 の 塗り つぶし および 輪郭 描画 色 を 0 から 1 まで の グレー 値 に 設定 し ます
web 上 の ターゲット url へ の web リンク を 追加 し ます
指定 し た オフセット の 値 を 取得 し ます
フォントエンコーディング の 名前 を 取得 し ます
指定 し た リモートファイル の パーミッション を mode に 設定 し ます
name で 指定 し た オプション の 値 を 返し ます
修飾子 の 名前 を 取得 し ます
は 、 str の 先頭 から offset バイト の 位置 から 、 最大 で length バイト まで 書き込み ます
プロパティ の ドキュメントコメント を 取得 し ます
libevent は 、 通常 の イベント api の 上位 に 抽象 化 レイヤー を 用意 し て い ます
この 関数 は 、 php インタプリタ に コンパイル 、 ロード さ れ て いる 全て の モジュール の 名前 を 返し ます
ページ の 塗り つぶし 色 を 定義 し ます
直近 の sql 文 の エラーメッセージ を 含む 文字 列 を 返し ます
さまざまな オプション に 基づい て 、 インポート し た pdf ページ を 配置 し ます
例外 の スタックトレース を 文字列 で 返し ます
は 、 haystack の 中 で 最初 に needle が 現れる 場所 を 探し 、 haystack の 部分 文字 列 を 返し ます
許可 さ れる 最大 の 深さ を 取得 し ます
mnogosearch セッションパラメータ を 定義 し ます
は 、 リモートソケット から 最大 length バイト の データ を 受け取り ます
mongodb の & raquo ;& nbsp ;aggregation フレームワーク を 使う と 、 値 を 集約 する とき に mapreduce を 使わず に 済ませる こと が でき ます
テキスト を 出力 する 位置 を 設定 し ます
現在 の mysql デーモン で 利用 可能 な データベース の 結果 ポインタ を 返し ます
アンシリアライズ 後 に 配列 を 再初 期化 し ます
システム について の 情報 を 取得 し ます
は データベース の 最初 の キー を 返し 、 内部 キーポインタ を リセット し ます
initialize the weights using widrow + nguyen ’s algorithm .
静的 メソッド を 実行 し た 場合 など 、 エラーコード を 取得 する オブジェクト が 存在 し ない 場合 の エラー 処理 に 便利 です
curl 共有 ハンドル を 閉じ 、 すべて の リソース を 解放 し ます
カスタム の シリアライズ で 使わ れ ます
を 使用 し て 削除 マーク が つけ られ た レコード を 完全 に 削除 する こと で 、 指定 し た データベース を 圧縮 し ます
変数 が セット さ れ て おり 、 それ が null で ない こと を 調べ ます
色空間 の 名前 を 取得 し ます
各 要素 が 子 を 持っ て いる かど う か を 調べる とき に コール し ます
は 、 log 1 + number の 値 を 返し ます
は 、 指定 し た テーブル に関する 情報 を 返し ます
画像 の 圧縮 品質 を 設定 し ます
ファイル の inode が 変更 さ れ た 時刻 を 返し ます
プロパティ を アクセス 可能 に し ます
array 1 を array 2 と 比較 し 、 その差 を 返し ます
指定 し た リンク id が 指す サーバー 上 の データベース を 、 アクティブ な データベース に 設定 し ます
これ は 、 phar アーカイブ 内 の ファイル が crc 検証 さ れ て いる かど う か を 返し ます
一意 な テンポラリファイル 名 を 、 パーミッション を 0 6 0 0 に 設定 し 、 指定 し た ディレクトリ に 作成 し ます
ふたつ の ファイル の バイナリ diff を 作成 し 、 その 結果 を パッチファイル として 保存 し ます
対処 の 色 に マッチ する ピクセル を 透過 さ せ ます
data で 渡し た データ を yaml 形式 に して filename に 書き込み ます
指定 し た ファイル 名 の メッセージセクション を 展開 / デコード し ます
ストレージ から オブジェクト を 取り除き ます
画像 の レンダリング 方向 を 設定 し ます
は memcached :: set と 同等 です が 、 キー key が サーバー 上 に ない 場合 は 失敗 し ます
結果 セット に 関連 付け られ た システムリソース および データベースリソース を 開放 し ます
は 、 複数 データベース 接続 に エージェント を 作成 し ます
結果 セット 内 の 指定 し た カラム の 現在 値 の 幅 を 返し ます
ファイル の キャッシュエントリ を リフレッシュ し ます
id で 指定 し た 接続 を クローズ し ます
指定 し た ユーザー id の ユーザー について の 情報 を 配列 で 返し ます
内部 イテレータ を 取得 し ます
イテレータ が 有効 か どう か を 調べ ます
レコード を 削除 し ます
グローバルメモリ の 使用 状況 について の 統計 情報 を 取得 し ます
関数 から 取得 さ れ た image を 閉じ ます
timestamp に関する 日付 情報 を 有する 連想 配列 を 返し ます
画像 の 色空間 を 取得 し ます
は 、 クライアント / サーバー 間 の オーバーヘッド を 防い です ばやく アクセス する ため に 、 リレーション file を ローカル に オープン し ます
指定 し た link _identifier に関し て 、 直近 の ldap コマンド により 生成 さ れ た エラー を 表す エラーメッセージ 文字 列 を 返し ます
mnogosearch セッション を 割り 当て ます
この 関数 は 、 拡張 サービス の リクエスト を 準備 し ます
ウィンドウ あるい は その クライアント 領域 の キャプチャ を 、 ウィンドウハンドル com インスタンス の hwnd プロパティ を 指定 し て 取得 し ます
xml パーサ parser の 、 処理 さ れ ない エンティティ 宣言 用 ハンドラ 関数 を 設定 し ます
mysql サーバー へ の 接続 を オープン あるい は 再利 用 し ます
結果 の 行 を 、 連想 配列 あるい は 数値 添字 配列 ある い は その 両方 で 取得 し ます
この 関数 は コマンドラインヒストリ 全体 を クリア し ます
perl の carp :: cluck と 同じ よう に 動作 し ます
現在 の プロセス の グループ id を 返し ます
読み込み の セカンダリ へ の 分散 について の 情報 は 、 この マニュアル の 問い合わせ の 節 を 参照く ださい
dom 表現 から xml ドキュメント を 作成 し ます
現在 の ページ に サムネイル として 既存 の イメージ を 追加 し ます
は 、 msql サーバー 上 に データベース の 作成 を 試み ます
現在 の 描画 状態 を 保存 し ます
指定 し た バッファ つき イベント を 破棄 し 、 関連 づけ られ たすべて の リソース を 解放 し ます
この 関数 は hwapi _insert の 短縮 版 です
調べ た 拡張 モジュール を エクスポート し 、 文字 列 として 返し ます
は 、 memcache サーバー と の 接続 を すべ て 閉じ ます
は 、 ラージオブジェクト を 読み込み 未送 信 の ヘッダ を 全 て 送信 し た 後 、 ブラウザ に 直接 ラージオブジェクト を 送信 し ます
指定 し た 接続 について 、 ひとつ あるい は 複数 の オプション を 設定 し ます
ms sql サーバーデータベース で ストアドプロシージャ を 実行 し ます
以前 に dbplus _xlockrel で 取得 し た 排他 的 ロック を 開放 し ます
結果 に 保持 さ れ た エントリ を 取得 し ます
や readfile 、 file _get _contents 、 opendir など の stat 関連 の 関数 を すべ て phar に 横取り させ ます
は フィールド の スケール を 返し ます
この 関数 は 、 deflate データフォーマット を 用い て 与え られ た 文字列 を 圧縮 し ます
現在 の プロセス の 親 プロセス の id を 返し ます
条件 を クエリ に 追加 し ます
接頭辞 と 接尾 辞 を つけ た 現在 の 要素 を 取得 し ます
直近 で 失敗 し た sqlite リクエスト の 結果 コード を 数値 で 返し ます
コレクション の 最後 に 要素 を 追加 し ます
現在 の 画像 の 圧縮 品質 を 取得 し ます
画像 の インターレース 手法 を 設定 し ます
また は ifx _do クエリ の 後 、 result _id を 有する クエリ に関し て これ まで 取得 さ れ た 行 の 数 を 返し ます
内部 ポインタ が 有効 な 要素 を 指し て いる かど う か を 調べ ます
ドキュメント で 宣言 さ れ て いる 名前 空間 を 返し ます
w 3c xsd スキーマ を 用い て 、 処理 中 の ドキュメント を 検証 し ます
事前 に oci _new _descriptor を 使用 し て 割り 当て られ た ディスクリプタ に 関連 付け られ たり ソース を 解放 し ます
クライアント の バージョン 番号 を 整数 値 で 返し ます
渡さ れ た javascript script を v 8js コンテキスト で 利用 する 拡張 として 登録 し ます
ドキュメント を どの よう に 表示 する か を 定義 し ます
現在 動作 中 の php パーサ あるい は 拡張 モジュール の バージョン を 表す 文字 列 を 返し ます
関数 dio _close は 、 ファイル 記述子 fd を 閉じ ます
は 、 handle が 指す ファイルポインタ から 最高 length バイト 読み込み ます
ローカルファイル を ftp サーバー に 保存 し ます
画像 の 色空間 を 設定 し ます
は 、 ディレクトリ を 削除 し ます
端末 が 色 を 扱える かどう か 、 そして プログラマ が ncurses _init _color で色 を 変更 できる かど う か を 返し ます
拡張 モジュール が ロード さ れ て いる かど う か を 調べ ます
指定 し た relation で 保持 さ れ て いる 全て の タプルロック を 解放 し ます
は 、 infile という 名前 の ファイル の 内容 を rc2 4 0 ビット 暗号 により 暗号 化 し ます
は 、 pg _execute あるい は pg _send _execute で後 に 実行 する ため の プリペアドステートメント を 作成 し ます
すべて の アクティブ な レイヤー を 無効 に し ます
クリック し た 際 に ファイル が 実行 さ れる ハイパーリンク を 、 指定 し た 場所 に 設定 し ます
は 現在 の session .cache _expire の 設定 を 返し ます
は 、 ibase _blob _create で 作成 し た blob に データ を 追加 し ます
名前 を 使用 し て 、 エントリ の 内容 を 返し ます
この 関数 は 、 object の 内部 から parser を 使用 可能 に し ます
ストアドプロシージャ は 、 複数 の 結果 セット を 返す こと が でき ます
データベース と の 接続 を 閉じ ます
再 構築 さ れ た 画像 と 画像 の 差異 を 含む 配列 を 返し ます
pdflib パラメータ を 文字 列型 で 設定 し ます
高速 な & quot ;exact division &quot ; アルゴリズム を 使用 し て n を d で 割り ます
関数 dio _seek は 、 指定 さ れ た ファイル 記述子 の ファイル 内 の 位置 を 変更 する 際 に 使用 さ れ ます
指定 さ れ た ファイル の モード を mode で 指定 し た もの に 変更 しよ う と 試み ます
ページ の 単語 間隔 を 設定 し ます
画像 の 圧縮 を 設定 し ます
この 関数 は 、 ユーザー 定義 の 比較 関数 により 配列 を その 値 で ソート し ます
ドメイン domain の マップ map から 、 最初 の キー / 値 の 組 を 取得 し ます
例外 が try / catch ブロック の 中 で キャッチ さ れ なかっ た 場合 の デフォルト の 例外 ハンドラ を 設定 し ます
指定 し た メッセージ の 指定 し た body セクション の 構造 を 読み込み ます
は 、 結果 リソース result に関連 し た エラーメッセージ を 返し ます
curl ハンドル を コピー し 、 同じ 設定 を 保持 し ます
環境 変数 の 値 を 取得 し ます
この 関数 は エントリ を ソート し ます
は 、 array を スタック として 処理 し 、 渡さ れ た 変数 を array の 最後 に 加え ます
関数 は 、 result が 指す 結果 セット の 現在 の 行 について 、 すべて の カラム の 長さ を 含む 配列 を 返し ます
と同じ です が 、 dir _handle の デフォルト が $ this に なり ます
は 、 connection で 指定 し た postgresql サーバー から の 直近 の 通知 メッセージ を 返し ます
直近 の エラーメッセージ 文字 列 を 返し ます
指定 し た フィールドオフセット に 移動 し ます
この メソッド は 、 テーブルデータベース で は サポート し て いませ ん
全て の オープン さ れ た ページハンドル を クローズ し 、 pdf ドキュメント 入力 pdi を 閉じ ます
ステートメントリソース に 関連 付け られ た システムリソース および データベースリソース を 開放 し ます
現在 の アイテム が 有効 か どう か を 調べ ます
は 、 サーバー の パラメータ を 実行 時 に 変更 し ます
radius パラメータ で 定義 し た ブロック 内 の 各 ピクセル を 、 ランダム に 移動 さ せ ます
画像 の マットチャネル を 設定 し ます
関数 は 、 object _id で 指定 し た オブジェクト に 続く snmp オブジェクト の 値 を 取得 し ます
xsltprocessor を 使っ た 変換 の ため の 1 つ あるい は 多く の パラメータ の 値 を 設定 し ます
反復 処理 が 始まる とき 最初 に recursiveiteratoriterator :: rewind が コール さ れ た 後 に コール さ れ ます
この 関数 は 次 の 関数 の エイリアス です
現在 の 塗り つぶし 色 を 取得 し ます
描画色 、 塗りつぶし 色 、 あるい は その 両方 を 設定 し ます
リンク さ れ て いる sqlite ライブラリ の バージョン を 文字 列 として 返し ます
文字列 の 定義 から 新しい セット を 作る ファクトリーメソッド です
アノテーションアイコン の 形式 を 定義 し ます
は 、 フィールド が 属 する テーブル の 名前 か あるい は oid _only が true の 場合 に テーブル の oid を 返し ます
結果 id で 指定 し た 結果 に 対応 する データ の ひとつ の 行 を 取得 し ます
以前 に stream _socket _server によって 作 られ た ソケット の 接続 を 受け 入れ ます
この メソッド は 、 ディスク 上 の tar / zip アーカイブ が 読み込み 専用 で ない 場合 に true を 返し ます
文 の 属性 を 設定 し ます
は 、 指定 し た リンク id が 指す サーバー の 現在 アクティブ な データベース を 設定 し ます
インターフェイス の 名前 を 取得 し ます
画像 の 中 の 暗め の 部分 と 明るめ の 部分 の 輝度 の 差 を 強調 し ます
この 関数 が 内部 関数 な の か ユーザー 定義 関数 な のか を 調べ ます
セキュリティ 上 の 理由 により 、( パスワード 、 ms -chapv 1 mppe キー など いくつか の データ は 変形 さ れ ます
簡体 字中 国語 エンコーディング を 有効 に し ます
ページ の 塗り つぶし 色 を 定義 し ます
関数 は 、 pcntl _signal が インストール し た シグナルハンドラ を 各 ペンディングシグナル に対し て コール し ます
a の 平方根 を 計算 し ます
は 、 msql サーバー で 最後 に 発生 し た エラー を 返し ます
string の 先頭 文字 の ascii 値 を 返し ます
エントリ を ldap ディレクトリ に 追加 し ます
メール を 送信 し ます
デフォルト の 書記 素 クラスタシーケンス を テキストバッファ から 取り出す 関数 です
この 関数 は 指定 し た クラス が 定義 さ れ て いる かど う か を 調べ ます
この メソッド は 、 新た な エントリ を ハッシュ に 追加 し て 追加 に 成功 し た かどう か を 返し ます
マップ 内 の 生き た エントリ を 数え ます
 mqopen は 、 オブジェクト へ の アクセス を 確立 し ます
は php バックトレース を 表示 し ます
は 、 指定 し た セマフォ を 削除 し ます
デジタルフィルタ を 適用 し て ノイジー な 画像 の 品質 を 向上 さ せ ます
は 、 最大 length バイト の データ を zp が 指す gz ファイルポインタ から 読み込み ます
リモートサーバー から ローカルファイルシステム に scp プロトコル を 使用 し て コピー し ます
は final メソッド な ので 、 オーバーライド でき ませ ん
ドキュメント が 現在 使用 し て いる haruencoder を 取得 し ます
特定 の プロパティ が 定義 さ れ て いる かど う か を 調べ ます
は 、 connection に 非同 期 クエリ を 送信 し ます
指定 し た テキスト について 、 テキスト 全体 の 幅 、 文字数 、 単語 数 および 空白 の 数 を 取得 し ます
数値 を 含む 配列 を 引数 として 受け 取り 、 画像 全体 にわ たっ て 見つかっ た 座標 の 色 を 補間 し ます
特定 の キー が 共有 メモリセグメント 内 に 存在 する かど う か を 調べ ます
ムービー で 使用 する swf の バージョン を 設定 し ます
イベント の チェック と デフォルトループ の コールバック の 呼び出し を 開始 し ます
を コール し た 後 に newt インターフェイス の 使用 を 再開 し ます
無地 の 画像 を 作成 し ます
新しい コレクションオブジェクト を 割り 当て ます
ファイル の 終端 に 到達 し て いる か 調べ ます
この メソッド は 、 実行 可能 な phar アーカイブ を tar あるい は zip ファイル に 変換 し ます
は 共有 メモリブロック を 削除 する ため に 使用 さ れ ます
ページ の 移動 方式 を 設定 し ます
この メソッド は 、 fstat に対応 し て コール さ れ ます
指定 し た 設定 オプション の 値 を 設定 し ます
これ は 、 オブジェクト が 配列 として 扱わ れる 際 に 、 フィールド を 取得 する ため に 使用 さ れ ます
mysql サーバー と の 持続 的 な 接続 を 確立 し ます
ストリーム の メタデータ を 設定 し ます
この メソッド は 次 の コード と 同じ 意味 です
xml パーサ の エラーコード を 取得 し ます
オープン さ れ た モード で サポート さ れる 最大 キー 長 を 取得 し ます
指定 さ れ た スキーマファイル に 基づい て ドキュメント を 検証 し ます
複数 の mime ヘッダフィールド を 一度 に デコード し ます
指定 し た プレフィックス を もと に 、 スコープ の 名前 空間 を 検索 し ます
新しい harudoc の インスタンス を 作成 し ます
は 、 指定 し た key で system v メッセージキュー に アクセス する ため に 使用 さ れる id を 返し ます
画像 の シーン を 設定 し ます
この メソッド は 、 静的 メソッド 版 の closure :: bindto です
この 関数 は hwapi _insert の 短縮 版 です
テキスト の 位置 を 、 指定 し た オフセット に 移動 し ます
指定 し た リンク id が 指す ms sql server データベース へ の リンク を 閉じ ます
は 、 現在 の unix タイムスタンプ を マイクロ 秒単 位 で 返し ます
は 、 出力 形式 を 完全 か 数値 のい ずれか に 設定 し ます
オブジェクト の デフォルト の 圧縮 方式 を 設定 し ます
データソース が サポート する データ 型 について の 情報 を 取得 し ます
指定 し た signed _text を 検証 し 、 署名 について の 情報 を 返し ます
指定 し た 接続 リソース 上 で 実行 中 の トランザクション を コミット し 、 新しい トランザクション を 開始 し ます
指定 し た 名前 の 画像 プロパティ を 返し ます
ページ の 高さ を 定義 し ます
現在 の ページ に 矩形 の 注記 を 作成 し ます
プリペアドステートメント 内 の パラメータマーカ の 数 を 返し ます
norewinditerator を 作成 し ます
すべて の 持続 的 な リソース を 配列 で 返し ます
は fbsql _fetch _array と 似 て い ます が 1 点 だけ 違い が あり ます
ストレージ を シリアライズ し ます
アーカイブエントリ の 名前 パス つき を 返し ます
base の exp 乗 を 計算 し ます
yaf _application の インスタンス を 作成 し ます
クラス の 新しい インスタンス を 作成 し ます
フラグ を 設定 し ます
画像 の 各色 コンポーネント で 使用 する ビット 数 を 取得 し ます
セッションキャッシュ の 中身 と その 利用 状況 について の 情報 を 取得 し ます
スクリプト 処理 が 完了 し た とき 、 あるい は exit が コール さ れ た とき に 実行 する コールバック 関数 を 登録 し ます
さまざまな パラメータ を 設定 し ます
は 機能 的 に memcached :: replace と 同等 です
ドキュメント に 新しい ページ を 追加 し 、 さまざまな オプション を 設定 し ます
は 人為 的 に 負荷 を 高め 、 実行 前 に delay 秒待 ち ます
その アルゴリズム で サポート さ れる 最大 キー 長 を バイト 単位 で 返し ます
この 関数 は 、 jday で 指定 し た ユリウス 歴 に 対応 する unix タイムスタンプ を 返し ます
ノード を 文字列 に 正規 化 し ます
デフォルト の イベントループ を 止め ます
調べ た 関数 を 起動 し ます
ビネット 形式 で 画像 の 輪郭 を ぼかし ます
認証 パラメータ key を 取得 し ます
この 関数 は 、 暗号 化記 述子 で 指定 し た アルゴリズム の iv の 大きさ を バイト 単位 で 返し ます
現在 の ページレイアウト を 取得 し ます
操作 モード を 設定 し ます
描画 出力 の ため の 現在 の 点 を 設定 し ます
は 、 結果 コード に 対応 する メッセージ を 返し ます
ルート sdo _dataobject を 返し ます
この 関数 は 、 ingres _query で 実行 し た クエリ から 取得 し た データ を 連想 配列 に 保存 し ます
この 関数 は 、 __ autoload の デフォルト 実装 として 使用 さ れる こと を 意図 し て い ます
これ は arrayaccess インターフェイス を 実装 し た もの です
非線形 s 字 コントラストアルゴリズム を 用い て 画像 の コントラスト を 調整 し ます
solr サーバー に 送られ た 生 の リクエストヘッダ を 返し ます
この 関数 は 、 指定 し た ローカルタグ 名 の すべ て の 要素 を 含む domnodelist クラス の 新しい インスタンス を 返し ます
指定 し た 名前 空間 内 で 、 指定 し た 名前 の 属性 に カーソル を 移動 し ます
は 、 検索 に関する 制約 を リセット し ます
自動 コミット の 挙動 を 切り 替え ます
リスト 内 で 逆方 向 に ひとつ 進ん だ とき にまだ オブジェクト が 画像 を 保持 し て いれ ば true を 返し ます
生成 さ れ た pdf ファイル を 閉じ 、 ドキュメント の 関係 する 全て の リソース を 開放 し ます
ある 範囲 の 整数 を 有する 配列 を 作成 し ます
サーバー の パラメータ 設定 を 検索 し ます
指定 し た 日付 について の 詳細 情報 を 連想 配列 で 返し ます
オブジェクト の 輪郭 の 描画 に 使う 色 を 設定 し ます
ステートメントリソース あるい は 接続 リソース の オプション を 設定 し ます
は 、 query _identifier が 指す メモリ を 開放 し ます
サブイテレータ の 有効 性 を 調べ ます
ページ の 定義 は 文字列 で 、 書式 は wxh +x +y と なり ます
与え られ た bzip 2 ファイルポインタ を 閉じ ます
クエリ から の 複数 の 行 を 二次 元配 列 に 取得 し ます
miter limit を 設定 し ます
その リクエスト が ajax リクエスト で ある かど う か を 調べ ます
プロセス id pid の プロセス について の 統計 情報 を 取得 し ます
画像 ヒストグラム を 均等 化 し ます
指定 し た 色 チャネル の 値 を 取得 し ます
反復 処理 中 の 現在 の 値 を 返し ます
文字 フィールド から データ を 取得 する 際 の エンコーディング を 設定 し ます
文字 列内 で 最初 に あらわ れる 場所 の 書記 素単 位 の 位置 を 見つけ ます
結果 セット に 含まれる フィールド の 数 を 返し ます
この 関数 は 、 デフォルト の タイムゾーン を 以下 の 優先 順位 で 取得 し て 返し ます
この 関数 は まさ に ベータ 版 で あり 、 9 9 % の ユーザー にとって は 使い道 の ない もの です
id 型 と なる 属性 を name で 宣言 し ます
int あるい は double 値 を 加算 し ます
ユリウス 積算 日 を & quot ;月 / 日 / 年 &quot ; の 形式 で グレゴリウス 日 を 含む 文字 列 に 変換 し ます
塗りつぶし や 描画 を 行わ ず に 現在 の パスオブジェクト を 終了 し ます
指定 し た relation から 直近 の タプル に関する データ を 読み込み 、 tuple に 連想 配列 として 代入 し ます
は 、 rows の 内容 を テーブル に 挿入 し ます
幅 と 高さ を 連想 配列 で 返し ます
これ は 、 イテレータ を 先頭 に 巻き戻し ます
type で 指定 さ れ た 内部 設定 変数 の 値 を 、 charset に 変更 し ます
この 関数 は 、 与え られ た プロパティ property が 指定 さ れ た クラス に 存在 する かど う か を 確認 し ます
画像 の 各 ピクセル に 、 塗りつぶし 色 を 混合 し ます
イテレータ を 前 に 移動 し ます
文字列 に 変換 し ます
停止 し た evcheck ウォッチャー の インスタンス を 作り ます
実行 時 に 関数 を 作成 し ます
オブジェクト へ の 強い 参照 を 確保 し 、 事実 上 、 弱い 参照 を 強い 参照 に 切り 替え ます
端末 が カラー 表示 機能 を 持つ かど う か を 調べ ます
コード 変換 指令 request に 基づき ファイルハンドル input が 指す ファイル を ファイルハンドル output が 指す ファイル に コード 変換 し ます
指定 し た 画像 を 設定 し ます
a と p の & raquo ;& nbsp ; ルジェンドル 記号 を 計算 し ます
は apache の 書き込み タイマー を リセット し ます
文字 列型 の pdi ドキュメントパラメータ の 内容 を 取得 し ます
指定 し た 文 statement における カラム の 数 を 返し ます
シーケンス 内 の 特定 の 画像 の ファイル 名 を 返し ます
この メソッド を 使用 する と 、 画像 全体 を 読み込ま なく て も 画像 の 幅や高さ 、 サイズ そし て フォーマット を 取得 でき ます
oracle が 追跡 する クライアント 情報 を 設定 し ます
を 処理 し ます
svn クライアントライブラリ の バージョン を 返し ます
指定 し た パラメータ により 匿名 関数 を 作成 し 、 その 関数 の ユニーク な 名前 を 返し ます
結果 セット の 行 の 数 を 返し ます
operand の 平方根 を 返し ます
を コール し た 結果 から データベース 名 を 取得 し ます
を 使用 し て 、 デッドロック の 際 の 再試 行回 数 を 定義 する こと が 可能 です
priority 1 と priority 2 を 比較 し ます
オブジェクト の 輪郭 の 不透 明度 を 設定 し ます
指定 し た 名前 の 属性 に カーソル を 移動 し ます
この 関数 は 、 xml 文字列 を 処理 し 、 2つ の 配列 構造 体 に 代入 し ます
新しい sphinxclient オブジェクト を 作成 し ます
が返し た statement を 実行 し ます
画像 の マット 色 を 返し ます
は 、 informix サーバー へ の 接続 を 確立 し ます
部分 文字 列 を 返し ます
画像 の 色 を 、 replacement で 定義 し た もの に 置き 換え ます
現在 の 塗り つぶし 色 から スポット 色 を 作成 し ます
指定 し た ファイル から 、 バイナリダンプ を apc の ファイル / ユーザーキャッシュ に 読み込み ます
imagemagick の リリース 日 を 文字列 で 返し ます
icc 、 iptc あるい は 汎用 の プロファイル を 画像 に 追加 あるい は 削除 し ます
は 、 oid が 指す データ に アクセス する ため の ストリーム を オープン し ます
名前 空間 を 宣言 し た ところ で コール さ れる ハンドラ を 設定 し ます
この 関数 は まさ に ベータ 版 で あり 、 9 9 % の ユーザー にとって は 使い道 の ない もの です
は 、 指定 し た フィールド の フィールドフラグ を 返し ます
データベース 内 の すべ て の コレクション の リスト を 取得 し 、 mongocollection オブジェクト の 配列 で 返し ます
関数 は 、 ip アドレス に 対応 する インターネットサービスプロバイダ isp 名 を 返し ます
csv フィールド 処理 用 の 区切り 文字 と 囲み 文字 を セット し ます
この メソッド は 、 すべて の シンボリックリンク を 展開 し て 相対 参照 を 解決 し 、 ファイル へ の 実際 の パス を 返し ます
ファイル の inode 変更 時刻 を 取得 し ます
オープン し た filepro データベース の フィールド （ カラム ） の 数 を 返し ます
この 関数 は 、 キャッシュ ・ インスタンス について の ステータス 情報 を 返し ます
指定 さ れ た メッセージ 本文 中 の 特定 の セクション を 取得 し ます
スクリプト 実行 時 の メモリ 使用 量 が 過大 で ある と 懸念 さ れる 場合 のみ mssql _free _result は コール する べき です
は object _id で 指定 し た snmp オブジェクト の 値 を 読み とる ため に 使用 さ れ ます
この 関数 は 、 bbcode _create が オープン し た リソース を 閉じ ます
新規 fdf ドキュメント を 作成 し ます
は 、 data に関し て condition に マッチ する レコード を 更新 し ます
画像 を 折り た たむ 任意 の メソッド imagick :: convolveimage など について 画像 の バイアス を 設定 し ます
この メソッド は 、 シリアライズ し た セット を 返し ます
シンボルテーブル を 書き 換える こと で 、 組み込み の 関数 を 上書き し ます
solr オブジェクト を 生成 し ます
は 、 image が truecolor 画像 か どう か 調べ ます
ノンゼロワインディング 規則 を 使用 し て 現在 の パス を 塗り つぶし ます
座標系 の 回転 を 設定 し ます
テキスト の 行 の フォーマット を 行い 、 その 結果 の メトリクス を 問い合わ せ ます
現在 の リクエストオブジェクト を 取得 し ます
この 関数 は 、 指定 し た シーケンス sequence の メッセージ の フラグ から 、 指定 し た フラグ flag を 削除 し ます
指定 し た 座標 左上 が 0 0 です から 、 指定 し た 色 color で image を 塗り つぶし ます
リポジトリ 内 の ファイル を 指す url repos _url の 中身 を 返し ます
に 入っ た 回数 から ev :: run を 正常 終了 し た 回数 を 引い た 結果 、 つまり 、 再帰 の 深さ を 返し ます
特定 の フィールド が 存在 する かどう か チェック し ます
作業 コピー 内 の パス で の ローカル の 変更 内容 を 取り消し ます
zip アーカイブ の コメント を 設定 し ます
ch ハンドル を 、 マルチハンドル mh に 追加 し ます
コレクション 内 の 要素 の 最大 数 を 返し ます
以降 の 描画 処理 で 使わ れる グレー 値 を 設定 し ます
は 、 データベース 内 の ドキュメント の 数 を 返し ます
は 、 指定 し た filename から 得 られ た イメージ を 表す イメージid を 返し ます
は 、 postgresql 結果 リソース から フィールド （ カラム ） の 数 を 返し ます
ファイル の グループ を 取得 し ます
ページ の 高さ を 取得 し ます
フレーム の 文字 列表 現 を 返し ます
は ftp サーバー 上 の ファイル や ディレクトリ の 名前 を 変更 し ます
画像 を ぼかし ます
iis の 各仮 想 サーバー に は 、 インスタンス 番号 が 付け られ て い ます
フラグ を 設定 し ます
画像 の インターレース 手法 を 取得 し ます
slob オブジェクト を 文字列 に 書き こみ ます
 ;& nbsp ;rfc 2 0 4 5 の section 6 . 7 に 従っ て 作成 し た quoted printable 文字列 を 返し ます
は 、 現在 の 配列 位置 に おける 連想 配列 要素 の キー を 返し ます
組み込み の スポット 色名 を 検索 する か 、 現在 の 塗り つぶし 色 から 名前 付き の スポット 色 を 作成 し ます
インターフェイス を 実装 し て いる かど う か を 調べ ます
この メソッド は 、 エントリ を 新しい 値 で 更新 し ます
この 関数 は 次 の 関数 の エイリアス です
http ステータス に関する 詳細 を 返し ます
sql 命令 を データベースサーバー に 送り ます
セッションキャッシュ による メモリ 使用 状況 について の 情報 を 取得 し ます
新規 の pdf ファイル を 指定 し た ファイル 名 で 作成 し ます
処理 フラグ を 設定 し ます
この 関数 は 、 コールバック 関数 を 設定 し ます
class に interface を 実装 さ せ ます
現在 の ヘルプ 行 を 、 スタック の 内容 で 置き 換え ます
組み込み の 繁体 字中 国語 フォント を 有効 に し ます
は 、 指定 し た link _identifier が 指す データベース 全体 を サーバー から 破棄 削除 しよ う とし ます
これ を 使用 し て 、 外部 の phar アーカイブ の 内容 を 読み込む こと が でき ます
