組み込み ヘルプシステム を 起動 し ます ( この 関数 は 対話 的 な 使用 の ため の もの です )
ソケット の ブロッキング 処理 の タイムアウト 値 を 指定 し ます
ポーリングループ を 開始 し 、 count 回 が 過ぎる か 、 全て の オープン 済み チャネル が クローズ さ れ た 場合 のみ 終了 し ます
マッチ し た 1 個 以上 の サブグループ を 返し ます
bdb クラス の インスタンス を 使っ て 、 呼び出し元 の フレーム から デバッグ を 開始 し ます
スクリプト 環境 で exec 互換 文字 列 の プロファイル を おこ ない ます
対応 する turtlescreen の メソッド の 複製 です
set と 全て の other の 要素 から なる 新しい set を 返し ます
range (start , stop , step ) の 要素 から ランダム に 選ば れ た 要素 を 返し ます
値 x の 新た な 要素 を アレイ の 末尾 に 追加 し ます
特定 の トラック について の 情報 を 返し ます
mailbox に対する acl を 取得 し ます
一つ の iterable から n 個 の 独立 し た イテレータ を 生成 し て 返し ます
対数 正規 分布 です
データ の 自乗 平均 根 (root -mean -square )、 すなわち sqrt (sum (s _i ^ 2 )/ n を 返し ます
一時ファイル ( temporary file ) を 生成 する 上 で ファイル 名 として 相応しい 一意 な パス 名 を 返し ます
同期 アクセス に lock を 使用 する ctypes オブジェクト の ため に プロセスセーフ な ラッパーオブジェクト を 返し ます
sep を 区切り 文字 と し た 、 文字 列中 の 単語 の リスト を 返し ます
この inputsource の システム 識別子 を 返し ます
リモート 側 の 端点 に data を 送出 し ます
文字列 s を input _codec から output _codec に 変換 し ます
文字列 message を システムログ 機構 に 送信 し ます
warning が 正しく 発行 さ れ て いる かどう か チェック する 、 warnings .catch _warnings を 使い やすく する ラッパー です
キー へ の 弱参 照 の リスト を 返し ます
メッセージ 本体 の 先頭 を seek します
x の 誤差 関数 を 返し ます
ソケット の ブロッキング ・非 ブロッキングモード を 指定 し ます
遠隔 の サーバ に data を 送信 し ます
key に対応 する メッセージ の 表現 を 文字 列 として 返し ます
この 木 の 根 エレメント を 置き 換え ます
sb /se ペア ( サブオプション 開始 ／ 終了 ) の 間 に 収集 さ れ た データ を 返し ます
二つ の オブジェクト x および y を 比較 し 、 その 結果 に 従っ て 整数 を 返し ます
値 を 指定 し た キー に 関連 付け ます
メッセージ に 付い て いる ラベル の リスト を labels に セット し ます
指定 し た トレースバック と 例外 を sys .stderr に 出力 し ます
x の 逆双 曲線 正接 を 返し ます
ファイル filename に 含ま れ た python コード を 制限 さ れ た 環境 で 実行 し ます
引数 name と direction は 文字列 です
希望 に 応じ 、 未使 用 の 引数 が ない か 確認 する 機能 を 実装 し ます
ラップ し た ファイルオブジェクト を 返し ます
http トンネリング 接続 の ホスト 名 と ポート 番号 を 設定 し ます
base 1 6 をつかっ て 、 文字列 を エンコード ( 符号化 ) します
不透明 な パーザオブジェクト を 作っ て 返し ます
cd -rom ドライブ の オーディオ cd の 特定 の トラック から 再生 を 開始 し ます
サウンドデバイス が バッファ 内 の 全て の データ を 再生 し 終える まで 待機 し ます
https リクエスト を 送り ます
ミキサデバイス を 開き 、 oss ミキサデバイスオブジェクト を 返し ます
引数 が ない 場合 、 現在 の ローカルスコープ に ある 名前 の リスト を 返し ます
(xml ) 宣言 中 の システム 識別 子中 の 相対 uri を 解決 する ため の 、 基底 uri を 設定 し ます
エラーコード code に対応 する エラーメッセージ を 返し ます
端末 が サポート する 全て の ビデオ 属性 を 論理和 し た 値 を 返し ます
メールボックス で 使わ れ て いる ユーザ が 定義 し た 全て の ラベル の リスト を 返し ます
与え られ た レルム および uri に対する ユーザ 名 また は パスワード が あれ ば それ を 取得 し ます
heap から 最小 の 要素 を pop し て 返し 、 新 た に item を push します
メッセージ 本体 を 書く の に 使う こと が できる ファイル の よう な オブジェクト を 返し ます
ヒストリ から 指定 し た 位置 に ある ヒストリ を 削除 し ます
これ は ラッパ 関数 を 定義 する とき に partial (update _wrapper , wrapped =wrapped , assigned =assigned , updated =updated ) を 関数 デコレータ として 呼び出す 便宜 関数 です
メモリバッファ の アドレス を 示す 整数 を 返し ます
stats クラス の この メソッド は 、 オブジェクト 内 の 情報 の リスト を 逆順 に ソート し ます
which で 指定 さ れ た インターバルタイマー の 現在 の 値 を 返し ます
tzinfo が none の 場合 、 none を 返し 、 そう で ない 場合 に は self .tzinfo .tzname (none ) を 返し ます
現在 の プロセス の real , effective group id を 設定 し ます
annotation を mailbox に 設定 し ます
http _error _ 3 0 1 と 同じ です が 、’ found ’ レスポンス に対し て 呼び出さ れ ます
この turtlescreen の canvas を 返し ます
浮動 小数 点数 x が nan ( not a number ) で ある か チェック し ます
str が データ の 場合 に 真 を 返し 、 セクション 分割子 の 可能 性 が ある 場合 に は 偽 を 返し ます
指定 し た 位置 に ある ヒストリ を 、 指定 し た line で 置き 換え ます
新しい partial オブジェクト を 返し ます
location : か uri : の url に リダイレクト し ます
ソケット を クローズ し ます
文字 セット を 変換 する こと なし に 、 メッセージ の ヘッダ を デコード し ます
多く の プログラム は 、 その 機能 を サブコマンド へ と 分割 し ます
融合 積和 (fused multiply -add ) です
現在 の エレメント と 同じ型 の 新しい エレメント ・ オブジェクト を 作り ます
キャッシュ が 有効 か チェック し ます
mac os の バージョン 情報 を 、 タプル ( release , versioninfo , machine ) で 返し ます
文書 に 変更 が あっ た 場合 は この メソッド を 呼び ます
圧縮 形式 を 返し ます
この クラス で は notimplementederror 例外 を 送出 し ます
open さ れ た ファイルオブジェクト から メッセージオブジェクト 構造 を 作成 し 返し ます
指定 さ れ た アドレスファミリ 、 ソケットタイプ 、 プロトコル 番号 から 、 接続 さ れ た ソケット の ペア を 作成 し ます
プログレスダイアログ 中 の プログレスボックス の テキスト を newstr に 設定 し ます
1 行 を ヒストリバッファ に 追加 し 、 最後 に 打ち込ま れ た 行 の よう に し ます
この ブレークポイント を 無効 に し ます
コントロール control の パートコード pcode が ユーザ に ヒット さ れ た 場合 に 呼ば れ ます
ascii 1 6 進数 字 か どう か を 調べ ます
二つ の 数値 型 の 引数 を 共通 の 型 に 変換 し て 、 変換 後 の 値 から なる タプル を 返し ます
フォルダ を 削除 し ます – サブフォルダ が 入っ て い て はいけ ませ ん
メールボックス に message を 追加 し 、 それ に 割り 当て られ た キー を 返し ます
ファイル 記述子 fd から 最大 で n バイト 読み出し ます
与え られ た 文字 セット の 文字 と unicode と の 変換 を おこなう codec を 追加 し ます
code が テーブル c . 6 ( 平文 :plain text として 不適切 ) かどう か 判定 し ます
月 曜日 を 1 、 日曜日 を 7 として 、 曜日 を 整数 で 返し ます
クエリ 結果 から 次 の 幾つか の row を フェッチ し て 、 リスト を 返し ます
この メソッド は デバイス を 明示 的 に 閉じ ます
エレメント の 木も しく は エレメント の 構造 を sys .stdout に 書き込み ます
この メソッド は 2 要素 タプル の リスト を parseaddr と 同じ 形式 で 返し ます
パイプ を通し て infile を outfile に コピー し ます
指定 し た セクション が コンフィグレーションファイル に 存在 する か を 返し ます
name の 完全 修飾 ドメイン 名 を 返し ます
アーカイブファイル ( zip や tar など ) を 作成 し 、 その 名前 を 返し ます
encoding に 指定 し た codec を 検索 し 、 デコーダ 関数 を 返し ます
リダイレクト の 通知 に 応じ て 、 request また は none を 返し ます
内部 の 型 キャッシュ を クリア し ます
設定 を 文字 列表 現 に 変換 し て ファイルオブジェクト に 書き出し ます
キュー の 中 へ 要素 を 追加 し ます
引数 の 文字列 を オブジェクト に 変換 し 、 namespace オブジェクト の 属性 に 代入 し ます
コネクション の 向こう 側 から 送 られ た バイトデータ を buffer に 読み込み 、 メッセージ の バイト 数 を 返し ます
path で 指定 さ れ た ディレクトリ 内 の エントリ 名 が 入っ た リスト を 返し ます
この mime ヘッダ に 文字列 s を 追加 し ます
与え た 幅 と 高さ の ウィンドウ を 作成 する のに 必要 な 、 ( left , top , right , bottom ) から なる タプル を 返し ます
src から dst へ 再帰 的 に ファイル の ツリー を コピー し ます
指定 し た section 内 の 各 オプション に対し て 、 ( name , value ) の ペア から なる リスト を 返し ます
リスト 中 の メッセージ を フォルダ から 削除 し ます
( モードレス ) ウィンドウ を 作成 し ます
パネル を 隠し ます
必要 なら ブロック し て 、 キュー に サンプル を 書き込み ます
現在 セット さ れ て いる フラグ を 特定 する 文字 列 を 返し ます
ファイルディスクリプタ fp1 と fp2 が 同じ ファイル を 指し て い たら 、 true を 返し ます
与え られ た payload を 現在 の ペイロード に 追加 し ます
pkg _name という 名前 の パッケージ の 在り処 が path で ある こと を 記録 し ます
この 関数 の グローバル 変数 の 名前 から なる タプル を 返し ます
整数 を [ a .. p ] から なる 文字 集合 を 用い て 表現 し た 文字列 に 変換 し ます
アーカイブフォーマット name を 、 サポート さ れ て いる フォーマット の リスト から 取り除き ます
整数 a と b の 最大 公約 数 を 返し ます
実際 に は 一度 に 全て を 格納 せ ずに 、 glob と 同じ値 を 順 に 生成 する イテレータ を 返し ます
与え られ た id の マーク の 要素 を getmarkers で 述べ た タプル で 返し ます
ファイル の 中 の 現在 位置 を 返し ます
この メソッド は basehandler で は 定義 さ れ て い ませ ん
現在 の 作業 ディレクトリ を 表現 する ユニコードオブジェクト を 返し ます
現在 の dtdhandler を セット し ます
文字列 bytes を アーカイブ に 書き込み ます
生ストリーム に対し た だ 一度 の 呼び出し で 最大 n バイト を 読み込ん で 返し ます
ソケット の 生成 を 試み ます
ストリーム 位置 を 指定 さ れ た offset バイト に 変更 し ます
ハッシュオブジェクト の コピー ( “ クローン ”) を 返し ます
code が テーブル c . 1 . 2 ( 非 ascii スペース 文字 ) かどう か 判定 し ます
http リクエストメソッド を 示す 文字 列 を 返し ます
出力 ストリームオブジェクト out に 、 xml -rpc エンコーディング の datetime 値 を 出力 し ます
msigetsummaryinformation を 呼び出し て 新しい サマリー 情報 オブジェクト を 返し ます
ファイルオブジェクト と 、 背後 の ファイルポインタ および ファイル 記述子 を 複製 し ます
( 隠れ て いる はず の ) パネル を 表示 し ます
名前 name の 新た な オプションフラグ を 作成 し 、 作成 さ れ た フラグ の 整数 値 を 返し ます
シグナル signalnum に対する 現在 の シグナルハンドラ を 返し ます
ファイル filename で 与え られ た 型 の マップ が 、 もし あれ ば ロード し ます
ungetch の ワイド 文字 列版
サーバ に 更新 を 促し ます
database の _ stream テーブル に 、 ファイル path を name という ストリーム 名 で 追加 し ます
新しい 一意 識別子 の 文字 列表 現 を 返し ます
エンコード さ れ た ヘッダ 文字 列 の 長さ を 返し ます
getch に 似 て い ます が 、 打鍵 し た 字 が 印字 可能 な 文字 の 場合 エコーバック さ れ ます
現在 の イベント の システム 識別子 を 返し ます
全て の バッファ さ れ て いる データ について 、 その後 に ファイル 終了 マーク が 続い て いる とみ なし て 強制 的 に 処理 を 行い ます
現在 の ファイル 中 で の 行番 号 を 返し ます
パスワード を 送出 し ます
ast に 格納 さ れ た 抽象 構文 木 の 各 ノード を 先行 順序 ( pre -order ) で たどっ て いき ます
この フォント で string を 描い た とき の 幅 を ピクセル 数 で 返し ます
ファイル 記述子 fd の モード を cbreak モード に 変え ます
この ファクトリ 関数 は 、 copytree 関数 の ignore 引数 に 渡す ため の 呼び出し 可能 オブジェクト を 作成 し ます
現在 セット さ れ て いる フラグ を 特定 する 文字 列 を 返し ます
gdbm データベース を 開い て gdbm オブジェクト を 返し ます
自動ガベージコレクション が 有効 なら 真 を 返し ます
一様 な 項目 から なる 固定 長 の アレイ を アンパック し て （ リスト として ） 返し ます
config .h スタイル の ファイル を 解析 し ます
ls - ld file の 出力 を 文字列 で 返し ます
x の 底 を 1 0 と する 対数 を 返し ます
倍精度 ( double -precision ) の 浮動 小数 点数 value を パック し ます
a = itruediv (a , b ) は _ _ future __ . division が 有効 な とき に a / = b と 等価 です
引数 の 標準 的 (canonical ) エンコーディング を 返し ます
filename から hotshot データ を 読み込み 、 pstats .stats クラス の インスタンス を 返し ます
パーザ が sgml 宣言 を 読み出し た 際 に 呼び出さ れる メソッド です
ひと月 分の カレンダー を html の テーブル として 返し ます
guess _all _extensions と 同様 です が 、 オブジェクト に 保存 さ れ た テーブル を 参照 し ます
x y で 与え られ た 場所 に ある 指定 さ れ た component の 説明 を 返し ます
regexp の 検索 が text と マッチ し ない こと を テスト し ます
(resp , list ) から なる ペア を 返し ます
レベル warning の メッセージ を この ロガー で 記録 し ます
文字列 引数 として 渡さ れ た クエリ 文字列 ( application /x -www -form -urlencoded 型 の データ ) を 解釈 し ます
指定 し た モジュール に 含まれる 全 テストケース の スイート を 返し ます
過去 に キュー に 入れ られ た タスク が 完了 し た 事 を 示し ます
url 用 に 安全 な アルファベット 集合 を もちい て 文字 列 s を デコード ( 復元 ) します
現在 設定 さ れ て いる 週 の 最初 の 曜日 を 返し ます
デバッガー が 現在 の 行 で 止まる べき で あれ ば 、 user _line メソッド ( サブクラス で オーバーライド さ れる ) を 呼び出し ます
a = irshift (a , b ) は a > >= b と 等価 です
4 文字 の type と creator コード を 持つ ファイル に対する マッピングエントリ を 返し ます
checkbox コントロール を 追加 し て 返し ます
string 内 の データ を 解凍 し て 、 解凍 さ れ た データ を 含む 文字 列 を 返し ます
色 の 定義 を 変更 し ます
永続 的 な 辞書 オブジェクト を 同期 し て 閉じ ます
メンバー を その 名前 の リスト として 返し ます
tarinfo オブジェクト を 文字列 バッファ buf から 作成 し て 返し ます
この 関数 は 、 用語 リソース を 得る のに 異なる 方法 を 使用 する 以外 は 、 processfile と 同じ です
比較 を 行う 2つ 目 の シーケンス を 設定 し ます
transfercmd と 同様 です が 、 データ と 予想 さ れる サイズ と の タプル を 返し ます
dgettext と 同じ です が 、 bind _textdomain _codeset で特に エンコード を 指定 し ない 限り 、 翻訳 結果 を 優先 システムエンコーディング ( preferred system encoding ) で 返し ます
a および b および それら の 共通 の サブディレクトリ 間 で の 比較 結果 を ( 再帰 的 に 比較 し て ) 出力 し ます
現在 の 行番 号 および オフセット 値 を 返し ます
プロセス を 停止 さ せ た シグナル 番号 を 返し ます
ch の 印字 可能 な 表現 を 文字列 で 返し ます
現在 の 数値 umask を 設定 し 、 以前 の umask 値 を 返し ます
attr に対する 色 ペアセット の 番号 を 返し ます
request に 正しい cookie ヘッダ を 追加 し ます
code は 、 1 行 以上 の python コード を 含む 文字 列 で なけれ ば なり ませ ん
もし ストリーム が ランダムアクセス を サポート し て い た 場合 true を 返し ます
リスト から 要素 を 追加 し ます
s 中 の 単語 から なる リスト を s の 末尾 から 検索 し て 生成 し 返し ます
レコード に対する 書式 化 を 行い ます - フォーマッタ が 設定 さ れ て いれ ば 、 それ を 使い ます
与え られ た 数 で の ( 自然 ) 指数 関数 e ** x の 値 を 返し ます
s が python の キーワード で あれ ば 真 を 返し ます
x の 双曲 線正 接 を 返し ます
プロセス の “ nice 値 ” に increment を 加え ます
入力 ソース を 処理 し 、 sax イベント を 発生 さ せ ます
digest と 似 て い ます が 、 返さ れる 文字 列 は 倍 の 長さ と なり 、 1 6 進 形式 と なり ます
set もしく は other のいずれ か 一方 だけ に 含まれる 要素 を 持つ新しい set を 返し ます
この メソッド は データベースコネクション を 閉じ ます
与え られ た path に対し て 、 lstat システムコール と 同じ 動作 を します
タートルグラフィックス ( turtlegraphics ) の ウィンドウ を 閉じ ます
reader の 反復 可能 な オブジェクト から 、 現在 の 表現 形式 に 基づい て 次 の 行 を 解析 し て 返し ます
区 分線 形曲 線 （piecewise -linear curve ） を 定義 し ます
ハードリンク の 場合 に true を 返し ます
mosel を http ヘッダ 形式 の 文字 列表 現 に して 返し ます
(content -type の よう な ) mime ヘッダ を 解釈 し 、 ヘッダ の 主要 値 と 各 パラメタ から なる 辞書 に し ます
フォントハンドルオブジェクト を 返し ます
チャネル で 検出 する 終了 条件 を 設定 し ます
この フォント の 名前 を 返し ます
pop 3 サーバー に ログオン する のに 、 より セキュア な apop 認証 を 使用 し ます
整数 値 を バイナリ 文字 列 に 変換 し ます
フォント の 検索 パス を 設定 し ます
以上 の 全て の 値 を 上 の 順 に 並べ た タプル を 返し ます
%xx エスケープ を エスケープ が 表す 1 文字 に 置き 換え ます
endwin がすで に 呼び出さ れ て いる ( すなわち 、 curses ライブラリ が 非初 期化 さ れ て しまっ て いる ) 場合 に 真 を 返し ます
nlines 行 を 指定 さ れ た ウィンドウ の 現在 の 行 の 上 に 挿入 し ます
ストリーム から の データ を デコード し 、 デコード 済 の オブジェクト を 返し ます
アドレスファミリ 、 ソケットタイプ 、 プロトコル 番号 を 指定 し て ソケット を 作成 し ます
新しい ロックオブジェクト を 返し ます
シェルスタイル の pattern を 、 正規 表現 に 変換 し て 返し ます
パッケージ を 構成 する モジュール の 検索 パス を 拡張 し ます
要素 を 逆順 に 取り出す イテレータ ( reverse iterator ) を 返し ます
インタプリタ の “ チェックインターバル ( check interval )” を 返し ます ; setcheckinterval を 参照 し て くだ さい
1行 の プロンプトメッセージ と 、 ユーザ が 入力 できる テキストフィールド を 持つ ダイアログボックス を 表示 し ます
string を 表現 する document を 返し ます
文字列 の 末尾 部分 を 除去 し た コピー を 返し ます
新しい エレメント を 開き ます
次 の セクション まで 行 を 読み飛ば し ます ( すなわち 、 セクション 分割子 また は 終了 マーカ が 消費 さ れる まで 行 データ を 読み ます )
任意 の メッセージ を sys .stderr に ログ 記録 し ます
開か れ た レジストリキー に 関連 付け られ て いる 、 指定 し た 名前 の 値 に対し て 、 型および データ を 取得 し ます
ファイルオブジェクト f から ( マシン 依存 の データ 形式 その ままで ) n 個 の 要素 を 読み出し 、 アレイ の 末尾 に 要素 を 追加 し ます
http _error _ 3 0 1 と 同じ です が 、’ temporary redirect ’ レスポンス に対し て 呼び出さ れ ます
2つ の セット が 等しい か どう か を テスト し ます
記号表 の 型 を 返し ます
lock の 値 に 依存 する 点 を 除け ば rawarray と 同様 です
フラグ を 全て 0 に リセット し ます
この コントローラー で ハンドル さ れ た ブラウザ で url を 表示 し ます
content -type ヘッダ 中 の パラメータ を 設定 し ます
オブジェクト が 組み込み 関数 か 束縛 済み の ビルトインメソッド の 場合 に 真 を 返し ます
items の それぞれ の 要素 の 選択 状態 を 入れ 替え ます
空白 以外 の ascii 印字 可能 文字 か どう か を 調べ ます
基底 クラス で は 何 も し ない ( no -op ) よう に なっ て い ます
システム の プロファイル 関数 を 登録 し ます
この 関数 は 引き数 に 入力 ソース 、 オプション として url を 取り 、 読み取り 可能 な 解決 済み inputsource オブジェクト を 返し ます
group と マッチ し た 部分 文字 列 の 先頭 と 末尾 の インデックス を 返し ます
指定 さ れ た 年 の データ を 整形 に 向く形 で 返し ます ( yeardatescalendar と 同様 です )
メールボックス の 状態 を 得 ます
繰り返し object を 返す イテレータ を 作成 し ます
指定 さ れ た items とその 子孫 たち 全て を 削除 し ます
レジストリキー から 指定 さ れ た 名前 つき の 値 を 削除 し ます
システムコール の リスタート の 動作 を 変更 し ます
match に マッチ する 最初 の サブエレメント の テキスト を 探し ます
おおよ その キュー の サイズ を 返し ます
translation に domain 、 localedir 、 および codeset を 渡し て できる 関数 _ を python の 組み込み 名前 空間 に 組み込み ます
文字列 の シーケンス から xml ドキュメント を 解析 し ます
max (self , other ) と 同じ です が 、 値 を 返す 前 に 現在 の コンテキスト に 即し た 丸め 規則 を 適用 し ます
path の リソースフォーク の 中 の restype タイプ の リソース から plist を 読み込み ます
deque から すべ て の 要素 を 削除 し 、 長さ を 0 にし ます
要素 elem を set から 取り除き ます
x より 大きい 最小 の 表現 可能 な 数 を 返し ます
この メソッド は ディスク にまだ 書き込ま れ て い ない データ を 全て 書き込ま せ ます
x の 床値 ( floor )、 すなわち x 以下 の 最も 大きい 整数 を float 型 で 返し ます
body 命令 を 送信 し ます
varname という 名前 の 環境 変数 を 取り消し ます
ファイル 記述子 fd の 登録 を 変更 する
deque の 要素 を 全体 で n ステップ だけ 右 に ローテート し ます
ブロック の 中 で exec が 使わ れ て いる なら ば true を 返し ます
指定 さ れ た path _item に対する pep 3 0 2 importer を 取得 し ます
fallback を 現在 の 翻訳 オブジェクト の 代替 オブジェクト として 追加 し ます
ファイル path を 削除 ( 消去 ) します
根底 に ある ロック を 獲得 し ます
データ ( 文字列 また は producer オブジェクト ) を producer fifo に 追加 し ます
feedparser に データ を 供給 し ます
doctype 宣言 を 処理 し ます
出力 チャネル 数 を num _channels に 設定 し ます
cd -rom から 次 に デジタルオーディオデータ を 読み込む 開始 位置 の ポインタ を 設定 し ます
ヒストリファイル に 必要 な 長さ を 設定 し ます
可能 な 限り 安全 な 方法 で 一時 ディレクトリ を 作成 し ます
mutex が ロック さ れ て いる かどう か 調べ ます
フォーム に ラウンドボタンオブジェクト を 加え ます
a と b の 論理 積 を 返し ます
filename が pattern に マッチ する か テスト し て 、 true 、 false を 返し ます
渡さ れ た unittest .testcase サブクラス を 実行 し ます
共有 dict オブジェクト を 作成 し て 、 その プロキシ を 返し ます
x の 双曲 線余 弦 を 返し ます
hls から rgb に 変換 し ます
この メソッド は basehandler で は 定義 さ れ て い ませ ん
path _info から script _name に 一つ の 名前 を シフト し て その 名前 を 返し ます
これ は 、 print _exc (limit ) に 似 て い ます が 、 ファイル に 出力 する 代わり に 文字列 を 返し ます
module の 全て の テーブル の 内容 を database に 追加 し ます
item の 親 の 識別子 を 、 item が 階層 の 最上 位 にい た 場合 ‘ ’ を 返し ます
node の 全て の 子孫 ノード ( node 自体 を 含む ) を 再帰 的 に yield します
子 ノード を 削除 し ます
現在 の グローバルドメイン 、 言語 、 および ロケール 辞書 に 基づい て 、 message の 特定 地域 向け の 翻訳 を 返し ます
textcalendar の formatyear メソッド を 利用 し て 、 3 列 から なる 一年間 の カレンダー を 複数 行 の 文字 列 で 返し ます
tarinfo オブジェクト tarinfo を アーカイブ に 追加 し ます
1つ 以上 の リッチ 順序 比較 メソッド を 定義 し た クラス を 受け取り 、 残り を 実装 する クラスデコレータ
引数 が 有限 の 数値 なら ば true を 、 無限 大 か nan ならば false を 返し ます
control -c 処理 の ため に testresult を 登録 し ます
ファイル の 長さ を 返し ます
find と 同じ です が 、 最後 に 見つかっ た もの の インデックス を 返し ます
与え られ た フレーム および 上位 ( 呼び出し 側 ) と 下位 の すべ て の フレーム に対する レコード の リスト と 、 上位 フレーム の サイズ を 得 ます
ファイル filename 内 の python コード を 、 制限 さ れ た 環境 の _ _ main __ モジュール で 実行 し ます
同じ 時 、 分 、 秒 、 マイクロ 秒 、 および tzinfo メンバ を 持つ time オブジェクト を 返し ます
登録 さ れ て いる ファイル 記述子 fd を 変更 する
ヘッダ が メッセージ の 可視 ヘッダ で あり ボディ が 空 で ある よう な message インスタンス を 返し ます
先読 み チェック に 使う ため の ファイル 記述子 fd を 指定 し ます
deque の 左側 から 要素 を ひとつ 削除 し 、 その 要素 を 返し ます
パラメタ : angle – 数 タートル の 形 (turtleshape ) を 現在 の 傾斜 角 から 角度 (angle ) だけ 回転 し ます
オーディオフレーム 数 を 返し ます
unicode 文字 unichr に 割り 当て られ た 、 文字 分解 マッピング を 、 文字 列型 で 返し ます
この メソッド を オーバーライド する こと で 、 アプリケーション の 説明 を 記述 する テキスト 文字 列 を 返し ます
終端 トークン の 値 に対し て 真 を 返し ます
epoll オブジェクト から 登録 さ れ た ファイル 記述子 fd を 削除 する
この 関数 は この モジュール で は 廃止 予定 です
無条件 に テスト を 失敗 さ せ ます
セキュアデータ 接続 を セットアップ し ます
escape に 似 て い ます が 、 data は 属性 値 の 作成 に 使わ れ ます
文字列 の data を クライアント へ の 転送 用 に バッファ し ます
data の adler - 3 2 チェックサム を 計算 し ます
この パート の 残り の 全て の 行 を 文字列 の リスト として 返し ます
inexact や rounded といっ た シグナル を 出さず に 最近 傍 の 整数 に 値 を 丸め ます
gmtime に 似 て い ます が 、 ローカルタイム に 変換 し ます
ascii 転送 モード で ファイル と ディレクトリ の リスト を 受信 し ます
string に 含まれる 特殊 文字 を % xx エスケープ で 置換 （quote ） します
fp で 与え られる ファイル か ファイル の よう な オブジェクト を 読み込ん で 構文 解析 し ます (readline メソッド だけ を 使い ます )
整数 除算 の 剰余 を 返し ます
指定 さ れ た ソースコード 中 の 行 に ( 有効 な ) ブレークポイント が ある かど う か を 判断 し ます
iterable iterable 中 の 文字列 を 結合 し た 文字列 を 返し ます
xml 断片 を 構文 解析 し て エレメント の 木 を 漸増 的 に 作っ て いき 、 その 間進 行状 況 を ユーザー に 報告 し ます
レベル error の メッセージ を ルートロガー で 記録 し ます
python コード の 文字列 で ある べき source を コンパイル し て みて 、 source が 有効 な python コード の 場合 は コードオブジェクト を 返し ます
format % val 形式 の フォーマット 指定子 を 、 現在 の ロケール 設定 を 考慮 し たうえ で 処理 し ます
指定 さ れ た キー の リフレクション 状態 を 確認 し ます
現在 の 行番 号 より も 大きい 行番 号 に 到達 し た とき 、 あるい は 、 現在 の フレーム から 戻る とき に ストップ し ます
object を (エンコーダ の 現在 の 状態 を 考慮 に 入れ て ) エンコード し 、 得 られ た エンコード さ れ た オブジェクト を 返し ます
base 3 2 をつかっ て 、 文字列 を デコード ( 復元 ) します
ノート ここで 文字 は python 文字 ( 長 さ 1 の 文字列 ) c における 文字 ( ascii コード ) を 意味 し ます
ファクトリ 関数 ( factory function ) factory を 名前 name で 登録 し ます
全て の メンバー を アーカイブ から 現在 の 作業 ディレクトリー また は path に 抽出 し ます
この 関数 は タプル ( x , y , z ) を 返し ます
プログラマ が カラー を 利用 し たい 場合 で 、 かつ 他 の 何ら か の カラー 操作 ルーチン を 呼び出す 前 に 呼び出さ なく て は なり ませ ん
バックグラウンドスレッド を join します
xml 断片 を 構文 解析 し て element tree に し ます
first と second が 同じ オブジェクト で ある こと （ そう で ない こと ） を テスト し ます
max メソッド に 似 て い ます が 、 比較 は 絶対 値 で 行わ れ ます
応答 中 の http ヘッダ の 終了 を 示す 空行 を 送信 し ます
アレイ 中 の x のうち 、 最初 に 現れ た もの を 取り除き ます
オブジェクト を 定義 し て いる python ソースファイル の 名前 を 返し ます
“ ユーザーベース ” ディレクトリ の パス を 返し ます
sys .last _traceback の トレースバック の 事後 解析 デバッギング に 入り ます
この 関数 は 変更 可能 な ユニコード 文字 バッファ を 作成 し ます
ドキュメント の 終わり を 決定 し ます
この フォント に 関連 し た データ を 含む タプル を 返し ます
x の 天井値 ( ceil )、 すなわち x 以上 の 最も 小さい 整数 を float 型 で 返し ます
text 内 の 段落 を 一つ だけ 折り返し を 行い 、 折り返し が 行わ れ た 段落 を 含む 一つ の 文字列 を 返し ます
サブシェル 内 で コマンド ( 文字列 ) を 実行 し ます
夏 時間 ( dst ) 修正 を 、 utc から 東向き を 正と し た 分 で 返し ます
エントリ を component テーブル に 追加 し 、 この コンポーネント を この ディレクトリ の 現在 の コンポーネント に し ます
タートル の 描い た もの を スクリーン から 消し 、 タートル を 中心 に 戻し て 、 全て の 変数 を デフォルト 値 に 設定 し 直し ます
ストリーム から 1 行読 み 込ん で 返し ます
与え られ た プロトコル に おける エラー を 処理 し ます
ブロック する ドメイン を 設定 し ます
msisummaryinfopersist を 使っ て 変更 さ れ た プロパティ を サマリー 情報 ストリーム に 書き込み ます
シーケンス を 閉じ ます
ディレクトリツリー 以下 の ファイル 名 を 、 ツリー を トップダウン もしく は ボトムアップ に 走査 する こと で 生成 し ます
year と month で 指定 さ れ た月 の 一日 の 曜日 と 日数 を 返し ます
タートル が 描画 中 の turtlescreen オブジェクト を 返し ます
ウィンドウ を 開く 時 は この メソッド を オーバーライド し ます
オーディオファイル で 使用 さ れ て いる 圧縮 形式 を 示す 4 文字 の 文字列 を 返し ます
sql 文 sql を seq _of _parameters シーケンス ( また は マッピング ) に 含まれる 全 て の パラメータ に対し て 実行 し ます
dump (value , file ) で ファイル に 書き込ま れる よう な 文字列 を 返し ます
バージョン 2 . 7 で 撤廃 : 代わり に _ _ imul __ を 使っ て 下さい
iterable の 要素 と 要素 が 同じ で 、 かつ 順番 も 同じ に なる タプル を 返し ます
( ばかばかしい ほど 単純 な ) ディザ 処理 アルゴリズム を 用い て 、 8 ビットグレースケール 画像 を 1ビット の モノクロ 画像 に 変換 し ます
要素 の 開始 を 処理 する ごと に 呼び出さ れ ます
dir で 指定 さ れ た ディレクトリ を 再帰 的 に 下降 し 、 見つかっ た . py を 全て コンパイル し ます
文字列 s を デコード し て 結果 の バイナリデータ を 返し ます
calendar 関数 で 返さ れる 一年間 の カレンダー を 出力 し ます
fifo に push され た アイテム の うち 、 最 も 古い アイテム を 返し ます
この メソッド は & # ref ; 形式 の 文字 参照 ( character reference ) を 処理 する ため に 呼び出さ れ ます
数値 で 指定 さ れ た モード mode を 持つ fifo ( 名前 付き パイプ ) を path に 作成 し ます
dir 1 と dir 2 ディレクトリ の 中 の 、 common で 指定 さ れ た ファイル を 比較 し ます
name が 拡張 smtp サービスセット に 含ま れ て いる 場合 に は true を 返し 、 そう で なけれ ば false を 返し ます
predicate が true となる 要素 だけ を 返す イテレータ を 作成 し ます
この メソッド を 別 スレッド から 呼び出し て 接続 上 で 現在 実行 中 で あろ う クエリ を 中断 さ せ られ ます
ハードウェアバッファ 上 に 残っ て い て まだ 再生 さ れ て い ない サンプル 数 を 返し ます
sub と 同じ 操作 を 行い ます が 、 タプル ( new _string 、 number _of _subs _made ) を 返し ます
unpack _fstring と 同様 に 、 固定 長 の 不透明 データストリーム を アンパック し て 返し ます
logical _or は 二つ の 論理 引数 ( 論理 引数 参照 ) を 取る 論理 演算 です
明示的 な 書式 化文 字列 で 制御 さ れ た 、 日付 を 表現 する 文字 列 を 返し ます
ソート さ れ た 順序 を 保っ た まま x を a に 挿入 できる 点 を 探し当て ます
プログレスバー の curval を n だけ 増や し ます
シーケンス expected が actual と 同じ 要素 を 含ん で いる こと を テスト し ます
デフォルト の formatter を 持つ streamhandler を 生成 し て ルートロガー に 追加 し 、 ロギングシステム の 基本 的 な 環境 設定 を 行い ます
オープン し た ファイル input から ブロック を eof まで 読ん で 、 それら を オープン し た ファイル output に 書き ます
与え た コールバック は 、 osa ダイレクトオブジェクト を 1 番目 の パラメータ として 呼び出さ れ ます
現在 の 端末 属性 を 、 稼動 中 の プログラム が curses を 使っ て い ない とき の モード で ある “ シェル ” モード として 保存 し ます
接続先 に 証明 書 が 無い 場合 、 none を 返し ます
現在 、 生存 中 の thread オブジェクト 全 て の リスト を 返し ます
サブクラス で 必要 な ソケット 形式 を 詳細 に 定義 できる よう に する ため の ファクトリメソッド です
この 入力 ソース の 文字 ストリーム を 取得 し ます
rootobject を plist ファイル に 書き込み ます
指定 さ れ た items を 全て ツリー から 切り離し ます
記号 が その ブロック の 中 で 参照 さ れ て い て 、 しかし 代入 は 行わ れ ない なら ば true を 返し ます
filename の lineno に ブレークポイント が 存在 する かど う か を チェック し ます
uuid を ホスト id 、 シーケンス 番号 、 現在 時刻 から 生成 し ます
nlst コマンド で 返さ れる ファイル 名 の リスト を 返し ます
遠隔 の サーバ から 一行 読み出し ます
引数 が 発信 nan で あれ ば true を 、 そう で なけれ ば false を 返し ます
major と minor から 、 新しく 生 の デバイス 番号 を 作り ます
iterable の 全て の 要素 が 真なら ば ( もしく は iterable が 空なら ば ) true を 返し ます
パス 名 を 標準 化 し ます
xml -rpc リクエスト に 応じる 関数 を 登録 し ます
x の 浅い ( shallow ) コピー を 返し ます
パラメタ : fullcircle – 数 角度 を 計る 単位 「度 」 を 、 円周 を 何等 分 する か という 値 に 指定 し ます
トークンスタック に 引数 文字列 を スタック し ます
関数 を 初期化 し ます
与え られ た url を 解析 し 、 適切 な アプリケーション を 起動 し て url を 渡し ます
object を フォーマット 化 し て stream に 出力 し 、 最後 に 改行 し ます
垂直 ローパスフィルタ 処理 を 画像 全体 に 行い ます
キャンバス 上 の 現在 タートル が いる 位置 に タートル の 姿 の ハンコ を 押し ます
フォーム に ボタンオブジェクト を 加え ます
ascii コード が 整数 i と なる よう な 文字 1 字 から なる 文字 列 を 返し ます
nurbs （ 非均 一有 理b スプライン ） 曲線 を 定義 し ます
iterkeys として 呼び出さ れる と 全て の キー について の イテレータ を 返し ます が 、 keys として 呼び出さ れる と キー の リスト を 返し ます
mu は 平均 の 角度 で 、 0 から 2 * pi まで の ラジアン で 表さ れ ます
この 関数 の ローカル 変数 の 名前 から なる タプル を 返し ます
字揃え の スタイル を 設定 し ます
固定 し た フォーム の 固定 を 解除 し ます
ハンドラ に 追加 さ れ た フィルタ の 条件 に 応じ て 、 指定 さ れ た ログレコード を 出力 し ます
新 た な プロセス 内 で プログラム path を 実行 し ます
play と 似 て い ます が 、 開始 位置 を トラックナンバー の 代わり に 分 、 秒 、 フレーム で 与え ます
メッセージ の エンベロープヘッダ を 返し ます
オブジェクト の 全 メンバー を 、 ( 名前 , 値 ) の 組み合わせ の リスト で 返し ます
完全 な エラー 応答 を クライアント に 送信 し 、 ログ 記録 し ます
新た な 属性 ノード を 要素 に 追加 し ます
cd -rom ドライブ の 現在 の 状態 に関する 情報 を 返し ます
ssl _version 属性 で 指定 さ れ た もの に 従っ て 、 tls また は ssl を 使い 、 セキュアコントロール 接続 を セットアップ し ます
“derive window ( ウィンドウ を 派生 する )” の 短縮 形 です
未処理 の 入力 データ が 処理 さ れ 、 この 未処 理部 分 を 圧縮 し た データ を 含む 文字 列 が 返さ れ ます
マネージャクラス で 呼び出し 可能 オブジェクト ( callable ) や 型 を 登録 する ため に 使用 さ れる クラスメソッド です
バイナリデータ data の 1 6 進 数 表現 を 返し ます
x の ガンマ 関数 を 返し ます
解凍 オブジェクト の コピー を 返し ます
エレメント を リセット し ます
単一ま た は 複数 の テキストファイル に 入っ て いる doctest 形式 の テスト を 、 unittest .testsuite インスタンス に 変換 し ます
端末 が 色表 示 を 行える 場合 に は 真 を 返し ます
object が 再帰 的 な 表現 か どう か を 返し ます
入力 ファイル 中 に 見つかっ た オプション 名 か 、 クライアントコード から 渡さ れ た オプション 名 option を 、 内部 で 利用 する 形式 に 変換 し ます
与え られ た cookie を 、 それ が 設定 さ れる べき かどう か の ポリシー の チェック を 行わ ず に 設定 し ます
handle _starttag と 似 て い ます が 、 パーザ が xhtml 形式 の 空タグ ( < a .. ./ >) に 遭遇 し た 場合 に 呼び出さ れ ます
与え られ た フレーム か それ より 下 ( の フレーム ) に ある 、 次 の 行 で ストップ し ます
バージョン 1 . 5 . 1 で 撤廃 : tofile メソッド を 使っ て く ださい
現在 の パネル の 下 に ある パネル を 返し ます
ファイルディスクリプタ fd を 閉じ ます
名前 name で 登録 済み の エラー 処理 関数 を 返し ます
tab _id で 指定 さ れ た タブ を 隠し ます
これ まで update メソッド で 与え て き た 文字 列 の ダイジェスト を 返し ます
itertools .imap と 同じ よう に 動作 し ます
uuencode さ れ た 1 行 の データ を バイナリ に 変換 し 、 変換 後 の バイナリデータ を 返し ます
ascii 制御 文字 ( 0x 0 0 から 0x 1f の 範囲 ) かどう か を 調べ ます
predicate が 真 で ある 限り は 要素 を 無視 し 、 その後 は 全て の 要素 を 返す イテレータ を 作成 し ます
x の 平方根 を 返し ます
x が nan か snan で あれ ば true を 返し ます
空白 を 折り た たん で 書式 化 し なけれ ば なら ない データ を 提供 し ます
もし ペン が 下り て いれ ば true を 、 上がっ て いれ ば false を 返し ます
カーソル の 状態 を 設定 し ます
利用 可能 な シャドウパスワードデータベース の 全 エントリ を 任意 の 順番 で 返し ます
現在 の rgb モード を 返し ます
引数 は オブジェクト と 文字 列 です
一つめ の 演算 対象 の 数字 を 二つめ の で 指定 さ れ た 量だけ 巡回 (rotate ) し た 結果 を 返し ます
インターネットサービス 名 と プロトコル から 、 その サービス の ポート 番号 を 取得 し ます
利用 可能 な コマンド 固有 の complete _* が 存在 し ない とき に 、 入力 行 を 補完 する ため に 呼び出さ れる メソッド
各 ファイル を codecs .open で オープン する フック を 返し ます
encoding に 指定 し た codec を 検索 し 、 streamwriter クラス 、 また は ファクトリ 関数 を 返し ます
iterable で 定義 さ れる データセット の うち 、 最小 値 から 昇順 に n 個 の 値 の リスト を 返し ます
現在 の エレメント から subelement を 削除 し ます
python codec レジストリ から codec 情報 を 探し 、 上 で 定義 し た よう な codecinfo オブジェクト を 返し ます
非零 の 数値 について は 、 decimal インスタンス として 調整 さ れ た 指数 を 返し ます
ログ 記録 レベル lvl の テキスト 表現 を 返し ます
上 で 説明 し た コンストラクタ の usage キーワード 引数 で の 規則 に 従っ た 使用 法 の 文字列 を セット し ます
data の crc ( cyclic redundancy check , 巡回 符号 方式 ) チェックサム を 計算 し ます
source を 指し て いる シンボリックリンク を link _name に 作成 し ます
この 関数 は python の インタプリタメインループ ( 別名 、 read -eval -print ループ ) を エミュレート しよ う と する プログラム にとって 役 に 立ち ます
指定 さ れ た フレーム から 抜ける とき に ストップ し ます
現在 の contenthandler を セット し ます
バッファ 中 の データ を 整数 の リスト として 返し ます : >> > memoryview (" abc ") . tolist [ 9 7 , 9 8 , 9 9 ]
トークン の 列 を python ソースコード に 変換 し ます
ファイルオブジェクト が 参照 し て いる ファイル に 指定 し た フラグ を 設定 し ます
unix の select システムコール に対する 直接 的 な インタフェース です
filename で 与え られる ファイル 名 あるい は url に 基づい て 、 ファイル の 型 を 推定 し ます
x が 通常 の 数 なら ば true を 返し ます
リソース id で スプラッシュスクリーン を 開き ます
キュー から 要素 を 取り出し て 削除 し ます
抽象 メソッド を 示す デコレータ です
接続 の 片方 向 、 また は 両方 向 を 切断 し ます
特定 の インデクス を 持つ 属性 を 返し ます
user として 認証 さ れ た もの とし ます
指定 さ れ た ハンドラ hdlr を この ロガー から 取り除き ます
2 ビットグレースケール 画像 を 8ビットグレースケール 画像 へ 変換 し ます
input の 中身 を デコード し た 結果 を output に 出力 し ます
cdata セクション の 開始 時 に 呼び出さ れ ます
findall 関数 と 同様 で 、 コンパイル し た パターン を 使い ます
この 関数 を 使う 場合 、 initscr また は newterm を 呼ぶ 前 に 呼び出さ なく て は なり ませ ん
共有 ライブラリ を プロセス へ ロード し 、 それ を 返し ます
ログレベル 名 を syslog 優先 度名 に 対応 付け ます
必要 なら ブロック し て 、 キュー から 指定 の サンプル 数 を 読み込み ます
fd で 指定 さ れ た ファイル の owner id と group id を 、 uid と gid に 変更 し ます
ソケット が 閉じ た 時 に 呼び出さ れ ます
アーカイブ から メンバー を file -like オブジェクト ( zipextfile ) として 展開 し ます
path _info と query _string 変数 が 無視 さ れる こと を 除け ば request _url に 似 て い ます
tzinfo が none の 場合 、 none を 返し 、 そう で ない 場合 に は self .tzinfo .dst (self ) を 返し ます
文字列 を 使っ て 属性 値 を 設定 し ます
getcomptype を 人 に 判読 可能 な 形 に し た もの です
アクティブ な スレッド の コンテキスト を c に 設定 し ます
pickle 化 さ れ た オブジェクト 階層 を 文字 列 から 読み出し ます
ソース の 場所 ( lineno と col _offset ) を old _node から new _node に 可能 なら ば コピー し 、 new _node を 返し ます
引数 arg は key から message へ の マッピング また は ( key , message ) ペア の イテレート 可能 オブジェクト で なけれ ば なり ませ ん
全て の 入手 可能 な グループエントリ を 返し ます
月 曜日 を 0 、 日曜日 を 6 として 、 曜日 を 整数 で 返し ます
プリフィックス と uri の 名前 空間 の 関連 付け を 終了 し ます
arguments 辞書 が key へ の エントリー を 含ん で いる 場合 、 辞書 edict の エントリー に 見合う 値 に 変換 し ます
指定 さ れ た size バイト ( また は size が 指定 さ れ なけれ ば 現在 の 位置 ) に ストリーム を リサイズ し ます
src を 起点 と し た ディレクトリツリー を コピー し ます
lock の 値 に 依存 する 点 を 除け ば rawvalue と 同様 です
node の 直接 の 子 ノード 全 て を yield します
この メソッド は 、 teardown の 後 、 もしく は 、 setup が 例外 を 投げ た 場合 は setup の 後 に 、 無条 件 で 呼ば れ ます
文字列 を sep の 最後 の 出現 位置 で 区切り 、 3 要素 の タプル を 返し ます
現在 の イベント が 終了 する 列番 号 を 返し ます
month 関数 によって 返さ れる 月 の カレンダー を 出力 し ます
x の コピー の 符号 を 反転 し て 返し ます
guess _type 関数 と 同様 です が 、 オブジェクト に 保存 さ れ た テーブル を 使用 し ます
非同 期 ループ 中 に 呼び出さ れ 、 write イベント の 監視 リスト に 加える か 否か を 決定 し ます
e * * x を 返し ます
a で インデクス が b から c - 1 の スライス 要素 の 値 を シーケンス v に 設定 し ます
数値 で 指定 さ れ た モード mode を もつ ディレクトリ path を 作成 し ます
a で インデクス が b の 要素 の 値 を c に 設定 し ます
浮動 小数 点数 x が 正ま た は 負 の 無限 大 で ある か チェック し ます
与え られ た path に対し て statvfs システムコール を 実行 し ます
ウィジェット の 状態 を 変更 し たり 、 取得 し たり し ます
ファイルオブジェクト と 、 背後 の ファイルポインタ および ファイル 記述子 を 複製 し ます
xml -rpc サーバ が サポート する メソッド 名 (system 以外 ) を 格納 する 文字 列 の リスト を 返し ます
指定 さ れ た key を 作成 する か 開い て 、 ハンドルオブジェクト を 返し ます
この メソッド は frame が コールスタック 中 で botframe より も 下 に ある か チェック し ます
この メソッド は 現在 の トランザクション を コミット し ます
最初 に 現れる value を 削除 し ます
現在 の イベント を 発生 さ せ た 入力 データ を 文字 列 として 返し ます
ディレクトリキャッシュ を リセット し ます
a および b の 間 の 比較 結果 を ( sys .stdout に ) 出力 し ます
記号表 の 名前 を 返し ます
指定 さ れ た ハンドラ hdlr を この ロガー に 追加 し ます
イベント を 待つ
key に対応 する メッセージ の 表現 を 返し ます
sep を 単語 の 境界 として 文字 列 を 単語 に 分割 し 、 分割 さ れ た 単語 から なる リスト を 返し ます
メッセージ 中 に ある すべ て の ヘッダ の フィールド 名 の リスト を 返し ます
要素 が iterable から カウント さ れる か 、 別 の mapping ( や カウンタ ) が 追加 さ れ ます
a で インデクス が b から c - 1 の スライス 要素 を 削除 し ます
指定 さ れ た wsgi アプリケーション 、 app を 実行 し ます
生成 する html ドキュメント の タイトル を セット し ます
quota root により 、 リソース 使用 状況 と 制限 値 を 取得 し ます
左上 の 角 が ( begin _y , begin _x ) にあり 、 幅 ／ 高さ が それぞれ ncols / nlines で ある よう な サブウィンドウ を 返し ます
get *( ) メソッド が 返す の と 同じ ( nchannels ,  sampwidth , framerate , nframes , comptype , compname ) の タプル を 返し ます
この 関数 は 8 ビット 文字 列 と ユニコード 文字 列 の 間 で 変換 する とき に 使わ れる 規則 を 設定 し ます
reference を 可能 な 限り fragment に 一致 さ せよ う とし ます ( fragment は reference より 長く なけれ ば なり ませ ん )
translations インスタンス を domain 、 localedir 、 および languages に 基づい て 生成 し て 返し ます
parsedata _tz が 返す 1 0 要素 の タプル を utc タイムスタンプ に 変換 し ます
ファイル 記述子 fd に対し て 、 行末 文字 の 変換 モード を 設定 し ます
object の 内容 を エンコード し て ストリーム に 書き出し ます
category の ロケール を 標準 設定 に し ます
fullname に 指定 し た モジュール の コードオブジェクト を 返し ます
マルチパートメッセージ の 個々 の パート を 表す 、 mimewriter の 新しい インスタンス を 返し ます
この フォント を 現在 の フォント に 設定 し ます
最後 に 呼び出さ れ た begin _fill の 後 に 描か れ た 図形 を 塗り つぶし ます
キー に対する 、 名前 付け られ て い ない 値 を 文字列 で 取得 し ます
無視 できる 文字 の とき 真 を 返し ます
与え られ た コード と グローバル 変数 を もつ (python ) 関数 を 返し ます
guess _extension 関数 と 同様 です が 、 オブジェクト に 保存 さ れ た テーブル を 使用 し ます
x の 正接 を 返し ます
カバレッジ 結果 を 書き出し ます
現在 の 端末 について 記述 し て いる terminfo の 長形 式 name フィールド が 入っ た 文字列 を 返し ます
プロファイル 出力 の 際 、 任意 の ラベル 名 を 追加 し ます
4 8 ビット の 正 の 整数 として ハードウェアアドレス を 取得 し ます
文字 が 7 ビット ascii 文字 に 合致 する かど う か を 調べ ます
ローカルシステム に おける 記法 で 表さ れ た パス 名 path を 、url における パス 部分 の 形式 に 変換 し ます
apply 組み込み 関数 と 同じ です
サーバ から capability 応答 で 通知 さ れ た 単純 な 拡張 命令 を 許容 ( allow ) します
アプリケーション に エラー や 警告 の ロカール 設定 を 許可 し ます
パーサ が 軽微 な 警告 情報 を アプリケーション に 通知 する ため に 呼び出さ れ ます
再帰 的 な ディレクトリ 削除 関数 です
角度 を 計る 単位 を ラジアン に し ます
属性 名 name の タイプ を 返す
この メソッド は emit の 呼び出し 中 に 例外 に 遭遇 し た 際 に ハンドラ から 呼び出さ れ ます
ユーザー の “ ログイン 名 ” を 返し ます
この ルーチン は コールバック を 登録 し ます
min メソッド に 似 て い ます が 、 比較 は 絶対 値 で 行わ れ ます
パラメタ :x – 数 ( 整数 また は 浮動 小数 点数 ) タートル の 第 一 座標 を x に し ます
生 ( raw ) の トークン を 読み出し ます
一様 の 項目 から なる 可変 長 の list を パック し ます
この メソッド は 開始 タグ tag を 処理 する ため に 呼び出さ れ ます
a = iadd (a , b ) は a + = b と 等価 です
オブジェクト の ソース 行 の リスト と 開始 行番 号 を 返し ます
xml 文書 が スタンドアロン の 文書 として 宣言 さ れ て い ない 場合 に 呼び出さ れ ます
xhdr 命令 を 送信 し ます 、 この 命令 は rfc に は 定義 さ れ て いませ ん が 、 一般 に 広まっ て いる 拡張 です
boolean が true なら ” パッシブモード ” を オン に し 、 そう で ない なら パッシブモード を オフ に し ます
リクエスト が rfc 2 9 6 5 の 定義 に おける 証明 不能 リクエスト で ある かど う か を 返し ます
与え られ た タイプ 、 幅 、 高さ で フォーム を 作り ます
開か れ て いる レジストリキー の 値 を 列挙 し 、 タプル で 返し ます
引数 として 与え た parse ( 上記 参照 ) により 返さ れる field _name を 書式 指定 対象 オブジェクト に 変換 し ます
与え られ た クッキー の ドメイン に対し て 、 そこに クッキー を 返す べき で ない 場合 に は false を 返し ます
ファイル から 次 の 1 行 を 読み出し 、 改行 文字 も 含め て 文字列 を 返し ます
x が 無言 nan で あれ ば true を 返し ます
各 iterable の 要素 を まとめる イテレータ を 作成 し ます
expectedfailure の デコレータ で マーク さ れ た test が 成功 し た 時 に 呼び出さ れ ます
現在 の 行 を 改行 し ます
パス 名 name の tarfile オブジェクト を 返し ます
code が テーブル c . 9 ( タグ 文字 ) かどう か 判定 し ます
cd -rom ドライブ の イジェクトボタン の ロック を 解除 し て 、 ユーザ が cd キャディ を 排出 する の を 許可 し ます
サーバ 上 の ファイル の ファイル 名 fromname を toname へ 変更 し ます
カーソル の 下 に ある 行 を 削除 し ます
ウィンドウ が 最前 面 に なっ た 時 、 スクロールバー の ディム ( dimming )/ ハイライト の 面倒 を みます
名前 空間 モード で 要素 の 開始 を 通知 し ます
xml を writer オブジェクト に 書き込み ます
x の integral ( たい て い 長整 数 ) へ 切り 捨 て られ た real 値 を 返し ます
コメント で 呼び出さ れ ます
オーディオファイル の 次 の nframes 個 の フレーム を 読み込ん で 返し ます
plist ファイル を 読み込み ます
babylmessage インスタンス の オリジナルヘッダ が 変更 さ れ た とき 、 可視 ヘッダ は 自動 的 に 対応 し て 変更 さ れる わけ で は あり ませ ん
ファイル 記述子 fd の 入力 また は 出力 を サスペンド し たり レジューム し たり し ます
x の 逆正 弦 を 返し ます
代替 オブジェクト が 設定 さ れ て いる 場合 、 ungettext を 代替 オブジェクト に 転送 し ます
ソースファイル を バイトコード に コンパイル し て 、 バイトコード の キャッシュファイル に 書き出し ます
水平 スクロールバー と 垂直 スクロールバー を 作成 し ます ( あるい は 破棄 し ます )
インスタンス を リセット し ます
map メソッド の 一種 で 結果 オブジェクト を 返し ます
スキップ し た エンティティ の 通知 を 受け取り ます
エラーメッセージ を 出力 し ます – 上書き する こと が でき ます
ブロックデバイス の 場合 に true を 返し ます
windows 用 : この 関数 は ctypes の 中 で もおそらく 最悪 な 名前 がつけ られ た もの です
指定 し た unicode 文字列 の データ を 使っ て アレイ を 拡張 し ます
トレースバック の 例外 部分 を 書式 化 し ます
シーケンス x を 直接 変更 によって 混ぜ ます
数値 を 表現 する ため の 名前 付き タプル ( named tuple ): ( sign , digittuple , exponent ) を 返し ます
rootobject を path の リソースフォーク の 中 に restype タイプ の リソース として 書き込み ます
name の 名前 を もつ フィールド の すべ て の 値から なる リスト を 返し ます
記号 が グローバル なら ば true を 返し ます
正規 の 辞書 と の 互換 性 を より 高める ため の getheader の 別名 ( alias ) です
digest と 似 て い ます が 、 返さ れる 文字 列 は 倍 の 長さ と なり 、 1 6 進 形式 と なり ます
word は 通常 は ユーザ の パスワード で 、 プロンプト や グラフィカルインタフェース から タイプ 入力 さ れ ます
コマンド を 実行 し て 、 現在 の トレースパラメータ に 基づい て その 実行 から 統計 情報 を 集め ます
シグナル signalnum に対する ハンドラ を 関数 handler に し ます
解凍 オブジェクト に 追加 の データ を 入力 し ます
非名 前空間 モード で 要素 の 終了 を 通知 し ます
フォルダ 内 の メッセージ の ( 番号 の ) リスト を 返し ます
fullname で 指定 さ れ た モジュール が パッケージ の 場合 に true を 返し ます
flag が 真 の 場合 、 デバッグ を オン に し ます
フォルダ 内 の シーケンス から なる 辞書 name : list を 返し ます
doctest の レポートフラグ を セット し ます
システムページ 内 の バイト 数 を 返し ます
文字列 から メッセージオブジェクト 構造 を 作成 し 返し ます
機能 featurename の 現在 の 設定 を 返し ます
ソケット を listen し 、 接続 を 待ち ます
認証 情報 が ある 場合 、 認証 情報 付き で 再度 リクエスト を 試み ます
この 関数 は オプション 引数 として exec 文 に 渡す ファイル 名 を 指定 でき ます
エレメント の 木 を ファイル に xml として 書き込み ます
プロファイラ を 開始 し ます
バッファ が 許容 量 に 達し て いる 場合 に true を 返し ます
パート の 境界 として 使う こと が できる 見込み が 高い ユニーク な 文字列 を 返し ます
バイトコンパイル さ れ た コードファイル として 実装 さ れ て いる モジュール を ロード し て 初期化 し 、 その モジュールオブジェクト を 返し ます
指定 さ れ た ヘッダ の 全て の 値 の リスト を 返し ます
flag を 真に し て 呼び出す と 、 ウィンドウ が 変更 さ れ た 際 は 常 に syncup を 自動 的 に 呼ぶ よう に なり ます
現在 の リクエスト で 使わ れ て いる url スキーム を 返し ます
ファイル を 閉じ ます
パス の 中 の シンボリックリンク ( もしそれ が 当該 オペレーティングシステム で サポート さ れ て いれ ば ) を 取り除い て 、 標準 化 し た パス を 返し ます
非同 期 ループ で 、 書き込み 可能 ソケット が 実際 に 書き込み 可能 に なっ た 時 に 呼び出さ れる
現在 の チャネル の 終了 条件 を 返し ます
format _string を 探査 し 、 タプル 、 ( literal _text , field _name , format _spec , conversion ) の イテラブル を 返し ます
インスタンス を リセット し ます
最大 n 文字 を ストリーム から 読み込み 、 一つ の unicode にし て 返し ます
stdio の ftell と 同様 、 ファイル の 現在 位置 を 返し ます
実行例 の 入っ た テキスト を スクリプト に 変換 し ます
最新 の メッセージ を 取得 し ます
メッセージ 中 に 含まれる 文字 セット の 名前 を すべ て リスト に して 返し ます
数値 を 科学 表記 で 文字列 に 変換 し ます
seq を キー とし 、 value を 値 に 設定 し た 、 新しい 辞書 を 作成 し ます
turtlescreen に (キー ・ イベント を 収集 する ため に ) フォーカス し ます
time .localtime が 返す 形式 の time .struct _time を 返し ます
assertequal で 呼び出さ れる 型特有 の メソッド を 登録 し ます
キー の すべ て の 属性 を レジストリ に 書き込み ます
ポート を 閉じ ます
時間 単位 以上 の delay で イベント を スケジュール し ます
n で 始まる 、 等間 隔 の 値 を 返す イテレータ を 作成 し ます
左上 の 角 が ( begin _y , begin _x ) にあり 、 幅 ／ 高さ が それぞれ ncols / nlines で ある よう な サブウィンドウ を 返し ます
ソケット を address に bind し ます
インスタンス が 名前 つき ヘッダ で ある かど う か を ( 通常 の ヘッダ と 非 リダイレクトヘッダ の 両方 を 調べ て ) 返し ます
端末 が 文字 の 挿入 ／ 削除 機能 を 持つ 場合 に 真 を 返し ます
単一 の グループ group から 説明 文字 列 を 取り出し ます
dbm データベース を 開い て dbm オブジェクト を 返し ます
サンプリングレート を 1 秒 あたり samplerate に 設定 しよ う と 試み 、 実際 に 設定 さ れ た レート を 返し ます
x が 非正 規数 で あれ ば true を 返し ます
この コントロール の controlevent テーブル に エントリ を 作り ます
オープン し た ファイル input から 行 を eof まで 読ん で 、 それら を オープン し た ファイル output に 書き ます
completer 関数 を 取得 し ます
localtime の 逆 を 行う 関数 です
ウィンドウ を クリア し ます
レベル error の メッセージ を ルートロガー で 記録 し ます
ステレオ 音声 データ を モノラル 音声 データ に 変換 し ます
self を 返す だけ です
同じ 時 、 分 、 秒 、 マイクロ 秒 を 持つ time オブジェクト を 返し ます
端末 が 行 の 挿入 ／ 削除 機能 を 持つ か 、 領域 単位 の スクロール によって 機能 を シミュレート できる 場合 に 真 を 返し ます
ファイル 記述子 fd を 持つ ファイル の ディスク へ の 書き込み を 強制 し ます
macos の エラーコード errno の テキスト 表現 を 返し ます
string で 与え られ た 文字列 を 圧縮 し 、 圧縮 さ れ た データ を 含む 文字 列 を 返し ます
msidatabasecommit を 呼び出し て 現在 の トランザクション で 保留 さ れ て いる 変更 を コミット し ます
引数 object は ( 文字列 、 アレイ 、 バッファ と いっ た ) バッファ 呼び出し インタフェース を サポート する オブジェクト で なけれ ば なり ませ ん
指定 さ れ た フィルタ filt を この ハンドラ から 除去 し ます
この 関数 は 、 logging による 警告 の 補足 を 、 有効 に また は 無効 に し ます
stats オブジェクト に 読み込ま れ た データ を 、 ファイル 名 filename の ファイル に 保存 し ます
引数 prompt が 存在 する 場合 、 末尾 の 改行 を 除い て 標準 出力 に 出力 さ れ ます
メインプログラム から 利用 できる 堅牢 性 テスト を 行う cgi スクリプト です
a = idiv (a , b ) は _ _ future __ . division が 有効 で ない とき に a / = b と 等価 です
filename 以外 の 引数 は すべ て オプション で 、 キーワード 引数 形式 で 指定 し なけれ ば なり ませ ん
与え た ロケール 名 を 規格 化 し た ロケールコード を 返し ます
メンバ key 、 value 、 coded _value に 値 を セット し ます
文字列 から plist を 読み取り ます
x の コピー の 符号 を 0 に セット し て 返し ます
最も 最近 開か れ た 開始 タグ の テキスト 部分 を 返し ます
与え られ た モジュール に対する コード を 見つけ て 取っ て き ます
not obj の 結果 を 返し ます
malloc され た ヒープ 領域 を 強制 的 に 消去 さ せ て 、 未使 用 の メモリブロック を オペレーティングシステム に 返し ます
与え られ た 実行 例 が 正しく 動作 し た こと を 報告 し ます
document クラス 内 に おける 同名 の メソッド と 同じ です
python 文字列 の data 全体 を オーディオデバイス に 書き込み ます
multiprocessing を 使用 する プログラム が 固まっ た とき に ウィンドウ を 実行 状態 に する こと を サポート し ます
a で インデクス が b から c - 1 の スライス 要素 を 返し ます
この inputsource の 文字 エンコーディング を セット し ます
パラメタ : angle – 数 ( 整数 また は 浮動 小数 点数 ) タートル を angle 単位 だけ 左 に 回し ます
フォーム に タイマーオブジェクト を 加え ます
fork し ます
データバッファ 中 の 現在 の アンパック 処理 位置 を 返し ます
decode _header によって 返さ れる 2 要素 タプル の リスト から header インスタンス を 作成 し ます
a = imul (a , b ) は a * = b と 等価 です
コンフィギュレーション を 引数 に 取り 、 その コンフィギュレーション に 設定 し ます
オーディオ 入力 から size バイト を 読み だし 、 python 文字 列型 に して 返し ます
obj を json 形式 の str に 直列 化 し ます
s の コピー を 大文字 を 小文字 に 変換 し て 返し ます
現在 の プロセス に 実効 ユーザ id を セット し ます
エラー 処理 関数 error _handler を 名前 name で 登録 し ます
nurbs （ 非均 一有 理b スプライン ） 曲面 を 定義 し ます
cleandoc で クリーンアップ さ れ た 、 オブジェクト の ドキュメンテーション 文字 列 を 取得 し ます
与え られ た 入力 から document を 返し ます
プラットフォーム の c ライブラリ で 定義 さ れ て いる fmod (x , y ) を 返し ます
mailbox の 指定 ステータス 名 の 状態 情報 を 要求 し ます
オブジェクト を 生成 する とき に 指定 し た サーバ に 接続 し ます
メニュー を 表現 する オブジェクト
3行 の メッセージ と ok ボタン の ある ダイアログボックス を 表示 し ます
一つ の メッセージ を 他 の フォルダ の 指定 先 に コピー し ます
モジュール を インポート し ます
キー 値 ch を とり 、 現在 の 端末 タイプ が その 値 の キー を 認識 できる 場合 に 真 を 返し ます
一時ファイル ( temporary file ) を 生成 する 上 で ファイル 名 として 相応しい 一意 な パス 名 を 返し ます
ブラウザ の 種類 name を 登録 し ます
プログラム の 使用 法 と argumentparser に 登録 さ れ た 引数 について の 情報 を 含む ヘルプメッセージ を 表示 し ます
pack _fstring と 同じく 、 固定 長 の 不透明 データストリーム を パック し ます
ポリシー が 許す の で あれ ば 、 与え られ た cookie を 設定 し ます
要素 コンテンツ に 含まれる 無視 可能 な 空白 文字 の 通知 を 受け取り ます
obj を json 形式 の fp ( . write を サポート する ファイル 的 オブジェクト ) への ストリーム として 直列 化 し ます
expat が 文書 型宣 言 < ! doctype .. .) を 解析 し 始め た とき に 呼び出さ れ ます
以前 の add _flowing _data 呼び出し で バッファ さ れ て いる 出力 待ち の 空白 を 、 関連 付け られ て いる writer オブジェクト に 送信 し ます
非 ascii 文字 ( 0x 8 0 また は それ 以上 の 値 ) かどう か を 調べ ます
statvfs のよう に 、 ファイル 記述子 fd に 関連 づけ られ た ファイル が 入っ て いる ファイルシステム に関する 情報 を 返し ます
フォーム を 隠し ます
キャッシュ を クリア し ます
任意 の スタイル 指定 を スタック に プッシュ し ます
ワイブル 分布 です
msg を 基点 と する メッセージオブジェクト 構造 体 の 文字 表現 を 出力 し ます
オブジェクト の コールバック 関数 と 引数 を 設定 し ます
入力 ソースストリーム を 入力 スタック に プッシュ し ます
parse メソッド に 似 て い ます が 、 ファイル など の ストリーム 形式 の かわり に 文字列 を 引数 として とる ところ が 違い ます
指定 さ れ た 名前 の メールボックス に message を 追加 し ます
現在 の プロセス の 制御 端末 に ログイン し て いる ユーザ 名 を 返し ます
argumentparser が コマンドライン から どう 実行 さ れる べきか の 短い 説明 を 表示 し ます
指定 し た ミキサコントロール の ボリューム を 返し ます
match (key , mapname )= = value と なる key を value に対応付ける 辞書 を 返し ます
オブジェクト を 定義 し て いる モジュール を 推測 し ます
一行 データ を 読み ます
この 関数 は with 構文 コンテキストマネージャ の ファクトリ 関数 を 定義 する ため の デコレータ ( decorator ) です
更新 を マーク は し ます が 待機 し ます
この 関数 は c の キャスト 演算子 に 似 て い ます
テキストデータ を エンコード する 方法 を 、 ユーザ の 設定 に 基づい て 返し ます
a = iand (a , b ) は a & = b と 等価 です
指定 し た フレーム と 、 その 外側 の 全 フレーム の フレームレコード を 返し ます
これ まで update で 与え て き た 文字 列入 力 の ダイジェスト を 返し ます
すで に キュー に 入っ て いる データ を 処理 し て 返し ます ( lazy モード )
指定 要素 に namespaceuri と localname で 指定 し た 名前 の 属性 が 存在 し て いれ ば true を 返し ます
メッセージ の content -type ヘッダ 中 の パラメータ param を 文字 列 として 返し ます
rfind と 同様 です が 、 sub が 見つ から なかっ た 場合 valueerror を 送出 し ます
ベル を 鳴ら し ます
バージョン 2 . 0 で 撤廃 : 組み込み 関数 long を 使っ て く ださい
フォーム に カウンタオブジェクト を 加え ます
テスト を 実行 する ため の コマンドラインプログラム
標準 の base 6 4 アルファベット 集合 を もちい て 文字 列 s を デコード ( 復元 ) します
a で インデクス が b の 要素 を 削除 し ます
application として パス 名 を 与え た アプリケーション が スクリプト 可能 で あり そう な 場合 、 真 を 返し ます
デフォルト の datetime .astimezone 実装 で 呼び出さ れ ます
pi エレメント の ファクトリー
find _module を 使っ て ( あるい は 、 互換 性 の ある 結果 を 作り出す 検索 を 行っ て ) 以前 見つけ た モジュール を ロード し ます
x * ( 2 ** i ) を 返し ます
frame から デバッグ を 開始 し ます
メモリー を 除く 全 て の リソース を 解放 し ます
引数 key が db ファイル に キー として 含ま れ て いる 場合 1 を 返し ます
ファイル の モード が ブロック 型 の 特殊 デバイスファイル の 場合 に ゼロ で ない 値 を 返し ます
オブジェクト f に関連付け られ た 実行 例 を テスト し ます
要素 の 終端 を 処理 する ごと に 呼び出さ れ ます
(frame , lineno ) で 指定 さ れ た スタックエントリ に関する 次 の よう な 情報 を 持つ 文字 列 を 返し ます
スクリーン 上 の タートル の リスト を 返し ます
圧縮 形式 を 設定 し ます
quoted -printable 形式 の データ を バイナリ に 変換 し 、 バイナリデータ を 返し ます
x の 全て の 桁 を 反転 さ せ ます
ファイル を ディレクトリ の 現在 の コンポーネント に 追加 し ます
アドレス を パーズ し ます
( おそらく pack (fmt , ... ) で パック さ れ た ) 文字列 データ を 与え られ た 書式 に 従っ て アンパック し ます
バイナリ を hexbin 4 エンコード し て ascii 文字列 に 変換 し 、 変換 後 の 文字列 を 返し ます
文字列 また は 数値 を 浮動 小数 点数 に 変換 し ます
ユーザ が 与え た データ を デリミタ で 区切 られ た 文字列 に 変換 し 、 与え られ た ファイルオブジェクト に 書き込む ため の writer オブジェクト を 返し ます
パス 名 path を ペア ( unc , rest ) に 分割 し ます
属性 name の 値 を 返す
a = iconcat (a , b ) は 二つ の シーケンス a と b に対し a + = b と 等価 です
urlparse が 返す よう な 形式 の タプル から url を 構築 し ます
cab ファイル を 作り 、 msi ファイル に ストリーム として 追加 し 、 media テーブル に 送り込み 、 作っ た ファイル は ディスク から 削除 し ます
ある オブジェクト の doctest を スクリプト に 変換 し ます
指定 さ れ た 年 の データ を 整形 に 向く形 で 返し ます
プレーヤーオブジェクト と 関連 付け られ た リソース を 解放 し ます
sort 命令 は search に 結果 の 並べ 替え ( sort ) 機能 を つけ た 変種 です
ratio の 上界 を 、 より 高速 に 計算 し ます
この メソッド は ある タグ 要素 の 終了 タグ を 処理 する ため に 呼び出さ れ ます
すで に インポート さ れ た module を 再解 釈 し 、 再初 期化 し ます
com メソッド を 呼び出す 外部 関数 を 返し ます
サンプリングレート を 返し ます
text の 各行 に対し 、 共通 し て 現れる 先頭 の 空白 を 削除 し ます
シェルフ が writeback を true に セット し て 開か れ て いる 場合 に 、 キャッシュ 中 の 全て の エントリ を 書き戻し ます
オブジェクト object を 保護 し 、 オブジェクト に対する 要塞 オブジェクト を 返し ます
実 uid /gid を 使っ て path に対する アクセス が 可能 か 調べ ます
putch の ワイド 文字 列版
year 年 month 月 に対する itermonthdates と 同じ よう な イテレータ を 返し ます
記号 が その ブロック の 中 で 使わ れ て いれ ば true を 返し ます
新しい バイト の 配列 を 返し ます
ファイル 選択 ダイアログ を 表示 し ます
与え られ た フォーマット に 対応 する 構造 体 の サイズ ( すなわち 文字 列 データ の サイズ ) を 返し ます
バッファ の 全内 容 を 保持 し た bytes を 返し ます
実行 中 の フレーム と 処理 中 の 例外 が 発生 し た フレーム の 間 の フレームレコード の リスト を 返し ます
その メッセージ 中 の content -disposition ヘッダ に ある 、 filename パラメータ の 値 を 返し ます
それぞれ の 要素 を 、 その カウント 分 の 回数 だけ 繰り返す イテレータ を 返し ます
ストリーム が 保持 し て いる ファイル 記述子 ( 整数 値 ) が 存在 する 場合 は それ を 返し ます
指数 e ** x を 返し ます
リクエスト に 新た な ヘッダ を 追加 し ます
タートルウィンドウ の 高さ を 返し ます
コマンドライン に テキスト を 挿入 し ます
クラス 内 に 定義 さ れ た テスト が 実行 さ れ た 後 に 呼び出さ れる クラスメソッド です
引数 が iterable だけ の 場合 、 空 で ない シーケンス ( 文字列 、 タプル また は リスト ) の 要素 の うち 最小 の もの を 返し ます
標準化 さ れ た ファイル 名 を 取得 する ため の 補助 関数
パラメタ : n – 非負 整数 delay – 非負 整数 タートル の アニメーション を オン ・オフ し 、 描画 更新 の 遅延 を 設定 し ます
code が テーブル c . 4 ( 非文字 コード 点 : non -character code points ) かどう か 判定 し ます
locale を 指定 する 場合 、 文字列 、 ( language code , encoding ) 、 から なる タプル 、 また は none を とる こと が でき ます
ファイル src を ファイル また は ディレクトリ dist へ コピー し ます
x の 逆正 接 を 返し ます
実行 例 から 実際 に 得られ た 出力 ( got ) と 、 期待 する 出力 ( want ) が 一致 する 場合 に のみ true を 返し ます
呼び出し元 の フレームオブジェクト を 返し ます
field の 値 を 可能 なら 整数 として 返し ます
buf 中 の python ソースコード から 得 られ た 抽象 構文木 ast を 返し ます
一年分 の カレンダー を html の テーブル として 返し ます
シーケンスオブジェクト subelements から 0 個 以上 の サブエレメント を 追加 し ます
tzinfo が none の 場合 、 none を 返し 、 そう で ない 場合 に は self .tzinfo .utcoffset (self ) を 返し ます
スイート 内 の テスト を 実行 し 、 結果 を result で 指定 し た 結果 オブジェクト に 収集 し ます
サーバ に quit コマンド を 送信 し 、 接続 を 閉じ ます
文字列 の 書式 操作 を 行い ます
この ジェネレータ 関数 は 、 コードオブジェクト code の co _firstlineno と co _lnotab 属性 を 使い 、 ソースコード 内 の 行 が 始まる 場所 で ある オフセット を 求め ます
グラフィックモード を 設定 し ます
ファイル ・ ポインタ の 現在 位置 を 返し ます
オブジェクト の 持つ doctest を デバッグ し ます
オフセット src から 始まる count バイト を インデックス dest の 位置 へ コピー し ます
a - b を 返し ます
コードオブジェクト を 逆アセンブル し ます
型名 に 基づく 名前 を もつ メソッド として 、 特定 の 型 に対する 書式 化 メソッド は 実装 さ れ ます
先頭 文字 だけ 大文字 に し た word の コピー を 返し ます
全て の フォルダ を 列挙 し ます
オブジェクト の ソースコード を 返し ます
比較 さ れる 2つ の 文字列 を 設定 し ます
which 番 の メッセージ 全体 を 取り出し 、 その メッセージ に 既読 フラグ を 立て ます
代替 オブジェクト が 設定 さ れ て いる 場合 、 ngettext を 代替 オブジェクト に 転送 し ます
共有 メモリ から 割り 当て られ た ctypes オブジェクト obj を コピー し た オブジェクト を 返し ます
デバッグレベル が > 0 の とき 、 デバッグ 用 の メッセージ を 出力 し ます
スクラップ について 現在 の 情報 を 返し ます
読み出し 待ち の 打鍵 イベント が 存在 する 場合 に 真 を 返し ます
レベル critical の メッセージ を ルートロガー で 記録 し ます
演算 対象 の msd の 大きさ の 指数 部 を 返し ます
ソケット を address に バインド し ます
イテラブル tests に 含まれる 全 て の testcase 又 は testsuite の インスタンス を スイート に 追加 し ます
http リクエスト を 送り ます
上述 の よう な 方法 で ロールオーバ を 行い ます
終了 時 に 実行 さ れる 関数 として func を 登録 し ます
処理 命令 の 通知 を 受け取り ます
メモリ 内 の ファイル ・ ポインタ の 現在 位置 に string の バイト 列 を 書き込み ます
この 関数 は 呼び出さ れ た 時点 から の スタックトレース を 出力 し ます
パラメタ に 渡し た 2 つの データ を 加算 し た 結果 を 返し ます
標準 の base 6 4 アルファベット 集合 を もちい て 文字 列 s を エンコード ( 符号化 ) します
パネル を スタック の 最上 層 に プッシュ し ます
req で 表さ れる ファイル を ftp 越し に オープン し ます
指定 さ れ た object の 属性 を 返し ます
現在使 う こと の できる 全 て の タートル の 形 の リスト を 返し ます
境界 文字列 を スタック に プッシュ し ます
iterable のいずれか の 要素 が 真なら ば true を 返し ます
システム の デフォルトnis ドメイン を 返し ます
ファイル 記述子 fd に ブレーク を 送信 し ます
x の y 乗 を 計算 し ます
生成 する html ドキュメント の 本文 を セット し ます
この 関数 は read と 同じ です が 、 x および y の サイズ に スケール さ れ た 画像 を 返し ます
domain を ロケール 辞書 localedir に 結び付け ( bind ) ます
整数 に 変換 さ れ た a を 返し ます
メール を 送信 し ます
x の 1 0 を 底と し た 対数 ( 常用 対数 ) を 返し ます
コールスタック から フレームオブジェクト を 取得 し ます
平文 データ 接続 を セットアップ し ます
test が スキップ さ れ た 時 に 呼び出さ れ ます
マシン が サポート し て いれ ば 、 ファインダ に macintosh を スリープ さ せる よう 命令 し ます
erase に 似 て い ます が 、 次 に refresh が 呼び出さ れ た 際 に 全て の ウィンドウ を 再描 画 する よう に し ます
新 た な アクション を パイプライン の 末尾 に 追加 し ます
一時的 な 記憶 領域 として 使う こと が できる ファイルライク ( file -like ) オブジェクト を 返し ます
パーサ が 回復 不能 な エラー を 検知 する と 呼び出さ れ ます
現在 の プロセス id を 返し ます
mimeメッセージ に 新しい ヘッダ 行 を 追加 し ます
emin - prec + 1 に 等しい 値 を 返し ます
ms ミリ 秒 スリープ し ます
ガンマ 分布 です
新た な 開か れ た フォルダオブジェクト を 返し ます
format _list (extract _tb (tb , limit )) の 省略 表現
与え られ た ユーザ 名 に 対応 する シャドウパスワードデータベース の エントリ を 返し ます
バージョン 2 . 0 で 撤廃 : 組み込み 関数 float を 使っ て く ださい
uuid を 名前 空間 識別子 （ これ は uuid です ） と 名前 （ 文字列 です ） の md5 ハッシュ から 生成 し ます
iterable 中 の 値 の 浮動 小数 点数 の 正確 な 和 を 返し ます
リダイレクト さ れ た リクエスト に は 追加 さ れ ない ヘッダ を 追加 し ます
レベル を 設定 し て 、 handler インスタンス を 初期化 し ます
raw モード から 離れ ます
ファイル 記述子 fd の 端末 属性 を attributes から 取り出し て 設定 し ます
シンプル な コマンド 文字列 を サーバ に 送信 し て 、 受信 し た 文字列 を 返し ます
生成 する html ドキュメント の 名前 を セット し ます
python 値 x を 変換 し た 値 を 保持 する aedesc オブジェクト を 返し ます
ロギングシステム に対し て 、 バッファ の フラッシュ を 行い 、 すべて の ハンドラ を 閉じる こと で 順次 シャットダウン を 行う よう に 告知 し ます
オーディオ の サンプルサイズ を バイト 数 で 設定 し ます
ウィンドウ を 閉じる とき に 特別 な 処理 を する 場合 は この メソッド を オーバーライド し ます
itertools .imap と 同じ です
getcomptype を 人 に 判読 可能 な 形 に し た もの です
datetime オブジェクト dt に対応 する タイムゾーン 名 を 文字列 で 返し ます
平方根 を 精度 いっぱい まで 求め ます
ファイルディスクリプタ ( ファイルオブジェクト の fileno で 返る 整数 ) fd を 複製 し て 、 ソケットオブジェクト を 構築 し ます
現在 の オペレーティングシステム を 特定 する 情報 の 入っ た 5 要素 の タプル を 返し ます
サーバ へ の 接続 に 使わ れ て いる ソケットインスタンス を 返し ます
この メソッド と next メソッド を 使っ て 、 データベース の 全て の キー / 値 の ペア にわたっ て ループ 処理 を 行え ます
代替 オブジェクト が 設定 さ れ て いる 場合 、 gettext を 代替 オブジェクト に 転送 し ます
オブジェクト が モジュール の 場合 は 真 を 返し ます
デフォルト の content -type を 返し ます
現在 の カーソル の ポジション か 、 引数 が 指定 さ れ た 場合 は ( y , x ) から 、 num 文字 の 属性 を 設定 し ます
イテレータ 化可 能 な 引数 iterable から 得 られる 要素 を deque の 右側 に 追加 し 拡張 し ます
この コントロール の controlcondition テーブル に エントリ を 作り ます
出力 に 水平 罫線 を 挿入 し ます
メッセージ 全体 の オブジェクト の ペイロード を payload に 設定 し ます
ディスプレイ を 即時 更新 し ( 現実 の ウィンドウ と これ まで の 描画 ／ 削除 メソッド の 内容 と の 同期 を とり ) ます
新た な 要素 ノード を 生成 し て 返し ます
購読 し て いる メールボックス 名 の うち 、 ディレクトリ 内 で パターン に マッチ する もの を 列挙 し ます
音声 データ 全 サンプル の 絶対値 の 最大 値 を 返し ます
最大 n 行 まで の コンテクスト を 含む グループ を 生成 する よう な 、 ジェネレータ ( generator ) を 返し ます
ファイル 記述子 fd の 現在 の 位置 を pos に 設定 し ます
code が テーブル d . 2 ( 双方向 プロパティ “ l ” を 持つ 文字 ) かどう か 判定 し ます
サーバ へ の 安全 な 接続 に 使わ れる sslobject インスタンス を 返し ます
dom と の 内部 的 な 参照 を 破壊 し て 、 循環 参照 ガベージコレクション を 持た ない バージョン の python でも ガベージコレクション さ れる よう に し ます
コマンド の 先頭 の 語 が 認識 さ れ ない とき に 、 入力 行 に対し て 呼び出さ れ ます
datetime オブジェクト を 返し ます
リスト x を インプレース 処理 し 、 線形 時間 で ヒープ に 変換 し ます
flags で 指定 さ れ た フラグ を セット し て 、 他 の フラグ は 下ろ し ます
path の 所有 者 ( owner ) id と グループ id を 、 数値 uid および gid に 変更 し ます
現在 の テーマ に 定義 さ れ て いる 要素 の リスト を 返し ます
flags で 指定 さ れ た フラグ を セット し ます が 他 の フラグ は 変え ませ ん
fd ( open が 返す 開か れ た ファイル 記述子 ) で 与え られる 端末 に 関連 付け られ た プロセスグループ を 返し ます
現在 の 作業 ディレクトリ を 表現 する 文字 列 を 返し ます
この メソッド は 、 フォーマッタ が 書式 化 さ れ た 時間 を 利用 し たい 際 に 、 format から 呼び出さ れ ます
以前 の import 機構 に 戻し ます
値へ の 弱参 照 の リスト を 返し ます
シーケンス 中 の x の 出現 回数 を 返し ます
a is not b を 返し ます
ウィンドウ に 関連 付け られ て いる 全て の データ を 与え られ た ファイルオブジェクト に 書き込み ます
other に 含まれる 要素 を 取り除き 、 set を 更新 し ます
引数 で コマンド を 実行 し 、 その 出力 を バイト 文字 列 として 返し ます
x の 平方根 を 返し ます
再 結合 さ れ た 形 で 元 の url の 文字列 を 返し ます
共有 namespace オブジェクト を 作成 し て 、 その プロキシ を 返し ます
全て の 下位 要素 ( 直接 の 子要 素 、 子要素 の 子要 素 、 等 ) から 、 特定 の 要素 型名 を 持つ もの を 検索 し ます
* .py ファイル を 探し 、 *. py ファイル に 対応 する ファイル を アーカイブ に 追加 し ます
filename の lineno に ある すべ て の ブレークポイント を 返し ます
エラー を 発生 し ます
environ を テスト 用 に 自明 な デフォルト 値 で 更新 し ます
新 た な hmac オブジェクト を 返し ます
現在 の 段落 に データ が 予期 せ ず 追加 さ れ た こと を formatter に 知ら せ ます
データベース の 順方 向探 索 に おい て 、 次 の より も 後 に 来る キー / 値 の ペア を 返し ます
生成 する html ドキュメント の タイトル を セット し ます
この 入力 ソース の バイトストリーム を 取得 し ます
現在 の unicode 処理 の デフォルトエンコーディング 名 を 設定 し ます
遠隔 の サーバ から size バイト 読み出し ます
ctypes 型 もしく は インスタンス の メモリバッファ の サイズ を バイト 単位 で 返し ます
rfc 2 8 2 2 準拠 形式 の message -id ヘッダ に 適し た 文字列 を 返し ます
base 1 6 をつかっ て 、 文字列 を デコード ( 復元 ) します
再生 中 なら cd を 一時 停止 し 、 一時 停止 中 なら 再生 し ます
domain が クッキー を 授受 する ホワイトリスト に 載っ て いる かど う か を 返し ます
1 4 文字 以下 に なる よう に 切り 詰め られ た 環境 変数 term の 値 を 返し ます
値 v 1 , v 2 , ... が 与え られ た フォーマット で 含ま れる 文字 列 データ を 返し ます
ブロック あり 、 また は ブロック なし で ロック を 獲得 し ます
ユーザ に 文字 列値 の 入力 を 促す モーダルダイアログ を 表示 し ます
c 言語 による 実行 時 システム に おける ファイル 記述子 fd に 基づい て 、 ファイル の 一部 に ロック を かけ ます
現在 の フォルダ 名 を 返し ます
パネル に 関連 付け られ た ウィンドウ を win に 変更 し ます
id resid の dlog リソース から ダイアログウィンドウ を 作成 し ます
(y , x ) から 始まり 、 n の 長さ を 持つ 、 文字 ch で 作られる 垂直線 を 表示 し ます
tix は tix _getimage と tix _getbitmap メソッド が 画像 ファイル を 検索 する ディレクトリ の リスト を 保持 し て い ます
ログ 記録 向け に 書式 化 さ れ た 、 現在 の 日付 および 時刻 を 返し ます
新しい ブレークポイント を 設定 し ます
バージョン 2 . 7 で 撤廃 : 代わり に isinstance (x , collections .sequence ) を 使っ て 下さい
ファインダ に 、 マシン を 適切 に シャットダウン する よう 命令 し ます
出力 に ms ミリ 秒 の 一時 停止 を 入れ ます
文字列 cmd を os .popen を 使い シェル 上 で 実行 し 、 タプル ( status , output ) を 返し ます
この 場所 で ブレーク する 必要 が ある かど う か を 、 ブレークポイント b が 設定 さ れ た 方法 に 依存 する 方法 で チェック し ます
rfc 2 2 3 1 に 従っ て パラメータ の リスト を デコード し ます
ログ 記録 向け に 書式 化 さ れ た 、 クライアント の アドレス を 返し ます
指定 さ れ た ファイルシステム 上 の 場所 に ある コード を 実行 し て 、 結果 として その モジュールグローバル 辞書 を 返し ます
section という 名前 の セクション を インスタンス に 追加 し ます
filename の lineno 行 に ある ブレークポイント を 削除 し ます
path が 存在 する 正しい ファイル なら 、 true を 返し ます
自分 が 使い たい python の 型 type を sqlite が サポート し て いる 型 に 変換 する 呼び出し 可能 オブジェクト ( callable ) を 登録 し ます
書き込み 可能 な value 属性 を 作成 し て 、 その プロキシ を 返し ます
der エンコード さ れ た バイト 列 として 与え られ た 証明 書 から 、 pem エンコード さ れ た バージョン の 同じ 証明 書 を 返し ます
生存 中 の thread オブジェクト の 数 を 返し ます
与え られ た bytes また は bytearray オブジェクト b を 生ストリーム に 書き込み 、 書き込ん だ バイト 数 を 返し ます
メッセージ の “ info ” を 含む 文字 列 を 返し ます
2つ の シーケンス が 等しい こと を テスト し ます
パラメタ : width – 正の 数 線 の 太さ を width に する か 、 また は 現在 の 太さ を 返し ます
一時的 に envvar を アンセット し ます
ファイルオブジェクト は それ 自身 が イテレータ です
バージョン 2 . 7 で 撤廃 : element .iter メソッド を 使っ て く ださい
スレッドセーフ で ない 背後 の i /o 機能 に対する アクセス を 直列 化 する ため に 用い られる スレッドロック ( thread lock ) を 初期化 し ます
http _error _ 3 0 1 と 同じ です が 、’ see other ’ レスポンス に対し て 呼び出さ れ ます
親ウィンドウ 中 に おける ウィンドウ の 開始 位置 を x と y の 二つ の 整数 で 返し ます
直列化 さ れ た fp ( . read を サポート する ファイル 的 オブジェクト で json 文書 を 収め た もの ) の 内容 を python オブジェクト に 戻し ます
現在 sysconfig で サポート さ れ て いる 全て の パス 名 を 格納 し た タプル を 返し ます
ウィンドウ の 左上 角 が ( new _y , new _x ) に なる よう に 移動 し ます
gmtime や localtime が 返す 時刻 値 タプル 又 は struct _time を 、 format で 指定 し た 文字 列形 式 に 変換 し ます
この メソッド は start _tag メソッド が 定義 さ れ て い ない 開始 タグ tag を 処理 する ため に 呼び出さ れ ます
ブロック を 起こ さず に ハードウェア の 再生 キュー に 書き込める サンプル 数 を 返し ます
この メソッド は コメント に 遭遇 し た 場合 に 呼び出さ れ ます
この importmanager を 指定 さ れ た 名前 空間 に インストール し ます
認証 命令 です — 応答 の 処理 が 必要 です
属性 名 propertyname に 値 value を セット し ます
フォーム に ダイアルオブジェクト を 加え ます
指定 さ れ た ファイル に 関係 する システム 設定 情報 を 返し ます
パーザ に コールバック を 加え ます
その 呼び出し が 完了 し て いる かど う か を 返し ます
パーザ が 認識 でき ない sgml 宣言 を 読み出し た 際 に 呼び出さ れる メソッド です
テストオブジェクト に 含まれる テスト の 数 を 返し ます
チャンネル 数 を 設定 し ます
border と 同様 です が 、 ls および rs は 共に vertch で 、 ts および bs は 共に horch です
名前 が folder で ある フォルダ を 作り 、 それ を 表わす maildir インスタンス を 返し ます
メッセージ 中 に ある すべ て の ヘッダ の フィールド 名 と その 値 を 2 - タプル の リスト として 返し ます
wifexited (status ) が 真 の 場合 、 exit ( 2 ) システムコール に 渡さ れ た 整数 パラメタ を 返し ます
message _set で 指定 し た メッセージ 群 を new _mailbox の 末尾 に コピー し ます
ロック の 状態 を 返し ます : 同 じ スレッド によっ て 獲得 さ れ た もの なら true 、 違う の なら false を 返し ます
全て の 既存 の テーマ の リスト を 返し ます
文字列 を インスタンス の 新しい 時間 を 示す 値 として 指定 し ます
チャンネル 数 を 設定 し ます
msiviewclose を通し て ビュー を 閉じ ます
文字 データ の 通知 を 受け取り ます
x 座標 が x の 位置 に ある セル の データカラム の 識別子 を 返し ます
ペイロード の 文字 セット を charset に 変更 し ます
入力 iterable の 要素 から なる 長さ r の 部分 列 を 返し ます
バッファ に 蓄積 さ れ て いる 出力 データ や デバイス 制御 イベント を フラッシュ し ます
n 3f と v 3f の 呼び出し に 相当 し ます が 、 それら より も 速い です
指定 さ れ た 名前 の ロガー を 返し ます
コードポイント を str の 値 に 変換 し ます
応答 ヘッダ を 送信 し 、 受理 し た リクエスト を ログ 記録 し ます
ストリーム に 複数 行書 き 込み ます
カプセル 化 し た 例外 オブジェクト また は none を 返し ます
データベース の 背後 に ある ファイル を 閉じ ます
ファイル 記述子 を fd から fd2 に 複製 し 、 必要 なら 後者 の 記述子 を 前もっ て 閉じ て おき ます
cmd を 子プロセス として 実行 し ます
キューサイズ を 返し ます
サーバ へ コマンド cmd を 送信 し ます
子 ノード を これら が 出 て き た 順 で 平ら な リスト 形式 に して 返し ます
item の 1 つ 上 の 兄弟 の 識別子 を 、 item が 親 にとって 一番上 の 子供 だっ た 場合 ‘ ’ を 返し ます
現在 の アンパック 処理 用 データバッファ を 文字列 で 返し ます
ソケット が 接続 し て いる リモートアドレス を 返し ます
共有 メモリ から 割り 当て られ た ctypes オブジェクト を 返し ます
新しい control オブジェクト を 返し ます
ファイル 記述子 を ポーリングオブジェクト に 登録 し ます
全て の ( 残り の ) クエリ 結果 の row を フェッチ し て 、 リスト を 返し ます
urlparse に 似 て い ます が 、 url から params を 切り離し ませ ん
インスタンス の デバッグレベル を 指定 し ます
rfc 8 2 2 形式 の ヘッダ を サーバ に 送り ます
class が classinfo の ( 直接 また は 間接 的 な ) サブクラス で ある 場合 に 真 を 返し ます
マッチ の 、 すべて の 名前 つき の サブグループ を 含む 、 サブグループ 名 で キー 付け さ れ た 辞書 を 返し ます
サーバ へ の 接続 を 遮断 し ます
全て の records を database の table テーブル に 追加 し ます
digest に 似 て い ます が 、 ダイジェスト は 長さ 3 2 の 文字列 に なり 、 1 6 進表 記文 字し か 含み ませ ん
オーディオフレーム を 書き込ん で nframes を 修正 し ます
ブロック の 中 で * を 使っ た from -import が 使わ れ て いる なら ば true を 返し ます
オーディオファイル に 書き込ま れる フレーム 数 を 設定 し ます
新しい フォルダ を 生成 し ます
マウスカーソル を 時計 型 に 設定 し ます
この メソッド は source オブジェクト の 読み出し 可能 バッファ を コピー する こと で 、 ctypes の インスタンス を 生成 し ます
cls クラス の 基底 クラス ( cls 自身 も 含む ) を 、メソッド の 優先 順位 順 に 並べ た タプル を 返し ます
ペイロード を quoted -printable 形式 に エンコード し 、 content -transfer -encoding ヘッダ を quoted -printable [ 1 ] に 設定 し ます
これ は print _exception (sys .exc _type , sys .exc _value , sys .exc _traceback , limit , file ) の 省略 表現 です
mailbox と 名づけ られ た 新 た な メールボックス を 生成 し ます
iterable で 定義 さ れる データセット の うち 、 最大 値 から 降順 に n 個 の 値 の リスト を 返し ます
pathname に 指定 し た ファイル の 内容 を 解析 し ます
load に 似 て い ます が 、 実際 に は 何 も オブジェクト を 生成 し ない という 点 が 違い ます
cmdloop が 戻る 直前 に 一度 だけ 実行 さ れる フックメソッド
母集団 の シーケンス から 選ば れ た 長さ k の 一意 な 要素 から なる リスト を 返し ます
msirecordsetstring を通し て field を value に セット し ます
修飾名 の 値 を 返す
quit 命令 を 送信 し 、 接続 を 閉じ ます
name という 名前 の フリーズ さ れ た モジュール を 初期化 し 、 モジュールオブジェクト を 返し ます
x の 極座 標表 現 を 返し ます
サンプル の フォーマット を 設定 し ます
この ブレークポイント を 有効 に し ます
text ( 文字列 ) 内 の 段落 を 一つ だけ 折り返し を 行い ます
現在 の contenthandler を 返し ます
記号 が その ブロック に対し て ローカル なら ば true を 返し ます
修飾名 name に対応 する ( namespace , localname ) の ペア を 返す
コンピュータ の ネットワーク 名 を 返し ます
robots .txt ファイル を 最後 に 取得 し た 時刻 を 現在 の 時刻 に 設定 し ます
仮想 スクリーン に おける 現在 の カーソル 位置 を y および x の 順 で 返し ます
path の 所有 者 ( owner ) id と グループ id を 、 数値 uid および gid に 変更 し ます
引数 function は 呼び出し が できる オブジェクト ( ユーザ 定義 および 組み込み の 関数 また は メソッド 、 また は クラスオブジェクト ) でなけれ ば なり ませ ん
pre _input _hook 関数 を 設定 また は 除去 し ます
メソッド の 呼び出し を type の 親ま た は 兄弟 クラス に 委譲 する 、 プロキシオブジェクト を 返し ます
python 3 . x で 廃止 予定 について の 警告 を 発生 さ せ ます
文字列 を コピー し 、 大文字 は 小文字 に 、 小文字 は 大文字 に 変換 し て 返し ます
iterable から 要素 を 取り出し 、 アレイ の 末尾 に 要素 を 追加 し ます
プロセス を 生成 し て 制御 端末 を 現在 の プロセス の 標準 入出 力 に 接続 し ます
パス 名 full の ファイル を cab ファイル に logical という 名 で 追加 し ます
この クラスメソッド は float で ある flt の 正確 な 値 を 表す fraction を 構築 し ます
rgb から yiq に 変換 し ます
(get _field が 返す ) 値 を 、 与え られ た conversion 型 に ( parse が タプル を 返す よう に ) 変換 し ます
play と 似 て い ます が 、 トラック の 終わり で 再生 を 停止 し ます
文字 参照 を 文字列 に 変換 する か 、 none を 返し ます
再帰 的 に ファイル や ディレクトリ を 別 の 場所 へ 移動 し ます
アクセス が 特殊 化 さ れる 必要 が ある i /o が 下に ない ので 、 この メソッド は ロック に対し て none を 返し ます
アプリケーション に ドキュメント ・ イベント の 発生 位置 を 通知 する ため に パーサ から 呼び出さ れ ます
yes が 1 の 場合 、 ある 種 の キー ( キーパッド や ファンクションキー ) によっ て 生成 さ れ た エスケープシーケンス は curses で 解釈 さ れ ます
例外 情報 と traceback から limit まで の スタックトレース 項目 を file へ 出力 し ます
直列化 さ れ た s ( str また は unicode インスタンス で json 文書 を 含む もの ) を python オブジェクト に 戻し ます
データベース の 逆方 向探 索 に おい て 、 手前 に 来る キー / 値 の ペア を 返し ます
data の チャンク を 処理 し ます
shutdown を 呼ば れる まで 、 リクエスト を 処理 し 続け ます
signal シグナル を 子 プロセス に 送り ます
itertools .ifilter と 同じ よう に 動作 し ます
指定 し た id （ 1 以上 ）、 位置 、 名称 で マーク を 加え ます
put (item , false ) と 等価 です
コンボボックス の 値 を value に 設定 し ます
cursor メソッド は オプション 引数 cursorclass を 受け 付け ます
生 の デバイス 番号 から 、 デバイス の マイナー 番号 を 取り出し ます
エラーメッセージ を 出力 し ます – 上書き する こと が でき ます
現在 の メッセージ 番号 を 返し ます
フォーム を アクティベート し ます
path が 存在 する なら 、 true を 返し ます
現在 の テスト で テストクラス もしく は setup を スキップ する 場合 に 呼ば れ ます
この クラスメソッド は counter オブジェクト に は 実装 さ れ て いませ ん
相互 排他 グループ を 作り ます
値域 [ 0 . 0 , 1 . 0 ) の 次 の ランダム な 浮動 小数 点数 を 返し ます
ど の ファイル を 開く か を ユーザ に 尋ねる ダイアログ を 表示 し 、 ユーザ が 選択 し た ファイル を 返し ます
文字列 から 要素 を 追加 し ます
水平 罫線 を 出力 デバイス に 表示 し ます
現在 の グローバルドメイン を 調べ たり 変更 し たり し ます
最後 に プッシュ さ れ た 入力 ソース を 入力 スタック から ポップ し ます
標準 c の memset ライブラリ 関数 と 同じ もの です
windows 用 : 呼び出し 側 の スレッド 内 で windows によっ て 設定 さ れ た 最新 の エラーコード を 返し ます
item の 子要素 の リスト を 返し ます
文字列 を コピー し 、 オプション 引数 の 文字列 deletechars の 中 に 含まれる 文字 を 全て 除去 し ます
サーバ に 空行 を 送り 、 ヘッダ 部 が 終了 し た こと を 通知 し ます
与え られ た style で の ウィジェット の レイアウト を 定義 し ます
文字列 また は 数値 を 通常 の 整数 に 変換 し ます
この 関数 は obj を 指す新しい ポインタインスタンス を 作成 し ます
順序 付き 辞書 の popitem メソッド は 、( key , value ) 対 を 返し て 消去 し ます
現在 の パネル の 上 に ある パネル を 返し ます
testcase 又 は testsuite の インスタンス を スイート に 追加 し ます
ガベージコレクション の 閾値 （ 検出 頻度 ） を 指定 し ます
正規 表現 の リスト の うちどれ か 一つ に マッチ する まで データ を 読み ます
yes が 1 の 場合 、 エスケープシーケンス は タイムアウト し なく なり ます
この メソッド は 、 stop _here か break _here が true を 返し た とき に 、 dispatch _line から 呼び出さ れ ます
row パラメタ を 現在 の 表現 形式 に 基づい て 書式 化 し 、 writer の ファイルオブジェクト に 書き込み ます
サンプルサイズ を バイト 数 で 返し ます
システム の cpu 数 を 返し ます
サーバ の コンストラクタ によって 呼び出さ れ 、 サーバ を 活動 状態 に し ます
いくつか 複数 の ソースファイル を コンパイル し ます
find と 同じ です が 、 部分 文字 列 が 見つ から なかっ た とき に valueerror を 送出 し ます
バイトコンパイル さ れ た コードファイル (. pyc ファイル ) を 認識 する ため に 使わ れる マジック 文字 列値 を 返し ます
子 プロセス を fork します
プラットフォーム の api から 関数 playsound を 呼び出し ます
認証 情報 が ある 場合 、 認証 情報 付き で 再度 リクエスト を 試み ます
エレメント subelement を この エレメント の 内部 に ある サブエレメント の リスト の 最後 に 追加 し ます
ユーザ 定義 の 集計 関数 を 作成 し ます
テキスト を パーザ に 入力 し ます
範囲 (y 1 ... y2 ) 指定 さ れ た 期間 の 閏年 の 回数 を 返し ます
プロセス pid に シグナル sig を 送り ます
code が テーブル c . 2 . 2 ( 非 ascii 制御 文字 ) かどう か 判定 し ます
object の フォーマット 化 し た 表現 を 返し ます
item を parent の 子要素 リスト の index の 位置 に 移動 し ます
アプリケーション で メニュー を 使う 必要 が ある 場合 、 この メソッド を オーバーライド し ます
fileinput クラス の インスタンス を 作り ます
全て の フォルダ 名 の リスト を 返し ます
emax - prec + 1 に 等しい 値 を 返し ます
利用 可能 な フォント 名 の リスト を 返し ます
全て の テスト が 実行 さ れる 前 に 一度 だけ 実行 さ れ ます
code が テーブル d . 1 ( 双方向 プロパティ “ r ” また は “ al ” を 持つ 文字 ) かどう か 判定 し ます
フレームレート を 設定 し ます
selop が 指定 さ れ なかっ た 場合 は 、 選択 さ れ て いる 要素 を 返し ます
quitting 属性 を true に 設定 し ます
指定 し た ファイル 名 と モード で 新しい posixfile オブジェクト を 作成 し ます
set と 全て の other に 共通 する 要素 を 持つ 、 新しい set を 返し ます
警告 を ファイル に 書き込み ます
チャンネル 数 を 返し ます
inexact や rounded といっ た シグナル を 出さず に 最近 傍 の 整数 に 値 を 丸め ます
ファイル 名 の リスト を 読ん で 解析 を こころみ 、 うまく 解析 でき た ファイル 名 の リスト を 返し ます
バージョン 2 . 7 で 撤廃 : 代わり に _ _ mul __ を 使っ て 下さい
エレメント の アトリビュート 名 を リスト として 返し ます
フォーム に バリュースライダーオブジェクト を 加え ます
この ハンドラ に対する 閾値 を lvl に 設定 し ます
name に 一致 する 最初 の ヘッダ と 、 その 行 に 連続 する ( 複数 ) 行 から なる 行 データ の リスト を 返し ます
アーカイブファイル を 閉じ ます
function ( 関数 また は メソッドオブジェクト 、 文字列 で は あり ませ ん ) を 与え られ た 引数 ととも に 呼び出し ます
ユーザ の 現在 の 消去 文字 ( erase character ) 設定 を 返し ます
オブジェクト input を デコード し 、( 出力 オブジェクト , 消費 し た 長さ ) の タプル を 返し ます
サーバソフトウェア の バージョン 文字 列 を 返し ます
対話 的 な python コンソール を そっくり に エミュレート し ます
ascii 余白 文字 か どう か を 調べ ます
tab _id で 指定 さ れ た タブ の インデックス を 、 tab _id が 文字列 の “ end ” だっ た 場合 は タブ の 総数 を 返し ます
行端 が 折り返さ れ 、 必要 に 応じ て 再割り 付け 解析 を 行っ た ( re -flowed ) 文字 データ を 出力 し ます
xml -rpc における 複数 の 要求 を 処理 する 関数 system .multicall を 登録 し ます
弱 参照 を 使う object へ の プロキシ を 返し ます
オブジェクト が トレースバック の 場合 は 真 を 返し ます
仮想 スクリーンカーソル を y , x に 設定 し ます
現在 の 最大 再帰 数 を 返し ます
type で 与え られる mime 型 に 基づい て ファイル の 拡張子 を 推定 し ます
stat _result が タイムスタンプ に 浮動 小数 点 オブジェクト を 使う か どう か を 決定 し ます
名前 の 束縛 が 新た な 名前 空間 を 導入 する なら ば true を 返し ます
引数 が ( 無言 か 発信 か は 問わず ) nan で あれ ば true を 、 そう で なけれ ば false を 返し ます
python の 値 を 、 xml -rpc の boolean 定数 true また は false に 変換 し ます
現在 の セクション の 先頭 に対し て 相対 的 な ファイル 位置 を 返し ます
単一 の コマンドキーストローク を 処理 し ます
最も 多い n 要素 を 、 カウント が 多い もの から 少ない もの まで 順 に 並べ た リスト を 返し ます
x y の 位置 に ある 要素 の 名前 、 もしく は その 位置 に 要素 が 無けれ ば 空文 字列 を 返し ます
1つ の 関数 呼び出し を デバッグ し 、 その 結果 を 返し ます
生 の デバイス 番号 から 、 デバイス の メジャー 番号 を 取り出し ます
指定 し た namespaceuri および localname を 持つ 属性 値 を ノード として 返し ます
x に y の 方向 に 向かっ て 最も 近い数 を 返し ます
サーバ に データ を 送り ます
与え られ た etype ( “ image ”, “ from ”, “ vsapi ” のいずれ か ) の 現在 の テーマ に 新しい 要素 を 作成 し ます
この 関数 は 、 現在 の スレッド で 処理 中 、 又 は 最後 に 発生 し た 例外 の 情報 を 全て クリア し ます
環境 変数 varname が 存在 する 場合 に は その 値 を 返し 、 存在 し ない 場合 に は value を 返し ます
listen を 呼び出し て 作成 さ れ た 、 待ち受け 中 の サーバ を 停止 し ます
キュー が 空 なら ば mutex を ロック 解除 し ます
以前 の フォント 設定 を 復元 し ます
フォーム に テキストオブジェクト を 加え ます
メッセージ が 保存 さ れる べき サブディレクトリ を セット し ます
二つめ の 操作 対象 と 同じ 指数 を 持つ よう に 丸め を 行っ た 、 一つめ の 操作 対象 と 等しい 値 を 返し ます
プログラム の 使用 法 と argumentparser に 登録 さ れ た 引数 について の 情報 を 含む ヘルプメッセージ を 格納 し た 文字列 を 返し ます
この 関数 は requesthandlerclass の handle メソッド が 例外 を 送出 し た 際 に 呼び出さ れ ます
fd _low ( を 含む ) から fd _high ( 含まない ) まで の 全て の ディスクリプタ を 、 エラー を 無視 し ながら 閉じ ます
一時的 に 現在 の テーマ を themename に 設定 し 、 指定 さ れ た settings を 適用 し た 後 、 元 の テーマ を 復元 し ます
バイナリ 転送 モード で ファイル を 転送 し ます
指定 さ れ た 年 の データ を 整形 に 向く形 で 返し ます ( yeardatescalendar と 同様 です )
x の 逆正 接 を 返し ます
threading モジュール を 使っ て 開始 し た 全て の スレッド に プロファイル 関数 を 設定 し ます
プロセス 間 で 共有 オブジェクト の ため に 使用 さ れる syncmanager オブジェクト を 返し ます
3 要素 の タプル の リスト を 返し ます
フォーム に ボックスオブジェクト を 加え ます
x の 深い ( deep ) コピー を 返し ます
この フォント に 関連 付け られ た コメント 文字 列 を 返し ます
メッセージ が name という 名前 を もつ ヘッダフィールド を 持っ て いれ ば 真 を 、 そう で なけれ ば 偽 を 返し ます
a と b の 論理 和 を 返し ます
botframe , stopframe , returnframe , quitting 属性 を 、 デバッグ を 始め られる 状態 に 設定 し ます
repr が 使う 再帰 的 な 実装
dngettext と 同じ です が 、 bind _textdomain _codeset で特に エンコード を 指定 し ない 限り 、 翻訳 結果 を 優先 システムエンコーディング ( preferred system encoding ) で 返し ます
この メソッド は 解決 不能 な 文字 参照 数値 を 処理 する ため に 呼び出さ れ ます
与え られ た フィールド の 値 を 取り出し ます
指定 し た フレーム に 渡さ れ た 引数 の 情報 を 取得 し ます
与え られ た オブジェクト o を エンコード し 、 得 られ た 文字 列表 現 ごと に yield します
チャンク の サイズ を 返し ます
name に対応 する 、 旧式 の api です
サンプルサイズ を バイト 数 で 返し ます
文字列 の 末尾 から 文字 を 取り除い た コピー を 生成 し て 返し ます
a = ilshift (a , b ) は a < < = b と 等価 です
画面 の 表示 を 、 現在 の ヒストリ 内容 によっ て 更新 し ます
windows 用 : この 関数 は ctypes をつかっ て インプロセス com サーバー を 実装 できる よう に する ため の フック です
名前 空間 宣言 を 含ん で い た エレメント の 終了 タグ に 到達 し た とき に 呼び出さ れ ます
トレースバックオブジェクト に 設定 さ れ た 現在 の 行番 号 を 返し ます
属性 名 propertyname の 現在 の 値 を 返し ます
位置 、 向き その 他 の プロパティ が そっくり 同じ タートル の クローン を 作っ て 返し ます
バイナリデータ を base 6 4 で エンコード し て 1 行 の ascii 文字列 に 変換 し ます
frozenset オブジェクト を 返し ます
文字列 s 内 の 単語 から なる リスト を 返し ます
python の ビルド 番号 と 日付 を 、 ( buildno , builddate ) の タプル で 返し ます
二つ の 演算 対象 を 抽象 的 な 表現 を 使っ て 比較 し ます
指定 し た column の オプション を 問い合わ せ たり 、 変更 し たり し ます
パーザ を 消去 し て 、 使用 し て い た メモリ を 解放 し ます
source を 指し て いる ハードリンク link _name を 作成 し ます
指定 さ れ た 例外 情報 ( sys .exc _info が 返す よう な 標準 例外 の タプル ) を 文字 列 として 書式 化 し ます
パネル が 隠れ て いる ( 不可視 で ある ) 場合 に 真 を 返し 、 そう で ない 場合 偽 を 返し ます
タグ 名 か パス に マッチ する 全て の サブエレメント を 返し ます
接続 を 受け 付け ます
アーカイブ に 含まれる 各 メンバ の zipinfo オブジェクト から なる リスト を 返し ます
新しい スレッド を 開始 し て 、 その id を 返し ます
image を 大きさ newwidth × newheight に 伸縮 さ せ て 返し ます
tarinfo オブジェクト が 普通 の ファイル の 場合 に 、 true を 返し ます
x を y 倍し た もの に z を 加え て 返し ます
msiviewexecute を通し て ビュー に対する sql 問い合わせ を 実行 し ます
指定 さ れ た 名前 の クッキー 属性 を 設定 し ます
path が 存在 する なら 、 true を 返し ます
x の 逆双 曲線 正弦 を 返し ます
openkeyex の 機能 は openkey を 標準 の 引数 で 使う こと で 提供 さ れ て い ます
この メソッド は コメント に 遭遇 し た 場合 に 呼び出さ れ ます
アーカイブメンバ の 名前 の リスト を 返し ます
基本 乱数 生成 器 を 初期化 し ます
チャンク の 現在 位置 を 設定 し ます
ignore エラー 処理 の 実装 です : 奇形 データ は 無視 さ れ エンコード 又 は デコード は 何 も 通知 せ ず 、 継続 さ れ ます
nbytes 以下 の バイト 列 を ssl 暗号 化 さ れ た チャンネル から 受信 し て それ を 返し ます
object を 参照 する 弱参 照 と プロキシ の 数 を 返し ます
ペン の 色 (pencolor ) と 塗り つぶし の 色 (fillcolor ) を 設定 する かまた は 返し ます
モノラル 音声 データ を ステレオ 音声 データ に 変換 し ます
イベント が 無い 場合 に メインイベントループ から 呼ば れ ます
b in a を 調べ た 結果 を 返し ます
最初 の 演算 対象 の コピー に 二つめ と 同じ 符号 を 付け て 返し ます
最後 に 記録 さ れ た 多角 形 を 返し ます
testcase の 派生 クラス testcaseclass に 含まれる 全 テストケース の スイート を 返し ます
opt _str と 同じ title か long description を 持っ て いる optiongroup が あれ ば 返し ます
node から 始まる ツリー の 全て の ノード の 行番 号 を n ずつ増や し ます
stats クラス の この メソッド は 、 プロファイル の データベース の 中 から 何ら か の 関数 呼び出し を 行っ た 関数 を すべ て 出力 し ます
文字列 arg を 入力 として sha オブジェクト を 更新 し ます
プロファイルエントリ ( 設定 さ れ て い なけれ ば none ) を 返し ます
ハンドラ で 使わ れ て いる すべ て の リソース の 後始 末 を 行い ます
サンプル 幅 を 1 、 2 、 4 バイト 形式 の 間 で 変換 し ます
path で 指定 さ れ た ファイル 中 の python ソースコード から 得 られ た 抽象 構文木 ast を 返し ます
posixfile オブジェクト が 参照 し て いる 標準 ファイルオブジェクト を 返し ます
e ** x を 返し ます
現在 の ローカルシンボルテーブル を 表す 辞書 を 更新 し て 返し ます
sequence を この メッセージ を 含む シーケンス の リスト から 除く
キャラクタ 文字列 を ( 行 に 収まる だけ ) カーソル より 前 に 挿入 し ます
キュー から アイテム を 取り除き 、 それ を 返し ます
アプリケーション 全体 を 表現 し て いる オブジェクト
python における 単項 の プラス 演算子 に 対応 する 演算 です
この フィーチャー を msilib の 現在 の フィーチャー に し ます
この メソッド は 画像 を 扱う ため に 呼び出さ れ ます
メッセージ を 受信 し て 、 その キー として authkey を 使用 する メッセージ の ダイジェスト を 計算 し 、 ダイジェスト を 送り返し ます
最近傍 の 整数 に 値 を 丸め ます
code が テーブル c . 5 ( サロゲーションコード ) かどう か 判定 し ます
out of band ( oob ) データ が 検出 さ れ た 時 に 呼び出さ れ ます
epoll オブジェクト に ファイル 記述子 fd を 登録 する
スタックフレーム を 呼び出し た ところ で デバッガ に 入り ます
print _version と 同じ です が 、 バージョン 文字 列 を 表示 する 代わり に 返し ます
数値 a および b について a * b を 返し ます
x の 逆双 曲線 余弦 を 返し ます
unpack _string と 同様 に 、 可変 長 の バイトストリーム を アンパック し て 返し ます
ヘッダ の 置換
サーバ に noop を 送信 し ます
ディスク 上 の 辞書 と データファイル を 同期 し ます
すで に 開か れ て いる ミキサデバイスファイル を 閉じ ます
現在 処理 中 の リクエスト の wsgi .input として の 利用 に 適当 な 入力 ストリームオブジェクト を 返し ます
x を もっとも 単純 な 形 に し ます
yes が 1 の 場合 、 8 ビット 文字 を 入力 として 許し ます
現在 の プロセス の ユーザ id を 返し ます
python の callable から c の 呼び出し 可能 関数 ( コールバック 関数 ) を 作成 し ます
浮動 小数 点数 の 1 6 進文 字列 表現 を 返し ます
ルートエレメント に対する 、 ツリー を 巡回 する イテレータ を 返し ます
ユーザー が 文字 c を タイプ し た 時 に 呼ば れ ます
メールボックス の パス 名 を 返し ます
readline 初期化 ファイル を 解釈 し ます
パラメタ : titlestring – タートルグラフィックスウィンドウ の タイトルバー に 表示 さ れる 文字 列 ウインドウ の タイトル を titlestring に 設定 し ます
content -type ヘッダ で 指定 さ れ た ( type /subtype の 形 で の ) メッセージ 型 を 返し ます
パス path の ディレクトリ 名 を 返し ます
ブロック あり 、 また は ブロック なし で ロック を 獲得 し ます
システム の トレース 関数 を 登録 し ます
( ファイル 入力 の ため の ) multipart /form -data 型 の 入力 を 解釈 し ます
tzinfo が none の 場合 、 none を 返し 、 そう で ない 場合 に は self .tzinfo .dst (none ) を 返し ます
入力 イテラブル の 直積 (cartesian product ) です
矩形 を 描画 し ます
この 関数 は obj の 内部 メモリバッファ の サイズ を 変更 し ます
3 2 ビット の 正 の 整数 の バイトオーダ を 、 ネットワークバイトオーダ から ホストバイトオーダ に 変換 し ます
注意 を 促す 短い 音 を 鳴ら し ます
regexp の 検索 が text と マッチ する こと を テスト し ます
音声 データ の 最大 peak -peak 振幅 を 返し ます
この メソッド は 何らか の データ を 処理 する ため に 呼び出さ れ ます
操作 対象 の クラス を 表す 文字 列 を 返し ます
その 結果 が 有効 に なる か timeout 秒経 つ まで 待ち ます
現在 の プロセス の 実効 (effective ) ユーザ id を 返し ます
test の 実行 直後 に 、 テスト 結果 に関わら ず 呼び出さ れ ます
モジュールオブジェクト module を アンロード し ます ( それ を 制限 さ れ た 環境 の sys .modules 辞書 から 取り の ぞき ます )
オブジェクト を 定義 し て いる ( テキスト また は バイナリ の ) ファイル の 名前 を 返し ます
a _standout 属性 を オン に し ます
サーバ の カレントディレクトリ を 設定 し ます
open と 同義
一つ の メッセージ を 他 の フォルダ の 指定 先 に 移動 し ます
指定 し た 環境 で exec 互換 文字 列 の 評価 を おこ ない ます
ホスト 名 と ポート 番号 を もと に 接続 し ます
全て の スレッド を 終了 さ せ 、 整数 の 引き数 status を プログラム 全体 の 終了 コード として 返し ます
oldattr が 属性 リスト に ある 場合 、 削除 し て 返し ます
push _style に渡さ れ た 最新 n 個 の スタイル 指定 を ポップ し ます
名前 空間 を 伴う 新 た な 属性 ノード を 生成 し て 返し ます
ユーザ に 文字 列値 の 入力 を 促す モーダルダイアログ を 表示 し ます
この 関数 は この モジュール で は 廃止 予定 です
優先度 マスク を maskpri に 設定 し 、 以前 の マスク 値 を 返し ます
可能 なら ば 、 data を 現在 の 左 マージン の 左側 に 設定 し ます
機能名 feature と バージョン 番号 version で 識別 さ れる 機能 （feature ） が 実装 さ れ て いれ ば true を 返し ます
メッセージ の 後略 さ れ た 部分 を 取り寄せ ます
logical _invert は 論理 演算 です
この メソッド は 全て の 出力 中 の もの を 捨て 去り ます
ホスト 名 を ' 1 0 0 . 5 0 . 2 0 0 . 5 ' のよう な ipv 4 形式 の アドレス に 変換 し ます
この 関数 で は 、 クライアント から の 要求 を 実現 する ため に 必要 な 全て の 作業 を 行わ なけれ ば なり ませ ん
文字列 バッファ を data で リセット し ます
parse に 似 て い ます が 、 こちら は パラメータ string で 指定 さ れ た バッファ を パース し ます
ファイル 記述子 fd に 書き込ま れ た 全て の 出力 が 転送 さ れる まで 待ち ます
入力 データストリーム が 、 set _terminator で 指定 し た 終了 条件 と 一致 し た 場合 に 呼び出さ れ ます
ファイル の 中 の 現在 位置 を 返し ます
url の パス の 部分 path を パーセントエンコード さ れ た url の 形式 から ローカルシステム に おける パス 記法 に 変換 し ます
その 呼び出し が 例外 を 発生 さ せる こと なく 完了 し た かどう か を 返し ます
time .localtime が 返す 形式 の time .struct _time を 返し ます
(namespace , localname ) の ペア に対応 する 修飾 名 を 返す
子 プロセス の 状態 コード 出力 を 待機 し て 返し ます
completer 関数 を 設定 また は 除去 し ます
readline ヒストリファイル を 読み出し ます
標準 の ロケール 設定 を 取得 しよ う と 試み 、 結果 を タプル ( language code , encoding ) の 形式 で 返し ます
二つ の 数 値間 の 除算 を 行い 、 結果 の 整数 部 を 返し ます
mime 型情 報 を 、 オープン し た ファイル から ロード し ます
open で 確立 さ れ た 接続 を 閉じ ます
引数 が 標準 的 (canonical ) ならば true を 返し 、 そう で なけれ ば false を 返し ます
文字列 データ の バッファリング を 終了 し 、 以前 save _bgn を 呼び出し た 時点 から 保存 さ れ て いる 全て の データ を 返し ます
正規 表現 パターン を 正規 表現 オブジェクト に コンパイル し ます
msiviewmodify を 呼び出し て ビュー を 変更 し ます
コンテキスト の 複製 を 返し ます
引数 object が 引数 classinfo の インスタンス で ある か 、 ( 直接 また は 間接 的 な ) サブクラス の インスタンス の 場合 に 真 を 返し ます
ファイル また は ディレクトリ src を dst に 名前 変更 し ます
パラメタ :n – 整数 ( また は none ) 全 て の 、 また は 最初 の / 最後 の n 個 の ハンコ を 消し ます
stats クラス の この メソッド は 、 指定 し た 関数 から 呼び出さ れ た 関数 の リスト を 出力 し ます
line コントロール を 追加 し て 返し ます
object の フォーマット 化 し た 表現 を 指定 し た ストリーム に 出力 し 、 最後 に 改行 し ます
a / / b を 返し ます
一年分 の カレンダー を 一つ の 完全 な html ページ として 返し ます
属性 の 数 を 返す
アイテム 番号 item が ヒット さ れ た 時 に 呼ば れ ます
トークン を 一つ 返し ます
クッキー が サーバ に 返さ れる べき かど う か を 表わす boolean 値 を 返し ます
name で 指定 し た 属性 の 値 を 文字 列 として 返し ます
n 個 の オーディオフレーム の 値 を 読み込ん で 、 バイト ごと に 文字 に 変換 し た 文字列 を 返し ます
key に対応 する メッセージ の 表現 を 返し ます
dlopen で 指定 さ れる フラグ を 返し ます
もし 、 key が 辞書 に 存在 すれ ば 、 その 値 を 返し ます
メッセージ の 本体 に 書く の に 使用 できる ファイル の よう な オブジェクト を 返し ます
標準 の logger クラス か 、 最後 に setloggerclass に渡し た クラス を 返し ます
'amdk 6 ' のよう な 、（ 現実 の ） プロセッサ 名 を 返し ます
レベル debug の メッセージ を この ロガー で 記録 し ます
“from ” 行 を from _ に セット し ます
全 ピクセル を 二値化 する こと によっ て 、 深さ 8 ビット の グレースケール 画像 を 深さ 1 ビット の 画像 へ 変換 し ます
更新 モード (w +b ) で 開か れ た 新しい ファイルオブジェクト を 返し ます
与え られ た sample を 解析 し 、 発見 さ れ た パラメタ を 反映 し た dialect サブクラス を 返し ます
ソケット から データ を 受信 し 、 文字 列 として 返し ます
実在 の ファイル file に対し て 、 拡張子 に 基づい て 適切 な クリエータ と タイプ を 設定 し ます
単精度 の 浮動 小数 点数 を アンパック し ます
この 関数 は exec 文 に 似 て い ます が 、 文字列 の 代わり に ファイル に対し て 構文 解釈 を 行い ます
処理 指令 に 遭遇 し た 場合 に 呼び出さ れ ます
ウィンドウ の コンテント 部分 を ユーザー が クリック する と 呼ば れ ます
hmac オブジェクト を 文字列 msg で 更新 し ます
systemexit を 送出 し ます
サーバ 上 に 新た に ディレクトリ を 作り ます
サンプリングレート を 1 秒 あたり の フレーム 数 で 設定 し ます
ソケット に データ を 送信 し ます
path の 最終 更新 時刻 を 、 エポック ( time モジュール を 参照 下 さい ) から の 経過 時間 を 示す 秒数 で 返し ます
hsv から rgb に 変換 し ます
a = ipow (a , b ) は a * *= b と 等価 です
メールボックス を 選択 し ます
iterables の 要素 を 引数 として funtion を 呼び出す イテレータ を 作成 し ます
file が 文字列 なら その 名前 の ファイル を 開き 、 そう で ない なら シーク 可能 な file like オブジェクト として 扱い ます
プロセス の 制御 端末 に 対応 する ファイル 名 を 返し ます
ノートブック に 管理 さ れ て いる ウィンドウ の リスト を 返し ます
first が second に 含ま れる こと （ そう で ない こと ） を テスト し ます
パネル に 関連 付け られ て いる ウィンドウオブジェクト を 返し ます
タートル が 見える よう に し ます
チャンネル 数 を 設定 し ます
この ロガー の 実効 レベル を 示し ます
フォーム の 位置 を 設定 し ます
非名 前空間 モード で 要素 の 終了 を 通知 し ます
記号 が その ブロック の 中 で 代入 さ れ て いる なら ば true を 返し ます
ファイル の 形式 を 記述 し て いる ファイルモード の 一部 ( 上記 の s _is *( ) 関数 で 使わ れ ます ) を 返し ます
この メソッド は 、 他 の メソッド に 当て は まら ない 任意 の データ を 処理 する ため に 呼び出さ れ ます
k に 番号 付け さ れ て いる キー の 名前 を 返し ます
mmdf メールボックス の メッセージ の 開始 を 示す “ from ” 行 を 表わす 文字 列 を 返し ます
label の 名前 の サブメニュー を 、 メニュー menu の 下 に 作成 し ます
属性 が attrdict で 定義 さ れ た 、 新しい logrecord インスタンス を 生成 し て 返し ます
テストフィクスチャ の 準備 の ため に 呼び出さ れる メソッド です
メッセージ 本体 の エンコード に 使わ れる content -transfer -encoding の 値 を 返し ます
domain が クッキー を 授受 し ない ブラックリスト に 載っ て いる かど う か を 返し ます
スタックトレース と 例外 情報 を 書式 化 し ます
指定 し た フレーム 数 の 位置 に ポインタ を 設定 し ます
出力 ファイル に データ を 書き込み ます
現在 の フォルダ 名 を 設定 し ます
ascii 文字 c の 文字 列表 現 を 返し ます
x に 値丸め を 適用 し 、 指数 を y に し た 値 を 返し ます
3行 の メッセージ と yes 、 no の ボタン の ある ダイアログボックス を 表示 し ます
host の 認証 情報 として 、 三要素 の タプル ( login , account , password ) を 返し ます
タブ 補完 の ため の readline 単語 区切り 文字 を 取得 し ます
python を コンパイル する 際 に 使用 し た コンパイラ を 示す 文字 列 を 返し ます
端末 を “ shell ” モード に 復旧 し 、 予め def _shell _mode で 保存 し た 内容 に 戻し ます
daemon に対応 する 、 旧式 の api です
gettext と 同様 です が 、 複数 形 の 場合 を 考慮 し て い ます
指定 し た フォルダ の 下 に ある 全て の サブフォルダ の リスト を 返し ます
これ は sequence 2st と 同じ 関数 です
記号 が global 文 によっ て グローバル で ある と 宣言 さ れ て いる なら true を 返し ます
aiff あるい は aiff -c ファイル を 開き 、 後述 する メソッド を 持つ インスタンス を 返し ます
db ファイル に 収め られ て いる キー から なる リスト を 返し ます
子 プロセス が 終了 し て いる かど う か を 検査 し ます
_ _future __ . division が 有効 で ない 場合 に は a / b を 返し ます
イテレータ が 返す 結果 の 順番 が 任意 の 順番 で 良い と 見なさ れる こと を 除け ば imap と 同じ です
フォルダ 内 の メッセージ n の 完全 な パス 名 を 返し ます
メンバー を アーカイブ から 現在 の 作業 ディレクトリ に 、 その 完全 名 を 使っ て 抽出 し ます
1 6 進文 字列 表現 s で 表さ れる 、 浮動 小数 点数 を 返す クラスメソッド です
msisummaryinfosetproperty を通し て プロパティ を セット し ます
オーディオファイル の ヘッダ 情報 が 更新 さ れ ない こと を 除い て 、 writeframes と 同じ です
mailbox に対し て quota root を 実行 し た 結果 の リスト を 取得 し ます
翻訳 メッセージ として 返す 文字 列 の エンコード を 決める 、 “ protected ” の _ output _charset 変数 を 返し ます
カーソル を key で 示さ れる 要素 に 移動 し 、 キー 及び 値 から なる タプル を 返し ます
パラメタ : fun – 引数 なし 関数 t – 数 > = 0 t ミリ 秒後 に fun を 呼び出す タイマー を 仕掛 け ます
メールボックス の 削除 マーク すべて を 取り消し ます
現在 sysconfig で サポート さ れ て いる 全て の スキーム を 格納 し た タプル を 返し ます
ボタン が 押さ れ て から 離さ れる まで の 時間 を マウスクリック 一 回 として 認識 する 最大 の 時間 間隔 を 設定 し ます
アーカイブメンバ name に関する 情報 を 持つ zipinfo オブジェクト を 返し ます
後 から sql 文中 で name という 名前 の 関数 として 使える ユーザ 定義 関数 を 作成 し ます
バージョン 2 . 0 で 撤廃 : contains を 使っ て く ださい
与え られ た name の ( name =value の 形 に対し て getplist が 返す ) 第 1 パラメータ の value を 返し ます
辞書 の 内容 を other の キー と 値 で 更新 し ます
与え られ た section の それぞれ の オプション について ( name , value ) ペア の リスト を 返し ます
サウンドカード が サポート し て いる オーディオ 出力 形式 を ビットマスク で 返し ます
stats クラス の この メソッド は 、 ファイル 名 の 前 に 付い て いる すべ て の パス 情報 を 取り除く ため の もの です
応答 code を 受信 し て いれ ば 、 その データ を 返し 、 そう で なけれ ば none を 返し ます
レベル error の メッセージ を この ロガー で 記録 し ます
'linux ', ' windows ', ' java ' のよう な 、 システム /os 名 を 返し ます
一続き の テキスト 全体 を 一個 の text インスタンス として 保存 する ため に 隣接 する テキストノード を 結合 し ます
xml -rpc リクエスト を 処理 し ます
min (self , other ) と 同じ です が 、 値 を 返す 前 に 現在 の コンテキスト に 即し た 丸め 規則 を 適用 し ます
テスト の 失敗 が 意図 的 で ある こと を 表し ます
与え られ た エラー 番号 errno を 解説 する 文字 列 を 返し ます
function を iterable の 全て の 要素 に 適用 し 、 返さ れ た 値 から なる リスト を 返し ます
option によって 与え られ た 設定 オプション の 現在 の 値 を 返し ます
path の フラグ を 数値 flags に 設定 し ます
演算 対象 の 常用 対数 (底 1 0 の 対数 ) を 返し ます
生成 する html ドキュメント の 名前 を セット し ます
string 内 の re pattern の 重複 し ない マッチ を matchobject インスタンス を 返す iterator を 返し ます
単語 の リスト や タプル を 間 に sep を 入れ て 連結 し ます
キャラクタデバイス の 場合 に true を 返し ます
バージョン 2 . 7 で 追加 . この メソッド は 共有 ライブラリ から sqlite 拡張 を 読み込み ます
buffer を 与え られ た フォーマット で アンパック し ます
eof まで ストリーム から すべ て の バイト を 読み込み ます
文字 を 取得 し 、 getch のよう に 整数 を 返す 代わり に 文字列 を 返し ます
stat タプル stat 1 と stat 2 が 同じ ファイル を 指し て い たら 、 true を 返し ます
描画 を 最適 化 する ため に 、 全て の ウィンドウ が 変更 さ れ たか の よう に 振舞 わせ ます
バージョン 2 . 7 で 撤廃 : 代わり に isinstance (x , numbers .number ) を 使っ て 下さい
現在 の イベント が 終了 する 行番 号 を 返し ます
参照 さ れ た 共有 オブジェクト の name という 名前 の 関数 を 呼出 し ます
圧縮 オブジェクト に 追加 の データ を 入力 し ます
getattr と対 を なす 関数 です
この 関数 は _ _ init __ コンストラクタ を 呼び出さず に 辞書 dict を もつ class の インスタンス を 作り出し ます
file が 文字列 なら その 名前 の ファイル を 開き 、 そう で ない なら ファイル の よう に シーク 可能 な オブジェクト として 扱い ます
単一 の 要求 を 処理 し ます
x を y 回 シフト し た コピー を 返し ます
python 実装 の バージョン 管理 システム 上 の リビジョン を 特定 する 文字 列 を 返し ます
これら の 関数 は 対応 する gl 関数 へ の forms の インターフェース です
テーブル b . 3 ( 正規化 を 伴わ ない 大小 文字 の 対応 付け ) に従っ て 、 code に対応付け られ た 値 を 返し ます
プロセスグループ pgid に シグナル sig を 送り ます
文字列 を 組み込み 関数 cmp で 使える 形式 に 変換 し 、 かつ ロケール に 則し た 結果 を 返し ます
ライブラリ の 非初 期化 を 行い 、 端末 を 通常 の 状態 に 戻し ます
この 期間 に 含まれる トータル の 秒数 を 返し ます
この メソッド は 常 に none を 返し 、 要求 さ れ た モジュール が 見つ から なかっ た こと を 表し ます
共有 メモリ から 割り 当て られ た ctypes 配列 を 返し ます
ウィンドウ の アップデートイベント が 受信 さ れ た 時 に 呼ば れ ます
シェル 類似 の 文法 を 使っ て 、 文字列 s を 分割 し ます
ウィジェット の 状態 を チェック し ます
トレーシング が 有効 な 間 、 func (* args ) を 呼び出し ます
ファイル 記述子 fd に 接続 し て いる 、 開か れ た ファイルオブジェクト を 返し ます
二つ の 値 を 数値 として 比較 し 、 小さい ほう を 返し ます
この 機能 を サポート し て いる 端末 上 で 、 色 の 値 として デフォルト 値 を 使う 設定 を します
文字 の 属性 を グローバル な レジストリ に 追加 し ます
パネル を スタック の 最下層 に プッシュ し ます
シンボリックリンク の 場合 に true を 返し ます
http エラーレスポンス を 処理 し ます
デバッガー が この 関数 から の リターン で 止まる べき で あれ ば 、 user _call メソッド ( サブクラス で オーバーライド さ れる ) を 呼び出し ます
現在 の フォント を 使っ て 文字列 を レンダリング し ます （ 下 の フォントハンドルメソッド setfont を 参照 ）
メッセージ の ペイロード が 子 message オブジェクト から なる リスト で あれ ば true を 返し 、 そう で なけれ ば false を 返し ます
range (start , stop , step ) で 指定 さ れる インデクス の 集合 を 表す スライス ( slice ) オブジェクト を 返し ます
data の 要素 から 、 selectors の 対応 する 要素 が true と 評価 さ れる もの だけ を 返す 、 フィルタリング し た イテレータ を 作り ます
msisummaryinfogetproperty を通し て サマリー の プロパティ を 返し ます
object の 型 を 返し ます
filter ルーチン を 使う 場合 、 initscr を 呼ぶ 前 に 呼び出さ なく て は なり ませ ん
以前 の 字揃 え 設定 を 復元 し ます
システム 起動 時 から の チック 数 (clock ticks 、 1 / 6 0 秒 ) を 得 ます
引数 を 指定 し ない 場合 は 、 全て の 検出 を 行い ます
リテラルモード ( cdata モード ) に 移行 し ます
式 ノード また は python の 式 を 表す 文字 列 を 安全 に 評価 し ます
アンパック 処理 を 終了 さ せ ます
読み書き の ため の stringio 類似 ストリーム を 返し ます
a < = n < = b で ある よう な ランダム な 整数 n を 返し ます
現在 の プロセス の real , effective , saved group id を 示す 、 ( ruid , euid , suid ) の タプル を 返し ます
シンプル な コマンド 文字列 を サーバ に 送信 し て 、 その 応答 を 扱い ます
その メッセージ の 副 content -type ( sub content -type 、 subtype ) を 返し ます
コメント ・ エレメント の ファクトリー です
メインスレッド で keyboardinterrupt を 送出 し ます
in _file を out _file に エンコード し ます
ロケール 特有 の 情報 を 文字 列 として 返し ます
stdio の fflush のよう に 、 内部 バッファ を フラッシュ し ます
newlime モード に 入り ます
ブレークポイント に 到達 する か 終了 し た とき に ストップ し ます
セマフォ を 獲得 し ます
finish _request を 呼び出し て 、 requesthandlerclass の インスタンス を 生成 し ます
unicode 文字 unichr に 割り 当て られ た 正規 結合 クラス を 返し ます
名前 で 指定 さ れ た 属性 を 削除 し ます
オーディオファイル の マーカー の リスト を 返し ます
与え られ た 引数 の func を 、 trace オブジェクト の コントロール 下 で 現在 の トレースパラメタ の もと に 呼び出し ます
a の 中 に b が 出現 する 回数 を 返し ます
非 終端 トークン の 値 に対し て 真 を 返し ます
この メソッド は 、 stop _here が true を 返し た とき に 、 dispatch _exception から 呼び出さ れ ます
threading モジュール を 使っ て 開始 し た 全て の スレッド に トレース 関数 を 設定 し ます
item を heap に push します
名前 が folder で ある フォルダ を 削除 し ます
再生 あるい は 録音 を 即座 に 中止 し て 、 デバイス を コマンド を 受け 取れる 状態 に 戻し ます
複数 の 文字 列 から なる シーケンス を ファイル に 書き込み ます
内部 フラグ の 値 が 真 で ある 場合 に のみ 真 を 返し ます
ロギングシステム に対し て 、 ロガー を インスタンス 化 する 際 に クラス klass を 使う よう に 指示 し ます
キーワード 引数 で 指定 し た メンバ の 値 を 除き 、 同じ値 を もつ datetime オブジェクト を 返し ます
整数 値 の システム 設定 値 を 返し ます
オブジェクト が 正当 な エレメント ・ オブジェクト で ある か を チェック し ます
article 命令 を 送信 し ます
x の 逆双 曲線 余弦 を 返し ます
この 条件 を 待っ て いる すべ て の スレッド を 起こし ます
与え られ た url ( リクエストオブジェクト で も 文字列 で もかまい ませ ん ) を 開き ます
文字 列中 の doctest を デバッグ し ます
iterable の 要素 を もと に 、 並べ替え 済み の 新 た な リスト を 生成 し て 返し ます
ユーザ 名 ／ パスワード を 取得 し 、 再度 サーバ へ の リクエスト を 試みる こと で 、 サーバ から の 認証 リクエスト を 処理 し ます
すべて の ブレークポイント を 削除 し ます
新た な 属性 ノード を 要素 に 追加 し ます
3行 の メッセージ と 最大 3つ まで の ボタン の ある ダイアログボックス を 表示 し ます
工学 表記 で 文字列 に 変換 し ます
セレクタ — サーバ に 送られる url の 一部分 — を 返し ます
現在 の 検出 閾値 を 、 ( threshold 0 , threshold 1 , threshold 2 ) の タプル で 返し ます
仮想 スクリーン を パネルスタック 変更 後 の 状態 に 更新 し ます
cbreak モード に 入り ます
expected で 指定 さ れ た 文字列 を 読み込む か 、 timeout で 指定 さ れ た 秒数 が 経過 する まで 読み込み ます
指定 さ れ た tab _id を 選択 し ます
指定 さ れ た item の オプション を 問い合わ せ たり 、 変更 し たり し ます
flag が 偽なら 、 noqiflush を 呼ぶ の と と 同じ 効果 です
file 型 の コンストラクタ です
エスケープ さ れ た 文字列 ' & amp ;' , '& lt ;' , '& gt ;' を 元 の 文字 に 戻し ます
オブジェクト を 再描 画 し ます
ソケット に 文字列 を 書き込み ます
readline タブ 補完 スコープ の 末尾 の インデクス を 取得 し ます
アーカイブ 中 の 全て の ファイル を 読み 、 crc チェックサム と ヘッダ が 正常 か 調べ ます
formatmonth で返さ れる ひと 月分 の カレンダー を 出力 し ます
year 年 month 月 の 週 の リスト を 返し ます
a および b の 排他 的 論理 和 を 返し ます
ターゲットハンドラ を この ハンドラ に 設定 し ます
ファイル dst の クリエータ や タイプ など の ファインダ 情報 が 変わっ た こと を ファインダ に 知ら せ ます
この inputsource の 公開 識別子 を 返し ます
数 値文 字列 の 左側 を ゼロ 詰め し 、 幅 width にし て 返し ます
replace エラー 処理 の 実装 です : 奇形 データ は 適切 な 文字列 に 置換 さ れ ます
“ バックグラウンド ” の 属性 セット を attr に 設定 し ます
ip アドレス を 、 アドレスファミリ 固有 の 文字 列 から パック し た バイナリ 形式 に 変換 し ます
args と kwds を 、 python の 関数 もしく は メソッド func を 呼び出し た 場合 と 同じ よう に 引数 名 に 束縛 し ます
レベル error の メッセージ を この ロガー で 記録 し ます
socket .socket の インスタンス sock を 受け取り 、 socket .socket の サブタイプ で ある ssl .sslsocket の インスタンス を 返し ます
塗りつぶし の 色 (fillcolor ) を 設定 する かまた は 返し ます
aiff ファイル を 閉じ ます
bytearray b に 最大 len (b ) バイト 分読 み 込み 、 読み込ん だ バイト 数 を 返し ます
タートル の x 座標 を 返し ます
tarfile が 読み込み 用 に オープン さ れ て いる 時 、 アーカイブ の 次 の メンバー を tarinfo オブジェクト として 返し ます
現在 の プラットフォーム を 識別 する ため の 文字列 を 返し ます
ファインダ に 、 マシン を 適切 に 再起 動 する よう 命令 し ます
テスト を 実行 し 、 テスト 結果 を result に 指定 さ れ た テスト 結果 オブジェクト に 渡し ます
大量 の 削除 を 実行 し た 後 、 gdbm ファイル の 占める スペース を 削減 し たい 場合 、 この ルーチン は データベース を 再組 織化 し ます
imap 4 flags 応答 を 個々 の フラグ から なる タプル に 変換 し ます
ファイル の 現在 の ポインタ 位置 を 返し ます
属性 の 名前 を 返す
インスタンス の デバッグレベル を 設定 し ます
msicreaterecord を 呼び出し て 新しい レコードオブジェクト を 返し ます
ファイル 記述子 fd に キュー さ れ た データ を 無視 し ます
x の 逆余 弦 を 返し ます
現在 の ファイル の “ ファイルデスクリプタ ” を 整数 値 で 返し ます
newsgroups 命令 を 送信 し ます
2 つの ( 複素数 で ない ) 数値 を 引数 として 取り 、 整数 の 除法 を 行っ た とき の 商 と 剰余 から なる ペア を 返し ます
与え られ た イベント sequence 用 の コールバック を タグ tagname に バインド し ます
iterable のうち 、 function が 真 を 返す よう な 要素 から なる リスト を 構築 し ます
rfc 2 2 3 1 に 従っ て s を エンコード し ます
name という 名前 の 再初 期化 できる 組み込み モジュール が ある 場合 は 、 1 を 返し ます
文字列 の 先頭 および 末尾 部分 を 除去 し た コピー を 返し ます
ファイル 記述子 fd の ファイルハンドル を 返し ます
6 4 ビット os上 で 動作 し て いる 3 2 bit プロセス に対する レジストリリフレクション を 無効 に し ます
'i 3 8 6 ' のよう な 、 機種 を 返し ます
ソケット に 関連 付け られ た ファイルオブジェクト を 返し ます ( ファイルオブジェクト について は ファイルオブジェクト を 参照 )
指定 し た ミキサコントロール の ボリューム を ( left ,right ) に 設定 し ます
text の イテレータ を 作成 し ます
この ロガー の 閾値 を lvl に 設定 し ます
filename の 文字 列 が pattern の 文字列 に マッチ する か テスト し て 、 true 、 false のいずれか を 返し ます
python 関数 の 引数 名 と デフォルト 値 を 取得 し ます
ノード が 何らか の 子 ノード を 持っ て いる 場合 に 真 を 返し ます
rfc 3 4 9 0 仕様 に 従っ て ラベル を unicode に 変換 し ます
オブジェクト が ユーザ 定義 か 組み込み の 関数 また は メソッド の 場合 は 真 を 返し ます
インデント さ れ た docstring から 、 コードブロック まで の インデント を 削除 し ます
http ヘッダ 形式 の 文字 列表 現 を 返し ます
item を heap に push し た 後 、 pop を 行っ て heap から 最初 の 要素 を 返し ます
塗りつぶ し たい 図形 を 描く 直前 に 呼び出し ます
writer の 割り 付け スタイル ( spacing style ) を 設定 し ます
いくつか の クッキー を 消去 し ます
フォーム を 固定 し ます
themename が 与え られ なかっ た 場合 は 、 現在 使用 中 の テーマ 名 を 返し ます
名前 で 指定 さ れ た 属性 を 削除 し ます
列挙 オブジェクト を 返し ます
ファイル が tty ( また は 類似 の ) デバイス に 接続 さ れ て いる 場合 true を 返し 、 そう で ない 場合 false を 返し ます
辞書 actual の キー / バリューペア が expected の スーパーセット に なっ て いる かど う か を テスト し ます
pack 関数 と 同じ 、 コンパイル さ れ た フォーマット を 利用 する メソッド です
オプション で 無い 最初 の 引数 を 見つけ た 時点 で パース を 止める よう に 設定 し ます
オブジェクト を n バイト まで 読み込み 、 それ を 返し ます
dom が 表現 し て いる xml を 文字列 に して 返し ます
ファイル の ポインタ を 指定 し た 位置 に 設定 し ます
“info ” に 文字列 info を セット し ます
新 た な documenttype クラス の オブジェクト を 返し ます
パネル の ユーザポインタ を 返し ます
pyconfig .h の パス を 返し ます
新た な 字揃 え ( alignment ) 設定 を 字揃 え スタック の 上 に プッシュ し ます
タートル の 現在 位置 を ( vec 2d の ベクトル として ) 返し ます
unicode における コード が 整数 i に なる よう な 文字 1 文字 から なる unicode 文字列 を 返し ます
フォーマット name の アーカイバ を 登録 し ます
logical _and は 二つ の 論理 引数 ( 論理 引数 参照 ) を 取る 論理 演算 です
単一 の 呼び出し 可能 オブジェクト の プロファイル を おこ ない ます
指定 さ れ た ホスト と ポート に 接続 し ます
この inputsource の 公開 識別子 を セット し ます
ファインダ に ファイル を 印刷 する よう 命令 し ます
cdata セクション の 終了 時 に 呼び出さ れ ます
与え られ た ロケールカテゴリ に対する 現在 の 設定 を 、 language code 、 encoding を 含む シーケンス で 返し ます
rootobject を plist 形式 の 文字 列 として 返し ます
元 の パイプラインテンプレート と 等価 の 新しい オブジェクト を 返し ます
メッセージ id に対する 複数 形 を 検索 し ます
パラメタ :y – 数 ( 整数 また は 浮動 小数 点数 ) タートル の 第 二 座標 を y に し ます
インスタンス の データ を 返し ます
記号 が import 文 で 作ら れ た もの なら ば true を 返し ます
setprofile 関数 など で 設定 し た profiler 関数 を 取得 し ます
メニューアイテムオブジェクト を 作成 し ます
ehlo を 利用 し 、 esmtp サーバ に 身元 を 明かし ます
値 を 符号 を 無視 し て 数値 として 比較 し ます
uuencode 形式 で エンコード さ れ た in _file を デコード し て varout _file に 書き出し ます
バッファ さ れ た データ を クライアント に 強制 的 に 転送 し ます
パス 名 path を ( root , ext ) の ペア に し ます
読み込み 可能 な データ が ある かど う か を 返し ます
新しい 型 オブジェクト を 返し ます
vrfy を 利用 し て smtp サーバ に アドレス の 妥当性 を チェック し ます
現在 の スタックフレーム から 生 の トレースバック を 取り出し ます
tokenize 関数 は 二つ の パラメータ を 取り ます : 一つ は 入力 ストリーム を 表し 、 もう 一つ は tokenize のため の 出力 メカニズム を 与え ます
ウィンドウ の 高さ および 幅 を 表す タプル ( y , x ) を 返し ます
パス 名 path を ( drive , tail ) の ペア に 分割 し ます
モードレスダイアログウィンドウ を 作成 し ます
サンプルサイズ を 返し ます
バイト 列 を ストリーム から 位置 を 変更 せ ずに 読ん で 返し ます
代替 コンストラクタ です
find と 同様 です が 、 sub が 見つ から なかっ た 場合 valueerror を 送出 し ます
url を 解釈 し て 6 つの 構成 要素 に し 、 6 要素 の タプル を 返し ます
format _field は 単純 に 組み込み の グローバル 関数 format を 呼び出し ます
可搬性 の 高い popen インターフェース で 、 可能 なら win 3 2 pipe .popen を 使用 し ます
子 プロセス を 開始 する とき に 使用 する python インタプリタ の パス を 設定 し ます
未知 の 開始 タグ を 処理 する ため に 呼び出さ れる メソッド です
辞書 の 値 の 新しい ビュー を 返し ます
この メソッド は オーディオ 入力 から size の サイズ の サンプル を 読み込ん で 、 python の 文字 列 として 返し ます
過去 1 分 、 5 分 、 1 5 分間 で 、 システム で 走っ て いる キュー の 平均 プロセス 数 を 返し ます
月 の カレンダー を 行列 で 返し ます
次 の セクション まで の 全て の 行 を 読み ます
音声 データ の 各 サンプル を a -law 符号 で エンコード し 、 python 文字 列 として 返し ます
実行 中 の mainloop 呼び出し を 、 次 の 適当 な タイミング で 終了 さ せ ます
codec 検索 関数 を 登録 し ます
与え られ た ウィンドウ win に関連付け られ た パネルオブジェクト を 返し ます
与え られ た traceback オブジェクト の 事後 解析 デバッギング に 入り ます
この 関数 は 呼び出し 側 から ast に st オブジェクト を 受け取り 、 解析 木 と 等価 な python の タプル を 返し ます
ファイル 記述子 fd を 持つ ファイル の ディスク へ の 書き込み を 強制 し ます
サブコード を 追跡 し て いる パーザ の フィールド を リセット し て 、 初期 状態 に し ます
リモート 側 の 端点 より 、 最大 buffer _size バイト の データ を 読み込み ます
mime 型 type から の マッピング を 拡張子 ext に 追加 し ます
a = isub (a , b ) は a - = b と 等価 です
すべて の ロガー に対し て 、 ロガー 自体 の レベル に 優先 する よう な 上書 き レベル lvl を 与え ます
週 の 最初 の 曜日 ( 0 は 月曜 日 , 6 は 日曜日 ) を 設定 し ます
defaulthandler と 同じ です が 、 内部 エンティティ の 展開 を 禁止 し ませ ん
handle メソッド が 呼び出さ れ た 後 、 何らか の 後始 末 を 行う ため に 呼び出さ れ ます
unicode 文字 unichr に 割り 当て られ た 、 汎用 カテゴリ を 返し ます
binhex 4 方式 の rle 圧縮 を data に対し て 行い 、 その 結果 を 返し ます
binhex 4 形式 の ascii 文字列 データ を rle 展開 を 行わ ない で バイナリ に 変換 し ます
この doctestrunner が 実行 し たすべて の テストケース の サマリ を 出力 し 、 名前 付き タプル ( named tuple ) testresults (failed , attempted ) を 返し ます
マッチ し た シーケンス 中 で 個別 に マッチ し た シーケンス を あらわす 、 3つ の 値 の リスト を 返し ます
flags で 指定 さ れ た フラグ を セット し 、 他 の フラグ は 下ろ し ます
ファシリティ および 優先 度 を 整数 に 符号 化 し ます
タグ 名 か パス に マッチ する 全て の サブエレメント を 探し ます
tab _id で 指定 さ れ た タブ を 削除 し ます
以前 の setbase によっ て 設定 さ れ た 基底 uri を 文字 列 の 形 で 返し ます
dumbdbm データベース を 開き 、 dubmdbm オブジェクト を 返し ます
ノートブック に 新しい タブ を 追加 し ます
新しい 再入 可能 ロックオブジェクト を 返す ファクトリ 関数 です
ファイル の モード が ソケット の 場合 に ゼロ で ない 値 を 返し ます
バージョン 1 . 5 . 1 で 撤廃 : fromfile メソッド を 使っ て く ださい
新しい テーマ を 作成 し ます
パラメタ : size – 整数 また は none アンドゥバッファ を 設定 また は 無効 化 し ます
(bsd で のみ サポート ) カーネルイベント ( kernel event ) オブジェクト を 返し ます
nframes が 正しい か 確認 し て 、 ファイル を 閉じ ます
オーディオフレーム 数 を 返し ます
eof に 到達 する まで の 全て の データ を 読み込み ます ; 接続 が 閉じ られる まで ブロック し ます
マージンレベル を 整数 値 level に 設定 し 、 論理 タグ ( logical tag ) を margin に 設定 し ます
制御用 ファイル 記述子 の 番号 を 返す
パラメタ : stampid – 整数 で 、 先立 つ stamp 呼出 し で 返さ れ た 値 で なけれ ば なり ませ ん stampid に対応 する ハンコ を 消し ます
この メソッド は close が 呼び出さ れ た 後 、 次 の ドキュメント を パース 可能 に する ため 、 パーサ の リセット する のに 呼び出さ れ ます
nframes の 修正 なし に オーディオフレーム を 書き込み ます
encoding に 指定 し た codec を 検索 し 、 漸増 的 デコーダクラス 、 また は ファクトリ 関数 を 返し ます
ウィンドウ の 全て の 親 ウィンドウ について 、 現在 の カーソル 位置 を 反映 する よう 更新 し ます
接続 を 閉じ ます
この フォント を 拡大 ／ 縮小 し た ハンドル を 返し ます
文字列 から なる リスト を 連結 し て 、( 必要 に 応じ て write を 何度 も 使っ て ) ストリーム に 書き出し ます
インタープリタ の ” チェック 間隔 ” を 示す 整数 値 を 指定 し ます
すべて の ログ 出力 が フラッシュ さ れる よう に し ます
値へ の 弱参 照 を 生成 する イテレータ ( iterator ) を 返し ます
code が テーブル c . 1 ( スペース 文字 、 c . 1 . 1 および c . 1 . 2 の 和集合 ) かどう か 判定 し ます
path の モード を 数値 mode に 変更 し ます
interact の マルチスレッド 版 です
code が テーブル c . 7 ( 標準 表現 :canonical representation として 不適切 ) かどう か 判定 し ます
ファイル から クッキー を 読み込み ます
filename という 名前 の ファイル 内 の 画像 データ を テスト し 、 画像 形式 を 表す 文字 列 を 返し ます
子 プロセス を 起動 し 、 子 プロセス と の 通信 の ため に 開か れ た パイプ を 返し ます
新た な 開か れ た メッセージオブジェクト を 返し ます ( ファイル 記述子 を 一つ 消費 し ます )
文字列 を sep の 最初 の 出現 位置 で 区切り 、 3 要素 の タプル を 返し ます
これ は reduce 関数 と 同じ もの です
指定 さ れ た モジュール の コード を 実行 し 、 実行 後 の モジュールグローバル 辞書 を 返し ます
mutex が ロック さ れ て い なけれ ば function (argument ) を 実行 し ます
name に 一致 する ヘッダ から なる 行 の リスト が あれ ば 、 それら を 全て 返し ます
objs で 指定 し た オブジェクト のい ずれ か を 参照 し て いる オブジェクト の リスト を 返し ます
key が メッセージ に 対応 し て いれ ば true を 、 そう で なけれ ば false を 返し ます
与え られ た user で ログイン し ます
python 実装 の バージョン 管理 システム 上 の ブランチ を 特定 する 文字 列 を 返し ます
この メソッド は run で 使わ れる testresult の インスタンス を 返し ます
最大 で size バイト の 解凍 さ れ た データ を 読み出し 、 文字 列 として 返し ます
子 プロセス が 終了 する まで 待ち ます
ファイル の ヘッダ 情報 を もと に 、 保存 さ れ た サウンドデータ の 形式 を 識別 し ます
a および b および それら の 直下 に ある 共通 の サブディレクトリ 間 で の 比較 結果 を 出力 し ます
v 3d の 呼び出し に 相当 し ます が 、 それ より も 速い です
もし 与え られ た セクション が 存在 し て いる 場合 は 、 指定 さ れ た 値 を 与え られ た オプション に 設定 し ます
角 x を ラジアン から 度 に 変換 し ます
テンプレート 置換 を 行い 、 新 た な 文字列 を 生成 し て 返し ます
パラメタ で 渡さ れ た データ の 入っ た テキストノード を 生成 し て 返し ます
expr が none で ある こと （ そう で ない こと ） を テスト し ます
浮動 小数 点数 で サンプルデータ の 最大 値 を 返し ます
この ヘルパ 関数 は スキーマ から プロキシサーバー の url へ の マッピング を 行う 辞書 を 返し ます
捕捉 さ れ ない 例外 が 発生 し た 時 に 呼び出さ れ ます
この テストケースクラス で 使わ れる テスト 結果 クラス の インスタンス を ( もし run メソッド に 他 の 結果 インスタンス が 提供 さ れ ない なら ば ) 返し ます
msgs 文 を 解釈 し て 、 メッセージ の リスト に し ます
x に 等しい deque の 要素 を 数え 上げ ます
強制 改行 挿入 し ます
引数 device は 整数 です
tzinfo が none の 場合 、 none を 返し 、 そう で ない 場合 に は self .tzinfo .tzname (self ) を 返し ます
オブジェクト が メソッド の 場合 は 真 を 返し ます
任意 に 選ん だ ( key , message ) ペア を 返し ます
フォルダ の 完全 な パス 名 を 返し ます
現在 選択 さ れ て いる 、 テンポラリファイル を 作成 する ため の ディレクトリ を 返し ます
ファイルオブジェクト が 参照 し て いる ファイル の 指定 部分 に ロック を かけ ます
カタログ から message id を 検索 し て 、 対応 する メッセージ 文字列 を 、 unicode で エンコード し て 返し ます
terminfo 機能 名 capname に対応 する 機能 値 を 文字 列値 で 返し ます
これ は obsolete で 、 バージョン 2 . 1 以前 の python と 、 ビット ・レベル の 互換 性 の ため に 提供 さ れ て ます
正規 表現 キャッシュ を クリア し ます
content -type ヘッダ で 指定 さ れ た 主要 型 を 返し ます
pathname に関連付け られ た データ を 返し ます
新しい オブジェクト の グループ を 作り ます ； グループオブジェクト を 返し ます
最新 の メッセージ を 設定 し ます ( 内部 使用 のみ )
optionparser に opt _str に対応 する オプション が ある 場合 、 その オプション を 削除 し ます
x を deque の 右側 につけ 加え ます
標準 で url を 開く オブジェクト として openerdirector の インスタンス を インストール し ます
データベース 探索 に おける 最後 の キー / 値 を 返し ます
msirecordsetstream を通し て field を value という 名 の ファイル の 内容 に セット し ます
パーサ が 許容 する 現在 の 最大 フィールドサイズ を 返し ます
sequence を この メッセージ を 含む シーケンス の リスト に 追加 する
現在 の オーディオ 形式 を format に 設定 しよ う と 試み ます — format について は getfmts の リスト を 参照 し て くだ さい
現在 の dtdhandler を 返し ます
x に y の 符号 を 付け て 返し ます
親要素 の 子要素 リスト の 中 で の item の インデックス を 返し ます
pack _string と 同じく 、 可変 長 の バイトストリーム を パック し ます
最初 の 文字 のみ を 大文字 に し た 文字 列 の コピー を 返し ます
この 関数 は ユニコード 文字 列 として メモリアドレス address から 始まる ワイドキャラクタ 文字 列 を 返し ます
リクエスト に対する wsgi 環境 を 含む 辞書 を 返し ます
文字列 から なる シーケンス を ファイル に 書き込み ます
exec 文 を 利用 し て 文 を 実行 し デバッグ し ます
データバッファ 中 の アンパック 処理 位置 を position に 設定 し ます
指定 さ れ た パラメータ を content -type ヘッダ 中 から 完全 に とり の ぞき ます
名前 が folder で ある フォルダ を 表わす maildir インスタンス を 返し ます
section で 指定 し た セクション で 利用 できる オプション の リスト を 返し ます
以前 の putwin 呼び出し で ファイル に 保存 さ れ て いる 、 ウィンドウ 関連 データ を 読み出し ます
x と y の 和 を 返し ます
producer fifo の トップ に none を プッシュ し ます
スクロールバー の インタラクション を 処理 し ます
( プロセッサ また は その 他 の ) 積算 時間 を 秒 で 表す 浮動 小数 点数 から なる 、 5 要素 の タプル を 返し ます
module _or _name に対する pep 3 0 2 “ loader ” を 取得 し ます
新しい cab ファイル を cabname という 名前 で 作り ます
クッキー が 指定 さ れ た 名前 の クッキー 属性 を もっ て いれ ば 、 その 値 を 返し ます
以前 の urlretrieve で 生成 さ れ た 可能 性 の ある キャッシュ を 消去 し ます
ウィンドウ 上 の 背景 プロパティ を 、 attr を 属性 と する 文字 ch に 設定 し ます
文字列 の よう に コネクション の 向こう 側 から 送 られ た バイトデータ の 完全 な メッセージ を 返し ます
この メソッド は 、 ユーザ に対し て エラーページ を 出力 する wsgi アプリケーション です
この メソッド は 、 現在 の フレーム の ファイル 名 の 中 に ブレークポイント が 存在 する かど う か を チェック し ます
サンプルサイズ を （ バイト 数 で ） 設定 し ます
この 関数 は pycode _new という c 関数 へ の インターフェイス です
ストリーム から 行 の リスト を 読み込ん で 返し ます
python の バージョン を 、 ' major .minor .patchlevel ' 形式 の 文字 列 で 返し ます
eval 関数 を 利用 し て 式 を 実行 し デバッグ し ます
get (false ) と 同じ 意味 です
標準 c の memmove ライブラリ 関数 と 同じ もの です
レコード の メッセージ id を 返し ます
空白 文字 を 含め 、 ascii 印字 可能 文字 か どう か を 調べ ます
[ 0 , 1 ] の 範囲 の 浮動 小数 点数 で 、 シーケンス の 類似 度 を 測る 値 を 返し ます
nvarray と 似 て い ます が 、 各 ペア は 始め に 座標 を 、 ２ 番目 に 法線 を 持っ て い ます
self と other が 同じ 指数 を 持っ て いる か 、 あるい は 双方 とも nan で ある 場合 に 真 を 返し ます
新 た な md5 オブジェクト を 返し ます
cmd を サブプロセス として 実行 し ます
メイン 文 の 実行 時間 を number 回取 得 し ます
メッセージ 全体 を フラット な 文字 列 として 返し ます
mapname 中 で key に 一致 する もの を 返す か 、 見つから ない 場合 に は エラー ( nis .error ) を 送出 し ます
指定 要素 に name で 渡し た 名前 の 属性 が 存在 し て いれ ば true を 返し ます
単純 な エントリ を 警告 フィルタ 仕様 の リスト に 挿入 し ます
共有 queue .queue オブジェクト を 作成 し て 、 その プロキシ を 返し ます
new -style class ( 新しい 形式 の クラス ) ( object から 派生 し た クラス ) における プロパティ 属性 を 返し ます
ホスト 名 から 、 ipv 4 形式 の 各種 アドレス 情報 を 取得 し ます
serve _forever ループ に 停止 する よう に 指示 し 、 停止 さ れる まで 待ち ます
現在 の カラム と 指定 タブ 幅 に 従っ て 文字 列中 の タブ を 展開 し 、 一つ また は それ 以上 の スペース に 置き 換え ます
アレイ の すべ て の 要素 に対し て 「 バイトスワップ 」 ( リトルエンディアン と ビッグエンディアン の 変換 ) を 行い ます
バージョン 2 . 7 で 撤廃 : list (elem ) を 使う か 、 element に対し て イテレート し て くだ さい
encoding に 指定 し た codec を 検索 し 、 streamreader クラス 、 また は ファ クトリ 関数 を 返し ます
x の 逆正 弦 を 返し ます
カレントプロセス に 対応 する process オブジェクト を 返し ます
トレースバック の スタック の 先頭 の 関数 を 逆アセンブル し ます
文字列 を コピー し 、 小文字 に 変換 し て 返し ます
ファイル を 閉じ ます
キーワード 引数 で 指定 さ れ た データメンバ が 置き 換え られる こと を 除き 、 同じ値 を 持つ date オブジェクト を 返し ます
ソケット に 指定 さ れ た オプション を 返し ます (unix の マニュアルページ getsockopt ( 2 ) を 参照 )
チャンク の 名前 （id ） を 返し ます
pattern に マッチ する directory メールボックス 名 を 列挙 し ます
code が テーブル c . 8 ( 表示 プロパティ の 変更 また は 撤廃 ) かどう か 判定 し ます
x が 負 の 数 で あれ ば true を 返し ます
指定 さ れ た キー を 開き 、 ハンドルオブジェクト を 返し ます
フォーム に 2 次元 ポジショナーオブジェクト を 加え ます
テスト test 実行 中 に 、 想定 外 の 例外 が 発生 し た 場合 に 呼び出さ れ ます
組み込み の property の サブクラス で 、 抽象 プロパティ で ある こと を 示し ます
インタープリタ の インポートロック を 解放 し ます
x の 階乗 を 返し ます
environ 属性 を 、 フル 実装 ( fully -populated ) の wsgi 環境 に 設定 し ます
1 引数 で 呼び出さ れ た 場合 、 指定 さ れ た item の カラム と 値 の ペア から なる 辞書 を 返し ます
クエリ 結果 から 次 の row を フェッチ し て 、 1つ の シーケンス を 返し ます
x の 双曲 線正 接 を 返し ます
割り付け スタイル ( spacing style ) を spacing に 設定 し ます
data の 中 から url を 検索 し 、 url の 開始 位置 、 終了 位置 、 url その もの を 返し ます
接続 を 行う 先 の ホスト 名 を 返し ます
self を コンテキスト と する 新 た な decimal インスタンス を num から 生成 し ます
s [start :end ] における 、 部分 文字 列 sub の ( 重複 し ない ) 出現 回数 を 返し ます
その メッセージ 中 の ペイロード の charset インスタンス を 返し ます
content -type ヘッダ で 指定 さ れ た 下位 型 を 返し ます
timeit を 複数 回呼 び 出し ます
アーカイブ 化 を サポート し て いる フォーマット の リスト を 返し ます
この 関数 は 、 現在 処理 中 の 例外 を 示す 三つ の 値 の タプル を 返し ます
マネージャ の 制御 下 に ある 実際 の サーバ に 相当 する server オブジェクト を 返し ます
echo モード に 入り ます
文字 を 取得 し ます
ツリービュー の 垂直 方向 の 位置 を 問い合わ せ たり 、 変更 し たり し ます
浮動 小数 点数 f から 新しい decimal インスタンス を 生成 し ます が 、 self を コンテキスト として 丸め ます
ファイル database の sqlite データベース へ の 接続 を 開き ます
x の 逆余 弦 を 返し ます
address で 示さ れる リモートソケット に 接続 し ます
サンプル の フォーマット を 返し ます
コネクション の 向こう 側 から send を 使用 し て 送ら れ た オブジェクト を 返し ます
ディザ 処理 を 行わ ず に 、 8 ビットグレースケール 画像 を 2ビットグレースケール 画像 に 変換 し ます
‘fill point ’ を 設定 し ます
この 関数 は 標準 的 な . mo ファイル 検索 アルゴリズム を 実装 し て い ます
アーカイブ 中 の ファイル 名 name の 内容 を バイト 列 に して 返し ます
ファイル 形式 の オブジェクト fsrc の 内容 を fdst へ コピー し ます
パラメタ :to _angle – 数 ( 整数 また は 浮動 小数 点数 ) タートル の 向き を to _angle に 設定 し ます
expat が 文書 型宣 言 の 解析 を 終え た とき に 呼び出さ れ ます
tarfile オブジェクト の tarfile から 、 次 の メンバ を 読み込ん で 、 それ を tarinfo オブジェクト として 返し ます
現在 の 左 マージン 位置 の 左側 に 配置 さ れる ラベル を 挿入 し ます
上 の 全 パラメータ を 一度 に 設定 し ます
現在 の ノード の 子 ノードリスト の 末尾 に 新た な 子 ノード を 追加 し 、 newchild を 返し ます
もし name が tar アーカイブファイル で あり 、 tarfile モジュール で 読み出せる 場合 に true を 返し ます
tarinfo オブジェクト から 文字 列 バッファ を 作成 し ます
現在 の プロセス の real , effective , saved group id を 設定 し ます
記号 が パラメータ なら ば true を 返し ます
year 年 month 月 に対する イテレータ を 返し ます
文字列 が 空白 文字 だけ から なり 、 かつ 1 文字 以上 ある 場合 に は 真 を 返し 、 そう で ない 場合 は 偽 を 返し ます
数値 を 工学 で 用い られる 形式 ( 工学 表記 ; enginnering notation ) の 文字列 に 変換 し ます
これら の 関数 は 、 ファイル と ディレクトリ 節 で 説明 さ れ て い ます
指数 分布 です
現在 の プロセス の 実効 (effective ) グループ id を 返し ます
テーブル b . 2 ( nfkc で 用い られる 大小 文字 の 対応 付け ) に従っ て 、 code に対応付け られ た 値 を 返し ます
オブジェクト を 固定 し ます
isfile と 同じ です
空 で ない シーケンス seq から ランダム に 要素 を 返し ます
元 の set と 全 て の other に 共通 する 要素 だけ を 残し て set を 更新 し ます
unpack 関数 と 同じ 、 コンパイル さ れ た フォーマット を 利用 する メソッド です
width の 長さ を もつ 右寄 せ し た 文字列 を 返し ます
unicode 文字 unichr に 割り 当て られ た 、 鏡像 化 の プロパティ を 返し ます
x を y で 除算 し た 値 を 整数 に 切り捨て て 返し ます
選択 さ れ た メールボックス から 削除 さ れ た 要素 を 永久 に 除去 し ます
警告 フィルタ 仕様 の リスト に エントリ を 一つ 挿入 し ます
演算 対象 から その _ _ getitem __ メソッド を 使っ て item を 取得 する 呼び出し 可能 な オブジェクト を 返し ます
コネクション の 向こう 側 へ recv を 使用 し て 読み込む オブジェクト を 送り ます
名 前付 き エンティティ 参照 を str の 値 に 変換 する か 、 また は none を 返し ます
code が テーブル c . 2 ( 制御 文字 、 c . 2 . 1 および c . 2 . 2 の 和集合 ) かどう か 判定 し ます
引数 が 無言 nan で あれ ば true を 、 そう で なけれ ば false を 返し ます
オーディオチャンネル 数 （ モノラル なら 1 、 ステレオ なら 2 ） を 返し ます
‘fill point ’ を 返し ます
圧縮 形式 と その 記述 を 設定 し ます
この 関数 は 呼び出し 側 から ast に st オブジェクト を 受け取り 、 解析 木 と 等価 な python の リスト を 返し ます
文字列 と オプション の 引数 globals 、 locals を とり ます
共有 list オブジェクト を 作成 し て 、 その プロキシ を 返し ます
与え られ た ユーザ 名 に 対応 する パスワードデータベース の エントリ を 返し ます
(y , x ) に 文字 ch を 属性 attr で 描画 し 、 行 の x から の 内容 を 1 文字 分右 に ずらし ます
ファイル 記述子 fd の 複製 を 返し ます
シーケンス に i 番目 の 要素 が ある 場合 に は その 要素 を 、 そう で ない 場合 に は none を 返し ます
音声 データ 全 サンプル 中 に おける 最小 値 と 最大 値 から なる タプル を 返し ます
ソケット に データ を 送信 し ます
パネル を スクリーン 座標 ( y , x ) に 移動 し ます
引数 object が 呼び出し 可能 オブジェクト で あれ ば 、 true を 返し ます
ファイル name あるい は ファイルオブジェクト fileobj のどちらか に対し て ( その ファイル 記述子 に os .fstat を 使っ て ) tarinfo オブジェクト を 作成 し ます
全て の 親 オブジェクト を 削除 し ます
それぞれ の 桁 に 論理 演算 and を 当て はめ ます
色 color _number の 赤 、 緑 、 および 青 ( rgb ) 要素 の 強度 を 返し ます
システムコール getsid を 呼び出し ます
与え られ た csvfile 内 の 行 を 反復 処理 する よう な reader オブジェクト を 返し ます
これら の 関数 は 最後 に ユーザ が show _file _selector で 選択 し た ディレクトリ 、 パターン 、 ファイル 名 （パス の 末尾 のみ ） を 返し ます
プロセス id pid の プロセス の プロセス ・ グループ id を 返し ます
フォーム に スライダーオブジェクト を 加え ます
ウィンドウ を 親ウィンドウ の 中 で 移動 し ます
文字 列中 の 領域 s [start , end ] に sub が 含まれる 場合 、 その 最大 の インデクス を 返し ます
compress と decompress を 呼ぶ ため の 様々 な オプション を セット し ます
pop を 行い 、 heap から 最初 の 要素 を 返し ます
キュー から イベント を 消去 し ます
警告 を 通常 の 方法 で 書式 化 し ます
getargvalues で 取得 し た 4つ の 値 を 読み やすく 整形 し ます
result は 外部 関数 が 返す もの で 、 restype 属性 で 指定 さ れ ます
上 で 説明 さ れ た 関数 の ドキュメント を 参照 し て くだ さい
現在 の ポート の コンフィギュレーション を 含ん だ コンフィギュレーションオブジェクト を 返し ます
parsedate と 同様 の 機能 を 提供 し ます が 、 none また は 1 0 要素 の タプル を 返す ところ が 違い ます
string を 圧縮 し 、 圧縮 さ れ た データ を 含む 文字 列 を 返し ます
item を キュー に 入れ ます
platform : windows ioctl メソッド は wsaioctl システムインタフェース へ の 制限 さ れ た インタフェース です
根底 に ある messagebeep 関数 を プラットフォーム の api から 呼び出し ます
この メソッド は タグ の 開始 部分 を 処理 する ため に 呼び出さ れ ます
データベース の 順方 向探 索 に おい て 、 key より も 後 に 来る キー を 返し ます
すで に 表示 用 に 書式 化 さ れ た 文字 データ を 出力 し ます
nbytes バイト まで の データ を ソケット から 受信 し て 、 その データ を 新しい 文字 列 に する の で は なく buffer に 保存 し ます
オブジェクト を 登録 し 、 その オブジェクト の register _function で 登録 さ れ て い ない メソッド を 公開 し ます
コンボボックス の 現在 の 値 を 返し ます
ファイル の メモリコピー 内 で の 変更 を ディスク へ フラッシュ し ます
この クラス で 宣言 さ れ て いる メソッド 名 から なる タプル を 返し ます
iterable から 要素 を 選択 し て 返す イテレータ を 作成 し ます
子 エレメント の ファクトリー
パーザ に テキスト を 入力 し ます
k ビット 分 の 乱数 ビット を 納め た python の long 整数 を 返し ます
ハンドルオブジェクト から windows ハンドル を 切り離し ます
signoff : commit changes , unlock mailbox , drop connection . サインオフ ： 変更 を コミット し 、 メールボックス を アンロック し て 、 接続 を 破棄 し ます
引数 で 指定 し た オブジェクト のい ずれ か から 参照 さ れ て いる 、 全て の オブジェクト の リスト を 返し ます
この イテレータ は msg 中 のすべて の サブパート に 含まれる ペイロード を すべ て 順 に たどっ て いき 、 ペイロード 内 の 文字列 を 1 行 ずつ 返し ます
ソケット の ファイルディスクリプタ を 整数 型 で 返し ます
x の 実数 部 また は 虚数 部 が 非数 ( nan ) であれ ば true を 返し ます
syslog モジュール の 値 を リセット し 、 システムライブラリ の closelog を 呼び出し ます
モジュール name を 見つけよ う とし ます
ベータ 分布 です
それぞれ の 桁 に 論理 演算 xor を 当て はめ ます
現在 の ファイル 位置 から 長さ 1 の 文字列 を 返し ます
application を ラップ し 、 新しい wsgi アプリケーションオブジェクト を 返し ます
none を 返し ます
新しい 擬似 端末 の ペア を 開き ます
行編集 バッファ の 現在 の 内容 を 返し ます
報告 す べき マウスイベント を 設定 し 、 ( availmask , oldmask ) の 組から なる タプル を 返し ます
fullname に 指定 し た モジュール を ロード し ます
rows パラメタ ( 上記 row の リスト ) 全 て を 現在 の 表現 形式 に 基づい て 書式 化 し 、 writer の ファイルオブジェクト に 書き込み ます
object ( 複数 でも 可 ) を sep で 区切り ながら ストリーム 、 file に 表示 し 、 最後 に end を 表示 し ます
ファイル 記述子 fd ( fileno メソッド を 提供 し て いる ファイルオブジェクト も 含む ) に対し て ロック 操作 op を 実行 し ます
aiff ファイル を 作り ます
ライブラリ で 使わ れ て いる 時刻 変換 規則 を リセット し ます
x より 小さい 最大 の 表現 可能 な 数 を 返し ます
数値 a および b について a * * b を 返し ます
デフォルト で は 、 ユーザ 定義 の 関数 、 集計 関数 、 変換 関数 、 認可 コールバック など は トレースバック を 出力 し ませ ん
指定 し た 標準 ファイルオブジェクト で 新しい posixfile オブジェクト を 作成 し ます
cd -rom ドライブ から キャディ を 排出 し ます
x - y * n を 返し ます
タグ 名 か パス に マッチ する 全て の サブエレメント を 探し ます
フレーム また は トレースバックオブジェクト の 情報 を 取得 し ます
認証 情報 が ある 場合 、 認証 情報 付き で 再度 リクエスト を 試み ます
gzipfile (filename , mode , compresslevel ) の 短縮 形 です
現在 の プロセス ・ グループ の id を 返し ます
サーバ が 指定 し た 、 クッキー の 期限 が 切れる べき 時 が 過ぎ て いれ ば 真 を 返し ます
プロファイラ の ログファイル の ファイル ・ ディスクリプタ を 返し ます
引数 lines の 内容 を 解釈 し ます
リクエスト を 現在 の 作業 ディレクトリ から の 相対 的 な パス として 解釈 する こと で 、 リクエスト を ローカルシステム 上 の ファイル と 対応 付け ます
圧縮 形式 と その 記述 を 設定 し ます
プログレスダイアログ の タイトルバー の テキスト を newstr に 設定 し ます
現在 の パック 処理 用 バッファ を 文字列 で 返し ます
エラー を 発生 し ます
createlock で 生成 さ れ た スレッドロック を 獲得 し ます
文字列 の 先頭 から 文字 を 取り除い た コピー を 生成 し て 返し ます
すで に 処理 済 み キュー に 入っ て いる データ を 処理 し て 返し ます ( very lazy モード )
リクエスト を 遂行 でき なかっ た 際 に 、 エラー を ログ に 記録 し ます
関数 を 呼び出し て いる 処理 の スレッド に 対応 する thread オブジェクト を 返し ます
プロンプト question と ”yes ”、 ”no ”、 ” cancel ” という ラベル の 3つ ボタン が 付い た ダイアログ を 表示 し ます
サーバ 上 の ファイル filename の サイズ を 尋ね ます
リスト で 指定 し た クラス の 継承 関係 から 、 ネスト し た リスト を 作成 し ます
obj また は obj 内 に 入っ て いる オブジェクト の docstring 中 で 定義 さ れ て いる doctest の リスト を 返し ます
この 関数 は 、 書式 指定 の 操作 を 行い ます
x の 余弦 を 返し ます
選択 状態 の 要素 として items を 追加 し ます
パラメータ として オーディオサンプル を python 文字列 を 受け取り 、 再生 し ます
rawdata が 文字列 で あれ ば 、 http _cookie として 処理 し 、 その 値 を morsel として 追加 し ます
現在 の ファイル を 閉じ ます
物理 スクリーン ( physical screen ) を 更新 し ます
ファイル から 一行 全部 を 読み込み ます
モジュール modulename を インポート し 、 もしその モジュール が 安全 で ない と み なさ れる なら 、 importerror 例外 を 発生 し ます
与え られ た path に対し て stat システムコール 相当 の 処理 を 実行 し ます
新しい 擬似 端末 の ペア を 開き ます
code が テーブル c . 3 ( プライベート 利用 ) かどう か 判定 し ます
入力 バッファ から 処理 さ れ て い ない ソーステキスト を 取り除き ます
フォーマッタ が 指定 さ れ て いれ ば 、 フォーマッタ を 使っ て レコード を 書式 化 し ます
eval (raw _input (prompt )) と 同じ です
quote と 似 て い ます が 、 加え て 空白 文字 を プラス 記号 ( “+ ”) に 置き 換え ます
プロセス が 実行 中 か を 判別 し ます
メールボックス 中 の シーケンス を get _sequences で返さ れる よう な 名前 と キー の リスト を 対応 付ける 辞書 sequences に 基づい て 再定 義 し ます
角 x を 度から ラジアン に 変換 し ます
タートル が 見え て いる 状態 なら ば true を 、 隠さ れ て いれ ば false を 返し ます
url url を 開き ます
yes が 1 の 場合 、 getch は 非 ブロック で 動作 し ます
print _usage と 同じ です が 、 使用 法 メッセージ を 表示 する 代わり に 文字 列 として 返し ます
新しい スレッド が 作られる 際 に 使わ れる スレッド の スタックサイズ を 返し ます
デバッガ に 制御 さ れ た 状態 で ( 文字 列 として 与え られ た ) statement を 実行 し ます
この inputsource の システム 識別子 を セット し ます
現在 の プロセス の real , effective , saved user id を 示す 、 ( ruid , euid , suid ) の タプル を 返し ます
スクリーン 上 の マウスクリック に bye メソッド を 束縛 し ます
この メソッド は タグ 外 の & name ; 形式 の 一般 の エンティティ 参照 ( entity reference ) name を 処理 する ため に 呼び出さ れ ます
style の 指定 さ れ た オプション の デフォルト 値 を 問い合わ せ たり 、 設定 し たり し ます
generate _tokens ジェネレータ は 一つ の 引数 readline を 必要 と します
sax パーサ を 作成 し て ドキュメント を パース し ます
システム の errno 変数 の 、 スレッドローカル な プライベートコピー を 返し ます
source を 解析 し て ast ノード に し ます
year 年 month 月 の 週 の リスト を 返し ます
ファイル の モード が シンボリックリンク の 場合 に ゼロ で ない 値 を 返し ます
許可 する ドメイン 、 あるい は none を 設定 し ます
プロセス の 処理 を 開始 する ため の メソッド です
補完 表示 関数 を 設定 あるい は 解除 し ます
テストメソッド が 実行 さ れ 、 結果 が 記録 さ れ た 直後 に 呼び出さ れる メソッド です
指定 さ れ た tab _id の オプション を 問い合わ せ たり 、 変更 し たり し ます
その クッキー が 指定 さ れ た 名前 の クッキー 属性 を もっ て いる 場合 に は 真 を 返し ます
引数 なし で 呼び出さ れ た とき 、 control -c ハンドラ が インストール さ れ て いる と 、 この 関数 は それ を 取り除き ます
シンボリックリンク が 指し て いる パス を 表す 文字 列 を 返し ます
以前 開か れ た レジストリキー を 閉じ ます
記法 の 宣言 ( notation declaration ) で 呼び出さ れ ます
(y , x ) から 始まり 、 n の 長さ を 持つ 、 文字 ch で 作られる 水平線 を 表示 し ます
ihave 命令 を 送信 し ます
二つ の 演算 対象 を 抽象 的 な 表現 を 使い 符号 を 無視 し て 比較 し ます
ユーザ が 供給 し た 引数 を メッセージ に 交ぜ た 後 、 この logrecord インスタンス へ の メッセージ を 返し ます
name に 一致 する 最後 の ヘッダ から 先頭 および 末尾 の 空白 を 剥ぎ取っ た 単一 の 文字列 を 返し ます
与え られ た ファイル 記述子 から 、 kqueue オブジェクト を 作成 する
アクティブ な スレッド の 現在 の コンテキスト を 返し ます
pushbutton コントロール を 追加 し て 返し ます
ペン を 下ろ し ます – 動く と 線 が 引か れ ます
全て の 入力 バッファ を フラッシュ し ます
unicode 文字列 unistr の 正規 形 form を 返し ます
gettext と 同様 です が 、 指定 さ れ た domain から メッセージ を 探し ます
python の バージョン を 、 文字列 の タプル ( major , minor , patchlevel ) で 返し ます
content -type ヘッダ の パラメータリスト を 返し ます
radiobuttongroup コントロール を 追加 し て 返し ます
登録 さ れ て いる 全て の 表現 形式 を 返し ます
yes が 1 ならば 、 次 の refresh は ウィンドウ を 完全 に 消去 し ます
サーバ の コンストラクタ によって 呼び出さ れ 、 適切 な アドレス に ソケット を バインド し ます
1 つ ある い は それ 以上 の パス の 要素 を うまく 結合 し ます
共有 threading .condition オブジェクト を 作成 し て 、 その プロキシ を 返し ます
python ソースファイル として 実装 さ れ て いる モジュール を ロード し て 初期化 し 、 モジュールオブジェクト を 返し ます
打鍵 を 読み取り 、 読み出さ れ た 文字 を 返し ます
与え られ た trace インスタンス の run , runctx , runfunc の 以前 の 呼び出し について 集計 し た 結果 を 納め た coverageresults オブジェクト を 返し ます
copy と 類似 し て い ます が 、 メタデータ も 同様 に コピー さ れ ます
function の 静的 メソッド を 返し ます
breakpoint .bpbynumber の 中 で arg の インデックス を 持つ ブレークポイント を 削除 し ます
sigabrt シグナル を 現在 の プロセス に対し て 生成 し ます
first と second が 近似 的 に 等しい （ 等しく ない ） こと を テスト し ます
yiq から rgb に 変換 し ます
fd から epoll オブジェクト を 作成 する
x の 小数 部分 と 整数 部分 を 返し ます
fifo の 場合 に true を 返し ます
バッファ に 存在 する サンプル の 数 を 返し ます
バイナリ 値 を base 6 4 で エンコード し 、 出力 ストリームオブジェクト out に 出力 し ます
新た な 子 ノード を 既存 の 子 ノード の 前 に 挿入 し ます
ストリーム を 閉じ 、 この オブジェクト の インスタンス を 使用 でき なく し ます
style の 指定 さ れ た オプション の 動的 な 値 を 問い合わ せ たり 、 設定 し たり し ます
ユーザ の 現在 の 行削 除文字 を 返し ます
アレイ を 同じ 要素 を 持つ 普通 の リスト に 変換 し ます
レコード に 応じ た サブジェクト 行 を 指定 し たい なら 、 この メソッド を オーバライド し て くだ さい
ファイル 記述子 fd に関連付け られ て いる 端末 デバイス を 特定 する 文字 列 を 返し ます
現在 の プロセス に 関連 づけ られ た 従属 グループ id の リスト を 返し ます
オーディオファイル の チャンネル 数 を 設定 し ます
ウィンドウ 内 の 全て の 行 を 、 最後 に refresh を 呼ん だ 際 から 変更 さ れ て い ない もの として マーク し ます
月 曜日 を 0 、 日曜日 を 6 として 、 曜日 を 整数 で 返し ます
xml -rpc の イントロスペクション 関数 、 system .listmethods 、 system .methodhelp 、 system .methodsignature を 登録 し ます
タグ の 処理 を 停止 し ます
unicode 文字 unichr に 割り 当て られ て いる 数値 を 、 float 型 で 返し ます
意味 の ある ( cgi の 使う ) 環境 変数 を html で 出力 し ます
a _standout 属性 を オフ に し ます
プロセス を 終了 し ます
xml エレメント を 全て の 子 エレメント を 含め て 表現 する 文字 列 を 生成 し ます
後方 互換 性 の ため の メソッド です
どちらか に のみ 含ま れ て 、 共通 に は 持た ない 要素 のみ で set を 更新 し ます
key に対応 する メッセージ の 表現 を ファイル 風表 現 として 返し ます
この ルーチン が メインイベントループ で 、 作成 し た アプリケーション が 動き出す ため に は これ を 呼ぶ こと に なり ます
stat のよう に ファイル 記述子 fd の 状態 を 返し ます
address で 渡し た アドレス を 使用 する リスナー に対し て コネクション を 確立 しよ う として connection を 返し ます
メッセージ の エンベロープヘッダ を unixfrom に 設定 し ます
ヘッダ name の 内容 を 取得 し て 返す か 、 該当 する ヘッダ が ない 場合 に は default を 返し ます
単精度 ( single -precision ) の 浮動 小数 点数 value を パック し ます
object が python の ジェネレータ 関数 で ある とき に 真 を 返し ます
object の サイズ を バイト 数 で 返し ます
turtle オブジェクト その もの を 返し ます
section の option 変数 を 取得 し ます
typename という 名前 の tuple の 新しい サブクラス を 返し ます
section の option を 浮動 小数 点数 として 評価 する 関数 です
サーバ が 要求 待ち を 行っ て いる ソケット の ファイル 記述子 を 整数 で 返し ます
開か れ た ファイル から 値 を 一つ 読ん で 返し ます
指定 さ れ た モジュール 名 に対する pep 3 0 2 importer を yield します
要素 から iterable の 要素 また は mapping の 要素 が 引か れ ます
「 原子 的 ( atomic )」 な test -and -set 操作 です
二つ の 値 を 数値 として 比較 し ます
executable で 指定 し た 実行 可能 ファイル （ 省略 時 は python インタープリタ の バイナリ ） の 各種 アーキテクチャ 情報 を 調べ ます
指定 さ れ た フィルタ filt を この ハンドラ に 追加 し ます
文字列 を 改行 部分 で 分解 し 、 各行 から なる リスト を 返し ます
tputs (str , 1 , putchar ) と 等価 です ; 現在 の 端末 に おける 、 指定 さ れ た terminfo 機能 の 値 を 出力 し ます
stdio の fseek と 同様 に 、 ファイル の 現在 位置 を 設定 し ます
文字列 を 標準 エラーストリーム ( sys .stderr ) へ 書き込み ます
現在 の ポインタ の フレーム 位置 を 返し ます
与え られ た line が message の 区切り と なる デリミタ で あっ た 場合 に 真 を 返し ます
code は 、 1 行 以上 の python コード を 含む 文字 列 か 、 コンパイル さ れ た コードオブジェクト の どちらか で なけれ ば なり ませ ん
同じ キー を もつよう な 要素 から なる iterable 中 の グループ に対し て 、 キー と グループ を 返す よう な イテレータ を 作成 し ます
左上 の 角 の 座標 を あらわす タプル ( y , x ) を 返し ます
バッファインタフェース を サポート する オブジェクト から 完全 な メッセージ として バイトデータ を 送り ます
短縮 さ れ た 曜日 名 を 含む ヘッダ を 返し ます
インターネットポート 番号 と プロトコル 名 から 、 サービス 名 を 取得 し ます
ディレクトリ を sys .path に 追加 し て 、 その 中 の pth ファイル も 処理 する
色ペア の 定義 を 変更 し ます
filename という 名前 の ファイル へ の パス を 返し ます
flags で 指定 さ れ た フラグ を セット し ます が 他 の フラグ は 変え ませ ん
データベース から 得 られる バイト 列 を 希望 する python の 型 に 変換 する 呼び出し 可能 オブジェクト ( callable ) を 登録 し ます
xml -rpc サーバ で 実装 さ れ て いる メソッド の 名前 を 指定 し 、 その メソッド を 解説 する 文書 文字 列 を 取得 し ます
slave 命令 を 送信 し ます
バイナリデータ を quoted -printable 形式 で エンコード し て 1 行 から 複数 行 の ascii 文字列 に 変換 し ます
サーバ 上 の メールボックス に チェックポイント を 設定 し ます
パスワードデータベース の 全て の エントリ を 、 任意 の 順番 で 並べ た リスト を 返し ます
現在 の entityresolver を 返し ます
namespaceuri と localname によっ て 指定 し た 属性 の 値 を 文字 列 として 返し ます
モジュール を 読み込み 、 クラス 名 から クラス 記述 オブジェクト に マップ する 辞書 を 返し ます
現在 追跡 し て いる オブジェクト の リスト を 返し ます
指定 さ れ た キー と 、 その サブキー 全 て を 指定 し た ファイル に 保存 し ます
バージョン 2 . 3 で 撤廃 : 代わり に mkstemp を 使っ て 下さい . 一時ファイル の 絶対 パス 名 を 返し ます
引数 が ない 場合 、 現在 の プラットフォーム に関する 全て の 構成 変数 の 辞書 を 返し ます
オブジェクト が getset デスクリプタ の 場合 に 真 を 返し ます
mailbox と 名づけ られ た 古い メールボックス を 削除 し ます
フォーム に ブラウザオブジェクト を 加え ます
called for every processing instruction . 処理 命令 を 処理 する ごと に 呼び出さ れ ます
要素 が 名前 空間 宣言 を 含ん で いる 場合 に 呼び出さ れ ます
複数 の コンテキストマネージャ を 一つ の ネスト さ れ た コンテキストマネージャ へ 結合 し ます
ファインダ に ファイル か フォルダ で ある file を フォルダ destdir に コピー する よう 命令 し ます
タプル ( response , date , time ) を 返し ます
月 曜日 を 1 , 日曜日 を 7 として 、 曜日 を 整数 で 返し ます
path で 指定 し た ファイル の 、 パッケージ 名 を 含ま ない モジュール 名 を 返し ます
x の 余弦 を 返し ます
ファイル を 関連 付け られ た アプリケーション を 使っ て 「 スタート 」 し ます
時刻 を 表現 する 文字列 を フォーマット に 従っ て 解釈 し ます
msirecordcleardata を通し て レコード の 全て の フィールド を 0 に セット し ます
引数 が ( 正また は 負 の )ゼロ で あれ ば true を 、 そう で なけれ ば false を 返し ます
year 年 month 月 に対する itermonthdates と 同じ よう な イテレータ を 返し ます
この 関数 は ファイル が ファイルシステム 上 で 見る こと が できる よう 保証 さ れ て いる 点 を 除き 、 temporaryfile と 全く 同じ に 働き ます
メッセージ の 配送 日時 を date に セット し ます
python 実装 を 指定 する 文字 列 を 返し ます
コンストラクタ で 与え られ た url を 返し ます
現在 の プロセス の 実際 の グループ id を 返し ます
（ ユニークid による ） メッセージダイジェスト の リスト を 返し ます
別 の coverageresults オブジェクト の データ を 統合 し ます
インスタンス 全体 で 使わ れる デフォルト 値 の 辞書 を 返し ます
端末 を “ program ” モード に 復旧 し 、 予め def _prog _mode で 保存 し た 内容 に 戻し ます
引数 device は 整数 です
実行 中 プラットフォーム を 識別 する 文字 列 を 返し ます
ソケット の fileno を 返し ます
動的 ロード 可能 な 共有 ライブラリ として 実装 さ れ て いる モジュール を ロード し て 初期化 し ます
レコード の 属性 辞書 が 、 文字列 を 書式 化 する 演算 で 被演 算子 として 使わ れ ます
ユークリッド 距離 (sqrt (x *x + y *y )) を 返し ます
引数 が 1つ の 場合 、 x の ( e を 底と する ) 自然 対数 を 返し ます
警告 フィルタ を リセット し ます
ファイル path の サイズ を バイト 数 で 返し ます
key に対応 する メッセージ の 表現 を 形式 ごと の message サブクラス の インスタンス として 返し ます
この メソッド は 、 現在 の セッション でまだ ehlo か helo コマンド が 実行 さ れ て い ない 場合 、 ehlo and /or helo メソッド を 呼び出し ます
カーソル を ( new _y , new _x ) に 移動 し ます
stats クラス の この メソッド は 、 profile .run の 項 で 述べ た プロファイル の レポート を 出力 し ます
プログレスバー 付き の モードレスダイアログ を 表示 し ます
制御用 ファイル 記述子 の 番号 を 返す
オーディオフレーム を 書き込ん で nframes を 修正 し ます
標準 色選 択 ダイアログ を 表示 し 、 ユーザ が 色 を 選択 する こと を 可能 に し ます
シーケンス a および b について a + b を 返し ます
表記 法宣 言 イベント の 通知 を 捕捉 し ます
python データ 構造 o の json 文字 列表 現 を 返し ます
getheader (name ) が 返し た 文字列 を 解析 し て 、 ( full name , email address ) から なる ペア を 返し ます
文字列 s を 既定 の ファイル に 出力 し ます
イテレータ 化可 能 な 引数 iterable から 得 られる 要素 を deque の 左側 に 追加 し 拡張 し ます
mime タイプ を mailcap ファイル の エントリ に対応付ける 辞書 を 返し ます
itertools .izip と 同じ よう に 動作 し ます
美しく 出力 さ れ た バージョン の 文書 を 返し ます
すべて の セッションクッキー を 消去 し ます
これ まで に update メソッド に 渡し た 文字 列 の ダイジェスト を 返し ます
現在 の ファイル 位置 から 次 の 改行 まで の 、 1行 を 返し ます
この メソッド は タグ 外 の & # ref ; 形式 の 文字 参照 ( character reference ) を 処理 する ため に 呼び出さ れ ます
i /o による ブロック を 起こ さず に 読み出せる 全て の データ を 読み込み ます ( eager モード )
オブジェクト が コード の 場合 は 真 を 返し ます
非 同期 で イベント 操作 を し たい 場合 は 、 非ゼロ の 引数 で この メソッド を 呼ん でく ださい
pickle さ れ た 文字 列 packet を ソケット に 送信 し ます
url で 表さ れる ネットワーク 上 の オブジェクト を 、 必要 に 応じ て ローカル な ファイル に コピー し ます
file を 開き 、 対応 する ストリーム を 返し ます
終了 ステータス n で プロセス を 終了 し ます
name という 名前 の 関数 が 参照 さ れ た 共有 オブジェクト に 存在 する 場合 、 その ポインター ( 整数 値 ) を 返し ます
境界 を セクション 分割子 に し ます
x の 自然 対数 (底 e の 対数 ) を 返し ます
この 関数 の 自由 変数 の 名前 から なる タプル を 返し ます
obj の 符号 反転 ( - obj ) を 返し ます
ウィンドウ 内 で 更新 ( touch ) し た 場所 を 、 上位 の 全て の ウィンドウ 内 でも 更新 し ます
適切 な プロトコル を 使っ て fullurl を 開き ます
windows 用 : この 関数 は ctypes をつかっ て インプロセス com サーバー を 実装 できる よう に する ため の フック です
データ 内 の サンプル の 順序 を 逆転 し 、 変更 さ れ た データ を 返し ます
二つ の decimal インスタンス を 比較 し ます
この メソッド は 、 共有 ライブラリ によっ て エクスポート さ れ た ctypes 型 の インスタンス を 返し ます
code が テーブル c . 2 . 1 ( ascii 制御 文字 ) かどう か 判定 し ます
タートル を 見え なく し ます
( 任意 の サイズ の ) 整数 を 8 進 の 文字列 に 変換 し ます
( 任意 の サイズ の ) 整数 を 16 進 の 文字列 に 変換 し ます
カレントディレクトリ 、 また は 、 オプション 引数 の start から 、 path へ の 相対 ファイルパス を 返し ます
どちら も 対応 する turtlescreen の メソッド の 複製 です
すべて の スケジュール さ れ た イベント を 実行 し ます
thread コマンド は search に スレッド の 概念 を 加え た 変形 版 です
ユーザー 専用 の site -packages ディレクトリパス を 返し ます
disassemble の 別名
タグ 名 か パス に マッチ する 全て の サブエレメント を 探し ます
“ 基底 url ”( base ) と 別 の url (url ) を 組み合わせ て 、 完全 な url ( “ 絶対 url ”) を 構成 し ます
接続 の タイムアウト を t 秒 に 設定 し ます
ascii 英数 文字 か どう か を 調べ ます ; isalpha (c ) or isdigit (c ) と 等価 です
子 プロセス を 止め ます
text の state 番目 の 補完 候補 を 返し ます
パス fullname の ファイル を コンパイル し ます
other がこの ノード と 同じ ノード を 参照 し て いる 場合 に 真 を 返し ます
ウィンドウ の 背景 を 設定 し ます
encoding に 指定 し た codec を 検索 し 、 漸増 的 エンコーダクラス 、 また は ファクトリ 関数 を 返し ます
バイナリ 転送 モード で ファイル を 受信 し ます
デバッグレベル を 設定 し ます
メニューバー を 表現 する オブジェクト
自動増加 モード を 停止 し ます : この プログレスバー の progressbar .start で 開始 さ れ た 繰り返し の タイマーイベント を 全て キャンセル し ます
コードオブジェクト を 実行 し ます
tzinfo が none の 場合 、 none を 返し 、 そう で ない 場合 に は self .tzinfo .utcoffset (none ) を 返し ます
「 十分 」 な マッチ の 上位 の リスト を 返し ます
xml 宣言 が 解析 さ れ た 時 に 呼ば れ ます
ファイル から 読み取っ た 各行 の 文字 列 から なる リスト を 返し ます
start から 始まる count 行 が 変更 さ れ たか の よう に 振舞 わせ ます
md 5 オブジェクト の コピー ( “ クローン ”) を 返し ます
ディスク 上 の ファイル を データベース に 同期 さ せ ます
オーディオデバイス を 開き 、 oss オーディオデバイスオブジェクト を 返し ます
文字列 で 指定 さ れる 全 テストケース を 含む スイート を 返し ます
filename の 中 の すべ て の ブレークポイント を 返し ます
s 内 の 部分 文字 列 old を 全て new に 置換 し た もの を 返し ます
数値 val を 、 現在 の lc _monetary の 設定 に あわせ て フォーマット し ます
引数 無し で は 、 locals のよう に 動作 し ます
録音 の ソース を 指定 に は この 関数 を 使っ て く ださい
tix の スキーム ・メカニズム によっ て 保持 さ れ て いる オプション を 得 ます
a is b を 返し ます
引数 は すべ て オプション で 、 m 以外 の 引数 は キーワード 引数 として 指定 し なけれ ば なり ませ ん
parsedate _tz が 返す 1 0 要素 の タプル を utc の タイムスタンプ に 変換 し ます
ライブラリ を 検索 し 、 パス 名 を 返し ます
文字列 の 一部 が suffix で 終わる とき に true を 返し ます
requesthandlerclass を インスタンス 化 し 、 handle メソッド を 呼び出し て 、 実際 に 要求 を 処理 し ます
python インタープリタ の 、 スタック の 最大 の 深さ を limit に 設定 し ます
path が 存在 する パス なら true を 返す
pop 3 サーバー に ログオン する のに 、（ unix の r - コマンド と 同様 の ）rpop 認証 を 使用 し ます
image の 選択 さ れ た 部分 を 返し ます
この メソッド は end _tag メソッド の 定義 さ れ て いる 終了 タグ を 処理 する ため に 呼び出さ れ ます
文字列 引数 として 渡さ れ た クエリ 文字列 ( application /x -www -form -urlencoded 型 の データ ) を 解釈 し ます
a で 最初 に b が 出現 する 場所 の インデクス を 返し ます
codec に 登録 さ れ た 文字 コード 系 encoding を 使っ て 文字列 を デコード し ます
現在 の unicode 処理 の デフォルトエンコーディング 名 を 返し ます
msiopendatabase を 呼び出し て 新しい データベースオブジェクト を 返し ます
浮動 小数 点例 外 の デフォルト の 処理 に 再設定 し ます
計測 対象 コード の トレースバック を 出力 する ため の ヘルパー
内部 的 に 使わ れ て いる ソケットオブジェクト です
request の データ を data に 設定 し ます
オーディオチャンネル 数 （ モノラル なら 1 、 ステレオ なら 2 ） を 返し ます
各 スレッド の 識別子 を 関数 が 呼ば れ た 時点 の その スレッド で アクティブ に なっ て いる 一番上 の スタックフレーム に 結びつける 辞書 を 返し ます
未構 文解析 エンティティ 宣言 イベント の 通知 を 受け取り ます
パイプラインテンプレート を 初期 状態 に 戻し ます
レコード の 属性 辞書 を pickle して 、 バイナリ 形式 で ソケット に 書き込み ます
これら の 関数 は 引数 を 取り ませ ん
この クラスメソッド は decimal .decimal で ある dec の 正確 な 値 を 表す fraction を 構築 し ます
x の 位相 ( x の 偏角 とも 呼び ます ) を 浮動 小数 点数 で 返し ます
testcaseclass 中 の 全て の メソッド 名 を 含む ソート 済み シーケンス を 返し ます
マップ と 元 ファイル ( がもし あれ ば ) の サイズ を 変更 し ます
list コマンド で 返さ れる ディレクトリ 内 の リスト を 作り 、 標準 出力 へ 出力 し ます
ローカル から リモート の マネージャオブジェクト へ 接続 し ます
ドキュメント の 終了 通知 を 受け取り ます
フォーム を html に 初期化 し て 出力 し ます
エンティティ の システム 識別子 を 解決 し 、 文字 列 として 読み込ん だ システム 識別 子 あるい は inputsource オブジェクト のい ずれ か を 返し ます
ノード を 訪れ ます
要求 さ れ た 操作 を ファイル 記述子 fd ( また は fileno メソッド を 提供 し て いる ファイルオブジェクト ) に対し て 実行 し ます
object が ジェネレータ で ある とき に 真 を 返し ます
二つ の 対象 を 数値 によら ず 抽象 表現 によっ て 比較 し ます
predicate が 真 で ある 限り iterable から 要素 を 返す イテレータ を 作成 し ます
name という 名前 の フリーズ さ れ た モジュール ( init _frozen を 参照 ) が ある 場合 は 、 true を 返し ます
一様 な 項目 から なる list を パック し ます
本質的 に fcntl による ロッキング の 呼び出し を ラップ し た もの です
一時的 に 、 envvar を value に セット し ます
パラメタ : radius – 数 extent – 数 ( また は none ) steps – 整数 ( また は none ) 半径 radius の 円 を 描き ます
キュー に ある 全て の 要素 が 取り出さ れ て 処理 さ れる まで ブロッキング し ます
teardown の 後 に 呼び出さ れる 関数 を 追加 し ます
settrace 関数 など で 設定 し た trace 関数 を 取得 し ます
プロセス に対し て コアダンプ が 生成 さ れ て い た 場合 に は true を 、 それ 以外 の 場合 は false を 返し ます
シーケンス 名 を キー の リスト に対応付ける 辞書 を 返し ます
新 た な sha オブジェクト を 返し ます
1 ビットモノクロ が 象画 像 を 8 ビット の グレースケール また は カラー 画像 に 変換 し ます
writer オブジェクト の フォントプロパティ の うち 、 一部 また は 全て を 変更 し ます
キャラクタ char を バッファリング を 行わ ない で コンソール に 出力 し ます
二つ の 対象 を compare _total のよう に 数値 によら ず 抽象 表現 によっ て 比較 し ます が 、 両者 の 符号 を 無視 し ます
cbreak モード から 離れ ます
( 全て の オペレーティングシステム で サポート さ れ て いる わけ で は あり ませ ん ) ポーリングオブジェクト を 返し ます
入れ子 に なっ た 記号 表 の リスト を 返し ます
e ** x - 1 を 返し ます
モジュールオブジェクト module を 再 ロード し て 、 それ を 再解 析 し 再 初 期化 し ます
現在 の フォント 検索 パス を 返し ます
セット さ れ て いる すべ て の ブレークポイント を 返し ます
フォーム に チョイスオブジェクト を 加え ます
共有 threading .semaphore オブジェクト を 作成 し て 、 その プロキシ を 返し ます
これら の 関数 は 、 後述 する 同名 の メソッド へ の 「 ショートカット 」 です
メールボックス から key に対応 する メッセージ を 削除 し ます
マネージャ を 開始 する ため に サブプロセス を 開始 し ます
新規 に 生成 さ れ た ソケットオブジェクト の 、 デフォルト の タイムアウト 値 を 浮動 小数 点形 式 の 秒数 で 指定 し ます
subclass を “ 仮想 的 サブクラス ” として この abc に 登録 し ます
何 もし ませ ん
文字列 を コピー し 、 部分 文字 列 old の ある 部分 全 て を new に 置換 し て 返し ます
明示的 な 書式 化文 字列 で 制御 さ れ た 、 日付 を 表現 する 文字 列 を 返し ます
もし イベントキュー が 空 なら ば 、 true を 返し ます
数値 a および b について a + b を 返し ます
データベースファイル filename を 開き 、 対応 する オブジェクト を 返し ます
a = imod (a , b ) は a % = b と 等価 です
浮動 小数 点数 で サンプルデータ の 最大 値 を 設定 し ます
x と y の 積 を 返し ます
getche の ワイド 文字 列版
data を 一括し て 圧縮 し ます
値 を 符号 を 無視 し て 数値 として 比較 し ます
ngettext と 同様 です が 、 指定 さ れ た domain から メッセージ を 探し ます
パネルスタック の 最下層 の パネル を 返し ます
ソケット から データ を 受信 し 、 結果 を タプル ( string , address ) として 返し ます
コマンド を 引数 付き で 実行 し ます
put (item , false ) と 同じ 意味 です
iterator から 、 next メソッド により 、 次 の 要素 を 取得 し ます
bytesio におい て は 、 この メソッド は read と 同じ です
ブロック が 入れ子 の 名前 空間 を 含ん で いる なら ば true を 返し ます
指定 さ れ た フィルタ filt を この ロガー に 追加 し ます
ハードウェア の バッファサイズ を サンプル 数 で 返し ます
この メソッド は 、 cgi スクリプト で のみ 許さ れ て いる ' post ' 型 の http 要求 に対する サービス を 行い ます
major .minor の 型 の python バージョン 番号 文字 列 を 返し ます
サーバ 上 の カレントディレクトリ の パス を 返し ます
端末 に 表示 さ れる 色 を プログラマ が 変更 できる か 否か によっ て 、 真また は 偽 を 返し ます
オプション の 引数 なし で 使用 する と 、 この メソッド は 他 の スレッド が ロック し て いる かどう か に かかわらず ロック を 獲得 し ます
name と callable で 指定 さ れる 照合 順序 を 作成 し ます
現在 の ヒストリ を クリア し ます
none を 返し ます
ブレークポイント が テンポラリブレークポイント だっ た とき に 、 それ を どう 削除 する か を 決定 し ます
もし 文字 列 sql が セミコロン で 終端 さ れ た 一つ 以上 の 完全 な sql 文 を 含ん で いれ ば 、 true を 返し ます
“protected ” の _ info 変数 を 返し ます
現在 の entityresolver を セット し ます
a [alo :ahi ] と b [blo : bhi ] の 中 から 、 最長 の マッチ 列 を 探し ます
子 プロセス を 殺し ます
明示的 な 書式 化文 字列 で 制御 さ れ た 、 日付 を 表現 する 文字 列 を 返し ます
c 言語 による 実行 時 システム に おける ファイル 記述子 を ファイルハンドル handle から 生成 し ます
引数 の name メソッド を 呼び出す 呼び出し 可能 オブジェクト を 返し ます
scheme で 指定 さ れ た インストールスキーム から 、 path name に 従っ て インストールパス を 返し ます
match に マッチ する 最初 の トップレベル の エレメント を 探し ます
シェル 変数 を html に 書式 化 し て 出力 し ます
データ を 4 ビット の intel /dvi adpcm 符号 化方 式 に 変換 し ます
resource の 現在 の ソフト および ハードリミット を 表す タプル ( soft , hard ) を 返し ます
format は 主たる api メソッド です
xml 文書 中 で 、 適用 可能 な ハンドラ が 指定 さ れ て い ない 文字 すべて に対し て 呼び出さ れ ます
引数 の 符号 を 変え て 返し ます
新しい セマフォ ( semaphore ) オブジェクト を 返す ファクトリ 関数 です
x の 平方根 を 精度 いっぱい まで 求め ます
unix で は 、 現在 の プロセッサ 時間 秒 を 浮動 小数 点数 で 返し ます
head 命令 を 送信 し ます
ファインダ に ファイル か フォルダ で ある file を フォルダ destdir に 移動 する よう に 命令 し ます
新 た な (dom の スーパークラス で ある ) document クラス の オブジェクト を 返し ます
アーカイブ の 目次 を sys .stdout に 出力 し ます
現在 の ディレクトリ を html に 書式 化 し て 出力 し ます
http response から クッキー を 取り出し 、 ポリシー によっ て 許可 さ れ て いれ ばこれ を cookiejar 内 に 保管 し ます
正規 分布 です 、 mu は 平均 で 、 sigma は 標準 偏差 です
原始 的 な 文字 編集 機能 つき で 、 ユーザ の 入力 文字 列 を 読み取り ます
この 関数 の 引数 名 から なる タプル を 返し ます
文脈 情報 を 挿入 する ため に 、 ログ 記録 呼び出し に 渡さ れ た メッセージ および / また は キーワード 引数 に 変更 を 加え ます
src から dst へ 、 パーミッション 、 最終 アクセス 時間 、 最終 更新 時間 、 フラグ を コピー し ます
logical _xor は 二つ の 論理 引数 ( 論理 引数 参照 ) を 取る 論理 演算 です
filename と 名づけ られ た ハッシュ 形式 の ファイル を 開き ます
標準 の forms の メインループ です
year 年 month 月 の 週 の リスト を 返し ます
ascii 転送 モード で ファイル を 転送 し ます
呼び出し 元 スタック の フレームレコード の リスト を 返し ます
実行 中 の ファイル 転送 を 中止 し ます
メッセージ 中 に ある すべ て の フィールド の 値 の リスト を 返し ます
s の 大文字 と 小文字 を 入れ 替え た もの を 返し ます
それぞれ の 要素 型宣 言 ごと に 呼び出さ れ ます
バージョン 2 . 7 で 撤廃 : 代わり に isinstance (x , collections .mapping ) を 使っ て 下さい
他 の 計算 機上 に ある 既定 の レジストリハンドル 接続 を 確立 し 、 ハンドルオブジェクト を 返し ます
文字 列中 に 数字 しか ない 場合 に は 真 を 返し 、 その 他 の 場合 は 偽 を 返し ます
[start , end ] の 範囲 に 、 部分 文字 列 sub が 出現 する 回数 を 返し ます
プロンプト に 空行 が 入力 さ れ た とき に 呼び出さ れる メソッド
引数 が iterable だけ の 場合 、 空 で ない シーケンス ( 文字列 、 タプル また は リスト ) の 要素 の うち 最大 の もの を 返し ます
与え られ た 実行 例 が 正しく 動作 し なかっ た こと を 報告 し ます
base 3 2 をつかっ て 、 文字列 を エンコード ( 符号化 ) します
x の 絶対 値 を 返し ます
実行 中 の windows バージョン を 示す 、 名前 付き タプル を 返し ます
get (false ) と 等価 です
アンインストール の 際 に . pyc / . pyo を 削除 し ます
指定 さ れ た キー の 下 に サブキー を 生成 し 、 サブキー に 指定 さ れ た ファイル の レジストリ 情報 を 記録 し ます
永続 的 な 辞書 を 開き ます
文字列 s 中 の 文字 ' &' 、 ' <' 、 および ' >' を html で 正しく 表示 できる 文字 列 に 変換 し ます
unicode ファイル 名 を システム の ファイル 名 に 変換 する 際 に 使用 する エンコード 名 を 返し ます
この メソッド は 再生 側 で バッファリング さ れる サンプル 数 を 返し ます
resouce の 新た な 消費 制限 を 設定 し ます
a = ifloordiv (a , b ) は a / /= b と 等価 です
ファイル の ポインタ を 指定 し た 位置 に 設定 し ます
x の 相補 誤差 関数 を 返し ます
文字列 形式 による システム 設定 値 ( system configuration value ) を 返し ます
メッセージ の 配送 日時 を エポック から の 秒数 を 表わす 浮動 小数 点数 で 返し ます
起き た ばかり の 構文 エラー を 表示 し ます
base 6 4 文字列 を デコード ( 復元 ) します
パス 名 path の 末尾 の ファイル 名 を 返し ます
tls (transport layer security ) モード で smtp コネクション を 出し 、 全て の smtp コマンド は 暗号 化 さ れ ます
曜日 の 数字 を 一週間 分生 成 する イテレータ を 返し ます
robots .txt ファイル を 最後 に 取得 し た 時刻 を 返し ます
可能 な 限り 最 も 安全 な 手段 で 一時 ファイル を 生成 し ます
この 関数 は split と 同じ よう に 振舞 い ます
cmdloop が 呼び出さ れ た とき に 一度 だけ 実行 さ れる フックメソッド
strict エラー 処理 の 実装 です : エンコード 又 は デコードエラー は 各々 unicodeerror を 送出 し ます .
mime 情報 を 、 path という 名 の ファイル から ロード し ます
パスワード の 保護 の ため 、 クライアント 認証 時 に cram -md5 だけ を 使用 し ます
インタプリタ 内 の ある ソース を コンパイル し 実行 し ます
ノード が 何らか の 属性 を 持っ て いる 場合 に 真 を 返し ます
item が 指定 さ れ て い た 場合 は 、 item に フォーカス を 当て ます
数値 val を 現在 の lc _numeric の 設定 に 基づい て 書式 化 し ます
2つ の 4 文字 の 文字 列 として ファイルクリエータ および ファイルタイプ を 返し ます
利用 可能 な セクション の リスト を 返し ます
共有 threading .rlock オブジェクト を 作成 し て 、 その プロキシ を 返し ます
ファイル の ポインタ を オーディオストリーム の 先頭 に 戻し ます
メッセージ に 付い て いる ラベル の リスト に label を 追加 し ます
フォルダ の 選択 を ユーザ に 促す ダイアログ を 表示 し て 、 ユーザ が 選択 し た フォルダ を 返し ます
この メソッド は 必ず作っ て おか なく て はいけ ませ ん
文字列 str から 最大 で n 文字 を ( y , x ) に 属性 attr で 描画 し ます
year が 閏年 なら true を 、 そう で なけれ ば false を 返し ます
文字列 の 一部 が prefix で 始まる とき に true を 返し ます
text 内 の 段落 を 一つ だけ 折り返し を 行い 、 折り返し が 行わ れ た 段落 を 含む 一つ の 文字列 を 返し ます
ファイル の 現在 位置 を セット し ます
属性 ノード を 生成 し て 返し ます
要素 elem を set に 追加 し ます
開か れ て いる 段落 が あれ ば 閉じ 、 次 の 段落 と の 間 に 少なく とも blanklines が 挿入 さ れる よう に し ます
split できる 文字列 を エンコード さ れ た 文字列 に 変換 し なおし ます
forms イベント を 確認 し ます
optionparser に (- q や - - verbose の よう な ) オプション opt _str が ある 場合 、 真 を 返し ます
二つ の 値 を 数値 として 比較 し 、 大きい ほう を 返し ます
condition が 真 の 場合 に 、 デコレート し た テスト を スキップ し ます
スクロール 領域 を top から bottom に 設定 し ます
これ は print _exception (sys .last _type , sys .last _value , sys .last _traceback , limit , file ) の 省略 表現 です
オブジェクト の “ 識別値 ” を 返し ます
カーソル を db ファイル の 直前 の 要素 に 設定 し 、 その 要素 を 返し ます
オブジェクト を 隠し ます
フォーム の 中 の 最後 の オブジェクト を 見つけ ます
メッセージ の リスト を 要求 し ます
params を xml -rpc リクエスト の 形式 に 変換 し ます
サーバ へ の 接続 を 閉じ ます
on _flag が 真 の 場合 、 pentium タイムスタンプカウンタ を 使っ た vm 計測 結果 の ダンプ 出力 を 有効 に し ます
最後 の ( 繰り返す こと により 複数 の ) タートル の 動き を 取り消し ます
オブジェクト 内 の [ start , end ] の 範囲 に 含ま れ て いる 部分 文字 列 string が 見つかっ た 場所 の 最も 大きい インデックス を 返し ます
ログ 記録 の 環境 設定 を ファイル 名 fname の configparser 形式 ファイル から 読み出し ます
プロンプト を 書き込み 、 一行 を 読み込み ます
x と y の 間 の 差 を 返し ます
パレート 分布 です
与え られ た 行 と カラム 数 を 持つ パッド ( pad ) データ 構造 を 生成 し 、 その ポインタ を 返し ます
指定 さ れ た column の heading の オプション を 問い合わ せ たり 、 変更 し たり し ます
readline を 使っ て に 到達 する まで 読み出し 、 eof 読み出さ れ た 行 を 含む リスト を 返し ます
二つめ の 演算 対象 で 調整 さ れ た 指数 の 一つめ の 演算 対象 を 返し ます
二つ の 演算 対象 の 値 を 数値 として 比較 し ます
この メソッド は 、 メタクラス によっ て 、 その インスタンス の メソッド 解決 の 順序 を カスタマイズ する ため に 、 上書き さ れる かも 知れ ませ ん
パイプ の 終端 を 表す connection オブジェクト の タプル ( conn 1 , conn 2 ) を 返し ます
ソケット に データ を 送信 し ます
ファイル name を アーカイブ に 追加 し ます
返さ れ た 関数 プロトタイプ は 標準 c 呼び出し 規約 を つかう 関数 を 作成 し ます
外部 エンティティ の 参照 時 に 呼び出さ れ ます
xgtitle 命令 を 処理 し 、 ( response , list ) から なる ペア を 返し ます
user コマンド を 送出 し ます
ファイル 名 input の バイナリファイル を ファイル 名 output の binhex 形式 ファイル に 変換 し ます
エンコード し た 値 を 返し ます
post 命令 を 使っ て 記事 を ポスト し ます
ファイルクリエータ および ファイルタイプ を 設定 し ます
x を y で 除算 し た 値 を 返し ます
この 関数 は 変更 可能 な 文字 バッファ を 作成 し ます
メッセージ ( の 一部 ) を 取り よせ ます
この 関数 は name で 指定 さ れ た モジュール を import し て 返し ます
weekday
weekday
weekday
weekday
weekday
logger
logger
logger
logger
logger
configparser
configparser
configparser
configparser
configparser
pathname
pathname
pathname
pathname
pathname
wlist
wlist
wlist
wlist
wlist
mktemp
mktemp
mktemp
mktemp
mktemp
delete
delete
delete
delete
delete
ahi
ahi
ahi
ahi
ahi
library
library
library
library
library
filecookiejar
filecookiejar
filecookiejar
filecookiejar
filecookiejar
curs
curs
curs
curs
curs
getcomment
getcomment
getcomment
getcomment
getcomment
coerce
coerce
coerce
coerce
coerce
tests
tests
tests
tests
tests
errno
errno
errno
errno
errno
checkcache
checkcache
checkcache
checkcache
checkcache
left
left
left
left
left
writerow
writerow
writerow
writerow
writerow
pendown
pendown
pendown
pendown
pendown
xhdr
xhdr
xhdr
xhdr
xhdr
testfile
testfile
testfile
testfile
testfile
buffer_size
buffer_size
buffer_size
buffer_size
buffer_size
getservbyport
getservbyport
getservbyport
getservbyport
getservbyport
nl
nl
nl
nl
nl
browser
browser
browser
browser
browser
attr
attr
attr
attr
attr
create
create
create
create
create
sysbeep
sysbeep
sysbeep
sysbeep
sysbeep
logging
logging
logging
logging
logging
text
text
text
text
text
showsyntaxerror
showsyntaxerror
showsyntaxerror
showsyntaxerror
showsyntaxerror
askfileforopen
askfileforopen
askfileforopen
askfileforopen
askfileforopen
subclass
subclass
subclass
subclass
subclass
getdefaultencoding
getdefaultencoding
getdefaultencoding
getdefaultencoding
getdefaultencoding
value
value
value
value
value
threading algorithm
threading algorithm
threading algorithm
threading algorithm
threading algorithm
os
os
os
os
os
quit
quit
quit
quit
quit
notify
notify
notify
notify
notify
isgraph
isgraph
isgraph
isgraph
isgraph
end
end
end
end
end
traceback
traceback
traceback
traceback
traceback
pkg_name
pkg_name
pkg_name
pkg_name
pkg_name
ldgettext
ldgettext
ldgettext
ldgettext
ldgettext
isgenerator
isgenerator
isgenerator
isgenerator
isgenerator
format
format
format
format
format
optionxform
optionxform
optionxform
optionxform
optionxform
alive
alive
alive
alive
alive
sendall
sendall
sendall
sendall
sendall
_getframe
_getframe
_getframe
_getframe
_getframe
ifloordiv
ifloordiv
ifloordiv
ifloordiv
ifloordiv
decoded seq
decoded seq
decoded seq
decoded seq
decoded seq
getsizes
getsizes
getsizes
getsizes
getsizes
field_names
field_names
field_names
field_names
field_names
fetch
fetch
fetch
fetch
fetch
issym
issym
issym
issym
issym
validate
validate
validate
validate
validate
skippedentity
skippedentity
skippedentity
skippedentity
skippedentity
shouldflush
shouldflush
shouldflush
shouldflush
shouldflush
expovariate
expovariate
expovariate
expovariate
expovariate
tcdrain
tcdrain
tcdrain
tcdrain
tcdrain
how
how
how
how
how
termattrs
termattrs
termattrs
termattrs
termattrs
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
createlock
createlock
createlock
createlock
createlock
hasattr
hasattr
hasattr
hasattr
hasattr
dom
dom
dom
dom
dom
noload
noload
noload
noload
noload
tofolder
tofolder
tofolder
tofolder
tofolder
newwidth
newwidth
newwidth
newwidth
newwidth
strxfrm
strxfrm
strxfrm
strxfrm
strxfrm
toward
toward
toward
toward
toward
302
302
302
302
302
tolist
tolist
tolist
tolist
tolist
putp
putp
putp
putp
putp
tagname
tagname
tagname
tagname
tagname
incrementalparser
incrementalparser
incrementalparser
incrementalparser
incrementalparser
str2
str2
str2
str2
str2
getlogger
getlogger
getlogger
getlogger
getlogger
sequence of strings
sequence of strings
sequence of strings
sequence of strings
sequence of strings
isendwin
isendwin
isendwin
isendwin
isendwin
int
int
int
int
int
subprocess
subprocess
subprocess
subprocess
subprocess
rsplit
rsplit
rsplit
rsplit
rsplit
recent
recent
recent
recent
recent
setsampfmt
setsampfmt
setsampfmt
setsampfmt
setsampfmt
modified
modified
modified
modified
modified
unixfrom
unixfrom
unixfrom
unixfrom
unixfrom
framerate
framerate
framerate
framerate
framerate
help
help
help
help
help
builtin
builtin
builtin
builtin
builtin
parse
parse
parse
parse
parse
testmod
testmod
testmod
testmod
testmod
getvaluebyqname
getvaluebyqname
getvaluebyqname
getvaluebyqname
getvaluebyqname
tmpfile
tmpfile
tmpfile
tmpfile
tmpfile
expectedfailure
expectedfailure
expectedfailure
expectedfailure
expectedfailure
euid
euid
euid
euid
euid
testsource
testsource
testsource
testsource
testsource
kqueue
kqueue
kqueue
kqueue
kqueue
defaulttestresult
defaulttestresult
defaulttestresult
defaulttestresult
defaulttestresult
setparams
setparams
setparams
setparams
setparams
input
input
input
input
input
heapreplace
heapreplace
heapreplace
heapreplace
heapreplace
nntp
nntp
nntp
nntp
nntp
optionflag
optionflag
optionflag
optionflag
optionflag
environmentvarguard
environmentvarguard
environmentvarguard
environmentvarguard
environmentvarguard
relpath
relpath
relpath
relpath
relpath
isascii
isascii
isascii
isascii
isascii
locking
locking
locking
locking
locking
updatescrollbars
updatescrollbars
updatescrollbars
updatescrollbars
updatescrollbars
psize
psize
psize
psize
psize
collections
collections
collections
collections
collections
lstat
lstat
lstat
lstat
lstat
mkstemp
mkstemp
mkstemp
mkstemp
mkstemp
choice
choice
choice
choice
choice
isdigit
isdigit
isdigit
isdigit
isdigit
nchannels
nchannels
nchannels
nchannels
nchannels
copyfileobj
copyfileobj
copyfileobj
copyfileobj
copyfileobj
derwin
derwin
derwin
derwin
derwin
openkey
openkey
openkey
openkey
openkey
coded value
coded value
coded value
coded value
coded value
httpconnection
httpconnection
httpconnection
httpconnection
httpconnection
xcor
xcor
xcor
xcor
xcor
tokenize
tokenize
tokenize
tokenize
tokenize
getservbyname
getservbyname
getservbyname
getservbyname
getservbyname
urlopen
urlopen
urlopen
urlopen
urlopen
unquote
unquote
unquote
unquote
unquote
touchline
touchline
touchline
touchline
touchline
undo
undo
undo
undo
undo
util
util
util
util
util
endidx
endidx
endidx
endidx
endidx
longest
longest
longest
longest
longest
synchronized
synchronized
synchronized
synchronized
synchronized
swapcase
swapcase
swapcase
swapcase
swapcase
cookiepolicy
cookiepolicy
cookiepolicy
cookiepolicy
cookiepolicy
warnings
warnings
warnings
warnings
warnings
uuid1
uuid1
uuid1
uuid1
uuid1
fragment1
fragment1
fragment1
fragment1
fragment1
keypad
keypad
keypad
keypad
keypad
setprofile
setprofile
setprofile
setprofile
setprofile
folders
folders
folders
folders
folders
object
object
object
object
object
subwin
subwin
subwin
subwin
subwin
getlogin
getlogin
getlogin
getlogin
getlogin
setpath
setpath
setpath
setpath
setpath
noraw
noraw
noraw
noraw
noraw
setrecursionlimit
setrecursionlimit
setrecursionlimit
setrecursionlimit
setrecursionlimit
setpos
setpos
setpos
setpos
setpos
getwindowsversion
getwindowsversion
getwindowsversion
getwindowsversion
getwindowsversion
activate
activate
activate
activate
activate
ext
ext
ext
ext
ext
readscaled
readscaled
readscaled
readscaled
readscaled
itermonthdays2
itermonthdays2
itermonthdays2
itermonthdays2
itermonthdays2
exitonclick
exitonclick
exitonclick
exitonclick
exitonclick
menubar
menubar
menubar
menubar
menubar
decl
decl
decl
decl
decl
rset
rset
rset
rset
rset
tanh
tanh
tanh
tanh
tanh
encoded
encoded
encoded
encoded
encoded
bye
bye
bye
bye
bye
quantum
quantum
quantum
quantum
quantum
convert
convert
convert
convert
convert
finish
finish
finish
finish
finish
fsync
fsync
fsync
fsync
fsync
pkgutil
pkgutil
pkgutil
pkgutil
pkgutil
anydbm
anydbm
anydbm
anydbm
anydbm
decimal
decimal
decimal
decimal
decimal
tmpnam
tmpnam
tmpnam
tmpnam
tmpnam
locked
locked
locked
locked
locked
osfhandle
osfhandle
osfhandle
osfhandle
osfhandle
i
i
i
i
i
init
init
init
init
init
elem
elem
elem
elem
elem
obj_or_type
obj_or_type
obj_or_type
obj_or_type
obj_or_type
str
str
str
str
str
expression
expression
expression
expression
expression
slider
slider
slider
slider
slider
visibility
visibility
visibility
visibility
visibility
findlinestarts
findlinestarts
findlinestarts
findlinestarts
findlinestarts
crop
crop
crop
crop
crop
yeardays2calendar
yeardays2calendar
yeardays2calendar
yeardays2calendar
yeardays2calendar
hostname
hostname
hostname
hostname
hostname
memset
memset
memset
memset
memset
new_mailbox
new_mailbox
new_mailbox
new_mailbox
new_mailbox
exit
exit
exit
exit
exit
test_support
test_support
test_support
test_support
test_support
other
other
other
other
other
iterable
iterable
iterable
iterable
iterable
adderror
adderror
adderror
adderror
adderror
allowremoval
allowremoval
allowremoval
allowremoval
allowremoval
monthdatescalendar
monthdatescalendar
monthdatescalendar
monthdatescalendar
monthdatescalendar
issamenode
issamenode
issamenode
issamenode
issamenode
fabs
fabs
fabs
fabs
fabs
easydialogs
easydialogs
easydialogs
easydialogs
easydialogs
randint
randint
randint
randint
randint
opcodes
opcodes
opcodes
opcodes
opcodes
chmod
chmod
chmod
chmod
chmod
testzip
testzip
testzip
testzip
testzip
levelname
levelname
levelname
levelname
levelname
converter
converter
converter
converter
converter
quopri
quopri
quopri
quopri
quopri
poll
poll
poll
poll
poll
getwriter
getwriter
getwriter
getwriter
getwriter
clearok
clearok
clearok
clearok
clearok
spwd
spwd
spwd
spwd
spwd
walk
walk
walk
walk
walk
read1
read1
read1
read1
read1
a2b
a2b
a2b
a2b
a2b
server_title
server_title
server_title
server_title
server_title
base
base
base
base
base
if
if
if
if
if
cacheftphandler
cacheftphandler
cacheftphandler
cacheftphandler
cacheftphandler
sys
sys
sys
sys
sys
pos
pos
pos
pos
pos
reader
reader
reader
reader
reader
prog
prog
prog
prog
prog
gzip
gzip
gzip
gzip
gzip
epoll
epoll
epoll
epoll
epoll
time
time
time
time
time
knots
knots
knots
knots
knots
nlargest
nlargest
nlargest
nlargest
nlargest
getresuid
getresuid
getresuid
getresuid
getresuid
longname
longname
longname
longname
longname
encodepriority
encodepriority
encodepriority
encodepriority
encodepriority
infile
infile
infile
infile
infile
wave write
wave write
wave write
wave write
wave write
reduce
reduce
reduce
reduce
reduce
future builtins
future builtins
future builtins
future builtins
future builtins
fillcolor
fillcolor
fillcolor
fillcolor
fillcolor
parsesequence
parsesequence
parsesequence
parsesequence
parsesequence
or_
or_
or_
or_
or_
openmixer
openmixer
openmixer
openmixer
openmixer
c9
c9
c9
c9
c9
c11
c11
c11
c11
c11
blanklines
blanklines
blanklines
blanklines
blanklines
imageop
imageop
imageop
imageop
imageop
getitimer
getitimer
getitimer
getitimer
getitimer
getbegyx
getbegyx
getbegyx
getbegyx
getbegyx
servicename
servicename
servicename
servicename
servicename
unistr
unistr
unistr
unistr
unistr
mappriority
mappriority
mappriority
mappriority
mappriority
expr
expr
expr
expr
expr
getnode
getnode
getnode
getnode
getnode
back
back
back
back
back
lstrip
lstrip
lstrip
lstrip
lstrip
dropwhile
dropwhile
dropwhile
dropwhile
dropwhile
template
template
template
template
template
window
window
window
window
window
authorizer
authorizer
authorizer
authorizer
authorizer
importer
importer
importer
importer
importer
http
http
http
http
http
or
or
or
or
or
popen2
popen2
popen2
popen2
popen2
global
global
global
global
global
resid
resid
resid
resid
resid
namespaceuri
namespaceuri
namespaceuri
namespaceuri
namespaceuri
interactiveconsole
interactiveconsole
interactiveconsole
interactiveconsole
interactiveconsole
sep
sep
sep
sep
sep
printdir
printdir
printdir
printdir
printdir
prototype
prototype
prototype
prototype
prototype
fetchone
fetchone
fetchone
fetchone
fetchone
runcall
runcall
runcall
runcall
runcall
imgfile
imgfile
imgfile
imgfile
imgfile
cget
cget
cget
cget
cget
layout
layout
layout
layout
layout
begin_y
begin_y
begin_y
begin_y
begin_y
errorhandler
errorhandler
errorhandler
errorhandler
errorhandler
term
term
term
term
term
rfc2231
rfc2231
rfc2231
rfc2231
rfc2231
namespace
namespace
namespace
namespace
namespace
isfifo
isfifo
isfifo
isfifo
isfifo
oss audio device
oss audio device
oss audio device
oss audio device
oss audio device
redisplay
redisplay
redisplay
redisplay
redisplay
pyhkey
pyhkey
pyhkey
pyhkey
pyhkey
array
array
array
array
array
contextlib
contextlib
contextlib
contextlib
contextlib
setfillpoint
setfillpoint
setfillpoint
setfillpoint
setfillpoint
ctypes
ctypes
ctypes
ctypes
ctypes
ossaudiodev
ossaudiodev
ossaudiodev
ossaudiodev
ossaudiodev
interval
interval
interval
interval
interval
ip_string
ip_string
ip_string
ip_string
ip_string
der cert bytes
der cert bytes
der cert bytes
der cert bytes
der cert bytes
isatty
isatty
isatty
isatty
isatty
any
any
any
any
any
getlast
getlast
getlast
getlast
getlast
make
make
make
make
make
isfile
isfile
isfile
isfile
isfile
compiled
compiled
compiled
compiled
compiled
map
map
map
map
map
factorial
factorial
factorial
factorial
factorial
uuidcreate
uuidcreate
uuidcreate
uuidcreate
uuidcreate
prefix
prefix
prefix
prefix
prefix
irepeat
irepeat
irepeat
irepeat
irepeat
flushkey
flushkey
flushkey
flushkey
flushkey
c4
c4
c4
c4
c4
debuglevel
debuglevel
debuglevel
debuglevel
debuglevel
_value
_value
_value
_value
_value
setregid
setregid
setregid
setregid
setregid
priority
priority
priority
priority
priority
hor
hor
hor
hor
hor
frozenset
frozenset
frozenset
frozenset
frozenset
framework
framework
framework
framework
framework
urljoin
urljoin
urljoin
urljoin
urljoin
exc_info
exc_info
exc_info
exc_info
exc_info
endelementns
endelementns
endelementns
endelementns
endelementns
tell
tell
tell
tell
tell
spawn
spawn
spawn
spawn
spawn
dbhash
dbhash
dbhash
dbhash
dbhash
ismappingtype
ismappingtype
ismappingtype
ismappingtype
ismappingtype
update
update
update
update
update
methodhelp
methodhelp
methodhelp
methodhelp
methodhelp
unused
unused
unused
unused
unused
ftphandler
ftphandler
ftphandler
ftphandler
ftphandler
itervaluerefs
itervaluerefs
itervaluerefs
itervaluerefs
itervaluerefs
pointer
pointer
pointer
pointer
pointer
quote
quote
quote
quote
quote
readframes
readframes
readframes
readframes
readframes
sslsocket
sslsocket
sslsocket
sslsocket
sslsocket
critical
critical
critical
critical
critical
postloop
postloop
postloop
postloop
postloop
shuffle
shuffle
shuffle
shuffle
shuffle
nlines
nlines
nlines
nlines
nlines
issequencetype
issequencetype
issequencetype
issequencetype
issequencetype
new y
new y
new y
new y
new y
copystat
copystat
copystat
copystat
copystat
plistlib
plistlib
plistlib
plistlib
plistlib
tab
tab
tab
tab
tab
idiv
idiv
idiv
idiv
idiv
splitlines
splitlines
splitlines
splitlines
splitlines
domimplementation
domimplementation
domimplementation
domimplementation
domimplementation
standalone
standalone
standalone
standalone
standalone
assertisnone
assertisnone
assertisnone
assertisnone
assertisnone
architecture
architecture
architecture
architecture
architecture
unpack_item
unpack_item
unpack_item
unpack_item
unpack_item
binary
binary
binary
binary
binary
positioner
positioner
positioner
positioner
positioner
baseserver
baseserver
baseserver
baseserver
baseserver
setchannels
setchannels
setchannels
setchannels
setchannels
oss mixer device
oss mixer device
oss mixer device
oss mixer device
oss mixer device
request
request
request
request
request
makeresult
makeresult
makeresult
makeresult
makeresult
pyclbr
pyclbr
pyclbr
pyclbr
pyclbr
default
default
default
default
default
xover
xover
xover
xover
xover
mro
mro
mro
mro
mro
playabs
playabs
playabs
playabs
playabs
verify
verify
verify
verify
verify
access
access
access
access
access
getsourcelines
getsourcelines
getsourcelines
getsourcelines
getsourcelines
eject
eject
eject
eject
eject
getmaintype
getmaintype
getmaintype
getmaintype
getmaintype
theme
theme
theme
theme
theme
dict
dict
dict
dict
dict
heapmin
heapmin
heapmin
heapmin
heapmin
seq_of_parameters
seq_of_parameters
seq_of_parameters
seq_of_parameters
seq_of_parameters
vformat
vformat
vformat
vformat
vformat
argv
argv
argv
argv
argv
setoption
setoption
setoption
setoption
setoption
change
change
change
change
change
declared
declared
declared
declared
declared
maptypecreator
maptypecreator
maptypecreator
maptypecreator
maptypecreator
yiq
yiq
yiq
yiq
yiq
scale
scale
scale
scale
scale
stringio
stringio
stringio
stringio
stringio
node or string
node or string
node or string
node or string
node or string
params
params
params
params
params
abstractproperty
abstractproperty
abstractproperty
abstractproperty
abstractproperty
writesamps
writesamps
writesamps
writesamps
writesamps
support
support
support
support
support
oct
oct
oct
oct
oct
mvwin
mvwin
mvwin
mvwin
mvwin
parseresult
parseresult
parseresult
parseresult
parseresult
wstring
wstring
wstring
wstring
wstring
tee
tee
tee
tee
tee
commands
commands
commands
commands
commands
unescape
unescape
unescape
unescape
unescape
getcontext
getcontext
getcontext
getcontext
getcontext
getpath
getpath
getpath
getpath
getpath
state
state
state
state
state
getgid
getgid
getgid
getgid
getgid
writelines
writelines
writelines
writelines
writelines
cache
cache
cache
cache
cache
blocked_domains
blocked_domains
blocked_domains
blocked_domains
blocked_domains
izip
izip
izip
izip
izip
format_string
format_string
format_string
format_string
format_string
sort
sort
sort
sort
sort
ifmt
ifmt
ifmt
ifmt
ifmt
app
app
app
app
app
p
p
p
p
p
hasfeature
hasfeature
hasfeature
hasfeature
hasfeature
mimetools
mimetools
mimetools
mimetools
mimetools
acos
acos
acos
acos
acos
s_k
s_k
s_k
s_k
s_k
model
model
model
model
model
fieldvalues
fieldvalues
fieldvalues
fieldvalues
fieldvalues
dumps
dumps
dumps
dumps
dumps
astimezone
astimezone
astimezone
astimezone
astimezone
reversed
reversed
reversed
reversed
reversed
lockf
lockf
lockf
lockf
lockf
tempfile
tempfile
tempfile
tempfile
tempfile
redirect
redirect
redirect
redirect
redirect
st2list
st2list
st2list
st2list
st2list
def
def
def
def
def
field
field
field
field
field
addtests
addtests
addtests
addtests
addtests
abort
abort
abort
abort
abort
factor
factor
factor
factor
factor
guess
guess
guess
guess
guess
globals
globals
globals
globals
globals
database
database
database
database
database
num params
num params
num params
num params
num params
envvar
envvar
envvar
envvar
envvar
search_criterion
search_criterion
search_criterion
search_criterion
search_criterion
audio
audio
audio
audio
audio
msvcrt
msvcrt
msvcrt
msvcrt
msvcrt
ms
ms
ms
ms
ms
303
303
303
303
303
in
in
in
in
in
mgr1
mgr1
mgr1
mgr1
mgr1
popen3
popen3
popen3
popen3
popen3
begin_x
begin_x
begin_x
begin_x
begin_x
sunau
sunau
sunau
sunau
sunau
setrlimit
setrlimit
setrlimit
setrlimit
setrlimit
frees
frees
frees
frees
frees
exc info
exc info
exc info
exc info
exc info
put
put
put
put
put
reset
reset
reset
reset
reset
current
current
current
current
current
getdtdhandler
getdtdhandler
getdtdhandler
getdtdhandler
getdtdhandler
mirrored
mirrored
mirrored
mirrored
mirrored
read
read
read
read
read
contains
contains
contains
contains
contains
notationdeclhandler
notationdeclhandler
notationdeclhandler
notationdeclhandler
notationdeclhandler
new node
new node
new node
new node
new node
clearcache
clearcache
clearcache
clearcache
clearcache
handle
handle
handle
handle
handle
break
break
break
break
break
start_response
start_response
start_response
start_response
start_response
sendcmd
sendcmd
sendcmd
sendcmd
sendcmd
old
old
old
old
old
server title
server title
server title
server title
server title
setfmt
setfmt
setfmt
setfmt
setfmt
fd
fd
fd
fd
fd
findertools
findertools
findertools
findertools
findertools
getcallargs
getcallargs
getcallargs
getcallargs
getcallargs
getche
getche
getche
getche
getche
get
get
get
get
get
application
application
application
application
application
date
date
date
date
date
assigned
assigned
assigned
assigned
assigned
adler32
adler32
adler32
adler32
adler32
parseflags
parseflags
parseflags
parseflags
parseflags
sub_key
sub_key
sub_key
sub_key
sub_key
tan
tan
tan
tan
tan
irshift
irshift
irshift
irshift
irshift
publicid
publicid
publicid
publicid
publicid
successful
successful
successful
successful
successful
dir2
dir2
dir2
dir2
dir2
is
is
is
is
is
path_item
path_item
path_item
path_item
path_item
resize
resize
resize
resize
resize
server name
server name
server name
server name
server name
expect
expect
expect
expect
expect
getsubtype
getsubtype
getsubtype
getsubtype
getsubtype
charset
charset
charset
charset
charset
div
div
div
div
div
urlretrieve
urlretrieve
urlretrieve
urlretrieve
urlretrieve
show
show
show
show
show
toname
toname
toname
toname
toname
tilt
tilt
tilt
tilt
tilt
flushinp
flushinp
flushinp
flushinp
flushinp
forms
forms
forms
forms
forms
python
python
python
python
python
tounicode
tounicode
tounicode
tounicode
tounicode
hypot
hypot
hypot
hypot
hypot
ch
ch
ch
ch
ch
possibilities
possibilities
possibilities
possibilities
possibilities
ifilter
ifilter
ifilter
ifilter
ifilter
stampid
stampid
stampid
stampid
stampid
setencoding
setencoding
setencoding
setencoding
setencoding
storlines
storlines
storlines
storlines
storlines
tostereo
tostereo
tostereo
tostereo
tostereo
interspersed
interspersed
interspersed
interspersed
interspersed
oldattr
oldattr
oldattr
oldattr
oldattr
openfolder
openfolder
openfolder
openfolder
openfolder
getmaxyx
getmaxyx
getmaxyx
getmaxyx
getmaxyx
cd
cd
cd
cd
cd
pathconf
pathconf
pathconf
pathconf
pathconf
clear
clear
clear
clear
clear
title
title
title
title
title
pm
pm
pm
pm
pm
addpackagepath
addpackagepath
addpackagepath
addpackagepath
addpackagepath
pathorfile
pathorfile
pathorfile
pathorfile
pathorfile
hmac
hmac
hmac
hmac
hmac
signed
signed
signed
signed
signed
port
port
port
port
port
fmod
fmod
fmod
fmod
fmod
increment
increment
increment
increment
increment
unknown
unknown
unknown
unknown
unknown
tovideo
tovideo
tovideo
tovideo
tovideo
getmodule
getmodule
getmodule
getmodule
getmodule
filename or stream
filename or stream
filename or stream
filename or stream
filename or stream
atexit
atexit
atexit
atexit
atexit
fdopen
fdopen
fdopen
fdopen
fdopen
and
and
and
and
and
angle
angle
angle
angle
angle
savekey
savekey
savekey
savekey
savekey
terminate
terminate
terminate
terminate
terminate
doupdate
doupdate
doupdate
doupdate
doupdate
getfeature
getfeature
getfeature
getfeature
getfeature
varname
varname
varname
varname
varname
cgixmlrpcrequesthandler
cgixmlrpcrequesthandler
cgixmlrpcrequesthandler
cgixmlrpcrequesthandler
cgixmlrpcrequesthandler
getstatus
getstatus
getstatus
getstatus
getstatus
signalnum
signalnum
signalnum
signalnum
signalnum
referenced
referenced
referenced
referenced
referenced
boundary
boundary
boundary
boundary
boundary
heapify
heapify
heapify
heapify
heapify
csvfile
csvfile
csvfile
csvfile
csvfile
removemessages
removemessages
removemessages
removemessages
removemessages
hkey
hkey
hkey
hkey
hkey
itermonthdates
itermonthdates
itermonthdates
itermonthdates
itermonthdates
byteswap
byteswap
byteswap
byteswap
byteswap
new_x
new_x
new_x
new_x
new_x
document
document
document
document
document
dispatch
dispatch
dispatch
dispatch
dispatch
lsub
lsub
lsub
lsub
lsub
alpha
alpha
alpha
alpha
alpha
slice
slice
slice
slice
slice
notationname
notationname
notationname
notationname
notationname
adapter
adapter
adapter
adapter
adapter
choose
choose
choose
choose
choose
font
font
font
font
font
gl
gl
gl
gl
gl
unicode_char
unicode_char
unicode_char
unicode_char
unicode_char
sendto
sendto
sendto
sendto
sendto
print
print
print
print
print
itertools
itertools
itertools
itertools
itertools
mechanism
mechanism
mechanism
mechanism
mechanism
defaults
defaults
defaults
defaults
defaults
d1
d1
d1
d1
d1
recv
recv
recv
recv
recv
getshapes
getshapes
getshapes
getshapes
getshapes
putheader
putheader
putheader
putheader
putheader
hash
hash
hash
hash
hash
hex
hex
hex
hex
hex
new
new
new
new
new
formats
formats
formats
formats
formats
getdefaultlocale
getdefaultlocale
getdefaultlocale
getdefaultlocale
getdefaultlocale
asinh
asinh
asinh
asinh
asinh
translation
translation
translation
translation
translation
fileinput
fileinput
fileinput
fileinput
fileinput
mailcap
mailcap
mailcap
mailcap
mailcap
dir1
dir1
dir1
dir1
dir1
freeze
freeze
freeze
freeze
freeze
socketpair
socketpair
socketpair
socketpair
socketpair
family
family
family
family
family
md5
md5
md5
md5
md5
fullurl
fullurl
fullurl
fullurl
fullurl
elements
elements
elements
elements
elements
message parts
message parts
message parts
message parts
message parts
client_address
client_address
client_address
client_address
client_address
cast
cast
cast
cast
cast
stringprep
stringprep
stringprep
stringprep
stringprep
has internal subset
has internal subset
has internal subset
has internal subset
has internal subset
alignment
alignment
alignment
alignment
alignment
pair_number
pair_number
pair_number
pair_number
pair_number
getsummaryinformation
getsummaryinformation
getsummaryinformation
getsummaryinformation
getsummaryinformation
align
align
align
align
align
getinfo
getinfo
getinfo
getinfo
getinfo
formatter
formatter
formatter
formatter
formatter
proto
proto
proto
proto
proto
urlsplit
urlsplit
urlsplit
urlsplit
urlsplit
ctlpoints
ctlpoints
ctlpoints
ctlpoints
ctlpoints
getlevelname
getlevelname
getlevelname
getlevelname
getlevelname
geturl
geturl
geturl
geturl
geturl
message_set
message_set
message_set
message_set
message_set
subparsers
subparsers
subparsers
subparsers
subparsers
difflib
difflib
difflib
difflib
difflib
titlestring
titlestring
titlestring
titlestring
titlestring
getsource
getsource
getsource
getsource
getsource
plural
plural
plural
plural
plural
getlocale
getlocale
getlocale
getlocale
getlocale
repl
repl
repl
repl
repl
async chat
async chat
async chat
async chat
async chat
coded_value
coded_value
coded_value
coded_value
coded_value
insertbefore
insertbefore
insertbefore
insertbefore
insertbefore
bpbynumber
bpbynumber
bpbynumber
bpbynumber
bpbynumber
pattern
pattern
pattern
pattern
pattern
errors
errors
errors
errors
errors
parseurl
parseurl
parseurl
parseurl
parseurl
canonic
canonic
canonic
canonic
canonic
bgn
bgn
bgn
bgn
bgn
saxutils
saxutils
saxutils
saxutils
saxutils
gettype
gettype
gettype
gettype
gettype
predicate
predicate
predicate
predicate
predicate
tcsetattr
tcsetattr
tcsetattr
tcsetattr
tcsetattr
splash
splash
splash
splash
splash
sigma
sigma
sigma
sigma
sigma
listdir
listdir
listdir
listdir
listdir
introspection
introspection
introspection
introspection
introspection
ntransfercmd
ntransfercmd
ntransfercmd
ntransfercmd
ntransfercmd
rlecode
rlecode
rlecode
rlecode
rlecode
what
what
what
what
what
g
g
g
g
g
getdecoder
getdecoder
getdecoder
getdecoder
getdecoder
makefile
makefile
makefile
makefile
makefile
au read
au read
au read
au read
au read
endtag
endtag
endtag
endtag
endtag
module
module
module
module
module
listen
listen
listen
listen
listen
replace
replace
replace
replace
replace
name
name
name
name
name
ton
ton
ton
ton
ton
modf
modf
modf
modf
modf
condition
condition
condition
condition
condition
loadlibrary
loadlibrary
loadlibrary
loadlibrary
loadlibrary
magic
magic
magic
magic
magic
inspect
inspect
inspect
inspect
inspect
getpagesize
getpagesize
getpagesize
getpagesize
getpagesize
digest
digest
digest
digest
digest
style
style
style
style
style
controller
controller
controller
controller
controller
resetlocale
resetlocale
resetlocale
resetlocale
resetlocale
askstring
askstring
askstring
askstring
askstring
pprint
pprint
pprint
pprint
pprint
_exit
_exit
_exit
_exit
_exit
expunge
expunge
expunge
expunge
expunge
xgtitle
xgtitle
xgtitle
xgtitle
xgtitle
togglepause
togglepause
togglepause
togglepause
togglepause
auth
auth
auth
auth
auth
getpwall
getpwall
getpwall
getpwall
getpwall
symmetric
symmetric
symmetric
symmetric
symmetric
semaphore
semaphore
semaphore
semaphore
semaphore
opener
opener
opener
opener
opener
tcflush
tcflush
tcflush
tcflush
tcflush
matches
matches
matches
matches
matches
argument
argument
argument
argument
argument
errorstring
errorstring
errorstring
errorstring
errorstring
children
children
children
children
children
success
success
success
success
success
wrap
wrap
wrap
wrap
wrap
fdst
fdst
fdst
fdst
fdst
grey2grey2
grey2grey2
grey2grey2
grey2grey2
grey2grey2
closekey
closekey
closekey
closekey
closekey
ntohl
ntohl
ntohl
ntohl
ntohl
button
button
button
button
button
aetools
aetools
aetools
aetools
aetools
getallmatchingheaders
getallmatchingheaders
getallmatchingheaders
getallmatchingheaders
getallmatchingheaders
clear
clear
clear
clear
clear
c6
c6
c6
c6
c6
dircache
dircache
dircache
dircache
dircache
fun
fun
fun
fun
fun
pcode
pcode
pcode
pcode
pcode
gnutranslations
gnutranslations
gnutranslations
gnutranslations
gnutranslations
method
method
method
method
method
selector
selector
selector
selector
selector
child
child
child
child
child
spawnl
spawnl
spawnl
spawnl
spawnl
au_write
au_write
au_write
au_write
au_write
object
object
object
object
object
raw
raw
raw
raw
raw
anywhere
anywhere
anywhere
anywhere
anywhere
combinations
combinations
combinations
combinations
combinations
docs}
docs}
docs}
docs}
docs}
revision
revision
revision
revision
revision
acquire
acquire
acquire
acquire
acquire
location
location
location
location
location
power
power
power
power
power
oss_audio_device
oss_audio_device
oss_audio_device
oss_audio_device
oss_audio_device
abstractbasicauthhandler
abstractbasicauthhandler
abstractbasicauthhandler
abstractbasicauthhandler
abstractbasicauthhandler
lines
lines
lines
lines
lines
dll
dll
dll
dll
dll
lexists
lexists
lexists
lexists
lexists
begin x
begin x
begin x
begin x
begin x
system
system
system
system
system
setitem
setitem
setitem
setitem
setitem
trace
trace
trace
trace
trace
symlink
symlink
symlink
symlink
symlink
but1
but1
but1
but1
but1
op
op
op
op
op
weibullvariate
weibullvariate
weibullvariate
weibullvariate
weibullvariate
xmlrpclib
xmlrpclib
xmlrpclib
xmlrpclib
xmlrpclib
splitunc
splitunc
splitunc
splitunc
splitunc
setundobuffer
setundobuffer
setundobuffer
setundobuffer
setundobuffer
startmultipartbody
startmultipartbody
startmultipartbody
startmultipartbody
startmultipartbody
getdlopenflags
getdlopenflags
getdlopenflags
getdlopenflags
getdlopenflags
iscode
iscode
iscode
iscode
iscode
tty
tty
tty
tty
tty
prstr
prstr
prstr
prstr
prstr
subnormal
subnormal
subnormal
subnormal
subnormal
tcgetpgrp
tcgetpgrp
tcgetpgrp
tcgetpgrp
tcgetpgrp
computer_name
computer_name
computer_name
computer_name
computer_name
actual
actual
actual
actual
actual
binascii
binascii
binascii
binascii
binascii
fp2
fp2
fp2
fp2
fp2
getenv
getenv
getenv
getenv
getenv
at
at
at
at
at
row
row
row
row
row
newsize
newsize
newsize
newsize
newsize
s
s
s
s
s
locals
locals
locals
locals
locals
xmldeclhandler
xmldeclhandler
xmldeclhandler
xmldeclhandler
xmldeclhandler
speed
speed
speed
speed
speed
docstring
docstring
docstring
docstring
docstring
findfile
findfile
findfile
findfile
findfile
mod name
mod name
mod name
mod name
mod name
readplistfromstring
readplistfromstring
readplistfromstring
readplistfromstring
readplistfromstring
yeardayscalendar
yeardayscalendar
yeardayscalendar
yeardayscalendar
yeardayscalendar
dup2
dup2
dup2
dup2
dup2
clock
clock
clock
clock
clock
301
301
301
301
301
der
der
der
der
der
aeserver
aeserver
aeserver
aeserver
aeserver
set
set
set
set
set
operator
operator
operator
operator
operator
last
last
last
last
last
setcomptype
setcomptype
setcomptype
setcomptype
setcomptype
sort_criteria
sort_criteria
sort_criteria
sort_criteria
sort_criteria
startdoctypedeclhandler
startdoctypedeclhandler
startdoctypedeclhandler
startdoctypedeclhandler
startdoctypedeclhandler
py compile
py compile
py compile
py compile
py compile
setmode
setmode
setmode
setmode
setmode
complete
complete
complete
complete
complete
expandtabs
expandtabs
expandtabs
expandtabs
expandtabs
staticmethod
staticmethod
staticmethod
staticmethod
staticmethod
getscrollbarvalues
getscrollbarvalues
getscrollbarvalues
getscrollbarvalues
getscrollbarvalues
getpgrp
getpgrp
getpgrp
getpgrp
getpgrp
mkfifo
mkfifo
mkfifo
mkfifo
mkfifo
runcode
runcode
runcode
runcode
runcode
loader
loader
loader
loader
loader
registerdomimplementation
registerdomimplementation
registerdomimplementation
registerdomimplementation
registerdomimplementation
fromstring
fromstring
fromstring
fromstring
fromstring
elementtree
elementtree
elementtree
elementtree
elementtree
basehandler
basehandler
basehandler
basehandler
basehandler
is_
is_
is_
is_
is_
popitem
popitem
popitem
popitem
popitem
tables
tables
tables
tables
tables
proxyauth
proxyauth
proxyauth
proxyauth
proxyauth
char
char
char
char
char
toprettyxml
toprettyxml
toprettyxml
toprettyxml
toprettyxml
scheduler
scheduler
scheduler
scheduler
scheduler
setfirstweekday
setfirstweekday
setfirstweekday
setfirstweekday
setfirstweekday
num
num
num
num
num
fromfile
fromfile
fromfile
fromfile
fromfile
makedev
makedev
makedev
makedev
makedev
reportflags
reportflags
reportflags
reportflags
reportflags
fillpoint
fillpoint
fillpoint
fillpoint
fillpoint
msg
msg
msg
msg
msg
pformat
pformat
pformat
pformat
pformat
mapping
mapping
mapping
mapping
mapping
uuid3
uuid3
uuid3
uuid3
uuid3
getchildren
getchildren
getchildren
getchildren
getchildren
getattribute
getattribute
getattribute
getattribute
getattribute
filename_or_file
filename_or_file
filename_or_file
filename_or_file
filename_or_file
fetchall
fetchall
fetchall
fetchall
fetchall
setattribute
setattribute
setattribute
setattribute
setattribute
getpreferredencoding
getpreferredencoding
getpreferredencoding
getpreferredencoding
getpreferredencoding
lognormvariate
lognormvariate
lognormvariate
lognormvariate
lognormvariate
textdomain
textdomain
textdomain
textdomain
textdomain
restype
restype
restype
restype
restype
current
current
current
current
current
ic
ic
ic
ic
ic
fd low
fd low
fd low
fd low
fd low
head
head
head
head
head
getegid
getegid
getegid
getegid
getegid
attributes
attributes
attributes
attributes
attributes
capitalize
capitalize
capitalize
capitalize
capitalize
getexception
getexception
getexception
getexception
getexception
iselement
iselement
iselement
iselement
iselement
uuid
uuid
uuid
uuid
uuid
toxml
toxml
toxml
toxml
toxml
dst
dst
dst
dst
dst
generate
generate
generate
generate
generate
dirs
dirs
dirs
dirs
dirs
functools
functools
functools
functools
functools
getnchannels
getnchannels
getnchannels
getnchannels
getnchannels
doccgixmlrpcrequesthandler
doccgixmlrpcrequesthandler
doccgixmlrpcrequesthandler
doccgixmlrpcrequesthandler
doccgixmlrpcrequesthandler
union
union
union
union
union
compile
compile
compile
compile
compile
conversion
conversion
conversion
conversion
conversion
right)
right)
right)
right)
right)
client address
client address
client address
client address
client address
connect
connect
connect
connect
connect
accept
accept
accept
accept
accept
emptyline
emptyline
emptyline
emptyline
emptyline
mortem
mortem
mortem
mortem
mortem
resetbuffer
resetbuffer
resetbuffer
resetbuffer
resetbuffer
seq2
seq2
seq2
seq2
seq2
combining
combining
combining
combining
combining
y
y
y
y
y
asyncore
asyncore
asyncore
asyncore
asyncore
popleft
popleft
popleft
popleft
popleft
only
only
only
only
only
hide
hide
hide
hide
hide
asyncevents
asyncevents
asyncevents
asyncevents
asyncevents
repeat
repeat
repeat
repeat
repeat
needed
needed
needed
needed
needed
deleteparser
deleteparser
deleteparser
deleteparser
deleteparser
completion
completion
completion
completion
completion
teletype)
teletype)
teletype)
teletype)
teletype)
count
count
count
count
count
fstatvfs
fstatvfs
fstatvfs
fstatvfs
fstatvfs
sndhdr
sndhdr
sndhdr
sndhdr
sndhdr
getmark
getmark
getmark
getmark
getmark
itermonthdays
itermonthdays
itermonthdays
itermonthdays
itermonthdays
isdir
isdir
isdir
isdir
isdir
article
article
article
article
article
iterfind
iterfind
iterfind
iterfind
iterfind
delims
delims
delims
delims
delims
fontpath
fontpath
fontpath
fontpath
fontpath
groupby
groupby
groupby
groupby
groupby
nodelist
nodelist
nodelist
nodelist
nodelist
unordered
unordered
unordered
unordered
unordered
v1
v1
v1
v1
v1
matching
matching
matching
matching
matching
createdocument
createdocument
createdocument
createdocument
createdocument
setdocumentlocator
setdocumentlocator
setdocumentlocator
setdocumentlocator
setdocumentlocator
column
column
column
column
column
fromunicode
fromunicode
fromunicode
fromunicode
fromunicode
addsitedir
addsitedir
addsitedir
addsitedir
addsitedir
init_or_size
init_or_size
init_or_size
init_or_size
init_or_size
encodedfile
encodedfile
encodedfile
encodedfile
encodedfile
error
error
error
error
error
loads
loads
loads
loads
loads
showturtle
showturtle
showturtle
showturtle
showturtle
field_name
field_name
field_name
field_name
field_name
star
star
star
star
star
fcntl
fcntl
fcntl
fcntl
fcntl
getinputcontext
getinputcontext
getinputcontext
getinputcontext
getinputcontext
netrc
netrc
netrc
netrc
netrc
url
url
url
url
url
same
same
same
same
same
mapname
mapname
mapname
mapname
mapname
from
from
from
from
from
sigfpe
sigfpe
sigfpe
sigfpe
sigfpe
file path
file path
file path
file path
file path
radians
radians
radians
radians
radians
openmessage
openmessage
openmessage
openmessage
openmessage
getcwd
getcwd
getcwd
getcwd
getcwd
getattributens
getattributens
getattributens
getattributens
getattributens
newpad
newpad
newpad
newpad
newpad
new_node
new_node
new_node
new_node
new_node
getrlimit
getrlimit
getrlimit
getrlimit
getrlimit
directory
directory
directory
directory
directory
maxpp
maxpp
maxpp
maxpp
maxpp
total
total
total
total
total
getmessage
getmessage
getmessage
getmessage
getmessage
'')
'')
'')
'')
'')
getloggerclass
getloggerclass
getloggerclass
getloggerclass
getloggerclass
pid
pid
pid
pid
pid
formatyear
formatyear
formatyear
formatyear
formatyear
summarize
summarize
summarize
summarize
summarize
etop
etop
etop
etop
etop
insstr
insstr
insstr
insstr
insstr
gettempdir
gettempdir
gettempdir
gettempdir
gettempdir
aggregate
aggregate
aggregate
aggregate
aggregate
fromutc
fromutc
fromutc
fromutc
fromutc
mutually
mutually
mutually
mutually
mutually
syslog
syslog
syslog
syslog
syslog
entityresolver
entityresolver
entityresolver
entityresolver
entityresolver
dirname
dirname
dirname
dirname
dirname
allowed_domains
allowed_domains
allowed_domains
allowed_domains
allowed_domains
haschildnodes
haschildnodes
haschildnodes
haschildnodes
haschildnodes
slave
slave
slave
slave
slave
_write
_write
_write
_write
_write
timetuple
timetuple
timetuple
timetuple
timetuple
betavariate
betavariate
betavariate
betavariate
betavariate
start
start
start
start
start
cmd
cmd
cmd
cmd
cmd
size or initializer
size or initializer
size or initializer
size or initializer
size or initializer
execute
execute
execute
execute
execute
startbody
startbody
startbody
startbody
startbody
io
io
io
io
io
getfloatmax
getfloatmax
getfloatmax
getfloatmax
getfloatmax
callable
callable
callable
callable
callable
syncok
syncok
syncok
syncok
syncok
paragraph
paragraph
paragraph
paragraph
paragraph
fsrc
fsrc
fsrc
fsrc
fsrc
detach
detach
detach
detach
detach
parsestring
parsestring
parsestring
parsestring
parsestring
pow
pow
pow
pow
pow
progressbar
progressbar
progressbar
progressbar
progressbar
q
q
q
q
q
async_chat
async_chat
async_chat
async_chat
async_chat
407
407
407
407
407
link
link
link
link
link
roundbutton
roundbutton
roundbutton
roundbutton
roundbutton
standout
standout
standout
standout
standout
strftime
strftime
strftime
strftime
strftime
echo
echo
echo
echo
echo
asin
asin
asin
asin
asin
out_file
out_file
out_file
out_file
out_file
purge
purge
purge
purge
purge
urllib
urllib
urllib
urllib
urllib
httpresponse
httpresponse
httpresponse
httpresponse
httpresponse
plus
plus
plus
plus
plus
createattributens
createattributens
createattributens
createattributens
createattributens
execfile
execfile
execfile
execfile
execfile
has
has
has
has
has
startendtag
startendtag
startendtag
startendtag
startendtag
c12
c12
c12
c12
c12
gcd
gcd
gcd
gcd
gcd
radiogroup
radiogroup
radiogroup
radiogroup
radiogroup
backlog
backlog
backlog
backlog
backlog
floor
floor
floor
floor
floor
getargspec
getargspec
getargspec
getargspec
getargspec
payload
payload
payload
payload
payload
exp
exp
exp
exp
exp
openerdirector
openerdirector
openerdirector
openerdirector
openerdirector
filename
filename
filename
filename
filename
erase
erase
erase
erase
erase
frozen
frozen
frozen
frozen
frozen
getpgid
getpgid
getpgid
getpgid
getpgid
ordereddict
ordereddict
ordereddict
ordereddict
ordereddict
json
json
json
json
json
which
which
which
which
which
insert
insert
insert
insert
insert
common
common
common
common
common
addtest
addtest
addtest
addtest
addtest
typecode_or_type
typecode_or_type
typecode_or_type
typecode_or_type
typecode_or_type
sqlite3
sqlite3
sqlite3
sqlite3
sqlite3
winerror
winerror
winerror
winerror
winerror
line
line
line
line
line
eventmask
eventmask
eventmask
eventmask
eventmask
zlib
zlib
zlib
zlib
zlib
statement
statement
statement
statement
statement
translate
translate
translate
translate
translate
csvwriter
csvwriter
csvwriter
csvwriter
csvwriter
runctx
runctx
runctx
runctx
runctx
vnarray
vnarray
vnarray
vnarray
vnarray
readplist
readplist
readplist
readplist
readplist
fontname
fontname
fontname
fontname
fontname
shlex
shlex
shlex
shlex
shlex
addcleanup
addcleanup
addcleanup
addcleanup
addcleanup
rlock
rlock
rlock
rlock
rlock
tixcommand
tixcommand
tixcommand
tixcommand
tixcommand
listmethods
listmethods
listmethods
listmethods
listmethods
fp1
fp1
fp1
fp1
fp1
getsize
getsize
getsize
getsize
getsize
authreq
authreq
authreq
authreq
authreq
obufcount
obufcount
obufcount
obufcount
obufcount
bsddbobject
bsddbobject
bsddbobject
bsddbobject
bsddbobject
element
element
element
element
element
writexml
writexml
writexml
writexml
writexml
filenames
filenames
filenames
filenames
filenames
wave_read
wave_read
wave_read
wave_read
wave_read
pack
pack
pack
pack
pack
ident
ident
ident
ident
ident
str1
str1
str1
str1
str1
qs
qs
qs
qs
qs
word
word
word
word
word
threshold0
threshold0
threshold0
threshold0
threshold0
startswith
startswith
startswith
startswith
startswith
_current
_current
_current
_current
_current
gensuitemodule
gensuitemodule
gensuitemodule
gensuitemodule
gensuitemodule
getsid
getsid
getsid
getsid
getsid
link_name
link_name
link_name
link_name
link_name
info
info
info
info
info
parts
parts
parts
parts
parts
decomposition
decomposition
decomposition
decomposition
decomposition
setcontenthandler
setcontenthandler
setcontenthandler
setcontenthandler
setcontenthandler
getincrementaldecoder
getincrementaldecoder
getincrementaldecoder
getincrementaldecoder
getincrementaldecoder
fromstringlist
fromstringlist
fromstringlist
fromstringlist
fromstringlist
status
status
status
status
status
noutrefresh
noutrefresh
noutrefresh
noutrefresh
noutrefresh
assertalmostequal
assertalmostequal
assertalmostequal
assertalmostequal
assertalmostequal
frame_lineno
frame_lineno
frame_lineno
frame_lineno
frame_lineno
flt
flt
flt
flt
flt
full
full
full
full
full
thread
thread
thread
thread
thread
keyname
keyname
keyname
keyname
keyname
writable
writable
writable
writable
writable
isleap
isleap
isleap
isleap
isleap
dllcanunloadnow
dllcanunloadnow
dllcanunloadnow
dllcanunloadnow
dllcanunloadnow
heappush
heappush
heappush
heappush
heappush
executable
executable
executable
executable
executable
saxexception
saxexception
saxexception
saxexception
saxexception
realpath
realpath
realpath
realpath
realpath
h_filename
h_filename
h_filename
h_filename
h_filename
nsmallest
nsmallest
nsmallest
nsmallest
nsmallest
trunc
trunc
trunc
trunc
trunc
stoptest
stoptest
stoptest
stoptest
stoptest
or
or
or
or
or
heading
heading
heading
heading
heading
sharedctypes
sharedctypes
sharedctypes
sharedctypes
sharedctypes
pkg name
pkg name
pkg name
pkg name
pkg name
queryreflectionkey
queryreflectionkey
queryreflectionkey
queryreflectionkey
queryreflectionkey
index
index
index
index
index
records
records
records
records
records
getsubject
getsubject
getsubject
getsubject
getsubject
pensize
pensize
pensize
pensize
pensize
pickle
pickle
pickle
pickle
pickle
modulefinder
modulefinder
modulefinder
modulefinder
modulefinder
bg
bg
bg
bg
bg
member
member
member
member
member
getaddr
getaddr
getaddr
getaddr
getaddr
answerchallenge
answerchallenge
answerchallenge
answerchallenge
answerchallenge
gettestcasenames
gettestcasenames
gettestcasenames
gettestcasenames
gettestcasenames
uri
uri
uri
uri
uri
folder
folder
folder
folder
folder
bastion
bastion
bastion
bastion
bastion
clearstamps
clearstamps
clearstamps
clearstamps
clearstamps
getmro
getmro
getmro
getmro
getmro
systemid
systemid
systemid
systemid
systemid
putwin
putwin
putwin
putwin
putwin
patterns
patterns
patterns
patterns
patterns
sort criteria
sort criteria
sort criteria
sort criteria
sort criteria
display
display
display
display
display
starttestrun
starttestrun
starttestrun
starttestrun
starttestrun
winreg
winreg
winreg
winreg
winreg
infoscrap
infoscrap
infoscrap
infoscrap
infoscrap
lower
lower
lower
lower
lower
exclusive
exclusive
exclusive
exclusive
exclusive
samples
samples
samples
samples
samples
iterators
iterators
iterators
iterators
iterators
bold
bold
bold
bold
bold
add
add
add
add
add
here
here
here
here
here
very
very
very
very
very
menuitem
menuitem
menuitem
menuitem
menuitem
tabs
tabs
tabs
tabs
tabs
reorganize
reorganize
reorganize
reorganize
reorganize
macostools
macostools
macostools
macostools
macostools
addunexpectedsuccess
addunexpectedsuccess
addunexpectedsuccess
addunexpectedsuccess
addunexpectedsuccess
minus
minus
minus
minus
minus
utils
utils
utils
utils
utils
textpad
textpad
textpad
textpad
textpad
italic
italic
italic
italic
italic
urlstring
urlstring
urlstring
urlstring
urlstring
recsrc
recsrc
recsrc
recsrc
recsrc
server_documentation
server_documentation
server_documentation
server_documentation
server_documentation
move
move
move
move
move
mimewriter
mimewriter
mimewriter
mimewriter
mimewriter
imaplib
imaplib
imaplib
imaplib
imaplib
output
output
output
output
output
normpath
normpath
normpath
normpath
normpath
isdaemon
isdaemon
isdaemon
isdaemon
isdaemon
optname
optname
optname
optname
optname
seek
seek
seek
seek
seek
imul
imul
imul
imul
imul
sampfmt
sampfmt
sampfmt
sampfmt
sampfmt
max
max
max
max
max
debug
debug
debug
debug
debug
attrib
attrib
attrib
attrib
attrib
copytree
copytree
copytree
copytree
copytree
normal
normal
normal
normal
normal
getscreen
getscreen
getscreen
getscreen
getscreen
duration
duration
duration
duration
duration
xor
xor
xor
xor
xor
wexitstatus
wexitstatus
wexitstatus
wexitstatus
wexitstatus
setstream
setstream
setstream
setstream
setstream
addch
addch
addch
addch
addch
ehlo
ehlo
ehlo
ehlo
ehlo
warnpy3k
warnpy3k
warnpy3k
warnpy3k
warnpy3k
classes
classes
classes
classes
classes
fchown
fchown
fchown
fchown
fchown
phase
phase
phase
phase
phase
tz
tz
tz
tz
tz
compare
compare
compare
compare
compare
pair number
pair number
pair number
pair number
pair number
selection
selection
selection
selection
selection
key
key
key
key
key
item
item
item
item
item
attribute
attribute
attribute
attribute
attribute
and_
and_
and_
and_
and_
assertin
assertin
assertin
assertin
assertin
table
table
table
table
table
to addrs
to addrs
to addrs
to addrs
to addrs
parser
parser
parser
parser
parser
nurbscurve
nurbscurve
nurbscurve
nurbscurve
nurbscurve
getname
getname
getname
getname
getname
makesocket
makesocket
makesocket
makesocket
makesocket
kbhit
kbhit
kbhit
kbhit
kbhit
manager
manager
manager
manager
manager
h
h
h
h
h
fractions
fractions
fractions
fractions
fractions
unregister
unregister
unregister
unregister
unregister
scriptable
scriptable
scriptable
scriptable
scriptable
mac
mac
mac
mac
mac
frame
frame
frame
frame
frame
deleteln
deleteln
deleteln
deleteln
deleteln
sax
sax
sax
sax
sax
formatexception
formatexception
formatexception
formatexception
formatexception
timer
timer
timer
timer
timer
aggregate_class
aggregate_class
aggregate_class
aggregate_class
aggregate_class
instance
instance
instance
instance
instance
sound
sound
sound
sound
sound
c
c
c
c
c
getusersitepackages
getusersitepackages
getusersitepackages
getusersitepackages
getusersitepackages
ismethod
ismethod
ismethod
ismethod
ismethod
base64
base64
base64
base64
base64
callers
callers
callers
callers
callers
finditer
finditer
finditer
finditer
finditer
formatwarning
formatwarning
formatwarning
formatwarning
formatwarning
snan
snan
snan
snan
snan
dump
dump
dump
dump
dump
product
product
product
product
product
rgid
rgid
rgid
rgid
rgid
authenticators
authenticators
authenticators
authenticators
authenticators
serve
serve
serve
serve
serve
callees
callees
callees
callees
callees
loadtestsfrommodule
loadtestsfrommodule
loadtestsfrommodule
loadtestsfrommodule
loadtestsfrommodule
umask
umask
umask
umask
umask
xmlparser
xmlparser
xmlparser
xmlparser
xmlparser
addheader
addheader
addheader
addheader
addheader
readinto
readinto
readinto
readinto
readinto
lseek
lseek
lseek
lseek
lseek
reverse
reverse
reverse
reverse
reverse
getfullname
getfullname
getfullname
getfullname
getfullname
eng
eng
eng
eng
eng
timeout
timeout
timeout
timeout
timeout
typename
typename
typename
typename
typename
contentclick
contentclick
contentclick
contentclick
contentclick
untokenize
untokenize
untokenize
untokenize
untokenize
getmembers
getmembers
getmembers
getmembers
getmembers
iscntrl
iscntrl
iscntrl
iscntrl
iscntrl
kevent
kevent
kevent
kevent
kevent
begin
begin
begin
begin
begin
wsgiref
wsgiref
wsgiref
wsgiref
wsgiref
node_or_string
node_or_string
node_or_string
node_or_string
node_or_string
position
position
position
position
position
to
to
to
to
to
delay
delay
delay
delay
delay
isoweekday
isoweekday
isoweekday
isoweekday
isoweekday
''
''
''
''
''
delslice
delslice
delslice
delslice
delslice
uidl
uidl
uidl
uidl
uidl
makeelement
makeelement
makeelement
makeelement
makeelement
oss_mixer_device
oss_mixer_device
oss_mixer_device
oss_mixer_device
oss_mixer_device
compress
compress
compress
compress
compress
ast
ast
ast
ast
ast
conjugate
conjugate
conjugate
conjugate
conjugate
not
not
not
not
not
domains
domains
domains
domains
domains
has_internal_subset
has_internal_subset
has_internal_subset
has_internal_subset
has_internal_subset
k
k
k
k
k
ignorablewhitespace
ignorablewhitespace
ignorablewhitespace
ignorablewhitespace
ignorablewhitespace
subelements
subelements
subelements
subelements
subelements
b32encode
b32encode
b32encode
b32encode
b32encode
themename
themename
themename
themename
themename
context
context
context
context
context
sgmlparser
sgmlparser
sgmlparser
sgmlparser
sgmlparser
monthdayscalendar
monthdayscalendar
monthdayscalendar
monthdayscalendar
monthdayscalendar
capture
capture
capture
capture
capture
qnan
qnan
qnan
qnan
qnan
token
token
token
token
token
allowed
allowed
allowed
allowed
allowed
fmt
fmt
fmt
fmt
fmt
formatyearpage
formatyearpage
formatyearpage
formatyearpage
formatyearpage
getresgid
getresgid
getresgid
getresgid
getresgid
fromfd
fromfd
fromfd
fromfd
fromfd
cprofile
cprofile
cprofile
cprofile
cprofile
zipfile
zipfile
zipfile
zipfile
zipfile
setlast
setlast
setlast
setlast
setlast
sorted
sorted
sorted
sorted
sorted
oldchild
oldchild
oldchild
oldchild
oldchild
set2
set2
set2
set2
set2
zfill
zfill
zfill
zfill
zfill
optionparser
optionparser
optionparser
optionparser
optionparser
xlist
xlist
xlist
xlist
xlist
check
check
check
check
check
_makeresult
_makeresult
_makeresult
_makeresult
_makeresult
event
event
event
event
event
not_
not_
not_
not_
not_
createrecord
createrecord
createrecord
createrecord
createrecord
visible
visible
visible
visible
visible
testandset
testandset
testandset
testandset
testandset
getinteger
getinteger
getinteger
getinteger
getinteger
endcdatasectionhandler
endcdatasectionhandler
endcdatasectionhandler
endcdatasectionhandler
endcdatasectionhandler
hashopen
hashopen
hashopen
hashopen
hashopen
n
n
n
n
n
docxmlrpcserver
docxmlrpcserver
docxmlrpcserver
docxmlrpcserver
docxmlrpcserver
launchurl
launchurl
launchurl
launchurl
launchurl
parameters
parameters
parameters
parameters
parameters
command
command
command
command
command
hideturtle
hideturtle
hideturtle
hideturtle
hideturtle
itertext
itertext
itertext
itertext
itertext
setcbreak
setcbreak
setcbreak
setcbreak
setcbreak
tzset
tzset
tzset
tzset
tzset
atof
atof
atof
atof
atof
format spec
format spec
format spec
format spec
format spec
warning
warning
warning
warning
warning
userptr
userptr
userptr
userptr
userptr
tcsendbreak
tcsendbreak
tcsendbreak
tcsendbreak
tcsendbreak
createparser
createparser
createparser
createparser
createparser
setvalue
setvalue
setvalue
setvalue
setvalue
hdlr
hdlr
hdlr
hdlr
hdlr
isprint
isprint
isprint
isprint
isprint
addcallback
addcallback
addcallback
addcallback
addcallback
bkgdset
bkgdset
bkgdset
bkgdset
bkgdset
locator
locator
locator
locator
locator
weekheader
weekheader
weekheader
weekheader
weekheader
issock
issock
issock
issock
issock
history
history
history
history
history
error_handler
error_handler
error_handler
error_handler
error_handler
pdict
pdict
pdict
pdict
pdict
macoswindowid
macoswindowid
macoswindowid
macoswindowid
macoswindowid
dt
dt
dt
dt
dt
setconfig
setconfig
setconfig
setconfig
setconfig
rindex
rindex
rindex
rindex
rindex
cmpfiles
cmpfiles
cmpfiles
cmpfiles
cmpfiles
branch
branch
branch
branch
branch
basehttpserver
basehttpserver
basehttpserver
basehttpserver
basehttpserver
getcanvas
getcanvas
getcanvas
getcanvas
getcanvas
setdefault
setdefault
setdefault
setdefault
setdefault
nested
nested
nested
nested
nested
pton
pton
pton
pton
pton
elementname
elementname
elementname
elementname
elementname
getuid
getuid
getuid
getuid
getuid
v
v
v
v
v
termname
termname
termname
termname
termname
filt
filt
filt
filt
filt
message
message
message
message
message
feature
feature
feature
feature
feature
getsyx
getsyx
getsyx
getsyx
getsyx
forever
forever
forever
forever
forever
day
day
day
day
day
getclasstree
getclasstree
getclasstree
getclasstree
getclasstree
dither2mono
dither2mono
dither2mono
dither2mono
dither2mono
isroutine
isroutine
isroutine
isroutine
isroutine
__init__
__init__
__init__
__init__
__init__
lambd
lambd
lambd
lambd
lambd
fqname
fqname
fqname
fqname
fqname
documentation
documentation
documentation
documentation
documentation
hqx
hqx
hqx
hqx
hqx
getcompname
getcompname
getcompname
getcompname
getcompname
teardown
teardown
teardown
teardown
teardown
samestat
samestat
samestat
samestat
samestat
randrange
randrange
randrange
randrange
randrange
_flush
_flush
_flush
_flush
_flush
getstatusoutput
getstatusoutput
getstatusoutput
getstatusoutput
getstatusoutput
times
times
times
times
times
submenu
submenu
submenu
submenu
submenu
standard
standard
standard
standard
standard
stats
stats
stats
stats
stats
theyear
theyear
theyear
theyear
theyear
and
and
and
and
and
endelementhandler
endelementhandler
endelementhandler
endelementhandler
endelementhandler
out file
out file
out file
out file
out file
isspace
isspace
isspace
isspace
isspace
globs
globs
globs
globs
globs
path
path
path
path
path
set1
set1
set1
set1
set1
isterminal
isterminal
isterminal
isterminal
isterminal
polar
polar
polar
polar
polar
qsl
qsl
qsl
qsl
qsl
findfont
findfont
findfont
findfont
findfont
message num
message num
message num
message num
message num
basecookie
basecookie
basecookie
basecookie
basecookie
ssl
ssl
ssl
ssl
ssl
fpectl
fpectl
fpectl
fpectl
fpectl
nextkey
nextkey
nextkey
nextkey
nextkey
stoplistening
stoplistening
stoplistening
stoplistening
stoplistening
preloop
preloop
preloop
preloop
preloop
beta
beta
beta
beta
beta
getplist
getplist
getplist
getplist
getplist
distb
distb
distb
distb
distb
getacl
getacl
getacl
getacl
getacl
messagebeep
messagebeep
messagebeep
messagebeep
messagebeep
rate
rate
rate
rate
rate
disassemble
disassemble
disassemble
disassemble
disassemble
erasechar
erasechar
erasechar
erasechar
erasechar
issubclass
issubclass
issubclass
issubclass
issubclass
threshold
threshold
threshold
threshold
threshold
capname
capname
capname
capname
capname
b64decode
b64decode
b64decode
b64decode
b64decode
filename_or_stream
filename_or_stream
filename_or_stream
filename_or_stream
filename_or_stream
pass
pass
pass
pass
pass
rawdata
rawdata
rawdata
rawdata
rawdata
assertregexpmatches
assertregexpmatches
assertregexpmatches
assertregexpmatches
assertregexpmatches
monthrange
monthrange
monthrange
monthrange
monthrange
pack_item
pack_item
pack_item
pack_item
pack_item
sety
sety
sety
sety
sety
setdefaultencoding
setdefaultencoding
setdefaultencoding
setdefaultencoding
setdefaultencoding
cmp
cmp
cmp
cmp
cmp
rows
rows
rows
rows
rows
config
config
config
config
config
t
t
t
t
t
formatmonth
formatmonth
formatmonth
formatmonth
formatmonth
processor
processor
processor
processor
processor
heappop
heappop
heappop
heappop
heappop
message_num
message_num
message_num
message_num
message_num
elementdeclhandler
elementdeclhandler
elementdeclhandler
elementdeclhandler
elementdeclhandler
weakvaluedictionary
weakvaluedictionary
weakvaluedictionary
weakvaluedictionary
weakvaluedictionary
getparyx
getparyx
getparyx
getparyx
getparyx
islice
islice
islice
islice
islice
doctest
doctest
doctest
doctest
doctest
deletevalue
deletevalue
deletevalue
deletevalue
deletevalue
divmod
divmod
divmod
divmod
divmod
lazy
lazy
lazy
lazy
lazy
save
save
save
save
save
getmodulename
getmodulename
getmodulename
getmodulename
getmodulename
sections
sections
sections
sections
sections
salt
salt
salt
salt
salt
c8
c8
c8
c8
c8
play
play
play
play
play
profile
profile
profile
profile
profile
ugettext
ugettext
ugettext
ugettext
ugettext
base_name
base_name
base_name
base_name
base_name
multiply
multiply
multiply
multiply
multiply
getcomptype
getcomptype
getcomptype
getcomptype
getcomptype
iand
iand
iand
iand
iand
lvl
lvl
lvl
lvl
lvl
opt str
opt str
opt str
opt str
opt str
list
list
list
list
list
geterrorstring
geterrorstring
geterrorstring
geterrorstring
geterrorstring
validator
validator
validator
validator
validator
unsetenv
unsetenv
unsetenv
unsetenv
unsetenv
bufsize
bufsize
bufsize
bufsize
bufsize
kappa
kappa
kappa
kappa
kappa
etiny
etiny
etiny
etiny
etiny
rstrip
rstrip
rstrip
rstrip
rstrip
unctrl
unctrl
unctrl
unctrl
unctrl
shutdown
shutdown
shutdown
shutdown
shutdown
dev
dev
dev
dev
dev
image
image
image
image
image
package
package
package
package
package
multifile
multifile
multifile
multifile
multifile
rfind
rfind
rfind
rfind
rfind
tcflow
tcflow
tcflow
tcflow
tcflow
grey22grey
grey22grey
grey22grey
grey22grey
grey22grey
user
user
user
user
user
seq1
seq1
seq1
seq1
seq1
attrset
attrset
attrset
attrset
attrset
retrlines
retrlines
retrlines
retrlines
retrlines
rcpttos
rcpttos
rcpttos
rcpttos
rcpttos
cfunctype
cfunctype
cfunctype
cfunctype
cfunctype
characters
characters
characters
characters
characters
formattime
formattime
formattime
formattime
formattime
result
result
result
result
result
param
param
param
param
param
tigetstr
tigetstr
tigetstr
tigetstr
tigetstr
subn
subn
subn
subn
subn
rpop
rpop
rpop
rpop
rpop
bitmask
bitmask
bitmask
bitmask
bitmask
on flag
on flag
on flag
on flag
on flag
doc
doc
doc
doc
doc
copymessage
copymessage
copymessage
copymessage
copymessage
setattributenode
setattributenode
setattributenode
setattributenode
setattributenode
getcontenthandler
getcontenthandler
getcontenthandler
getcontenthandler
getcontenthandler
ftp_tls
ftp_tls
ftp_tls
ftp_tls
ftp_tls
getsystemid
getsystemid
getsystemid
getsystemid
getsystemid
checkfuncname
checkfuncname
checkfuncname
checkfuncname
checkfuncname
getabouttext
getabouttext
getabouttext
getabouttext
getabouttext
commit
commit
commit
commit
commit
getqueuesize
getqueuesize
getqueuesize
getqueuesize
getqueuesize
num_params
num_params
num_params
num_params
num_params
nice
nice
nice
nice
nice
getslice
getslice
getslice
getslice
getslice
getsampwidth
getsampwidth
getsampwidth
getsampwidth
getsampwidth
setup
setup
setup
setup
setup
queryparams
queryparams
queryparams
queryparams
queryparams
args
args
args
args
args
compiler
compiler
compiler
compiler
compiler
ready
ready
ready
ready
ready
setloggerclass
setloggerclass
setloggerclass
setloggerclass
setloggerclass
weakkeydictionary
weakkeydictionary
weakkeydictionary
weakkeydictionary
weakkeydictionary
dynamic
dynamic
dynamic
dynamic
dynamic
subtract
subtract
subtract
subtract
subtract
imap4
imap4
imap4
imap4
imap4
_setroot
_setroot
_setroot
_setroot
_setroot
atan
atan
atan
atan
atan
csvreader
csvreader
csvreader
csvreader
csvreader
charref
charref
charref
charref
charref
lookup
lookup
lookup
lookup
lookup
getpid
getpid
getpid
getpid
getpid
sign
sign
sign
sign
sign
mkdtemp
mkdtemp
mkdtemp
mkdtemp
mkdtemp
qsize
qsize
qsize
qsize
qsize
fork
fork
fork
fork
fork
fdatasync
fdatasync
fdatasync
fdatasync
fdatasync
firstweekday
firstweekday
firstweekday
firstweekday
firstweekday
free
free
free
free
free
vline
vline
vline
vline
vline
parseaddr
parseaddr
parseaddr
parseaddr
parseaddr
identify
identify
identify
identify
identify
_parse
_parse
_parse
_parse
_parse
getticks
getticks
getticks
getticks
getticks
gamma
gamma
gamma
gamma
gamma
regexp
regexp
regexp
regexp
regexp
fatalerror
fatalerror
fatalerror
fatalerror
fatalerror
effective
effective
effective
effective
effective
unicode
unicode
unicode
unicode
unicode
getfillpoint
getfillpoint
getfillpoint
getfillpoint
getfillpoint
writerows
writerows
writerows
writerows
writerows
skipif
skipif
skipif
skipif
skipif
threading_algorithm
threading_algorithm
threading_algorithm
threading_algorithm
threading_algorithm
breaks
breaks
breaks
breaks
breaks
rfactor
rfactor
rfactor
rfactor
rfactor
getcreatorandtype
getcreatorandtype
getcreatorandtype
getcreatorandtype
getcreatorandtype
group
group
group
group
group
hsv
hsv
hsv
hsv
hsv
urlcleanup
urlcleanup
urlcleanup
urlcleanup
urlcleanup
flag
flag
flag
flag
flag
setfloatmax
setfloatmax
setfloatmax
setfloatmax
setfloatmax
fname
fname
fname
fname
fname
src
src
src
src
src
argparse
argparse
argparse
argparse
argparse
color number
color number
color number
color number
color number
c7
c7
c7
c7
c7
opendatabase
opendatabase
opendatabase
opendatabase
opendatabase
prot
prot
prot
prot
prot
endheaders
endheaders
endheaders
endheaders
endheaders
authuri
authuri
authuri
authuri
authuri
infolist
infolist
infolist
infolist
infolist
turtle
turtle
turtle
turtle
turtle
namedtemporaryfile
namedtemporaryfile
namedtemporaryfile
namedtemporaryfile
namedtemporaryfile
imod
imod
imod
imod
imod
softspace
softspace
softspace
softspace
softspace
bindtextdomain
bindtextdomain
bindtextdomain
bindtextdomain
bindtextdomain
example
example
example
example
example
minutes
minutes
minutes
minutes
minutes
sci
sci
sci
sci
sci
askyesnocancel
askyesnocancel
askyesnocancel
askyesnocancel
askyesnocancel
dir
dir
dir
dir
dir
offset
offset
offset
offset
offset
extendleft
extendleft
extendleft
extendleft
extendleft
parsedate
parsedate
parsedate
parsedate
parsedate
buffer size
buffer size
buffer size
buffer size
buffer size
target
target
target
target
target
getspall
getspall
getspall
getspall
getspall
typeahead
typeahead
typeahead
typeahead
typeahead
viewvalues
viewvalues
viewvalues
viewvalues
viewvalues
outfile
outfile
outfile
outfile
outfile
extensions
extensions
extensions
extensions
extensions
pathname2url
pathname2url
pathname2url
pathname2url
pathname2url
fail
fail
fail
fail
fail
tracing
tracing
tracing
tracing
tracing
panels
panels
panels
panels
panels
pasv
pasv
pasv
pasv
pasv
cleandoc
cleandoc
cleandoc
cleandoc
cleandoc
future_builtins
future_builtins
future_builtins
future_builtins
future_builtins
getrecursionlimit
getrecursionlimit
getrecursionlimit
getrecursionlimit
getrecursionlimit
crypt
crypt
crypt
crypt
crypt
copyliteral
copyliteral
copyliteral
copyliteral
copyliteral
apply
apply
apply
apply
apply
commenthandler
commenthandler
commenthandler
commenthandler
commenthandler
sb
sb
sb
sb
sb
literal
literal
literal
literal
literal
sqrt
sqrt
sqrt
sqrt
sqrt
removehandler
removehandler
removehandler
removehandler
removehandler
mkd
mkd
mkd
mkd
mkd
mh
mh
mh
mh
mh
form
form
form
form
form
deepcopy
deepcopy
deepcopy
deepcopy
deepcopy
v2
v2
v2
v2
v2
getcharacterstream
getcharacterstream
getcharacterstream
getcharacterstream
getcharacterstream
dup
dup
dup
dup
dup
isreg
isreg
isreg
isreg
isreg
fd2
fd2
fd2
fd2
fd2
al
al
al
al
al
string
string
string
string
string
rawvalue
rawvalue
rawvalue
rawvalue
rawvalue
blocks
blocks
blocks
blocks
blocks
files
files
files
files
files
confstr
confstr
confstr
confstr
confstr
r
r
r
r
r
wraps
wraps
wraps
wraps
wraps
getuser
getuser
getuser
getuser
getuser
touchwin
touchwin
touchwin
touchwin
touchwin
macos
macos
macos
macos
macos
peek
peek
peek
peek
peek
currentframe
currentframe
currentframe
currentframe
currentframe
flatten
flatten
flatten
flatten
flatten
getqnamebyname
getqnamebyname
getqnamebyname
getqnamebyname
getqnamebyname
seekblock
seekblock
seekblock
seekblock
seekblock
dl
dl
dl
dl
dl
entry
entry
entry
entry
entry
report
report
report
report
report
ilshift
ilshift
ilshift
ilshift
ilshift
packet
packet
packet
packet
packet
disablereflectionkey
disablereflectionkey
disablereflectionkey
disablereflectionkey
disablereflectionkey
isnonterminal
isnonterminal
isnonterminal
isnonterminal
isnonterminal
qp
qp
qp
qp
qp
retrbinary
retrbinary
retrbinary
retrbinary
retrbinary
section
section
section
section
section
tix
tix
tix
tix
tix
flowing
flowing
flowing
flowing
flowing
uninstall
uninstall
uninstall
uninstall
uninstall
grey2mono
grey2mono
grey2mono
grey2mono
grey2mono
push
push
push
push
push
timeit
timeit
timeit
timeit
timeit
until
until
until
until
until
client
client
client
client
client
normalize
normalize
normalize
normalize
normalize
handler
handler
handler
handler
handler
localename
localename
localename
localename
localename
stream
stream
stream
stream
stream
component
component
component
component
component
encoding
encoding
encoding
encoding
encoding
bdb
bdb
bdb
bdb
bdb
arg
arg
arg
arg
arg
killpg
killpg
killpg
killpg
killpg
setproperty
setproperty
setproperty
setproperty
setproperty
multicall
multicall
multicall
multicall
multicall
exec
exec
exec
exec
exec
invert
invert
invert
invert
invert
path1
path1
path1
path1
path1
record
record
record
record
record
pdb
pdb
pdb
pdb
pdb
post
post
post
post
post
copy2
copy2
copy2
copy2
copy2
locale
locale
locale
locale
locale
mailfrom
mailfrom
mailfrom
mailfrom
mailfrom
normalvariate
normalvariate
normalvariate
normalvariate
normalvariate
ratio
ratio
ratio
ratio
ratio
month
month
month
month
month
iterweekdays
iterweekdays
iterweekdays
iterweekdays
iterweekdays
opt_str
opt_str
opt_str
opt_str
opt_str
begidx
begidx
begidx
begidx
begidx
dec
dec
dec
dec
dec
subelement
subelement
subelement
subelement
subelement
methodcaller
methodcaller
methodcaller
methodcaller
methodcaller
f
f
f
f
f
isinstance
isinstance
isinstance
isinstance
isinstance
hotshot
hotshot
hotshot
hotshot
hotshot
unverifiable
unverifiable
unverifiable
unverifiable
unverifiable
tuple2st
tuple2st
tuple2st
tuple2st
tuple2st
isalnum
isalnum
isalnum
isalnum
isalnum
lin2alaw
lin2alaw
lin2alaw
lin2alaw
lin2alaw
modify
modify
modify
modify
modify
simplexmlrpcserver
simplexmlrpcserver
simplexmlrpcserver
simplexmlrpcserver
simplexmlrpcserver
vonmisesvariate
vonmisesvariate
vonmisesvariate
vonmisesvariate
vonmisesvariate
chdir
chdir
chdir
chdir
chdir
fromresource
fromresource
fromresource
fromresource
fromresource
want
want
want
want
want
sig
sig
sig
sig
sig
sequences
sequences
sequences
sequences
sequences
audioop
audioop
audioop
audioop
audioop
rawconfigparser
rawconfigparser
rawconfigparser
rawconfigparser
rawconfigparser
refchild
refchild
refchild
refchild
refchild
getquota
getquota
getquota
getquota
getquota
rgbmode
rgbmode
rgbmode
rgbmode
rgbmode
timetz
timetz
timetz
timetz
timetz
assertsequenceequal
assertsequenceequal
assertsequenceequal
assertsequenceequal
assertsequenceequal
enumvalue
enumvalue
enumvalue
enumvalue
enumvalue
qdevice
qdevice
qdevice
qdevice
qdevice
fragment2
fragment2
fragment2
fragment2
fragment2
getpwnam
getpwnam
getpwnam
getpwnam
getpwnam
setdtdhandler
setdtdhandler
setdtdhandler
setdtdhandler
setdtdhandler
in file
in file
in file
in file
in file
gethostbyname
gethostbyname
gethostbyname
gethostbyname
gethostbyname
quantize
quantize
quantize
quantize
quantize
bytearray
bytearray
bytearray
bytearray
bytearray
factory
factory
factory
factory
factory
kind
kind
kind
kind
kind
objects
objects
objects
objects
objects
movemessage
movemessage
movemessage
movemessage
movemessage
colorsys
colorsys
colorsys
colorsys
colorsys
iterparse
iterparse
iterparse
iterparse
iterparse
assertitemsequal
assertitemsequal
assertitemsequal
assertitemsequal
assertitemsequal
min
min
min
min
min
gettarinfo
gettarinfo
gettarinfo
gettarinfo
gettarinfo
mouseinterval
mouseinterval
mouseinterval
mouseinterval
mouseinterval
docmd
docmd
docmd
docmd
docmd
fm
fm
fm
fm
fm
docleanups
docleanups
docleanups
docleanups
docleanups
themonth
themonth
themonth
themonth
themonth
fstat
fstat
fstat
fstat
fstat
beep
beep
beep
beep
beep
mag
mag
mag
mag
mag
aifc
aifc
aifc
aifc
aifc
date_time
date_time
date_time
date_time
date_time
siginterrupt
siginterrupt
siginterrupt
siginterrupt
siginterrupt
playtrack
playtrack
playtrack
playtrack
playtrack
return
return
return
return
return
above
above
above
above
above
blocked
blocked
blocked
blocked
blocked
findfit
findfit
findfit
findfit
findfit
tracer
tracer
tracer
tracer
tracer
ok
ok
ok
ok
ok
number
number
number
number
number
getincrementalencoder
getincrementalencoder
getincrementalencoder
getincrementalencoder
getincrementalencoder
colorpicker
colorpicker
colorpicker
colorpicker
colorpicker
disco
disco
disco
disco
disco
getsourcefile
getsourcefile
getsourcefile
getsourcefile
getsourcefile
got
got
got
got
got
enter
enter
enter
enter
enter
quick
quick
quick
quick
quick
into
into
into
into
into
insch
insch
insch
insch
insch
compileall
compileall
compileall
compileall
compileall
safeconfigparser
safeconfigparser
safeconfigparser
safeconfigparser
safeconfigparser
results
results
results
results
results
controlhit
controlhit
controlhit
controlhit
controlhit
enable
enable
enable
enable
enable
fromlist
fromlist
fromlist
fromlist
fromlist
writepy
writepy
writepy
writepy
writepy
makefolder
makefolder
makefolder
makefolder
makefolder
getfloat
getfloat
getfloat
getfloat
getfloat
block
block
block
block
block
leapdays
leapdays
leapdays
leapdays
leapdays
getpublicid
getpublicid
getpublicid
getpublicid
getpublicid
readfp
readfp
readfp
readfp
readfp
allocate
allocate
allocate
allocate
allocate
pack item
pack item
pack item
pack item
pack item
append
append
append
append
append
close
close
close
close
close
httperrorprocessor
httperrorprocessor
httperrorprocessor
httperrorprocessor
httperrorprocessor
rpartition
rpartition
rpartition
rpartition
rpartition
timedelta
timedelta
timedelta
timedelta
timedelta
subpad
subpad
subpad
subpad
subpad
spacing
spacing
spacing
spacing
spacing
scheme
scheme
scheme
scheme
scheme
fileobject
fileobject
fileobject
fileobject
fileobject
graphics
graphics
graphics
graphics
graphics
sym
sym
sym
sym
sym
size
size
size
size
size
packer
packer
packer
packer
packer
wave read
wave read
wave read
wave read
wave read
rlist
rlist
rlist
rlist
rlist
type
type
type
type
type
getfmts
getfmts
getfmts
getfmts
getfmts
tzname
tzname
tzname
tzname
tzname
bases
bases
bases
bases
bases
limit
limit
limit
limit
limit
usage
usage
usage
usage
usage
scaleb
scaleb
scaleb
scaleb
scaleb
delitem
delitem
delitem
delitem
delitem
enumerate
enumerate
enumerate
enumerate
enumerate
pi
pi
pi
pi
pi
profilefunc
profilefunc
profilefunc
profilefunc
profilefunc
setfont
setfont
setfont
setfont
setfont
run
run
run
run
run
rewindbody
rewindbody
rewindbody
rewindbody
rewindbody
o
o
o
o
o
gammavariate
gammavariate
gammavariate
gammavariate
gammavariate
scrolledwindow
scrolledwindow
scrolledwindow
scrolledwindow
scrolledwindow
clearstamp
clearstamp
clearstamp
clearstamp
clearstamp
setsampwidth
setsampwidth
setsampwidth
setsampwidth
setsampwidth
isblank
isblank
isblank
isblank
isblank
bin
bin
bin
bin
bin
getnframes
getnframes
getnframes
getnframes
getnframes
getframeinfo
getframeinfo
getframeinfo
getframeinfo
getframeinfo
excepthook
excepthook
excepthook
excepthook
excepthook
samplerate
samplerate
samplerate
samplerate
samplerate
singular
singular
singular
singular
singular
setnomoretags
setnomoretags
setnomoretags
setnomoretags
setnomoretags
b
b
b
b
b
loadtestsfromtestcase
loadtestsfromtestcase
loadtestsfromtestcase
loadtestsfromtestcase
loadtestsfromtestcase
clone
clone
clone
clone
clone
qiflush
qiflush
qiflush
qiflush
qiflush
start response
start response
start response
start response
start response
cls
cls
cls
cls
cls
str3
str3
str3
str3
str3
jpeg
jpeg
jpeg
jpeg
jpeg
toggle
toggle
toggle
toggle
toggle
proxy
proxy
proxy
proxy
proxy
apop
apop
apop
apop
apop
server documentation
server documentation
server documentation
server documentation
server documentation
category
category
category
category
category
codec
codec
codec
codec
codec
cookie
cookie
cookie
cookie
cookie
codecs
codecs
codecs
codecs
codecs
write
write
write
write
write
cos
cos
cos
cos
cos
realm
realm
realm
realm
realm
takewhile
takewhile
takewhile
takewhile
takewhile
egid
egid
egid
egid
egid
checkbox
checkbox
checkbox
checkbox
checkbox
getproperty
getproperty
getproperty
getproperty
getproperty
idna
idna
idna
idna
idna
device
device
device
device
device
addfile
addfile
addfile
addfile
addfile
core
core
core
core
core
argumentparser
argumentparser
argumentparser
argumentparser
argumentparser
etype
etype
etype
etype
etype
chr
chr
chr
chr
chr
hline
hline
hline
hline
hline
authorizer callback
authorizer callback
authorizer callback
authorizer callback
authorizer callback
to_angle
to_angle
to_angle
to_angle
to_angle
featurename
featurename
featurename
featurename
featurename
ihave
ihave
ihave
ihave
ihave
mmap
mmap
mmap
mmap
mmap
valslider
valslider
valslider
valslider
valslider
formatargvalues
formatargvalues
formatargvalues
formatargvalues
formatargvalues
emit
emit
emit
emit
emit
double
double
double
double
double
new_y
new_y
new_y
new_y
new_y
createelement
createelement
createelement
createelement
createelement
c3
c3
c3
c3
c3
truncate
truncate
truncate
truncate
truncate
utcoffset
utcoffset
utcoffset
utcoffset
utcoffset
assertnotregexpmatches
assertnotregexpmatches
assertnotregexpmatches
assertnotregexpmatches
assertnotregexpmatches
turtles
turtles
turtles
turtles
turtles
setcontext
setcontext
setcontext
setcontext
setcontext
createdocumenttype
createdocumenttype
createdocumenttype
createdocumenttype
createdocumenttype
parent
parent
parent
parent
parent
env
env
env
env
env
controlswindow
controlswindow
controlswindow
controlswindow
controlswindow
integral
integral
integral
integral
integral
methods
methods
methods
methods
methods
notstandalonehandler
notstandalonehandler
notstandalonehandler
notstandalonehandler
notstandalonehandler
nocbreak
nocbreak
nocbreak
nocbreak
nocbreak
sysconfig
sysconfig
sysconfig
sysconfig
sysconfig
starttls
starttls
starttls
starttls
starttls
proxydigestauthhandler
proxydigestauthhandler
proxydigestauthhandler
proxydigestauthhandler
proxydigestauthhandler
klass
klass
klass
klass
klass
runsource
runsource
runsource
runsource
runsource
date time
date time
date time
date time
date time
ndata
ndata
ndata
ndata
ndata
readall
readall
readall
readall
readall
currency
currency
currency
currency
currency
minidom
minidom
minidom
minidom
minidom
init
init
init
init
init
circle
circle
circle
circle
circle
address
address
address
address
address
alo
alo
alo
alo
alo
scalefont
scalefont
scalefont
scalefont
scalefont
year
year
year
year
year
ftp tls
ftp tls
ftp tls
ftp tls
ftp tls
unfreeze
unfreeze
unfreeze
unfreeze
unfreeze
l
l
l
l
l
fd_low
fd_low
fd_low
fd_low
fd_low
unparsedentitydecl
unparsedentitydecl
unparsedentitydecl
unparsedentitydecl
unparsedentitydecl
strptime
strptime
strptime
strptime
strptime
endelement
endelement
endelement
endelement
endelement
_clear
_clear
_clear
_clear
_clear
zinfo or arcname
zinfo or arcname
zinfo or arcname
zinfo or arcname
zinfo or arcname
base name
base name
base name
base name
base name
curses
curses
curses
curses
curses
eager
eager
eager
eager
eager
keys
keys
keys
keys
keys
found
found
found
found
found
all
all
all
all
all
pass_
pass_
pass_
pass_
pass_
top
top
top
top
top
ver
ver
ver
ver
ver
constructor
constructor
constructor
constructor
constructor
aepack
aepack
aepack
aepack
aepack
rename
rename
rename
rename
rename
ustr
ustr
ustr
ustr
ustr
addbitmapdir
addbitmapdir
addbitmapdir
addbitmapdir
addbitmapdir
pwd
pwd
pwd
pwd
pwd
archive
archive
archive
archive
archive
hasattributens
hasattributens
hasattributens
hasattributens
hasattributens
extract
extract
extract
extract
extract
getattributenodens
getattributenodens
getattributenodens
getattributenodens
getattributenodens
getparam
getparam
getparam
getparam
getparam
ordering
ordering
ordering
ordering
ordering
boolean
boolean
boolean
boolean
boolean
extn
extn
extn
extn
extn
ungetwch
ungetwch
ungetwch
ungetwch
ungetwch
pre
pre
pre
pre
pre
playsound
playsound
playsound
playsound
playsound
uu
uu
uu
uu
uu
direction
direction
direction
direction
direction
menu
menu
menu
menu
menu
isnumbertype
isnumbertype
isnumbertype
isnumbertype
isnumbertype
setdefaulttimeout
setdefaulttimeout
setdefaulttimeout
setdefaulttimeout
setdefaulttimeout
tab id
tab id
tab id
tab id
tab id
modulename
modulename
modulename
modulename
modulename
ischr
ischr
ischr
ischr
ischr
root
root
root
root
root
fnmatchcase
fnmatchcase
fnmatchcase
fnmatchcase
fnmatchcase
nextpart
nextpart
nextpart
nextpart
nextpart
b3
b3
b3
b3
b3
domain
domain
domain
domain
domain
repr
repr
repr
repr
repr
subtype
subtype
subtype
subtype
subtype
setlevel
setlevel
setlevel
setlevel
setlevel
rule
rule
rule
rule
rule
stop
stop
stop
stop
stop
endnamespacedeclhandler
endnamespacedeclhandler
endnamespacedeclhandler
endnamespacedeclhandler
endnamespacedeclhandler
resetwarnings
resetwarnings
resetwarnings
resetwarnings
resetwarnings
unload
unload
unload
unload
unload
langinfo
langinfo
langinfo
langinfo
langinfo
writestr
writestr
writestr
writestr
writestr
message_part
message_part
message_part
message_part
message_part
setsyx
setsyx
setsyx
setsyx
setsyx
copysign
copysign
copysign
copysign
copysign
forget
forget
forget
forget
forget
build
build
build
build
build
configuration
configuration
configuration
configuration
configuration
getentityresolver
getentityresolver
getentityresolver
getentityresolver
getentityresolver
scrollbars
scrollbars
scrollbars
scrollbars
scrollbars
notationdecl
notationdecl
notationdecl
notationdecl
notationdecl
junk
junk
junk
junk
junk
to angle
to angle
to angle
to angle
to angle
mod_name
mod_name
mod_name
mod_name
mod_name
message set
message set
message set
message set
message set
selectors
selectors
selectors
selectors
selectors
getturtle
getturtle
getturtle
getturtle
getturtle
lineno
lineno
lineno
lineno
lineno
gid
gid
gid
gid
gid
_winreg
_winreg
_winreg
_winreg
_winreg
ceil
ceil
ceil
ceil
ceil
cancel
cancel
cancel
cancel
cancel
getch
getch
getch
getch
getch
assertis
assertis
assertis
assertis
assertis
winsound
winsound
winsound
winsound
winsound
floordiv
floordiv
floordiv
floordiv
floordiv
imap4 ssl
imap4 ssl
imap4 ssl
imap4 ssl
imap4 ssl
ldngettext
ldngettext
ldngettext
ldngettext
ldngettext
decodestring
decodestring
decodestring
decodestring
decodestring
first
first
first
first
first
ctype
ctype
ctype
ctype
ctype
istraceback
istraceback
istraceback
istraceback
istraceback
docfilesuite
docfilesuite
docfilesuite
docfilesuite
docfilesuite
notimeout
notimeout
notimeout
notimeout
notimeout
log10
log10
log10
log10
log10
flags
flags
flags
flags
flags
empty
empty
empty
empty
empty
listmessages
listmessages
listmessages
listmessages
listmessages
runfunc
runfunc
runfunc
runfunc
runfunc
field names
field names
field names
field names
field names
nonstandard
nonstandard
nonstandard
nonstandard
nonstandard
readlink
readlink
readlink
readlink
readlink
filecmp
filecmp
filecmp
filecmp
filecmp
iconcat
iconcat
iconcat
iconcat
iconcat
poly
poly
poly
poly
poly
to_addrs
to_addrs
to_addrs
to_addrs
to_addrs
radius
radius
radius
radius
radius
rms
rms
rms
rms
rms
findall
findall
findall
findall
findall
ngettext
ngettext
ngettext
ngettext
ngettext
addinfo
addinfo
addinfo
addinfo
addinfo
find
find
find
find
find
control
control
control
control
control
fileopen
fileopen
fileopen
fileopen
fileopen
unpack
unpack
unpack
unpack
unpack
mime
mime
mime
mime
mime
init or size
init or size
init or size
init or size
init or size
gettrackinfo
gettrackinfo
gettrackinfo
gettrackinfo
gettrackinfo
stat1
stat1
stat1
stat1
stat1
lfactor
lfactor
lfactor
lfactor
lfactor
fd high
fd high
fd high
fd high
fd high
c5
c5
c5
c5
c5
parse
parse
parse
parse
parse
isgeneratorfunction
isgeneratorfunction
isgeneratorfunction
isgeneratorfunction
isgeneratorfunction
lin2adpcm
lin2adpcm
lin2adpcm
lin2adpcm
lin2adpcm
getfontinfo
getfontinfo
getfontinfo
getfontinfo
getfontinfo
atanh
atanh
atanh
atanh
atanh
getcurrent
getcurrent
getcurrent
getcurrent
getcurrent
valuerefs
valuerefs
valuerefs
valuerefs
valuerefs
enumsubst
enumsubst
enumsubst
enumsubst
enumsubst
feed
feed
feed
feed
feed
color_number
color_number
color_number
color_number
color_number
cbreak
cbreak
cbreak
cbreak
cbreak
reference
reference
reference
reference
reference
module or name
module or name
module or name
module or name
module or name
b2
b2
b2
b2
b2
retr
retr
retr
retr
retr
copybinary
copybinary
copybinary
copybinary
copybinary
inc
inc
inc
inc
inc
marshal
marshal
marshal
marshal
marshal
statvfs
statvfs
statvfs
statvfs
statvfs
assertsetequal
assertsetequal
assertsetequal
assertsetequal
assertsetequal
terminator
terminator
terminator
terminator
terminator
putsequences
putsequences
putsequences
putsequences
putsequences
bisect
bisect
bisect
bisect
bisect
noop
noop
noop
noop
noop
addressof
addressof
addressof
addressof
addressof
interact
interact
interact
interact
interact
load
load
load
load
load
height
height
height
height
height
localtime
localtime
localtime
localtime
localtime
comment
comment
comment
comment
comment
deletefolder
deletefolder
deletefolder
deletefolder
deletefolder
gettrace
gettrace
gettrace
gettrace
gettrace
getweakrefcount
getweakrefcount
getweakrefcount
getweakrefcount
getweakrefcount
peer
peer
peer
peer
peer
mutex
mutex
mutex
mutex
mutex
order
order
order
order
order
blo
blo
blo
blo
blo
qname
qname
qname
qname
qname
modifiers
modifiers
modifiers
modifiers
modifiers
file
file
file
file
file
getiterator
getiterator
getiterator
getiterator
getiterator
panel
panel
panel
panel
panel
cwd
cwd
cwd
cwd
cwd
pair
pair
pair
pair
pair
namelist
namelist
namelist
namelist
namelist
obuffree
obuffree
obuffree
obuffree
obuffree
lchflags
lchflags
lchflags
lchflags
lchflags
tobuf
tobuf
tobuf
tobuf
tobuf
httpdigestauthhandler
httpdigestauthhandler
httpdigestauthhandler
httpdigestauthhandler
httpdigestauthhandler
simplefilter
simplefilter
simplefilter
simplefilter
simplefilter
dbm
dbm
dbm
dbm
dbm
labels
labels
labels
labels
labels
htmlparser
htmlparser
htmlparser
htmlparser
htmlparser
testcaseclass
testcaseclass
testcaseclass
testcaseclass
testcaseclass
heappushpop
heappushpop
heappushpop
heappushpop
heappushpop
ref
ref
ref
ref
ref
isvisible
isvisible
isvisible
isvisible
isvisible
touched
touched
touched
touched
touched
windowbounds
windowbounds
windowbounds
windowbounds
windowbounds
split
split
split
split
split
repr1
repr1
repr1
repr1
repr1
unpacker
unpacker
unpacker
unpacker
unpacker
fileconfig
fileconfig
fileconfig
fileconfig
fileconfig
fd_high
fd_high
fd_high
fd_high
fd_high
closeport
closeport
closeport
closeport
closeport
crc32
crc32
crc32
crc32
crc32
nvarray
nvarray
nvarray
nvarray
nvarray
externalentityrefhandler
externalentityrefhandler
externalentityrefhandler
externalentityrefhandler
externalentityrefhandler
width
width
width
width
width
bind
bind
bind
bind
bind
nan
nan
nan
nan
nan
cookies
cookies
cookies
cookies
cookies
shelve
shelve
shelve
shelve
shelve
resetparser
resetparser
resetparser
resetparser
resetparser
binhex
binhex
binhex
binhex
binhex
use
use
use
use
use
grp
grp
grp
grp
grp
logical
logical
logical
logical
logical
prettyprinter
prettyprinter
prettyprinter
prettyprinter
prettyprinter
queue
queue
queue
queue
queue
seteuid
seteuid
seteuid
seteuid
seteuid
platform
platform
platform
platform
platform
expt
expt
expt
expt
expt
authenticate
authenticate
authenticate
authenticate
authenticate
exc
exc
exc
exc
exc
serverproxy
serverproxy
serverproxy
serverproxy
serverproxy
paretovariate
paretovariate
paretovariate
paretovariate
paretovariate
alt
alt
alt
alt
alt
encode
encode
encode
encode
encode
entityref
entityref
entityref
entityref
entityref
getgroups
getgroups
getgroups
getgroups
getgroups
setslice
setslice
setslice
setslice
setslice
wcoredump
wcoredump
wcoredump
wcoredump
wcoredump
fileno
fileno
fileno
fileno
fileno
from
from
from
from
from
settrace
settrace
settrace
settrace
settrace
attrs
attrs
attrs
attrs
attrs
urllib2
urllib2
urllib2
urllib2
urllib2
local
local
local
local
local
url2pathname
url2pathname
url2pathname
url2pathname
url2pathname
removeattributens
removeattributens
removeattributens
removeattributens
removeattributens
sequence
sequence
sequence
sequence
sequence
lock
lock
lock
lock
lock
typecode
typecode
typecode
typecode
typecode
byte
byte
byte
byte
byte
dllgetclassobject
dllgetclassobject
dllgetclassobject
dllgetclassobject
dllgetclassobject
hidden
hidden
hidden
hidden
hidden
createkeyex
createkeyex
createkeyex
createkeyex
createkeyex
h filename
h filename
h filename
h filename
h filename
il
il
il
il
il
box
box
box
box
box
isrecursive
isrecursive
isrecursive
isrecursive
isrecursive
getproxies
getproxies
getproxies
getproxies
getproxies
writeplist
writeplist
writeplist
writeplist
writeplist
write
write
write
write
write
endswith
endswith
endswith
endswith
endswith
getouterframes
getouterframes
getouterframes
getouterframes
getouterframes
minor
minor
minor
minor
minor
flagstr
flagstr
flagstr
flagstr
flagstr
old node
old node
old node
old node
old node
expected
expected
expected
expected
expected
removefilter
removefilter
removefilter
removefilter
removefilter
ctermid
ctermid
ctermid
ctermid
ctermid
nframes
nframes
nframes
nframes
nframes
reload
reload
reload
reload
reload
data
data
data
data
data
length
length
length
length
length
t k
t k
t k
t k
t k
onoff
onoff
onoff
onoff
onoff
password
password
password
password
password
proxybasicauthhandler
proxybasicauthhandler
proxybasicauthhandler
proxybasicauthhandler
proxybasicauthhandler
unittest
unittest
unittest
unittest
unittest
putwch
putwch
putwch
putwch
putwch
flush
flush
flush
flush
flush
urlparse
urlparse
urlparse
urlparse
urlparse
stat2
stat2
stat2
stat2
stat2
pwlcurve
pwlcurve
pwlcurve
pwlcurve
pwlcurve
setcheckinterval
setcheckinterval
setcheckinterval
setcheckinterval
setcheckinterval
getparams
getparams
getparams
getparams
getparams
cmath
cmath
cmath
cmath
cmath
sampwidth
sampwidth
sampwidth
sampwidth
sampwidth
can
can
can
can
can
blocked domains
blocked domains
blocked domains
blocked domains
blocked domains
cleardata
cleardata
cleardata
cleardata
cleardata
req
req
req
req
req
username
username
username
username
username
readlines
readlines
readlines
readlines
readlines
label
label
label
label
label
getlinenumber
getlinenumber
getlinenumber
getlinenumber
getlinenumber
summaryinformation
summaryinformation
summaryinformation
summaryinformation
summaryinformation
below
below
below
below
below
isxdigit
isxdigit
isxdigit
isxdigit
isxdigit
completer
completer
completer
completer
completer
register
register
register
register
register
vtbl_index
vtbl_index
vtbl_index
vtbl_index
vtbl_index
getframerate
getframerate
getframerate
getframerate
getframerate
size_or_initializer
size_or_initializer
size_or_initializer
size_or_initializer
size_or_initializer
testing
testing
testing
testing
testing
match
match
match
match
match
strict
strict
strict
strict
strict
getconfig
getconfig
getconfig
getconfig
getconfig
getbase
getbase
getbase
getbase
getbase
do
do
do
do
do
filterwarnings
filterwarnings
filterwarnings
filterwarnings
filterwarnings
au_read
au_read
au_read
au_read
au_read
attach
attach
attach
attach
attach
extension
extension
extension
extension
extension
getpos
getpos
getpos
getpos
getpos
random
random
random
random
random
abs
abs
abs
abs
abs
tuple
tuple
tuple
tuple
tuple
codeop
codeop
codeop
codeop
codeop
obj
obj
obj
obj
obj
idle
idle
idle
idle
idle
makelogrecord
makelogrecord
makelogrecord
makelogrecord
makelogrecord
filename or file
filename or file
filename or file
filename or file
filename or file
getchildnodes
getchildnodes
getchildnodes
getchildnodes
getchildnodes
is
is
is
is
is
uname
uname
uname
uname
uname
struct
struct
struct
struct
struct
namedtuple
namedtuple
namedtuple
namedtuple
namedtuple
geteuid
geteuid
geteuid
geteuid
geteuid
minmax
minmax
minmax
minmax
minmax
resource
resource
resource
resource
resource
defaulthandler
defaulthandler
defaulthandler
defaulthandler
defaulthandler
fma
fma
fma
fma
fma
referrers
referrers
referrers
referrers
referrers
implementation
implementation
implementation
implementation
implementation
showwarning
showwarning
showwarning
showwarning
showwarning
sequence_of_strings
sequence_of_strings
sequence_of_strings
sequence_of_strings
sequence_of_strings
capturewarnings
capturewarnings
capturewarnings
capturewarnings
capturewarnings
wstopsig
wstopsig
wstopsig
wstopsig
wstopsig
visitor
visitor
visitor
visitor
visitor
getattr
getattr
getattr
getattr
getattr
isnan
isnan
isnan
isnan
isnan
version
version
version
version
version
seq
seq
seq
seq
seq
seqs
seqs
seqs
seqs
seqs
sock
sock
sock
sock
sock
isblk
isblk
isblk
isblk
isblk
cgi
cgi
cgi
cgi
cgi
enddoctypedeclhandler
enddoctypedeclhandler
enddoctypedeclhandler
enddoctypedeclhandler
enddoctypedeclhandler
getelementsbytagname
getelementsbytagname
getelementsbytagname
getelementsbytagname
getelementsbytagname
getkey
getkey
getkey
getkey
getkey
getnames
getnames
getnames
getnames
getnames
hasattributes
hasattributes
hasattributes
hasattributes
hasattributes
error handler
error handler
error handler
error handler
error handler
queryvalueex
queryvalueex
queryvalueex
queryvalueex
queryvalueex
geteffectivelevel
geteffectivelevel
geteffectivelevel
geteffectivelevel
geteffectivelevel
ungettext
ungettext
ungettext
ungettext
ungettext
property
property
property
property
property
unpack item
unpack item
unpack item
unpack item
unpack item
tomono
tomono
tomono
tomono
tomono
task
task
task
task
task
hook
hook
hook
hook
hook
words
words
words
words
words
level
level
level
level
level
partition
partition
partition
partition
partition
httpredirecthandler
httpredirecthandler
httpredirecthandler
httpredirecthandler
httpredirecthandler
openpty
openpty
openpty
openpty
openpty
prmonth
prmonth
prmonth
prmonth
prmonth
imp
imp
imp
imp
imp
email
email
email
email
email
_quit
_quit
_quit
_quit
_quit
difference
difference
difference
difference
difference
startnamespacedeclhandler
startnamespacedeclhandler
startnamespacedeclhandler
startnamespacedeclhandler
startnamespacedeclhandler
join
join
join
join
join
askpassword
askpassword
askpassword
askpassword
askpassword
readsamps
readsamps
readsamps
readsamps
readsamps
maskpri
maskpri
maskpri
maskpri
maskpri
value_name
value_name
value_name
value_name
value_name
fsum
fsum
fsum
fsum
fsum
getcolumnnumber
getcolumnnumber
getcolumnnumber
getcolumnnumber
getcolumnnumber
killchar
killchar
killchar
killchar
killchar
kill
kill
kill
kill
kill
test support
test support
test support
test support
test support
runeval
runeval
runeval
runeval
runeval
super
super
super
super
super
islnk
islnk
islnk
islnk
islnk
runpy
runpy
runpy
runpy
runpy
divide
divide
divide
divide
divide
server_name
server_name
server_name
server_name
server_name
ncols
ncols
ncols
ncols
ncols
setnchannels
setnchannels
setnchannels
setnchannels
setnchannels
appendchild
appendchild
appendchild
appendchild
appendchild
fromhex
fromhex
fromhex
fromhex
fromhex
setnframes
setnframes
setnframes
setnframes
setnframes
zip
zip
zip
zip
zip
heapq
heapq
heapq
heapq
heapq
weakref
weakref
weakref
weakref
weakref
wave
wave
wave
wave
wave
getsampfmt
getsampfmt
getsampfmt
getsampfmt
getsampfmt
popen4
popen4
popen4
popen4
popen4
getwidth
getwidth
getwidth
getwidth
getwidth
sniff
sniff
sniff
sniff
sniff
stack
stack
stack
stack
stack
propertyname
propertyname
propertyname
propertyname
propertyname
b2a
b2a
b2a
b2a
b2a
fl
fl
fl
fl
fl
getvalue
getvalue
getvalue
getvalue
getvalue
varray
varray
varray
varray
varray
rectangle
rectangle
rectangle
rectangle
rectangle
select
select
select
select
select
from_
from_
from_
from_
from_
settscdump
settscdump
settscdump
settscdump
settscdump
typeobj
typeobj
typeobj
typeobj
typeobj
from addr
from addr
from addr
from addr
from addr
out
out
out
out
out
escape
escape
escape
escape
escape
seed
seed
seed
seed
seed
importers
importers
importers
importers
importers
tab_id
tab_id
tab_id
tab_id
tab_id
filter
filter
filter
filter
filter
getlength
getlength
getlength
getlength
getlength
tracebacks
tracebacks
tracebacks
tracebacks
tracebacks
splittable
splittable
splittable
splittable
splittable
erf
erf
erf
erf
erf
callback
callback
callback
callback
callback
prcal
prcal
prcal
prcal
prcal
getlasterror
getlasterror
getlasterror
getlasterror
getlasterror
getspnam
getspnam
getspnam
getspnam
getspnam
file_name
file_name
file_name
file_name
file_name
setwatchcursor
setwatchcursor
setwatchcursor
setwatchcursor
setwatchcursor
old_node
old_node
old_node
old_node
old_node
getfilesystemencoding
getfilesystemencoding
getfilesystemencoding
getfilesystemencoding
getfilesystemencoding
calcsize
calcsize
calcsize
calcsize
calcsize
setannotation
setannotation
setannotation
setannotation
setannotation
mask
mask
mask
mask
mask
stamp
stamp
stamp
stamp
stamp
getmessageid
getmessageid
getmessageid
getmessageid
getmessageid
islast
islast
islast
islast
islast
getchannels
getchannels
getchannels
getchannels
getchannels
content
content
content
content
content
getsizeof
getsizeof
getsizeof
getsizeof
getsizeof
arguments
arguments
arguments
arguments
arguments
setattr
setattr
setattr
setattr
setattr
bhi
bhi
bhi
bhi
bhi
value
value
value
value
value
urlunparse
urlunparse
urlunparse
urlunparse
urlunparse
removechild
removechild
removechild
removechild
removechild
z
z
z
z
z
getargvalues
getargvalues
getargvalues
getargvalues
getargvalues
nextfile
nextfile
nextfile
nextfile
nextfile
expm1
expm1
expm1
expm1
expm1
getsockopt
getsockopt
getsockopt
getsockopt
getsockopt
isbuiltin
isbuiltin
isbuiltin
isbuiltin
isbuiltin
reqed
reqed
reqed
reqed
reqed
functions
functions
functions
functions
functions
loadtestsfromname
loadtestsfromname
loadtestsfromname
loadtestsfromname
loadtestsfromname
dialogwindow
dialogwindow
dialogwindow
dialogwindow
dialogwindow
destdir
destdir
destdir
destdir
destdir
getframe
getframe
getframe
getframe
getframe
sendmail
sendmail
sendmail
sendmail
sendmail
divider
divider
divider
divider
divider
writeplisttoresource
writeplisttoresource
writeplisttoresource
writeplisttoresource
writeplisttoresource
contenthandler
contenthandler
contenthandler
contenthandler
contenthandler
setpublicid
setpublicid
setpublicid
setpublicid
setpublicid
ex
ex
ex
ex
ex
counttestcases
counttestcases
counttestcases
counttestcases
counttestcases
in_file
in_file
in_file
in_file
in_file
posixfile
posixfile
posixfile
posixfile
posixfile
bytes
bytes
bytes
bytes
bytes
importlib
importlib
importlib
importlib
importlib
allowed domains
allowed domains
allowed domains
allowed domains
allowed domains
atol
atol
atol
atol
atol
wave_write
wave_write
wave_write
wave_write
wave_write
doctype
doctype
doctype
doctype
doctype
values
values
values
values
values
on_flag
on_flag
on_flag
on_flag
on_flag
fallback
fallback
fallback
fallback
fallback
imap4_ssl
imap4_ssl
imap4_ssl
imap4_ssl
imap4_ssl
canonical
canonical
canonical
canonical
canonical
getquotaroot
getquotaroot
getquotaroot
getquotaroot
getquotaroot
c22
c22
c22
c22
c22
inet
inet
inet
inet
inet
defaulthandlerexpand
defaulthandlerexpand
defaulthandlerexpand
defaulthandlerexpand
defaulthandlerexpand
setliteral
setliteral
setliteral
setliteral
setliteral
continue
continue
continue
continue
continue
call
call
call
call
call
secret
secret
secret
secret
secret
settings
settings
settings
settings
settings
math
math
math
math
math
floatmax
floatmax
floatmax
floatmax
floatmax
parameter
parameter
parameter
parameter
parameter
writeplisttostring
writeplisttostring
writeplisttostring
writeplisttostring
writeplisttostring
resolveentity
resolveentity
resolveentity
resolveentity
resolveentity
createattribute
createattribute
createattribute
createattribute
createattribute
node
node
node
node
node
webbrowser
webbrowser
webbrowser
webbrowser
webbrowser
statespec
statespec
statespec
statespec
statespec
seconds
seconds
seconds
seconds
seconds
unlink
unlink
unlink
unlink
unlink
groupdict
groupdict
groupdict
groupdict
groupdict
bz2
bz2
bz2
bz2
bz2
indexof
indexof
indexof
indexof
indexof
https
https
https
https
https
parsestr
parsestr
parsestr
parsestr
parsestr
shelf
shelf
shelf
shelf
shelf
createtextnode
createtextnode
createtextnode
createtextnode
createtextnode
seq of parameters
seq of parameters
seq of parameters
seq of parameters
seq of parameters
getgrall
getgrall
getgrall
getgrall
getgrall
mktime
mktime
mktime
mktime
mktime
ismeta
ismeta
ismeta
ismeta
ismeta
ttyname
ttyname
ttyname
ttyname
ttyname
pop3
pop3
pop3
pop3
pop3
yeardatescalendar
yeardatescalendar
yeardatescalendar
yeardatescalendar
yeardatescalendar
vars
vars
vars
vars
vars
tarfile
tarfile
tarfile
tarfile
tarfile
setlocale
setlocale
setlocale
setlocale
setlocale
ismodule
ismodule
ismodule
ismodule
ismodule
erfc
erfc
erfc
erfc
erfc
concat
concat
concat
concat
concat
unicode char
unicode char
unicode char
unicode char
unicode char
fromkeys
fromkeys
fromkeys
fromkeys
fromkeys
obj or type
obj or type
obj or type
obj or type
obj or type
getfontname
getfontname
getfontname
getfontname
getfontname
completedefault
completedefault
completedefault
completedefault
completedefault
chown
chown
chown
chown
chown
askfolder
askfolder
askfolder
askfolder
askfolder
datetime
datetime
datetime
datetime
datetime
pipe
pipe
pipe
pipe
pipe
pyzipfile
pyzipfile
pyzipfile
pyzipfile
pyzipfile
bottom
bottom
bottom
bottom
bottom
sha
sha
sha
sha
sha
decompress
decompress
decompress
decompress
decompress
endwin
endwin
endwin
endwin
endwin
options
options
options
options
options
id
id
id
id
id
signal
signal
signal
signal
signal
dial
dial
dial
dial
dial
itemhit
itemhit
itemhit
itemhit
itemhit
newattr
newattr
newattr
newattr
newattr
cert
cert
cert
cert
cert
extend
extend
extend
extend
extend
population
population
population
population
population
st2tuple
st2tuple
st2tuple
st2tuple
st2tuple
operation
operation
operation
operation
operation
popen
popen
popen
popen
popen
abc
abc
abc
abc
abc
pyc
pyc
pyc
pyc
pyc
exists
exists
exists
exists
exists
endpick
endpick
endpick
endpick
endpick
newchild
newchild
newchild
newchild
newchild
host
host
host
host
host
expat
expat
expat
expat
expat
uid
uid
uid
uid
uid
server
server
server
server
server
action
action
action
action
action
socket
socket
socket
socket
socket
au write
au write
au write
au write
au write
_name
_name
_name
_name
_name
ldexp
ldexp
ldexp
ldexp
ldexp
lchown
lchown
lchown
lchown
lchown
isgetsetdescriptor
isgetsetdescriptor
isgetsetdescriptor
isgetsetdescriptor
isgetsetdescriptor
sub
sub
sub
sub
sub
view
view
view
view
view
sameopenfile
sameopenfile
sameopenfile
sameopenfile
sameopenfile
keyword
keyword
keyword
keyword
keyword
makeusermenus
makeusermenus
makeusermenus
makeusermenus
makeusermenus
interactiveinterpreter
interactiveinterpreter
interactiveinterpreter
interactiveinterpreter
interactiveinterpreter
attributesns
attributesns
attributesns
attributesns
attributesns
iglob
iglob
iglob
iglob
iglob
isinf
isinf
isinf
isinf
isinf
from_addr
from_addr
from_addr
from_addr
from_addr
y1
y1
y1
y1
y1
writeframes
writeframes
writeframes
writeframes
writeframes
isdown
isdown
isdown
isdown
isdown
class
class
class
class
class
sysconf
sysconf
sysconf
sysconf
sysconf
message_parts
message_parts
message_parts
message_parts
message_parts
eval
eval
eval
eval
eval
farray
farray
farray
farray
farray
module_or_name
module_or_name
module_or_name
module_or_name
module_or_name
linecache
linecache
linecache
linecache
linecache
gdbm
gdbm
gdbm
gdbm
gdbm
test
test
test
test
test
send
send
send
send
send
nodes
nodes
nodes
nodes
nodes
machine
machine
machine
machine
machine
getstr
getstr
getstr
getstr
getstr
decoded_seq
decoded_seq
decoded_seq
decoded_seq
decoded_seq
channels
channels
channels
channels
channels
addtypeequalityfunc
addtypeequalityfunc
addtypeequalityfunc
addtypeequalityfunc
addtypeequalityfunc
sync
sync
sync
sync
sync
sub key
sub key
sub key
sub key
sub key
instate
instate
instate
instate
instate
settimeout
settimeout
settimeout
settimeout
settimeout
win
win
win
win
win
fnmatch
fnmatch
fnmatch
fnmatch
fnmatch
getdoc
getdoc
getdoc
getdoc
getdoc
sequenceincludes
sequenceincludes
sequenceincludes
sequenceincludes
sequenceincludes
getnamebyqname
getnamebyqname
getnamebyqname
getnamebyqname
getnamebyqname
dedent
dedent
dedent
dedent
dedent
shift
shift
shift
shift
shift
addnstr
addnstr
addnstr
addnstr
addnstr
nlst
nlst
nlst
nlst
nlst
heap
heap
heap
heap
heap
aggregate class
aggregate class
aggregate class
aggregate class
aggregate class
unlock
unlock
unlock
unlock
unlock
field name
field name
field name
field name
field name
writeframesraw
writeframesraw
writeframesraw
writeframesraw
writeframesraw
negate
negate
negate
negate
negate
int2ap
int2ap
int2ap
int2ap
int2ap
authobject
authobject
authobject
authobject
authobject
environ
environ
environ
environ
environ
mu
mu
mu
mu
mu
exception
exception
exception
exception
exception
suffixes
suffixes
suffixes
suffixes
suffixes
link name
link name
link name
link name
link name
limits
limits
limits
limits
limits
mainloop
mainloop
mainloop
mainloop
mainloop
message part
message part
message part
message part
message part
rjust
rjust
rjust
rjust
rjust
intersection
intersection
intersection
intersection
intersection
whathdr
whathdr
whathdr
whathdr
whathdr
remainder
remainder
remainder
remainder
remainder
main
main
main
main
main
c21
c21
c21
c21
c21
removedirs
removedirs
removedirs
removedirs
removedirs
num channels
num channels
num channels
num channels
num channels
getcolor
getcolor
getcolor
getcolor
getcolor
yview
yview
yview
yview
yview
tunnel
tunnel
tunnel
tunnel
tunnel
margin
margin
margin
margin
margin
codepoint
codepoint
codepoint
codepoint
codepoint
requesthandler
requesthandler
requesthandler
requesthandler
requesthandler
flock
flock
flock
flock
flock
mousemask
mousemask
mousemask
mousemask
mousemask
pubid
pubid
pubid
pubid
pubid
nodelay
nodelay
nodelay
nodelay
nodelay
hls
hls
hls
hls
hls
httphandler
httphandler
httphandler
httphandler
httphandler
readmodule
readmodule
readmodule
readmodule
readmodule
sql
sql
sql
sql
sql
examples
examples
examples
examples
examples
setcreatorandtype
setcreatorandtype
setcreatorandtype
setcreatorandtype
setcreatorandtype
prev
prev
prev
prev
prev
interrupt
interrupt
interrupt
interrupt
interrupt
temporaryfile
temporaryfile
temporaryfile
temporaryfile
temporaryfile
search criterion
search criterion
search criterion
search criterion
search criterion
morsel
morsel
morsel
morsel
morsel
getfqdn
getfqdn
getfqdn
getfqdn
getfqdn
lin2lin
lin2lin
lin2lin
lin2lin
lin2lin
unredirected
unredirected
unredirected
unredirected
unredirected
standend
standend
standend
standend
standend
fragment
fragment
fragment
fragment
fragment
edict
edict
edict
edict
edict
processinginstruction
processinginstruction
processinginstruction
processinginstruction
processinginstruction
mimetypes
mimetypes
mimetypes
mimetypes
mimetypes
x
x
x
x
x
connectregistry
connectregistry
connectregistry
connectregistry
connectregistry
seekable
seekable
seekable
seekable
seekable
creator
creator
creator
creator
creator
loadkey
loadkey
loadkey
loadkey
loadkey
msgid
msgid
msgid
msgid
msgid
rotate
rotate
rotate
rotate
rotate
registerresult
registerresult
registerresult
registerresult
registerresult
used_args
used_args
used_args
used_args
used_args
rewind
rewind
rewind
rewind
rewind
carbon
carbon
carbon
carbon
carbon
turnoff
turnoff
turnoff
turnoff
turnoff
ln
ln
ln
ln
ln
stacksize
stacksize
stacksize
stacksize
stacksize
d2
d2
d2
d2
d2
setblocking
setblocking
setblocking
setblocking
setblocking
splitdrive
splitdrive
splitdrive
splitdrive
splitdrive
der_cert_bytes
der_cert_bytes
der_cert_bytes
der_cert_bytes
der_cert_bytes
getwin
getwin
getwin
getwin
getwin
zinfo_or_arcname
zinfo_or_arcname
zinfo_or_arcname
zinfo_or_arcname
zinfo_or_arcname
textwrap
textwrap
textwrap
textwrap
textwrap
character
character
character
character
character
strip
strip
strip
strip
strip
fp
fp
fp
fp
fp
rfc822
rfc822
rfc822
rfc822
rfc822
vtbl index
vtbl index
vtbl index
vtbl index
vtbl index
code
code
code
code
code
prepare
prepare
prepare
prepare
prepare
yes
yes
yes
yes
yes
sleep
sleep
sleep
sleep
sleep
color
color
color
color
color
visit
visit
visit
visit
visit
pop
pop
pop
pop
pop
dorollover
dorollover
dorollover
dorollover
dorollover
tostring
tostring
tostring
tostring
tostring
major
major
major
major
major
authkey
authkey
authkey
authkey
authkey
computer name
computer name
computer name
computer name
computer name
mvderwin
mvderwin
mvderwin
mvderwin
mvderwin
getcheckinterval
getcheckinterval
getcheckinterval
getcheckinterval
getcheckinterval
getfirstmatchingheader
getfirstmatchingheader
getfirstmatchingheader
getfirstmatchingheader
getfirstmatchingheader
track
track
track
track
track
dgettext
dgettext
dgettext
dgettext
dgettext
as
as
as
as
as
cursyncup
cursyncup
cursyncup
cursyncup
cursyncup
address_family
address_family
address_family
address_family
address_family
startcdatasectionhandler
startcdatasectionhandler
startcdatasectionhandler
startcdatasectionhandler
startcdatasectionhandler
ftp
ftp
ftp
ftp
ftp
getcaps
getcaps
getcaps
getcaps
getcaps
xmlreader
xmlreader
xmlreader
xmlreader
xmlreader
getheader
getheader
getheader
getheader
getheader
prompt
prompt
prompt
prompt
prompt
subdir
subdir
subdir
subdir
subdir
monthcalendar
monthcalendar
monthcalendar
monthcalendar
monthcalendar
startelementns
startelementns
startelementns
startelementns
startelementns
decode
decode
decode
decode
decode
gc
gc
gc
gc
gc
logout
logout
logout
logout
logout
enddocument
enddocument
enddocument
enddocument
enddocument
ipow
ipow
ipow
ipow
ipow
307
307
307
307
307
dest
dest
dest
dest
dest
queryvalue
queryvalue
queryvalue
queryvalue
queryvalue
address family
address family
address family
address family
address family
re
re
re
re
re
redraw
redraw
redraw
redraw
redraw
rgb
rgb
rgb
rgb
rgb
bsddb
bsddb
bsddb
bsddb
bsddb
len
len
len
len
len
rexec
rexec
rexec
rexec
rexec
voidcmd
voidcmd
voidcmd
voidcmd
voidcmd
pty
pty
pty
pty
pty
urlsafe
urlsafe
urlsafe
urlsafe
urlsafe
loop
loop
loop
loop
loop
setmark
setmark
setmark
setmark
setmark
script
script
script
script
script
splitfields
splitfields
splitfields
splitfields
splitfields
y2
y2
y2
y2
y2
source
source
source
source
source
iterkeys
iterkeys
iterkeys
iterkeys
iterkeys
shutil
shutil
shutil
shutil
shutil
setstring
setstring
setstring
setstring
setstring
glob
glob
glob
glob
glob
hasattribute
hasattribute
hasattribute
hasattribute
hasattribute
threading
threading
threading
threading
threading
near
near
near
near
near
reason
reason
reason
reason
reason
iterator
iterator
iterator
iterator
iterator
findtext
findtext
findtext
findtext
findtext
getmessagefilename
getmessagefilename
getmessagefilename
getmessagefilename
getmessagefilename
next
next
next
next
next
mul
mul
mul
mul
mul
restart
restart
restart
restart
restart
ascii
ascii
ascii
ascii
ascii
site
site
site
site
site
sitedir
sitedir
sitedir
sitedir
sitedir
async
async
async
async
async
kwargs
kwargs
kwargs
kwargs
kwargs
writeall
writeall
writeall
writeall
writeall
colors
colors
colors
colors
colors
nlocals
nlocals
nlocals
nlocals
nlocals
contextmanager
contextmanager
contextmanager
contextmanager
contextmanager
scrap
scrap
scrap
scrap
scrap
cat
cat
cat
cat
cat
float
float
float
float
float
focus
focus
focus
focus
focus
pem
pem
pem
pem
pem
addhandler
addhandler
addhandler
addhandler
addhandler
multiprocessing
multiprocessing
multiprocessing
multiprocessing
multiprocessing
ulx
ulx
ulx
ulx
ulx
function
function
function
function
function
openfp
openfp
openfp
openfp
openfp
tracefunc
tracefunc
tracefunc
tracefunc
tracefunc
file name
file name
file name
file name
file name
nurbssurface
nurbssurface
nurbssurface
nurbssurface
nurbssurface
open
open
open
open
open
getloadavg
getloadavg
getloadavg
getloadavg
getloadavg
tarinfo
tarinfo
tarinfo
tarinfo
tarinfo
argcount
argcount
argcount
argcount
argcount
monthdays2calendar
monthdays2calendar
monthdays2calendar
monthdays2calendar
monthdays2calendar
name
name
name
name
name
s k
s k
s k
s k
s k
itruediv
itruediv
itruediv
itruediv
itruediv
imghdr
imghdr
imghdr
imghdr
imghdr
qualifiedname
qualifiedname
qualifiedname
qualifiedname
qualifiedname
setattributenodens
setattributenodens
setattributenodens
setattributenodens
setattributenodens
val
val
val
val
val
dialects
dialects
dialects
dialects
dialects
napms
napms
napms
napms
napms
putch
putch
putch
putch
putch
telnet
telnet
telnet
telnet
telnet
zero
zero
zero
zero
zero
configure
configure
configure
configure
configure
codecname
codecname
codecname
codecname
codecname
listallfolders
listallfolders
listallfolders
listallfolders
listallfolders
setbase
setbase
setbase
setbase
setbase
mtime
mtime
mtime
mtime
mtime
inputsource
inputsource
inputsource
inputsource
inputsource
splitext
splitext
splitext
splitext
splitext
xatom
xatom
xatom
xatom
xatom
stat
stat
stat
stat
stat
b64encode
b64encode
b64encode
b64encode
b64encode
process
process
process
process
process
flush
flush
flush
flush
flush
classinfo
classinfo
classinfo
classinfo
classinfo
session
session
session
session
session
header
header
header
header
header
addfilter
addfilter
addfilter
addfilter
addfilter
parsers
parsers
parsers
parsers
parsers
tb
tb
tb
tb
tb
keyrefs
keyrefs
keyrefs
keyrefs
keyrefs
question
question
question
question
question
getfilled
getfilled
getfilled
getfilled
getfilled
closerange
closerange
closerange
closerange
closerange
frame lineno
frame lineno
frame lineno
frame lineno
frame lineno
names
names
names
names
names
substitute
substitute
substitute
substitute
substitute
response
response
response
response
response
points
points
points
points
points
strerror
strerror
strerror
strerror
strerror
finite
finite
finite
finite
finite
dngettext
dngettext
dngettext
dngettext
dngettext
etree
etree
etree
etree
etree
extractall
extractall
extractall
extractall
extractall
termios
termios
termios
termios
termios
when
when
when
when
when
filelineno
filelineno
filelineno
filelineno
filelineno
mkdir
mkdir
mkdir
mkdir
mkdir
fromname
fromname
fromname
fromname
fromname
calendar
calendar
calendar
calendar
calendar
encodings
encodings
encodings
encodings
encodings
cstringio
cstringio
cstringio
cstringio
cstringio
not
not
not
not
not
log
log
log
log
log
processfile
processfile
processfile
processfile
processfile
iter
iter
iter
iter
iter
b16encode
b16encode
b16encode
b16encode
b16encode
gettext
gettext
gettext
gettext
gettext
ignore
ignore
ignore
ignore
ignore
install
install
install
install
install
doctypename
doctypename
doctypename
doctypename
doctypename
storbinary
storbinary
storbinary
storbinary
storbinary
charsets
charsets
charsets
charsets
charsets
localname
localname
localname
localname
localname
setroot
setroot
setroot
setroot
setroot
second
second
second
second
second
startfile
startfile
startfile
startfile
startfile
suffix
suffix
suffix
suffix
suffix
settarget
settarget
settarget
settarget
settarget
most
most
most
most
most
setentityresolver
setentityresolver
setentityresolver
setentityresolver
setentityresolver
getpass
getpass
getpass
getpass
getpass
ontimer
ontimer
ontimer
ontimer
ontimer
removeattributenode
removeattributenode
removeattributenode
removeattributenode
removeattributenode
smtp
smtp
smtp
smtp
smtp
degrees
degrees
degrees
degrees
degrees
cram
cram
cram
cram
cram
failure
failure
failure
failure
failure
frombuf
frombuf
frombuf
frombuf
frombuf
fcicreate
fcicreate
fcicreate
fcicreate
fcicreate
buf
buf
buf
buf
buf
begin y
begin y
begin y
begin y
begin y
headers
headers
headers
headers
headers
fromtarfile
fromtarfile
fromtarfile
fromtarfile
fromtarfile
syncup
syncup
syncup
syncup
syncup
ctl
ctl
ctl
ctl
ctl
partial
partial
partial
partial
partial
setheading
setheading
setheading
setheading
setheading
tzinfo
tzinfo
tzinfo
tzinfo
tzinfo
mono2grey
mono2grey
mono2grey
mono2grey
mono2grey
search_function
search_function
search_function
search_function
search_function
release
release
release
release
release
typecode or type
typecode or type
typecode or type
typecode or type
typecode or type
iskeyword
iskeyword
iskeyword
iskeyword
iskeyword
bar
bar
bar
bar
bar
setresgid
setresgid
setresgid
setresgid
setresgid
openkeyex
openkeyex
openkeyex
openkeyex
openkeyex
getfile
getfile
getfile
getfile
getfile
self
self
self
self
self
listallsubfolders
listallsubfolders
listallsubfolders
listallsubfolders
listallsubfolders
untouchwin
untouchwin
untouchwin
untouchwin
untouchwin
func
func
func
func
func
meta
meta
meta
meta
meta
option
option
option
option
option
getwche
getwche
getwche
getwche
getwche
setframerate
setframerate
setframerate
setframerate
setframerate
wait
wait
wait
wait
wait
removeattribute
removeattribute
removeattribute
removeattribute
removeattribute
collation
collation
collation
collation
collation
whitespace
whitespace
whitespace
whitespace
whitespace
addskip
addskip
addskip
addskip
addskip
unset
unset
unset
unset
unset
py_compile
py_compile
py_compile
py_compile
py_compile
disable
disable
disable
disable
disable
handleerror
handleerror
handleerror
handleerror
handleerror
done
done
done
done
done
sample
sample
sample
sample
sample
getstrwidth
getstrwidth
getstrwidth
getstrwidth
getstrwidth
ip string
ip string
ip string
ip string
ip string
setsystemid
setsystemid
setsystemid
setsystemid
setsystemid
tag
tag
tag
tag
tag
t_k
t_k
t_k
t_k
t_k
newgroups
newgroups
newgroups
newgroups
newgroups
getreader
getreader
getreader
getreader
getreader
tempnam
tempnam
tempnam
tempnam
tempnam
path item
path item
path item
path item
path item
insdelln
insdelln
insdelln
insdelln
insdelln
search function
search function
search function
search function
search function
logb
logb
logb
logb
logb
readline
readline
readline
readline
readline
referents
referents
referents
referents
referents
connection
connection
connection
connection
connection
closure
closure
closure
closure
closure
nis
nis
nis
nis
nis
frames
frames
frames
frames
frames
getaddresses
getaddresses
getaddresses
getaddresses
getaddresses
getcwdu
getcwdu
getcwdu
getcwdu
getcwdu
encoders
encoders
encoders
encoders
encoders
remove
remove
remove
remove
remove
imap
imap
imap
imap
imap
neg
neg
neg
neg
neg
executemany
executemany
executemany
executemany
executemany
openport
openport
openport
openport
openport
iadd
iadd
iadd
iadd
iadd
namednodemap
namednodemap
namednodemap
namednodemap
namednodemap
401
401
401
401
401
b32decode
b32decode
b32decode
b32decode
b32decode
doublebuffering
doublebuffering
doublebuffering
doublebuffering
doublebuffering
refresh
refresh
refresh
refresh
refresh
sizeof
sizeof
sizeof
sizeof
sizeof
a
a
a
a
a
counter
counter
counter
counter
counter
basename
basename
basename
basename
basename
getpeercert
getpeercert
getpeercert
getpeercert
getpeercert
import
import
import
import
import
httpshandler
httpshandler
httpshandler
httpshandler
httpshandler
file_path
file_path
file_path
file_path
file_path
facility
facility
facility
facility
facility
fullname
fullname
fullname
fullname
fullname
del
del
del
del
del
format string
format string
format string
format string
format string
getpeername
getpeername
getpeername
getpeername
getpeername
imported
imported
imported
imported
imported
tokens
tokens
tokens
tokens
tokens
processinginstructionhandler
processinginstructionhandler
processinginstructionhandler
processinginstructionhandler
processinginstructionhandler
getprofile
getprofile
getprofile
getprofile
getprofile
multipart
multipart
multipart
multipart
multipart
shell
shell
shell
shell
shell
startelementhandler
startelementhandler
startelementhandler
startelementhandler
startelementhandler
cookiejar
cookiejar
cookiejar
cookiejar
cookiejar
exit
exit
exit
exit
exit
assertdictcontainssubset
assertdictcontainssubset
assertdictcontainssubset
assertdictcontainssubset
assertdictcontainssubset
active
active
active
active
active
quit
quit
quit
quit
quit
uly
uly
uly
uly
uly
cabname
cabname
cabname
cabname
cabname
itemgetter
itemgetter
itemgetter
itemgetter
itemgetter
cosh
cosh
cosh
cosh
cosh
skiptest
skiptest
skiptest
skiptest
skiptest
numeric
numeric
numeric
numeric
numeric
modname
modname
modname
modname
modname
unichr
unichr
unichr
unichr
unichr
grouped
grouped
grouped
grouped
grouped
helo
helo
helo
helo
helo
whseed
whseed
whseed
whseed
whseed
csv
csv
csv
csv
csv
used args
used args
used args
used args
used args
nsamples
nsamples
nsamples
nsamples
nsamples
aiff
aiff
aiff
aiff
aiff
previous
previous
previous
previous
previous
fg
fg
fg
fg
fg
isenabled
isenabled
isenabled
isenabled
isenabled
getbytestream
getbytestream
getbytestream
getbytestream
getbytestream
isub
isub
isub
isub
isub
pgid
pgid
pgid
pgid
pgid
mode
mode
mode
mode
mode
createsocket
createsocket
createsocket
createsocket
createsocket
endprefixmapping
endprefixmapping
endprefixmapping
endprefixmapping
endprefixmapping
msilib
msilib
msilib
msilib
msilib
httppasswordmgr
httppasswordmgr
httppasswordmgr
httppasswordmgr
httppasswordmgr
authorizer_callback
authorizer_callback
authorizer_callback
authorizer_callback
authorizer_callback
xml
xml
xml
xml
xml
format_spec
format_spec
format_spec
format_spec
format_spec
readplistfromresource
readplistfromresource
readplistfromresource
readplistfromresource
readplistfromresource
fetchmany
fetchmany
fetchmany
fetchmany
fetchmany
teardownclass
teardownclass
teardownclass
teardownclass
teardownclass
starttag
starttag
starttag
starttag
starttag
ioctl
ioctl
ioctl
ioctl
ioctl
num_channels
num_channels
num_channels
num_channels
num_channels
setscrreg
setscrreg
setscrreg
setscrreg
setscrreg
description
description
description
description
description
nowait
nowait
nowait
nowait
nowait
expired
expired
expired
expired
expired
getrandbits
getrandbits
getrandbits
getrandbits
getrandbits
cpu
cpu
cpu
cpu
cpu
player
player
player
player
player
defaultcookiepolicy
defaultcookiepolicy
defaultcookiepolicy
defaultcookiepolicy
defaultcookiepolicy
third
third
third
third
third
parsefile
parsefile
parsefile
parsefile
parsefile
nbytes
nbytes
nbytes
nbytes
nbytes
new x
new x
new x
new x
new x
typeid
typeid
typeid
typeid
typeid
value name
value name
value name
value name
value name
settypecreator
settypecreator
settypecreator
settypecreator
settypecreator
chgat
chgat
chgat
chgat
chgat
persist
persist
persist
persist
persist
countof
countof
countof
countof
countof
quoteattr
quoteattr
quoteattr
quoteattr
quoteattr
a)
a)
a)
a)
a)
cursor
cursor
cursor
cursor
cursor
types
types
types
types
types
dumbdbm
dumbdbm
dumbdbm
dumbdbm
dumbdbm
assert
assert
assert
assert
assert
dis
dis
dis
dis
dis
err
err
err
err
err
rootobject
rootobject
rootobject
rootobject
rootobject
writer
writer
writer
writer
writer
login
login
login
login
login
memmove
memmove
memmove
memmove
memmove
fopaque
fopaque
fopaque
fopaque
fopaque
stdin
stdin
stdin
stdin
stdin
getuserbase
getuserbase
getuserbase
getuserbase
getuserbase
body
body
body
body
body
bkgd
bkgd
bkgd
bkgd
bkgd
acosh
acosh
acosh
acosh
acosh
abstractmethod
abstractmethod
abstractmethod
abstractmethod
abstractmethod
items
items
items
items
items
attrdict
attrdict
attrdict
attrdict
attrdict
getsignal
getsignal
getsignal
getsignal
getsignal
setx
setx
setx
setx
setx
_object
_object
_object
_object
_object
dtdhandler
dtdhandler
dtdhandler
dtdhandler
dtdhandler
iterencode
iterencode
iterencode
iterencode
iterencode
buffer
buffer
buffer
buffer
buffer
hexdigest
hexdigest
hexdigest
hexdigest
hexdigest
wrapped
wrapped
wrapped
wrapped
wrapped
new mailbox
new mailbox
new mailbox
new mailbox
new mailbox
setlogmask
setlogmask
setlogmask
setlogmask
setlogmask
sgid
sgid
sgid
sgid
sgid
closelog
closelog
closelog
closelog
closelog
unicodedata
unicodedata
unicodedata
unicodedata
unicodedata
fill
fill
fill
fill
fill
mt
mt
mt
mt
mt
pushbutton
pushbutton
pushbutton
pushbutton
pushbutton
basicconfig
basicconfig
basicconfig
basicconfig
basicconfig
getmtime
getmtime
getmtime
getmtime
getmtime
optionflags
optionflags
optionflags
optionflags
optionflags
collect
collect
collect
collect
collect
mailbox
mailbox
mailbox
mailbox
mailbox
copy
copy
copy
copy
copy
getmarkers
getmarkers
getmarkers
getmarkers
getmarkers
b16decode
b16decode
b16decode
b16decode
b16decode
